[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…people in my district, including nearly 100,000 children, at  risk of losing healthcare.\n\nMadam Chair, cruelty is the point.\n\nIt also targets food assistance, leaving over 147,000 New Yorkers in  my district struggling to afford meals.\n\nCruelty is the point.\n\nWhy?\n\nAll this to hand out trillions of dollars in tax breaks to the top 1  percent. Republicans…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688073/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…lower the cost  of goods. I thought we were supposed to make healthcare more affordable  for Americans.\n\nWell, let me tell you this: When you strip healthcare away from  290,000 New Mexicans, many of which are in my district, including  132,000 children and 26,000 seniors, can anybody on the other side of  the aisle tell me how is that making life better…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688084/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…provided  tax rebates and savings for appliances on electric bills.\n\nThis has led to a major manufacturing boom across the country of over  750 clean-energy projects and over 400,000 new jobs created all across  America, many in Republican districts.\n\nSince the Trump administration came in and started these illegal  shutdowns and threatened new taxes through…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…up costs, and ultimately are a major contributor to higher prices for  working families.\n\nThe data is clear: Nearly 10,000 electricians retire each year, while  only about 7,000 new entrants come in each year, according to the  Bureau of Labor Statistics.\n\nGoldman Sachs has estimated the United States will need roughly  510,000 new workers just to meet…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…my  district. While my colleagues across the aisle are afraid to even face  their constituents, we are showing up every day across our communities:  15 townhalls touching 15,000 New Mexicans across every county that we  represent in 12 towns and communities and Tribal communities across our  State.\n\nLet me say this: Our people are afraid. Everywhere we…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…can generate 127 million new additional visitors over the next  decade and $478 billion in additional revenue, which translates into  $55 billion in tax revenue, creating 140,000 new jobs.\n\nWith upcoming marquee events like the Ryder Cup, the FIFA World Cup,  and the Summer Olympics, we need to be investing in systems to make the  experience seamless.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, more than 700,000 New Jerseyans sent me  here to be their voice in Congress and to address the challenges they  face each and every day.\n\nMany of those constituents have sent me messages advocating…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689192/addressing-constituents-most-important-issues"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the Association of American Medical Colleges, the U.S.  could see a shortage of up to 124,000 physicians by 2034, and the  American Hospital Association says more than 200,000 new registered  nurses are needed each year to meet increasing healthcare needs and to  replace retiring nurses. AHECs have continued to work towards  addressing workforce shortage…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…I will start in my home State of New York.\n\nMr. Speaker, in New York's First Congressional District, represented  by our colleague Congressman Nick LaLota, approximately 50,000 New  Yorkers will lose their healthcare.\n\nIn New York's 24th Congressional District, Mr. Speaker, represented  by our colleague Congresswoman Claudia Tenney, over 30,000 New Yorkers…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…makes no sense to create chaos for automakers that already  agreed to meet these standards with investments in domestic EV  production and manufacturing that created over 200,000 new jobs and  nearly $200 billion in private investment.\n\nIf they really cared about reducing costs for American families,  Republicans would focus on reversing Trump's reckless…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690436/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Minnesota  affected by the immigration situation.\n\nI remind my colleagues and the American people that we are a Nation  of immigrants, but every year we naturalize about 800,000 new folks.  That is about five times what it was when I was a child. Mr. Speaker,  16 percent of the people in our country were not born in America. That  is the highest it has…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699736/america-cannot-have-unlimited-immigration"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…rebuilding our military; military recruitment up;  defending religious liberty; sending gang members back to their own  home countries; standing up for American workers; adding 345,000 new  jobs; securing billions of dollars in new investments in the United  States.\n\nThe golden age of American prosperity is indeed here. As exciting as  the first 100 days of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…looking at each dollar to make sure it is spent wisely.\n\nI did that as Governor of Florida, and I was able to balance our  budget.\n\nLet's start by looking at one earmark, $500,000 for new immigrant  community empowerment in New York City. This is an organization that  serves immigrants who are here illegally. Why should the American  taxpayer foot the bill…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699432/consolidated-appropriations-act-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…expand just that opportunity, it created new  jobs. In the 4 years after that change, EGCs made up 90 percent of our  initial public offerings. Moreover, it created 82,000 new jobs, new  careers, right here in the U.S.\n\nI believe we can't stop there. Across Iowa's Third District, my home  district, I hear from small business owners who want to reinvest…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "Mr. ISSA. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I am going to slightly drift off, but not really leave  this point.\n\nFentanyl kills 5,000 in New York. It kills 100,000 in the U.S. It  kills thousands in Canada and thousands in Mexico. Those numbers are  staggering, but those numbers are a small part of the tragedy…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the University of Iowa, about  25 percent of the students matched in our home State. In 2020, as then- chairman of the Finance Committee, I helped pass a law that added 1,000  new, permanent Medicare-funded medical residency programs. So far, Iowa  has gained 12 new permanent medical residency slots out of the 600  distributed nationally. Iowa will…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690631/medical-student-match-day-achievement"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…employees account for 43.5 percent of our Nation's GDP. Since 2019,  they have been responsible for over 70 percent of net new job creation.  Just last year, we saw more than 430,000 new business applications each  month, a 50 percent increase compared to 2019.\n\nThat kind of momentum deserves our full support. We should be doing  everything we can to encourage…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…put up with this anti-American rhetoric of why are we kicking these  people out. We have to remind people every year that in this country we  wind up swearing in about 850,000 new people legally. I think if you  think about that number for a little bit, something that is far higher  than the historical average in this country, you will realize it is…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "John Rose", "party": "Republican", "sentence": "…again be respected  on the world stage. Mr. Speaker, it is clear he has delivered on that  promise, as well.\n\nThere are many, many wins I could point to. Just last month, 228,000  new jobs were added to the U.S. economy. Prices fell for the first time  since May 2020. The Border Patrol reported a 94 percent drop in illegal  immigrant encounters at our southern…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…time talking about people who are  sneaking into this country. We don't talk about the fact that over  800,000 people every year become new citizens.\n\nIn addition to that 800,000 new citizens, 500,000 people come here on  work visas. Another 500,000 come here on student visas. People being  what they are, many of these people on visas stay in the United…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people who came here  illegally commit another crime. If we think about it for 2 seconds,  that is completely ridiculous.\n\nRight now, every year in this country, about 850,000 new citizens are  naturalized citizens. When I was a child, that was under 200,000. That  is without taking into account people who become citizens because of  birthright citizenship,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698706/fixing-the-immigration-crisis"}]