[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "More  than one-half of the residents in the district that I have the  privilege to represent, the 13th Congressional District, encompassed by  Harlem, east Harlem, Washington Heights, Inwood, and the northwest  Bronx, more than  one-half--close to 500,000 of my constituents--are Medicaid recipients.", "title": "Medicaid and Social Security Cuts", "date": "2025-05-20"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "My colleagues  on the other side of the aisle seem to think that who got them elected,  who they serve, that the only people who matter are not the 730,000  constituents that they have but Donald Trump, Stephen Miller, and Elon  Musk, as long as he and Donald Trump are getting along and paying for  elections.", "title": "Holding Power Accountable", "date": "2025-06-25"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Last night, 217 Republicans voted to gut Texas Medicaid, raise costs,  and take away healthcare from over 100,000 of my constituents,  including over 80,000 children and over 12,000 seniors just in my  district.", "title": "Democratic Proposals", "date": "2025-02-26"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "I represent just slightly over 780,000 constituents.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "In the gentlewoman from North Carolina's district alone, 142,000 of  her constituents would lose some or all of their SNAP benefits, and  five rural hospitals are at risk of closure.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Speaker,  189,000 of my own constituents have been getting these notices.", "title": "Aca Tax Credits Set to Expire", "date": "2025-11-20"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Under his leadership, the South Metro Fire  Department was awarded Class 1 status by the Insurance Service Office  for its outstanding protection of residents, and was one of only  thirteen Class 1 departments that serve over 500,000 constituents.", "title": "Recognizing Chief Bob Baker", "date": "2025-06-05"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "I will vote ``no'' on this rule and the underlying bill to protect my  over 31,000 constituents who rely on these ACA tax credits to make  their healthcare affordable.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "While the news is inundated with reports of Trump's airstrikes, there  are many concerns that we are not hearing about here at home: hostages;  Ukraine; Federal institutions, like USAID and NIH, gutted; the big,  ugly bill that would slash Medicaid for 14 million Americans, including  110,000 of my constituents; and the cruel cuts at SAMHSA that will  jeopardize the lives of those struggling with addiction and mental  health.", "title": "Trump Leads with Smoke and Mirrors", "date": "2025-06-27"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "Over 300,000 of my constituents are at risk of losing healthcare if  House Republicans get their way.", "title": "Health Disparities in Minority Communities", "date": "2025-04-28"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "That includes 172,000 of my constituents here in the Fourth District,  90,000 of whom are children on CHIP.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, I say to  the gentleman who just spoke, by supporting this bill, he is betraying  7,000 constituents in his district who rely on the ACA to afford their  healthcare.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Thanks to President Trump and  Republicans in Congress, more than 58,000 of my constituents in  Alabama's Seventh Congressional District will see their health  insurance premiums skyrocket next year.", "title": "Stories From Home: the Human Cost of Expiring Healthcare Tax Credits", "date": "2025-11-17"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Under the GOP budget, over 136,000 of my constituents would lose  their healthcare, including over 42,000 children.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "In my district, nearly 100,000 of my constituents rely on the  Affordable Care Act's tax credits to pay for their coverage.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Silence, crickets,  no response, because the death of 5,000 of his constituents apparently  means nothing to him.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}]