[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…very often, we take very serious votes on  this floor, but this vote is a deadly serious vote. This is a vote  about life and death.\n\nI represent just slightly over 780,000 constituents. Out of those  780,000 constituents, 524,000 of them are Medicaid recipients, and over  100,000 of them are Medicare recipients, so over 600,000 of the 780,000  constituents…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688045/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…seem to agree. My colleagues  on the other side of the aisle seem to think that who got them elected,  who they serve, that the only people who matter are not the 730,000  constituents that they have but Donald Trump, Stephen Miller, and Elon  Musk, as long as he and Donald Trump are getting along and paying for  elections.\n\nCongress' power is critical…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…today in strong opposition to this bill. I am a  ``hell no'' vote on any legislation that strips healthcare away from  millions of Texans.\n\nIn my district, nearly 100,000 of my constituents rely on the  Affordable Care Act's tax credits to pay for their coverage. Without  these lifesaving credits, many of them will go without healthcare at  all.\n\nEvery…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696691/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…represent, the 13th Congressional District, encompassed by  Harlem, east Harlem, Washington Heights, Inwood, and the northwest  Bronx, more than  one-half--close to 500,000 of my constituents--are Medicaid recipients.  They receive primary and emergency healthcare. Almost 4 million  residents in New York City, one-half of the city, rely on Medicaid.\n\nMr.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that the gentleman from  New York sounds as extreme as his voting record. Mr. Speaker, I say to  the gentleman who just spoke, by supporting this bill, he is betraying  7,000 constituents in his district who rely on the ACA to afford their  healthcare. Boy, I am glad he is not my Representative.\n\nMr. KENNEDY of New York. Mr. Speaker, as the Representative…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…country and in my State of  Florida are getting letters in the mail saying that their healthcare  premiums will go up anywhere from 50 to 300 percent. Mr. Speaker,  189,000 of my own constituents have been getting these notices.\n\nOne of my constituents, battling stage IV breast cancer, said that  without these credits, she can't afford insurance or the lifesaving…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697056/aca-tax-credits-set-to-expire"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…awarded Class 1 status by the Insurance Service Office  for its outstanding protection of residents, and was one of only  thirteen Class 1 departments that serve over 500,000 constituents.  Throughout his service, Chief Baker has championed the physical and  mental well-being of his team through workplace wellness programs, and  we are incredibly grateful…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…and its goal of stripping  California's ability to regulate air pollution  and improve public health. Not only are Republicans taking away  healthcare from over 370,000 of my constituents who rely on Medicaid,  they are actively worsening the health problems many of them face. This  is insult to injury. I urge my colleagues to vote ``no.''", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690477/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…at home: hostages;  Ukraine; Federal institutions, like USAID and NIH, gutted; the big,  ugly bill that would slash Medicaid for 14 million Americans, including  110,000 of my constituents; and the cruel cuts at SAMHSA that will  jeopardize the lives of those struggling with addiction and mental  health.\n\nThe Trump White House leads with smoke and mirrors,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693115/trump-leads-with-smoke-and-mirrors"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…House Republicans want to slash Medicaid by $880 billion. Their  budget is an attack against millions of Americans who depend on  Medicaid for healthcare.\n\nOver 300,000 of my constituents are at risk of losing healthcare if  House Republicans get their way. More constituents stand to see their  health premiums increase by over $1,000.\n\nAgain, it is more…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…severe  consequences for health care access for the families, seniors, people  with disabilities, and especially children who rely on this coverage.  That includes 172,000 of my constituents here in the Fourth District,  90,000 of whom are children on CHIP. In our district, 54,000  Minnesotans rely on SNAP to put food on the table. SNAP assistance is  particularly…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this  Republican Congress don't rip away their healthcare and their food  benefits. That is disgusting.\n\nIn the gentlewoman from North Carolina's district alone, 142,000 of  her constituents would lose some or all of their SNAP benefits, and  five rural hospitals are at risk of closure.\n\nMy Democratic colleagues and I are here to help people, not to screw…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…the rest of America, we in Alabama are facing a health  crisis caused by the Republican Party. Thanks to President Trump and  Republicans in Congress, more than 58,000 of my constituents in  Alabama's Seventh Congressional District will see their health  insurance premiums skyrocket next year.\n\nOne of my constituents is a 63-year-old gentleman from…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…only one  way to get to $3 trillion in cuts, and that is to slash lifeline  programs, including nearly $1 trillion in cuts to Medicaid.\n\nUnder the GOP budget, over 136,000 of my constituents would lose  their healthcare, including over 42,000 children. This budget would  also take food away from hungry children and deny healthcare to sick  veterans.\n\nWhy…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688058/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…this Special Order hour on this  very important topic.\n\nLast night, 217 Republicans voted to gut Texas Medicaid, raise costs,  and take away healthcare from over 100,000 of my constituents,  including over 80,000 children and over 12,000 seniors just in my  district.\n\nI love my State. There are so many great things about Texas, but  unfortunately, we…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…colleague, who represents New York, to just say 5,000  fentanyl-related deaths in New York is an emergency. Silence, crickets,  no response, because the death of 5,000 of his constituents apparently  means nothing to him.\n\nMr. MAST. Mr. Speaker, I thank Representative Issa for his remarks,  and I believe there will be another Representative from California…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}]