[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…here tonight on behalf of  the Congressional Black Caucus to commemorate National Minority Health  Awareness Month, but I am also here for personal reasons.\n\nMr. Speaker, 10 years ago today, I was 31 weeks pregnant. I was  excited. I was expecting a girl. I had placenta previa, so I knew we  were going to have to schedule a C-section. We had just scheduled…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…urge my colleagues to reject it, and I reserve the  balance of my time.\n\nMr. BEYER. Madam Chair, while we are doing math, when I divide $2  trillion in savings and cuts over 10 years, I get $200 billion a year.\n\nMadam Chair, I yield such time as she may consume to the gentlewoman  from Massachusetts (Ms. Clark), the whip of the House Democratic  Caucus.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…absolute slap in  the face for parents and for doctors who have dedicated their lives to  caring for children and families.\n\nThis bill could put doctors behind bars for up to 10 years for  providing medically appropriate care for children, and it doesn't even  stop there. It could put parents behind bars for making, after deep  consideration, and in many…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698357/protect-childrens-innocence-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…actors.\n\nFormer Representative Luetkemeyer and I sponsored two bills, which  became law, to extend the statute of limitations for fraud in the PPP  and the EIDL program to 10 years. Without additional resources, the OIG  will not be able to capitalize on these new laws, and American  taxpayers will lose out.\n\nIn closing, I appreciate the bipartisan work…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…now turn to a subject which, next to our desire for       peace, may well become the major concern of the American       people in the decade of the seventies.\n\nIn the next 10 years we shall increase our wealth by 50       percent. The profound question is: Does this mean we will be       50 percent richer in a real sense, 50 percent better off, 50…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Republicans are choosing to strangle  America's supply of cheap solar and wind, which we are going to need  for the AI revolution. The estimates are that AI itself over the next  10 years could double the need for electricity in our country.\n\nAnd what this bill will do is take wind and solar and batteries off  the field and then say to the natural gas industry…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that means debt.\n\nHow much more debt does this bill create? The current estimate--and  the estimates keep going up--is $5.3 trillion of unpaid-for tax cuts  over the next 10 years--$5.3 trillion--trillion with a ``t''--over the  next 10 years.\n\nBut that is not all. Their plan provides for $37 trillion--at least  $37 trillion--in additional debt over…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Capital,  and when Washington moved to the President's house near Independence  Hall in 1790, he brought with him eight slaves from his Virginia  plantation.\n\nMr. Speaker, 10 years earlier, Pennsylvania had begun to abolish  slavery, allowing slaves brought to the Commonwealth by residents of  other States to claim their freedom if they lived there for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…about that, the only energy that is ready to come online  right now is solar energy--some wind energy but mostly solar energy.  Why? Because nuclear, frankly, takes at least 10 years to permit and  site, and, of course, anytime anyone wants to do any nuclear power  generation, everybody in whatever neighborhood or State or county that  is in tries to stop…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…representing. His mom is a teacher. His dad works for a local  municipality. These are wonderful, middle-class folks just like anyone  else in this country.\n\nThe problem is that 10 years ago, when he was 4 years old, Conner was  diagnosed with Duchenne muscular dystrophy. Duchenne muscular dystrophy  is a terrible disease. Your muscles waste away, including…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…comparable restrictions  could reduce returns by $30 million to $40 million a year. In Indiana,  an analysis found it could cost pension returns as much as $6.4 billion  over 10 years.\n\nThis legislation is not about protecting retirees. It is about  protecting mediocre businesses from the vibrancy of well-informed,  competitive capital markets. Maybe that…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…keep reentering our country without permission.\n\nNow, it would require that people who are immediately removable and  deportable, undocumented immigrants, must spend 5 or 10 years in  overcrowded and overburdened Bureau of Prisons facilities in our  country at a huge cost to American taxpayers--more than $150, and in  many cases $200 a day, which comes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…oldest  U.S. retailers in America--and remains a vital part of military  readiness. 100 percent of Exchange earnings support critical Quality- of-Life programs. In the last 10 years, the Exchange delivered $15  billion in value to the military community.\n\nCongratulations to the Exchange on 130 years of serving those who  serve. Here's to ``going where…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…that an IRS employee's immediate supervisor is a person to whom the  employee reports.\n\nIn addition to providing clarity, this bill also raises $117 million  over the next 10 years. This bill passed the Committee on Ways and  Means with overwhelming bipartisan support.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this very…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697250/fair-and-accountable-irs-reviews-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the trial court.\n\n``(c)(1) Subject to paragraph (2), no action may be       maintained under subsection (a) unless it is commenced not       later than the later of--\n\n``(A) 10 years after the cause of action arose; or\n\n``(B) 10 years after the victim reaches 18 years of age, if       the victim was a minor at the time of the alleged offense.\n\n``(2) There…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Club.\n\nI know his parents, Scott and Alicia, are so proud of all he has  accomplished. I wish Mitchell the best of luck in this next chapter,  and I thank him for his nearly 10 years of dedicated service to  Louisiana's 1st Congressional District.\n\nMr. Speaker, I ask my colleagues to join me in commending Mitchell  Shea and in wishing him continued success…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…other drugs. Melanoma. When I was in med  school, if you got diagnosed with melanoma, they said go fill out the  will. Now I have friends who have been living for 8 years, 10 years  longer taking immunotherapy for melanoma. That doesn't just happen.  That happens because you incentivize innovation.\n\nSo what are our diseases now for which we have no cure?…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…against it.\n\nThis chart shows what actually happens when you eliminate fraud,  waste, and abuse, and the Republicans increase spending in Medicaid by  25 percent over the next 10 years for the people who really need it:  the pregnant women, the children, the disabled, the blind, the elderly,  and we did it eliminating fraud, waste, and abuse.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691335/eliminating-fraud-waste-and-abuse-in-medicaid"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…my plumber, Marty: What is going on with these showerheads?  He said: You tell me. The people in Washington messed this up. Nobody  can have a darn good shower in the last 10 years.\n\nWhy does that matter? What did they say? They say we are worried  about showerheads. We are worried about the working man. We are worried  about the standard of living that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Palace, and multiple residential and commercial real estate  enterprises. In 2006, he became the President of the Greater Harrisburg  Area NAACP, where he served for over 10 years. In 2009, he was ordained  as a Deacon at the First Spirit Filled Missionary Baptist Church.\n\nOver the course of his life, Stan earned several meaningful honors  that meant…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…amendment sends a clear message to the VA: Don't just study.  Prepare. Prepare to implement new therapies and newfound ways to  improve the lives of veterans now, not 5 or 10 years from now.\n\nThat means identifying the clinical infrastructure needed to deliver  these treatments, training and certifying providers, and launching  pilot programs to bring…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise today in full support of the Whole Milk for  Healthy Kids Act of 2025.\n\nFor over 10 years, children in schools across our country have been  deprived of the many benefits of whole milk, and the Dietary Guidelines  for Americans has reported that nearly 90 percent…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698185/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…5-year window. It expires in December. All  I am trying to do is extend it for 5 more years. That is it. This is a  one-sentence bill. It changes the words ``5 years'' to ``10 years.''\n\nGuess what. Last year in December, I came down to the Senate floor,  and I passed this unanimously. It passed. So the Senate passed it last  year. The House has already…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…section 3729 or 3802 of title 31, United States Code, with       respect to any grant for shuttered venue operators under this       section shall be filed not later than 10 years after the date       of the violation or conspiracy.''.\n\n(b) Restaurant Revitalization.--Section 5003 of the       American Rescue Plan Act of 2021 (15 U.S.C. 9009c) is amended…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697227/sba-fraud-enforcement-extension-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…costs for lower and middle-income  families, about a fifth of those enrolled in the National Flood  Insurance Program will be forced to drop their coverage over the next  10 years, OK? You raise premiums, and you raise them to a degree that  20 percent of the people--typically the lowest risk--drop their  coverage. Then the Flood Insurance Program has…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…opponents in his front yard.\n\nWe did the basic math. If you actually were saying, let's just go  back to the tax rate for the top earners back to 2017, it is $32.7  billion over 10 years. Okay, we can all divide that by 10, so let's  call it $3.2 billion a year.\n\nWe borrow $6 billion a day. If that is $3.2 billion, you functionally  bought yourself 12\\1/2\\,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…one of the things that  we use in our economic shop, where we try to actually say: Okay, here  is 1 year. If it went up \\1/2\\ percent, that 1 year costs $206 billion  over 10 years. It is basically a table that says that if interest rates  pop up this much, and it only lasts for 1 year or 2 years, here is what  it will cost us over the 10-year window.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…numbers of Nationwide       Permits (NWPs) issued annually. To assist with planning and       permit backlogs, this legislation extends the duration of a       NWP from 5 to 10 years and right sizes the acreage threshold       for impacts to where the NWP was originally intended.\n\nTo better assist states in assuming their own 404       permitting authority,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…navigate a labyrinth of bureaucratic hurdles,  submitting petitions to the USPS that are rarely approved. If their  petition is denied, then they are forced to wait up to 10 years before  they can even reapply, 10 years, Mr. Speaker.\n\nThat is 10 years of lost opportunities, 10 years of misdirected mail,  and 10 years of unnecessary risks to public safety.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…gave billions of dollars of  the Green New Deal; in the same bill they set these tax cuts to expire?\n\nI know it was during reconciliation they could have done them within  10 years instead of 5. They also could have done them permanently.  There is a way in reconciliation to do them permanently, as well.\n\nNo one on the other side has ever explained why…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}]