[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "These are tools that have helped drive down  drug-related deaths in New Hampshire to the lowest levels in 10 years.", "title": "Calling for Permanent Scheduling for Fentanyl Analogues", "date": "2025-06-11"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "President, today, we got the news that the  Congressional Budget Office, the CBO, confirms Donald Trump's ``Big  Ugly Betrayal'' is going to kick at least 10 million Americans off  their health insurance and spike our national debt by another $3.4  trillion.", "title": "Budget", "date": "2025-07-21"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "On May 10, we celebrated the 75th anniversary of the National Science  Foundation.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Last year, she suffered a head injury that required emergency care,  and ACA kept her bill around $1,000 instead of $10,000, saving her from  potential bankruptcy.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "We have seen a week where it is violating a tradition  that has gone back before I was born where the Federal Government  activating Federal troops in a community goes through--in fact, I know  the statute: title 10, section 12406--that they should go through the  Governors, work in coordination with them.", "title": "Alex Padilla", "date": "2025-06-12"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Republicans have blocked nearly 8 out of every 10 amendments  submitted to the Rules Committee.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "That is 10 percent of their revenue.", "title": "Better is Possible", "date": null}, {"senator": "Al Green", "party": "Democrat", "sentence": "He must be brought before this  House because he disrespects the court, and he refuses to honor the  April 10 order requiring him to facilitate the return or the release of  a person who was taken from this country to another country, a Supreme  Court mandate.", "title": "And Still I Rise: Impeaching President Trump", "date": "2025-05-08"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "That is no surprise because, since 2010, Republicans, Mr.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Last year, a small business owner testified that it cost him an  average of $10,000 per proposal.", "title": "Transparency and Predictability in Small Business Opportunities Act", "date": "2025-06-03"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "This President  has issued more executive orders than the last approximately 10  Presidents combined already, and we are only 3\\1/2\\ months into his  Presidency.", "title": "Gross Violations of Law By Trump Administration", "date": "2025-05-07"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "We are in crisis--our Nation is in crisis--as more and more Americans  lose trust and lose faith in our country, in our democracy, in the  people who serve--the 535 Members: the 100 Members of the Senate and  the 435 Members of the House of Representatives.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Artemis is 1 of 10 Iranian Christians, including 3 children, who are  detained in Panama.", "title": "Migrants Fleeing Religious Persecution", "date": "2025-03-03"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "A 10-year-old U.S.", "title": "Holding Power Accountable", "date": "2025-06-25"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "President Trump's own stablecoin is set to become one of the top 10  stablecoins after Abu Dhabi announced a $2 billion investment in World  Liberty Financial, which is a joint venture between the Trump family,  his sons, and Steve Witkoff and his family.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Medicaid goes up between 20 and 30 percent  under our budget over the next 10 years.", "title": "Tax Cuts and Spending", "date": "2025-06-27"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Speaker, we believe in expanded health savings accounts that you  can use for direct primary care to go to a doctor, have that doctor's  cell phone number, have a relationship with that doctor and not be put  into some complicated scheme where you have to get approval for  somebody who is in network or not in network and who may or may not be  within 100 miles of your house.", "title": "Bringing America Back to its Roots", "date": "2025-12-12"}, {"senator": "James Risch", "party": "Republican", "sentence": "25-102, concerning       the Navy's proposed Letter(s) of Offer and Acceptance to the       Government of Denmark for defense articles and services       estimated to cost $1.8 billion.", "title": "Arms Sales Notification", "date": "2026-01-06"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "Lake Lanier is the most visited lake of 464 federally operated lakes  in the United States, with well over 10 million annual visitors from  all over the country.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "That  is why a 5- to 10-year prison sentence is warranted, valid, and  necessary.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "William Timmons", "party": "Republican", "sentence": "4431 updates the qualifying venture capital fund exemption by  raising the capital cap from $10 million to $50 million and by  increasing the allowable number of investors from 250 to 500.", "title": "Improving Capital Allocation for Newcomers Act of 2025", "date": "2025-12-01"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "We have done it over 10 times during the Biden  administration on the Republican side, but there is frustration.", "title": "En Bloc Nominations", "date": "2025-10-03"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Speaker, on the legislation that is before us, I know that my  colleagues on the other side of the aisle are, no doubt, about to  launch into how we have had an ineffective first 100 days and Congress  is not doing anything.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy- Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars Ii; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''; and for Other Purposes", "date": "2025-04-29"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "They get very angry, but $35 billion over 10 years,  $350 billion, and that is just one of dozens of things.", "title": "Math is Such An Anathema", "date": "2026-02-11"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "By one recent poll, more than 6 in 10 Americans support--support-- sending more arms and military supplies to help Ukraine win.", "title": "-9999", "date": "2025-10-03"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Among the most notable improvements were a 15 percent increase in  Algebra 1 proficiency, a 7 percent increase in English Language Arts  for grades 9 and 10, a 4 percent overall increase in English Language  Arts scores, and a 4 percent improvement in Civics end-of-course exam  performance.", "title": "Recognizing Lake County Schools on Earning An ``a'' Rating From the Florida Department of Education", "date": "2025-07-23"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "(10) Uyghurs and Kazakhs who have secured citizenship or       permanent residency outside of the PRC have attested to       repeated threats, harassment, and surveillance by PRC       officials.", "title": "Uyghur Policy Act of 2025", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Baseline borrowing for the next  10 years is $22 trillion.", "title": "A Real Math Problem", "date": "2025-03-06"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Greg, the founder and CEO of Parker's Kitchen, has grown his business  from one store in 1976 to his 100th in a grand opening in April of  2025.", "title": "Congratulating Greg Parker, Retailer Executive of the Year", "date": "2025-06-10"}, {"senator": "French Hill", "party": "Republican", "sentence": "It encompasses nearly 10,000 acres of rugged terrain, and the most  treasured views in the Ouachita region are in Flatside Wilderness.", "title": "Flatside Wilderness Additions Act", "date": "2025-05-13"}]