[{"senator": "John Larson", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize the  100th anniversary of the Town & County Club in the historic Asylum Hill  neighborhood of Hartford, Connecticut. Over its storied 100-year  history, the club has grown into the premier location for members to  enjoy organized social, intellectual, and artistic gatherings.\n\nOn May 21, 1925, just five years after…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to thrive. Their century-long  commitment to mental wellness and family stability has made an  indelible impact on Aurora and beyond.\n\nAs they commemorate this remarkable 100-year milestone, I would like  to extend my deepest gratitude to the staff, counselors, and volunteers  of Family Counseling Service. Their unwavering dedication, compassion,  and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…for American  families and harm our economy.\n\nDOE found that the kind of unlimited exports authorized under this  bill would increase household energy costs by more than $100 per year  on top of the cost increases already burdening families under the  Republicans' One Big Beautiful Bill Act, i.e., the big, ugly law.\n\nLet's be clear. H.R. 1949 is a substantial…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…comes down to time horizons, as Mr. Casten said. When I was  State treasurer, I had 60,000 people who were relying on me for their  retirement. I had people who were 90- or 100-year-old retirees, and I  had first-year teachers who were 23 years old. I owed just as much of a  fiduciary duty to those 23-year-olds as the 90-year-olds.\n\nSo long-term factors…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…on behalf of the  oil and gas industry. These updates were estimated to save households  nearly $1 trillion annually over 30 years and save the average family  at least $100 per year in lower utility bills. They were also estimated  to cut approximately 2.5 billion metric tons of carbon emissions over  30 years. That is the equivalent of taking over…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Celebrating Centennial Anniversary of Leyden High School\n\nMr. GARCIA of Illinois. Mr. Speaker, I rise today to celebrate a  century of excellence in public education, the 100-year anniversary of  Leyden High School District No. 212, proudly serving the western  suburbs of Chicago.\n\nWhat began as a 2-year school in a portable building has grown into…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…place frequented by all. Today, you can find  anyone from day laborers to college students to politicians enjoying a  meal under the original railroad cart ceiling.\n\nHenry's 100-year tenure has not been without its challenges. A fire  in 1969 necessitated a months-long closure and heavy renovations to the  business. Still, care was taken to preserve as…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694323/recognizing-henrys-diner"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…impression--most notably in 1986, when  their distinctive attire earned national recognition and was featured  on the David Letterman Show.\n\nOver the course of the agency's esteemed 100 year history, the  dedicated men and women of the Rhode Island State Police have worked  tirelessly to ensure Rhode Islanders' safety. And I know that for the  next one hundred…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…world's two biggest economies and auto markets.\n\nChinese electric cars are an exceedingly rare sight on U.S.       roads because of tariffs that were already at around 100%       last year under import taxes levied by the Biden       administration. Then, in a string of recent moves, President       Trump slapped additional tariffs on most Chinese goods,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Last year, the Department of Energy's own review was clear:  Unfettered gas exports will hurt the American economy. It found that  energy costs would go up by more than $100 per year for every  individual. At the same time, that is on top of the costs imposed by  Republicans' big beautiful or ugly bill.\n\nThe Department of Energy also found that natural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…and more intense storms,  unexpected, throughout the entire country, but surely in Texas. We have  had freezes that have killed hundreds of people, and now we had a 1-in- 100-year catastrophic rainstorm that produced horrific floods and  tragic loss of life.\n\nWhat happened in this policy is that Republicans at every level of  government in our State…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…event will also feature a special panel that discusses the  legacy of Mr. Slaughter, who, unfortunately, is no longer with us. He  died in 2012, and he would have turned 100 this year. Mr. Slaughter's  son will participate on the panel.\n\nThe tremendous success of the memorial, the patriotism that it  inspires, and the stories that continue to be shared…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my privilege to recognize  and celebrate the 100 Year Anniversary of the City of Ocoee, Florida.  Ocoee officially became a municipality in 1923 and was incorporated as  a city in May 1925. The City of Ocoee will host their Centennial…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690916/recognizing-the-100th-anniversary-of-the-city-of-ocoee"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…District and  the United States House of Representatives, I am pleased to recognize  the Rotary Club of Grass Valley for their outstanding contributions  throughout their 100-year history, and I commend them for their ongoing  and tireless devotion to community service.\n\nHere is to another great 100 years.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my privilege to recognize  and celebrate the 100-year anniversary of the City of Coleman, Florida.  While unofficial records indicate that Coleman was first incorporated  under general laws on June 20, 1908, it was in 1925 that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the community, strengthening bonds of fellowship  between people, and upholding tradition.\n\nThis club is a shining example of the best that North Carolina has to  offer. Its 100-year history is a testament to that simple fact.\n\nMr. Speaker, I congratulate the Leakesville Garden Club and its  members on this historic milestone. Here is to another 100 years.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688345/recognizing-leakesville-garden-clubs-centennial"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…Olympic hockey team who brought golden glory back to the  United States 46 years after the ``Miracle on Ice.''\n\nWe are proud of our heroic soldiers like CW5 Eric Slover and the 100- year-old Navy fighter pilot CAPT Royce Williams, who both received the  Congressional Medal of Honor during the State of the Union speech. What  a great moment for us to experience…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…built, and the rail authority has the audacity to claim that  substantial progress has been made.\n\nBy the way, we were also told that, by the year 2030, we would have  100 million riders per year. We now know for a fact that the number of  riders per year by the year 2030 will be 100 million less than  forecast. There will be zero riders still by the year…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…has cooled. Things are  more affordable. Remember, under Joe Biden, prices soared by more than  21 percent. Under President Trump, private sector real wages are up  over $1,100 a year. The economy grew 3.8 percent in the second quarter  of this year. We are seeing strong economic growth, and more strong  economic growth is expected. The Atlanta Federal…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…give you a couple of examples of some of its abuses, one of  them is specifically related to fire.\n\nIn 2019, the L.A. Department of Water and Power began replacing  nearly 100-year-old wooden power line poles that are cutting through  Topanga State Park.\n\nThe project, though, was halted because there was apparently an  endangered plant, the Braunton's…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]