[{"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…organization dedicated to enhancing the quality of life for older  adults in our community.\n\nThe Area Agency on Aging of Broward County is part of a vital  statewide network of 11 Area Agencies on Aging across Florida. These  agencies are tasked with coordinating a wide array of programs and  services designed to help seniors live safely, independently,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…family for this terrible killing and continue to stand with them  to demand justice and accountability.\n\nShireen Abu Akleh, an American-Palestinian Journalist, was killed on  May 11, 2022. She was killed while wearing a clearly marked press vest  on assignment, reporting on a military raid that took place in the  Israeli occupied city of Jenin. Shortly after…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Among them are Officers Erick Contreras, Christopher Cizmarik,  Kevin Canavan, and Philip Schifini of the Nassau County Police  Department who bravely served our community on 9/11, one of the darkest  days in American history.\n\nIn the aftermath of the worst terrorist attack on American soil, they  are among the brave first responders who ran toward danger,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Debris Foundation so that it can respond more effectively to the  growing threats facing our coastal regions, of which I represent one in  Mobile, Alabama.\n\nEach year, more than 11 million tons of plastic debris enters the  oceans, endangering the livelihood of communities, small businesses,  fishermen, and our food chain that rely on healthy waterways.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…SCHOLTEN. Mr. Speaker, I rise today to share a story from  Charlene, a grandmother in Michigan, who wrote me with a real, honest  fear about Medicaid cuts.\n\nHer granddaughter is just 11 years old, and she lives with type 1  diabetes.  Her life depends on insulin and a constant stream of medical supplies  to keep her alive.\n\nHer mother is a single mom and a nurse.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691478/gop-tax-scam-hurts-women-and-families"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…White women.\n\nBlack people are about twice as likely to die from diabetes than  White people.\n\nOn the South Side of Chicago, which I represent, Black people are  expected to die 11 years earlier than White people living on the North  Side, and sometimes it is higher than that.\n\nLet us not forget gun violence, a public health crisis and emergency  in our…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Bronx Councilman Kevin Riley is  sponsoring one such effort, the fifth annual Black History Month Living  Legends Luncheon honoring our neighbors on Wednesday, February 25, from  11 a.m. to 3 p.m. at The Mall at Bay Plaza food court.\n\nIt will highlight Black leaders from Co-op City, Edenwald, Wakefield,  and other parts of the north Bronx who have helped…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700078/black-history-month"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…health.\n\nLast week, against universally recommended guidelines, the Department  of Health and Human Services slashed the childhood immunization  schedule from 17 vaccines to 11. Among those removed are vaccines to  protect against RSV, COVID-19, and hepatitis B.\n\nAmericans deserve accurate information that is based on established  science to make decisions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698959/immunization-schedule"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…History  is clear. The dictatorship of Russia takes what is not theirs. Russia  invades territory that does not belong to it.\n\nIf one looks at this map, Russia is a vast country of 11 time zones.  It does not lack for territory. Here is Ukraine. Just think about that.  West of that lies Europe. Study the map. Mr. Speaker, if you know  nothing about Europe…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…this offshore wind been online during that  period, it would have ``lowered regional electricity production costs  by $80-85 million'' over those 2 weeks, ``resulting in an $11-13 per  megawatt-hour reduction'' in what the grid charged ratepayers.\n\nRevolution Wind has cleared in the New England capacity market, and  if it were to fail, it would require…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…unobligated  funds from the Greenhouse Gas Reduction Fund, claiming that this was  Congress rescinding a full $17 billion, including all of what EPA  claimed to terminate on March 11, 2025. That simply is not so. The DOJ  reads too much into the repeal of Greenhouse Gas Reduction Fund  language. Two pieces of evidence support my contention here.\n\nFirst, when…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…would  address these barriers by lowering the minimum number of credit hours  required. It would also allow student veterans to apply for the  scholarship before their post-9/11 GI Bill benefits run out.\n\nThis would allow for a smooth transition of funding for their  education. They have so greatly served us. It is time for us to serve  them.\n\nMadam…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695426/edith-nourse-rogers-stem-scholarship-opportunity-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Congressional District of New Jersey thank him for his leadership.\n\nIn his early career, Joseph served as the official Corps liaison to  the City of New York in the wake of the 9/11 World Trade Center  tragedy. Throughout his tenure, he also was on the USACE Leadership  Team leading immediate response actions in wake of Hurricane Sandy to  include unwatering…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…urgent.\n\nIf the other side wouldn't block it, I bet you it would pass  overwhelmingly.\n\nThere is another bill by Senator Hawley a Republican, conservative. I  believe it has 11 Republican cosponsors already. It is another bill  that could pass. It doesn't have WIC, but it does have SNAP.\n\nDemocrats are ready to do what every President in American history…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…And if you have been around a ward of children, you know that  they are not quiet. But why are these children quiet? Because they  don't have the energy to cry.\n\nNoura has an 11-month-old son. He is deeply malnourished. He is  missing his major developmental milestones, and she says:\n\nMy son is supposed to be drinking formula milk, but there       is…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Definitions. Sec. 4. Prohibited acts. Sec. 5. Exceptions. Sec. 6. Criminal offenses. Sec. 7. Civil penalties. Sec. 8. Licenses. Sec. 9. Enforcement. Sec. 10. Findings by Secretary. Sec. 11. Reporting requirements; disclosure of information. Sec. 12. Closed Area stowage requirements. Sec. 13. Observers. Sec. 14. Technical assistance. Sec. 15. Arbitration. Sec. 16.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Beautiful Bill Act is about restoring  fairness and awarding work, and it begins with Americans' taxes.\n\nIn Tennessee, the bill we passed here in the House would put an  average of $11,700 more in the pockets of a family of four every year.  Under this bill, everyday Americans will see lower income tax rates, a  larger standard deduction, and an expanded child…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Pearl Harbor Day\n\nMrs. MILLER-MEEKS. Mr. Speaker, I remark that Sunday, December 7, is  the 84th anniversary of Pearl Harbor Day, the day that will live in  infamy.\n\nLike 9/11, we must never forget. Always prepared, always ready.\n\nI ask for a moment of silence for those whose lives were lost on that  fateful day.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…dual  eligible because they are poor and retired, and we have some things  that are terrifying.\n\nIn 6\\1/2\\ years, the Medicare trust fund is empty. Your hospital will  take an 11 percent cut. Medicare Advantage programs will actually take  something much larger. It is just the way the Medicare part A trust  fund works.\n\nIn 6\\1/2\\ years, the Social Security…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…31,  2026, shall not constitute a calendar day.\n\nSo that is a little odd on the face of it, simply fiating that  somehow these days of the months in the calendar year, February 11,  February 12, February 13, and so on all the way to July 31 are somehow  now by legislative decree not days.\n\nNow, I had actually voted against this very same provision in…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Republicans are finally offering  taxpayers relief from years of spending from Democrats. Again, with  President Biden they expanded the Federal Government with an  unprecedented $11 trillion in spending, $6 trillion of which has been  added to the national debt. It needs to end. We voted to end it in H.R.  1. We are ending it in this package here today,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Grosbeck\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of an  extraordinary Orangeburg resident, Pieter Grosbeck, who passed away at  the beginning of December due to a 9/11-related illness.\n\nA proud Eagle Scout, a graduate of Tappan Zee High School and of  Rockland Community College, Pieter dedicated his life to serving  others. After working as…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…including: London Police Department, Laurel County  Sheriffs Office, London Fire Department, London Public Works, London/ Laurel County Rescue Squad, Kentucky State Police Post 11, Bush  Volunteer Fire Department, Campground Volunteer Fire Department,  Crossroads Volunteer Fire Department, East Bernstadt Volunteer Fire  Department, Keavy Volunteer Fire…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, I move to suspend the rules and pass the bill  (S. 3424) to amend titles 11 and 28, United States Code, to modify the  compensation payable to trustees serving in cases under chapter 7 of  title 11, United States Code, to extend the term of certain temporary…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today in favor of S.J. Res. 11, a  Congressional Review Act to reverse the Bureau of Ocean Energy  Management, or BOEM, rule that targeted oil and gas production in our  Outer Continental Shelf.\n\nThe Biden…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688631/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…as Assistant  Principal at Neshaminy High School and later at Neshaminy Middle  School. In 2004, he became Principal of Oliver Heckman Elementary  School, a role he held for 11 years. In 2015, he took on the position  of Principal at Pearl S. Buck Elementary School--which recently  transitioned to Core Creek Elementary School--where he has served for…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…to be able to shape the language to be able to  make sure it was an order, not a rule. And then the Biden  administration sat on it and did nothing with it. In the meantime, 11  other States said: If California does that for electric vehicles, we  are going to do that as well.\n\nHere is the other thing about the law I didn't mention. The way the  Clean…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize Coast Guard  Auxiliary Clearwater Flotilla 11-1's 75th Anniversary. The U.S. Coast  Guard Auxiliary was established by Congress to support the Coast Guard  with its boat safety mission. Clearwater Flotilla 11-1's service…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…D.C. bureaucrats.\n\nMr. Speaker, I urge my colleagues to support this rule, and I reserve  the balance of my time.\n\nMr. Speaker, the budget reconciliation bill is the work of 11  committees that have gone through full markup, that went through the  full bipartisan process.\n\nI sat through 27 hours in the Energy and Commerce Committee. I know  full well…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…the U.S. Senate.  We are looking for five Democrats to join us.\n\nIt is already bipartisan. Three Democrats have joined us. If five  more join the Republicans, we have done this 11 times in voting for  this clean CR, which Democrats have done repeatedly under Joe Biden's  watch. If five Democrats join us, we will open the government back up.  But just wanted…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696364/government-funding"}]