[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…Black and brown students. Further, the  Republicans Budget plans seek to dramatically cut education funding,  with Illinois at risk of losing approximately $793 million and 12,000  teachers. Further, Trump's cuts threaten the Individuals with  Disabilities Act (IDEA) that provides protection and funding for  students with disabilities. Illinois received…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is a beacon of  hope, ensuring our most vulnerable have access to critical services  regardless of their income or background. Haymarket Center has grown to  treat more than 12,000 patients a year and offers 30 specialized  addiction and recovery programs in support of its mission. These  programs also support job training and mental health counseling…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…new cars once a rule has been finalized by the Department of  Transportation.\n\nMore than 30 people in the United States die every day in drunk  driving crashes, and more than 12,000 people a year suffer these  preventable deaths.\n\nUsing the appropriations process to delay or in any way impede the  development of technology to prevent drunk driving is inappropriate…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…terrible bombings.\n\nThere are an estimated 13,400 nuclear warheads on Earth today. The  United States and Russia hold more than 90 percent of them. Together,  we control more than 12,000 warheads, and that is more than enough to  end human civilization. While the United States and Russia maintain the  largest stockpiles, China is rapidly building.\n\nAccording…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…underpins onsite inspections.\n\nIt is the latest in a series of treaties that have reduced the global  nuclear warhead stockpile from a high of 70,000 in the mid-1980s to  roughly 12,000 today.\n\nNow that is meaningful, serious progress, but instead of building on  that progress, we are weeks away from reversing those hard-earned  gains.\n\nOn February 5, New…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…State, couples in  this situation would have to decide what to do in the face of an  average premium increase of a whopping $1,049 per month. That is, their  costs will go up $12,000 per year.\n\nHere is just one example in King County, my State's largest county.  This couple would go from paying $425 a month to $1,386 a month. This  problem isn't unique…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Last night, 217 Republicans voted to gut Texas Medicaid, raise costs,  and take away healthcare from over 100,000 of my constituents,  including over 80,000 children and over 12,000 seniors just in my  district.\n\nI love my State. There are so many great things about Texas, but  unfortunately, we are number one in some of the worst ways.\n\nTexas leads the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…biting down already. They threaten to raise  prices on everything, including automobiles. I come from an automobile  manufacturing center. Increases per car may be $9,000 to $12,000 per  car. That is unaffordable. Housing is unaffordable now. Now cars, now  other commodities like items that everybody uses--gasoline, lumber,  road salt, potash, oil, energy.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…actually  are not going to be able to use it for that purpose.\n\nSo how is this Republican so-called healthcare plan going to help  someone who works in a hardware store, who owes $12,000 a year in  premiums, and has a $7,500 deductible? How does that $1,000 help anyone  whose premiums will be $19,000 next year? How does $1,000 cover  $19,000, which would have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…of these cuts on  the 40,000 patients that they serve each year.\n\nIn fiscal year 2024, Washington researchers were awarded nearly $1.3  billion in NIH funding that supports 12,000 jobs in our State. One of  my constituents works at an organization that is fighting autoimmune  diseases. It is 80 percent funded by NIH investments. She is worried  about…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688502/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…how the American auto industry is going to continue to  operate. Ford's CEO said these tariffs will ``blow a hole in the U.S.  industry that we have never seen,'' with up to $12,000 added to the  cost of a car.\n\nAnd this will make lumber and electrical equipment that we need to  build housing--at a time when housing is already in short supply--it  will…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…know in your district, you have  209,000 Social Security recipients: 157,000 are retirees; 25,000 plus  are disabled workers; 10,000 are widows; 3,678 are spouses; and over  12,000 are children. I don't believe that you think that Social  Security and the checks that these people receive is a scam or that  Social Security is a Ponzi scheme.\n\nIn fact,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…trade. They are our best trading  partner. What is going on over there?\n\nUnneeded tariffs will cause prices to rise more on everything. Just  wait. Cars will go up $9,000 to $12,000 a vehicle. Costs of grain will  go up. The cost of road salt, potash, oil, gasoline will skyrocket  dangerously. Let me state plainly that 25 percent tariffs on Canada are…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688376/tariffs-on-canada-are-foolish"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…is  planning would cost American families an estimated up to $2,000 per  year. According to Anderson Economic Group, tariffs could raise the  price of a new car as much as $12,000. I am pretty sure nobody has  extra money for a new car.\n\nHousing costs--one of the biggest drivers on inflation, but President  Trump's tariffs would drive up the cost of…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Project for Pride in Living, helping folks find stable  housing.\n\nNow, at 91, Ted paints to raise funds for nonprofits throughout  Minneapolis. This past weekend, he raised $12,000 at his art sale to  benefit nonprofits working to end homelessness and address hunger for  Agate Housing and Services, Groveland Emergency Food Shelf, and  Sabathani Food Shelf.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690796/recognizing-ted-pouliot"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Reserve's C-130 inventory. She has  heavily invested in servicemember quality of life improvements  throughout her command, especially at Dobbins Air Reserve Base. With  more than 12,000 Reserve Airmen and 59 unit-equipped aircraft, her  leadership of the 22nd Air Force has directly contributed to our  Nation's security through aerial spray, fire suppression,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…Mr. President, I have been in the U.S. Senate now for a  total of 125 days. I have seen some outrageous comments over the last  125 days. My colleague has been here exactly 12,000 days more than I  have. Let me just set the record straight.\n\nOn October 7, 2023, families, mothers, fathers were sitting at home,  enjoying a peaceful existence in one of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690859/gaza"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…outside world. Peaceful protesters have  been met with lethal force.\n\nAlthough the regime has shut down nearly all communications, we are  seeing reports estimating that over 12,000 innocent civilians have been  killed. More than 18,000 individuals have been arrested. This level of  violence against Iran's own people is indefensible.\n\nI commend President…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…part in the State and Tribal Wildlife Grant program.\n\nThese plans play a leading role in helping to prevent and recover  endangered species and guide the conservation of over 12,000 species in  the greatest conservation need.\n\nCurrently, there is no deadline for the U.S. Fish and Wildlife  Service to approve a State-submitted wildlife action plan, with…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…critically important to the Western way of life,  sustaining small rural communities and generating much-needed economic  activity. Passing this CRA will save an estimated 12,000 jobs in North  Dakota just in the coal industry alone.\n\nThis CRA is also crucial to prevent an estimated loss of $34 million  annually in State revenues from oil and gas production.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…percent--not some, but 100 percent; not half, but 100 percent--were  approved in the first year, and 90 percent are still being subsidized,  resulting in checks worth more than $12,000 per month going to  insurance companies.\n\nOne Social Security number was associated with more than 125  different ObamaCare policies. One Social Security number was tied to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…small walk-in  cooler--let's just pick some figures. Let's say it costs $5,000 to  $6,000, but the plumbing, electrical, carpentry, permits, and  everything costs $10,000 to $12,000.\n\nNow, they have a choice. They are either going to pass that on to  their consumers in higher food prices, or they are going to continue to  pay an extra $10 or $20 a month…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…of seniors.\n\nUnder the Working Families Tax Cut Act, seniors age 65 and older can  now claim a $6,000 individual deduction, while married couples filing  jointly can claim $12,000, significantly reducing and for most seniors  effectively eliminating Federal taxes on Social Security benefits.\n\nAfter a lifetime of contributing to our communities and our…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…bringing together many of the  spiritual groups and civic organizations within the community to help  hurricane victims. Thanks to these efforts, Our Lady Queen of Peace  served 12,000 families during the six weeks after the hurricanes. David  still works with Fresh Start for Pasco, Endeavors, and Pinellas  Emergency Operations Center to help victims of disasters.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690173/recognizing-david-cruz"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…insurance premiums.\n\nLet's put up the chart of prices. Two properties. This is before they  elevated their home, after they elevated their home. At first, it  worked. They go from $12,000 a year to $758, from $4,500 to $751. This  is an investment which would lower the cost of flood insurance, saving  the National Flood Insurance Program money; therefore, it…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…eligibility depended upon having a small income.\n\nIn other words, you would lose eligibility for these programs if you  either worked and, depending on the program, made more than $12,000,  made more than $25,000, made more than $50,000, or had somebody else in  the household making more than this amount of money.\n\nThis would include if, say, a single parent…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…the border. That would be  President George H. W. Bush's decision to invade and topple the  Government of Panama in 1989. Without prior congressional approval, he  ordered 12,000 American troops into that country. We toppled Panama's  illegitimate regime. We apprehended the country's dictator, and he  spent the rest of his life in foreign custody.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and boosting investment and made-in-America  production.\n\nFor working families, the results are just as clear. The typical Utah  family with two kids will take home close to $12,000 more under this  law. It is real tax relief for groceries, gas, savings, and peace of  mind.\n\nFor the first time, we are on the path to permanent school choice.  This bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…able to do the  enforcement because the numbers are so precipitously lower than what  they used to be.\n\nWhat does that mean side by side? A year ago, we had some days we had  12,000 people a day illegally crossing our southern border--12,000  people a day.\n\nLast week, most days were around 200. In fact, for the first time  that I can remember in a very…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…community, connection, and recovery. I thank Matt and all of his  team for all that they do to support those who served our country.\n\nTo date, Camp Freedom has served more than 12,000 veterans', first  responders', and servicemembers' families from across Pennsylvania and  the country.\n\nMr. Speaker, I also recognize Bill Bachenberg, who founded Camp  Freedom.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}]