[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…do just that. It is no secret that, right now,  Americans' electric bills are going through the roof. Since Trump took  office, electricity prices have risen an average of 13 percent in just  a matter of months. That is double digits in well under a year.\n\nBeyond the growing costs, demand is growing too. Grid Strategies, the  power sector consulting firm,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…gone up instead of being cut.\n\nJust to mention to my two colleagues, here in Kentucky, it says that  they have gone up 11.8 percent; in Ohio, 9.9 percent; in New Jersey,  13.6 percent. Certainly nothing like the cut in half that President  Donald Trump promised. This report projects that American households  will pay approximately $100 more per household…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…billionaires, not our families living on Main Streets  and in our barrios. He is not even trying to hide it anymore.\n\nMeanwhile, utility bills are surging; electric bills are up 13  percent; and residential gas prices are up nearly 60 percent. This  administration canceled clean energy projects that could have powered  13 million homes, destroying 165,000 jobs…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…power bills in half.  Instead, he and Republicans are causing them to soar with their  backward policies and their war on cheaper clean energy.\n\nElectricity prices are up 13 percent nationwide, and Trump calls the  issue of affordability a hoax. That is how out of touch the President  is, and the Republicans continue to blindly follow him down the path.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…think about this.  Fertilizers--those costs are up 16 percent and in some cases, 39  percent. The effective rate on tractors and other farming machinery is  16 percent and 13 percent, respectively.\n\nWe have also had, as a result of the tariffs that are seen by our  trading partner in Canada that was the participant in the U.S.-Mexico- Canada Trade Agreement--negotiated,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…neighbors are really struggling with higher electric bills.  They are really grappling with how to pay these higher costs.\n\nHousehold electricity prices across America are up by 13 percent this  year--17 percent in North Carolina and 15 percent in the State of  Georgia. Folks really are at their wits' end because it is all coming  down at once.\n\nIn Florida,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…American people and show  precisely how Donald Trump and Republicans have made life far more  expensive for Americans.\n\nThis morning, a report came out that Americans will pay 13 percent  more on energy costs than they did last year. In part, why? Because  Donald Trump and his obeisant Republicans cut out the cheapest way to  get new power and new electrons…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…something about it, all of their bills and  their policies are making it worse and making life even more expensive.  Household electricity prices are up across America by about 13 percent  and a lot higher in some places.\n\nWhy is that the case? First of all, the big, ugly bill that  Republicans passed in July to provide tax breaks to the wealthy and  well-connected…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Instead, he and Republicans are causing  them to soar with their backward policies and their war on cheaper,  cleaner energy. Since Trump took office, electricity prices are up 13  percent, and natural gas prices are up 8 percent. They simply don't  care. They would rather continue to push bills like this that will make  the affordability crisis even worse.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…exceeding the national average by threefold. We are not  alone in this problem. For example, in Maine the cost of electricity  hovers at 22 cents per kilowatt, coming in at 13 percent higher than  the national average, in part due to its many islands and isolated  communities.\n\nMy colleagues and I representing these communities intimately  understand the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…isn't it? It is so out of touch.\n\nThe President promised he was going to cut Americans' power bills in  half, but since he took office last year, electric bills are up by 13  percent across the country, and they are much higher in some places.  There are 80 million Americans who are struggling just to pay their  electric bills. In Florida, the Republican-controlled…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…marginal shift in the export of LNG from the  United States.\n\nAccording to the Department of Energy website, this is what happened:  ``The U.S. natural gas spot price fell by 13 percent on June 9. The  price continued to decline by an additional 17 percent through the end  of June. Prices fell largely because the outage at Freeport decreased  U.S. natural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…President Trump, just this year,  electricity costs are up 11 percent. Food prices are up. The cost of  coffee is up 19 percent this year. Bananas are up 7 percent. Beef is up  13 percent. The cost of healthcare for millions of small business  owners will increase by an average of 114 percent.\n\nThis is going to be a massive hit on small businesses and small…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…showerheads. It is  almost impossible to believe. To make matters worse, this bill will  actually drive up monthly utility bills for American families.\n\nElectricity prices are up 13 percent across the country. Eighty  million Americans are struggling to pay their utility bills, and  Republicans want to make that financial pain even worse. Meanwhile,  grocery…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…listen to what these haphazard  tariffs will do. Canada is Connecticut's single largest trading  partner, accounting for 20 percent of our total trade in 2024,  including 13 percent of our exports and 25 percent of our imports.\n\nConsumers in Connecticut already face some of the highest electricity  prices in the Nation, with an average cost of 28.16…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Republicans did the  Tax Cuts and Jobs Act, you had a tax rate of foreign drive and tangible  income at approximately 16 percent effective rate, but let's say in  Ireland, it was 13 percent. A company could easily set up their entire  tax base for that portion of their business in Ireland and pay 13  percent where the U.S. sees no revenue.\n\nIf we lower that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and utility prices affordable in  distant places as far as Texas, Illinois, and my home State of  Arkansas.\n\nNationwide, residential electricity prices have increased by 13  percent since 2022, and overturning misguided policies like this RMP  amendment will help make the cost of living more affordable for  families across America.\n\nIt is time to unleash…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…size of our economy, is about the same size  as it is right now.\n\nInstead of spending less, right now we can't even agree to cut off  $9.4 billion in DOGE cuts. That is 0.13 percent of what our United  States Government is going to spend this year. It passed the House with  no support from Democrats and four Republicans voting against it, but  it can't…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…next 10 years is Social Security and disability,  28 percent of the growth in spending over the next 10 years is  Medicare, other mandatory and discretionary grows about 13 percent, but  a portion of that is actually, I think, defense and other things in  that. The fact of the matter is your government is an insurance company  with an army.\n\nNow, here…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…car between $5,000 and $15,000.  Despite arguments to the contrary, Americans know that tariffs are a  tax they will have to pay. That is why vehicle sales jumped almost 13  percent last month--because people are trying to buy their cars before  the tariff gets on their car and raises the price. People are smarter  than politicians. That is nothing…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we try to balance  the budget over. We need more money for defense, and we have threats in  the world. We get down to where we are trying to balance the budget on  about 13 percent of our spending because we are terrified to talk about  everything else. We can't touch interest.\n\nI am going to show a slide here in a moment. This one should scare  the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}]