[{"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…country, but in  my State, for example, and in Mr. Thompson's State, similarly, if you  have a teacher and a police officer who are married, their income could  be over $150,000, $200,000 a year. In our States, because the taxes are  higher, because the cost of living is higher, the cost of housing is  higher, so that $150,000 to $200,000 a year is not…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…attack made its way to London, British       leaders seethed. In a royal proclamation, King George III       offered a reward of up to 1,000 pounds sterling--more than       $150,000 in today's currency--to anyone who could help       identify and convict the ``outrageous and heinous Offenders''       behind the ship's burning. He also established a commission…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…would impact operations.\n\nThis is not efficient. This is senseless, and this is heartless.\n\nNIH is based in my State of Maryland, and many of the workers there  are among the 150,000 civil servants who call Maryland home. Each one  of them has made a commitment to public service. Each one of them is a  civil servant that I am proud to represent. These…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…from folks who are making 7 or 8 bucks an hour to $15 an hour, to  middle-class families maybe with two folks working--a firefighter maybe  and a teacher--might be making $150,000, and they have a couple of  kids, still trying at the end of each month to pay the bills, put aside  a little money for college, put a little money aside, hopefully, for a…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…to change the world. They can't do that when Federal research  funding is drying up and educational support is being pulled out from  under them.\n\nDallas ISD alone has over 150,000 students, many from middle-class  families. Cuts to programs like Head Start, Title I, and after-school  STEM enrichment don't just hurt, they derail students' futures.\n\nTexas…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…2 to 5 years; in this population sarcoidosis can  be debilitating and life-threatening. It's estimated that the  prevalence of sarcoidosis in the U.S. ranges between 150,000 and  200,000 with an estimated 1.2 million individuals with sarcoidosis  worldwide.\n\nI am proud to have the Foundation for Sarcoidosis Research (FSR)  based in my district, in the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…would revoke critical       protections for the watershed of the Boundary Waters Canoe       Area Wilderness, a world-class fishing and hunting       destination averaging over 150,000 visitors annually, and       overturn existing precedent for the management of our       nation's public lands.\n\nThe Boundary Waters and downstream Voyageurs National Park…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…or slow.\n\nI am joining all of my colleagues to advocate for this bill.\n\nOne-third of the Virginia population is a resident of the DC metro  area and enjoys this Capital, and 150,000 Virginians come to work in DC  every day. They want DC police and services to be well funded. Please  support this bill. Thank you.                                Vote on…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688852/district-of-columbia-local-funds-act-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…gentlewoman should read the bill.  It doesn't allow it, and I think that is part of the problem.\n\nI would also note, Mr. Speaker, in Representative Miller's district,  an estimated 150,000 women have a different name on their birth  certificate than their current photo ID. Under the SAVE Act, these  women could not use their birth certificate to register to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…people across the United States.\n\nSince he came into office, the President has laid off at least 58,000  Federal civil service workers with plans to eliminate an additional  150,000 workers. Another 76,000 workers accepted buyouts after being  threatened with relocation or termination.\n\nThese layoffs include hundreds of staff members at the Centers for…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692075/illegal-cutting-of-federal-workforce"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…2 years ago, the Sudanese Armed Forces, led by General al- Burhan, and the Rapid Support Forces, led by General Hemedti, plunged  Sudan into war. In the 2 years since, over 150,000 people have died and  12 million more have been displaced.\n\nYou can see this poster reflects the results of what is happening in  Sudan. In just 2 years, 12 million more people…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…credits will expire, spiking premiums overnight.  Mr. Speaker, 30,000 Pennsylvanians have already dropped coverage. By  the end of January, it is estimated by my Governor that 150,000 will be  without insurance.\n\nThe students I met with are so young. They have people and resources  on their side. I have such hope for them. We should want the same for  everyone.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698085/healthcare-and-affordability"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…following:\n\n(1) The Bureau of Prisons has 122 institutions located       throughout the United States, employs nearly 38,000       employees, and is responsible for more than 150,000 Federal       inmates.\n\n(2) Inmate mail is a primary entry point for smuggling       drugs into correctional facilities, with tainted mail       incidents also on the rise.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689519/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Mr. Speaker. By the numbers, there were over 7,000  Southwest border crossings in March. That is still a high number, but  over the last 4 years, the monthly average was over 150,000. It is  astonishing.\n\nThis is something that has been delivered. I would appreciate any  opportunity to codify this into law. I do not like ruling by executive  order all…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to make  do with only 400,000 or 450,000 non-uniformed employees in the  Department of Defense. I will point out that a lot of these employees  are making over $100,000 or $150,000 a year, with anecdotal evidence  that they do very little.\n\nOne of the reasons Congress is so irresponsible is our press corps is  asleep. I hope our press corps digs into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…opportunity for individuals to come see the names of their  loved ones and patriots who otherwise may not be able to make it to  Washington, D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of  war,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…people who make from roughly $30,000 a year to  $130,000 a year for families of four. Now, because President Biden  raised the cap, we have people making $600,000 a year, $150,000 a year,  and families making $200,000 a year who are getting subsidies from the  American taxpayer. Why? Because they said we needed it in the pandemic.\n\nThe pandemic is over,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…neighborhood foster care, maternity care, independent living programs,  human trafficking prevention, and family outreach.\n\nOver the past 25 years, Place of Hope has served more than 150,000  children, youth, and families--offering safe homes, educational  opportunities, and pathways to independence. Their programs keep  siblings together, provide refuge for trafficking…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…incredible landscapes. But  beneath that beauty, lies real strategic importance. Palau reminds us  that size is not what determines strength; conviction is.\n\nGuam, home to over 150,000 U.S. citizens, is central to our Indo- Pacific posture. Together, with partners like the Philippines, Palau,  and Taiwan, we are building a network of deterrence--deterrence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to flood our  country with people who don't believe in it and have no intention of  assimilating into it.\n\nA new Muslim community in Texas, not even a few days old, with a  150,000-square-foot Muslim community center, was opened in Houston,  called EPIC City. It is in Plano, outside of Dallas-Fort Worth and it  has raised all sorts of questions about…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Forest Service, a time-consuming and expensive  process.\n\nIn addition to wasting time and personnel resources, the renewal  process is estimated to cost the City at least $150,000.\n\nBetween 2010 and 2020, the population of The Dalles increased by more  than 11 percent. To address the needs of its current and future  population, the City plans to increase…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}]