[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…since the  global financial crisis. During that period, record numbers of  institutions turned to the discount window, borrowing at unprecedented  levels with more than $150 billion borrowed during the peak period.\n\nThe system held in large part because of the reforms and regulatory  tools provided and implemented as part of the Dodd-Frank Act, but…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699860/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…that. We now have our markets wide open to China. Their markets aren't  particularly open to us, and we have huge trade deficits. Those trade  deficits with China were $150 billion higher under the Trump  administration than they were under the Biden administration. They were  particularly high in the partial Trump administration before COVID. It…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…kicking 17 million people off of their  healthcare.\n\nTrump's big betrayal bill--and that is what I call it because it is a  betrayal to the American people--also included $150 billion for the  Pentagon's war machine. Here we are this week, again, debating another  obscene $892.6 billion military budget. It is not helping our veterans.  That is not where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, it has been 365 days of Trump 2.0, 365 days of terror,  abuse, and violations of our rights.\n\nAfter infusing $150 billion into DHS and ICE, people in this Chamber  have chosen to give them even more money, even after seeing what DHS  does with its unlimited resources, even after seeing what…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…would  raise that to $900.6 billion, approximately $8 billion more than the  President's budget request. That excludes the July 2025 reconciliation  bill, which added over $150 billion in mandatory spending. We need to  more carefully examine how our defense spending increases year after  year, seemingly without fail, and demand the same accountability…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…tariffs that will punish those same Americans.''\n\nThe Wall Street Journal said: ``Tariffs are taxes, and Mr. Trump's  latest tariffs are estimated to be about an annual $150 billion tax  increase. Taxes are antigrowth. That is the message investors are  sending this week since Mr. Trump let his 25 percent tariffs on Canada  and Mexico take effect.''…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…harm  that is happening to children because of this amount of human  trafficking and sex trafficking.\n\nWhat we also have learned is that, globally, this has turned into a  $150 billion-a-year business. This is something that we also have  learned affects every town, city, and community in our Nation. It is  pervasive.\n\nIn Tennessee, my home State, there…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…globally.\n\nHuman trafficking is the second largest criminal enterprise in the  world, second to only that of drug trafficking. Human trafficking  generates an estimated $150 billion a year and enslaves nearly 50  million people. The most vulnerable are our children and young adults.  They are being targeted and exploited through their phones, through…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…million illegal  aliens were given Social Security numbers.\n\nFact number three, a 2023 study showed that the net cost of illegal  aliens to the American taxpayer was at least $150 billion annually.\n\nFact number four, States are still having to bear the financial  burden of Biden's border crisis. Texas taxpayers have to shell out  $8.88 billion a year to pay…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…in DOGE we trust. I  think we can achieve a trillion dollars of savings as a result of its  work. The mass repatriation of millions of illegal aliens should save  another $150 billion. Restoring the work requirement for able-bodied  welfare recipients will save hundreds of billions of dollars more  without touching a single service for the truly needy.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that what we call the forgotten  funds money, it is $1.524 trillion.\n\nIf anyone else is playing along, I have Medicare reform, $1.8  trillion, and talent-based immigration, $150 billion. Let's say we were  able to get just part of the expiring provisions, that is $540 billion.  I just covered every dime of the reconciliation budget.\n\nThere is no borrowing,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and  will now be able to grow their companies and further support their  employees.\n\nI met with defense companies like Ascent Aerospace in Macomb,  Michigan. Thanks to our $150 billion generational investment in  national security, Ascent will ensure that our men and women in uniform  have the tools that they need to protect our country and keep us safe.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…throughout our districts that we support our veterans and thank  them for their service.\n\nLet me quickly walk through what is in this bill: $453 billion in  total funding, $150 billion in discretionary funding, $300 billion for  mandatory programs, $131 billion to fully fund veterans' medical care,  $2 billion for military family housing, and over $1.2…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in working with the  President and the Senate to achieve the $1.5 trillion to $2 trillion in  spending restraint over the 10-year budget window, which is a mere $150  billion to $200 billion a year, even if we are successful, we are going  to massively increase the debt in the United States all the way to  pushing well over $50 trillion by the end of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…States for support but got only  silence. In 2016, the American Government sent $1.7 billion in cash to  the mullahs on shrink-wrapped cargo pallets. In 2015, we released $150  billion more in frozen assets, all to get a nuclear agreement that Iran  never honored.\n\nToday, America must stand with the people of Iran. The regime in  Tehran has been crystal…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you have tax receipts going up  3 percent or 4 percent, we are borrowing more money.\n\nLet's actually take another look at one of these. Major healthcare  programs were up $150 billion over the previous year, and the major  healthcare programs came in at a 9-percent increase from the previous  years.\n\nDoes anyone see a math problem? You have an economy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Trump's promise to secure the  border and enhance national security.\n\nThis bill includes the largest investment in border security in over  a generation. There is nearly $150 billion to secure the border and  deport criminal illegal aliens. We are restoring order at the border  and restocking our military.  We increase pay, housing, and healthcare for…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…ends today because, with the passage of the One Big Beautiful  Bill Act, we begin implementing President Trump's peace through  strength agenda.\n\nH.R. 1 includes a historic $150 billion investment in America's  national defense that will help us begin building the Golden Dome  missile defense shield to protect our homeland, begin to revitalize our  defense…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…baseline, just a couple of the pieces of legislation we have, we think  we can get $100 billion a year just using technology and healthcare.\n\nHow about another $100 billion to $150 billion to actually step into  supply chains and these others? With the adoption of technology, we can  crash parts of the price of this government. Is that a cut? Is that a  chain…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "John Thune", "party": "Republican", "sentence": "…individual marketplace, the 23 or 24 million  Americans who receive their coverage there.\n\nThat is just flat staggering. Look at that. So we are looking at  2024, 2025 now--$150 billion a year over a 10-year period. As I said,  it ends up being scored by the CBO as $1.3 trillion.\n\nBut here is what happened. The spending went up dramatically when the  very…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}]