[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…actually hard to find employment.\n\nThey have been saying: Well, you can make these cuts because there  are not even that many people on Medicaid. There are these people who  are 150 years old or 130 years old or they have been dead for 4 years,  and they are on Medicaid. Well, the reality is that so many of us have  constituents who are dependent on Medicaid…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…during the 1920's when they entertained lawmakers and their  spouses.\n\nIn 1973, the House was added to the National Register of Historic  Places, paying homage to its nearly 150 years of contributions to  American history and society. Virginia Murray Bacon then established  the Bacon House Foundation which worked hand in hand with the  Diplomatic and Consular…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…independent review has shown that their claims are  false or riddled with errors.\n\nBuying condoms for Gaza?\n\nIt didn't happen.\n\nSocial Security payments to people who are 150 years old?\n\nNope.\n\nMr. Speaker, $800 billion in savings on one contract?\n\nOops. Maybe $800 million, they are not really sure.\n\nAbsolutely nothing adds up.\n\nThese DOGI efforts have…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Ridge is a not for profit nursing home and is       a part of the Ascentria Care Alliance, a not for profit,       mission driven organization that has been around for over 150       years.\n\nAs a Skilled Nursing Center we rely on a large labor force       to care for our residents. Throughout COVID many of these       positions sat vacant as undesirable…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…2025, as National Salvation Army Week.\n\nFounded in 1865, the Salvation Army has been unfailingly committed to  serving those in need without discrimination. For more than 150 years,  the Salvation Army has provided essential social services, including  disaster relief, food assistance, shelter, rehabilitation programs, and  youth development initiatives…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690965/national-salvation-army-week"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…oath. Such laws govern against stealing what others legitimately  own, their property and possessions.\n\nWe now face one of the most important tests of our democracy in over  150 years: Whether the Federal Government will blatantly steal the  assets of an independent sovereign nation, who is our ally, for no  legitimate reason other than lust for land.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I am proud to recognize the City of  Douglasville on the occasion of its Sesquicentennial Birthday. For 150  years, Douglasville has contributed to the rich history of the state of  Georgia, and I am honored to uplift today's remarkable milestone. Back  home in my district, constituents…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688019/recognizing-the-city-of-douglasville-georgia-on-its-sesquicentennial-birthday"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…In something that was widely debunked last week, President Trump made  the most outlandish claim that Social Security is contributing money to  people who are supposedly 150 years old. That was widely debunked as  false and untrue, but it is the kind of thing that is seen in  dictatorships or at the start of fascism when people all of a sudden  make…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, I wish to congratulate Rev. Dan Fowler and  First Presbyterian Church of Ashland on 150 years of commitment to  welcoming and accepting people through all walks of life into your  community of faith. Ever since Rev. Moses Allen Williams organized the  First Presbyterian…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693320/recognizing-the-150th-anniversary-of-first-presbyterian-church-of-ashland"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…acres of  the original holding.\n\nRichard Metz, Jr.'s newly designated bicentennial farm was founded in  1825 by Johann Metz, his third great-grandfather. After more than 150  years of family farm lineage, Richard Metz took ownership in 1996.\n\nToday, the original 110 acres exist and grow soybeans, corn, and hay.\n\nMadam Speaker, I offer my sincere congratulations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Recognizing S.W. Johnson Fire Department\n\nMr. LAWLER. Mr. Speaker, I rise today to recognize the S.W. Johnson  Fire Department in Rockland County on an incredible milestone of 150  years of dedicated service to our community.\n\nSince its formation in 1876, S.W. Johnson has been 100 percent  volunteer, embodying selflessness, courage, and a commitment to  protecting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…resilience, stability, and continuity that have defined St. Mary's  since its founding.\n\nMr. Speaker, I ask my colleagues to join me in honoring St. Mary's  Episcopal Church for 150 years of faithful service to its members, the  people of Lampasas, and the greater Central Texas region. May the  congregation continue to serve as a beacon of hope, light, and…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…NEWSPAPER\n\nMr. WILLIAMS of Texas. Mr. Speaker, I rise today to recognize and  celebrate a remarkable milestone for The Comanche Chief newspaper  located in my district.\n\nFor over 150 years, The Comanche Chief paper has provided trustworthy  news, thoughtful commentary, entertainment, and vital resources for the  people of Comanche County. It has served as a…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…tribute to the men and women,  past and present, who have answered the call to protect life and  property in times of need.\n\nCongratulations to the Leesburg Fire Department on 150 years of  outstanding service. I am proud to join the community in expressing our  deepest gratitude and appreciation for their enduring contributions to  the safety and well-being…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694140/recognizing-the-150th-anniversary-of-the-leesburg-fire-department"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…National Medal of Honor Day is an opportunity to pay tribute not only  to their acts of courage but also to the profound sacrifices made in  the defense of our freedoms.\n\nOver 150 years ago, on March 25, 1863, the very first Medals of Honor  were presented, establishing a tradition of recognizing those who  displayed unparalleled bravery in the face of overwhelming…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…faithfully expanded its reach, and they have held onto  their heritage, including the original pulpit from their 1891  sanctuary, a powerful symbol of enduring faith.\n\nFor 150 years, they have been a light in the valley, feeding the  hungry, sending missionaries, broadcasting the Gospel, and transforming  lives.\n\nMay God continue to bless First Baptist…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…that continues to promote leadership, service, and  moral integrity. The Order's motto, ``Dieu et les Dames,'' meaning God  and the Ladies, reflects its core values. For over 150 years, its  members have committed themselves to cultivating character and serving  their communities with distinction.\n\nToday, KA's across the country continue to make a meaningful…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693202/recognizing-kappa-alpha-orders-81st-convention"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Mr. Speaker, I rise today to recognize the Westfield Fire  Department as they celebrate 150 years of service to our community.  Since its founding as a volunteer fire department in 1875, the WFD has  grown into a career department, providing essential fire protection…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692630/recognizing-the-westfield-fire-department-on-their-150th-anniversary"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…of the year. The GENIUS Act not only revolutionizes the way we do  business but preserves critical financial institutions, and they need  this opportunity.\n\nFor more than 150 years, our country has maintained both State- chartered and national banks. There are about 5,000 banks; 4,000 of  them are chartered at the State level and only 1,000 at the Federal…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the Centre County Grange Fair.\n\nFor more than 150 years, Centre County has welcomed visitors from  across the world to the Grange Fair. The Grange Fair has served as a  home away from home for families who, for a period of over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694934/recognizing-centre-county-grange-fair"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…Department, a pillar of our  beloved Ohio community since 1875. It is a privilege to honor these  firefighters who have dedicated themselves to keeping our village safe.\n\nFor 150 years, these brave men and women have put their lives on the  line, responding to countless emergencies with unwavering courage.  Beyond their role as first responders, they connect…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693528/congratulating-the-east-palestine-fire-department-for-150-years-of-service"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize a remarkable  landmark of our history from my hometown of South Dayton. For 150  years, the South Dayton Depot has been a center of connection, culture,  and community spirit. Since its founding in 1875, the South Dayton  Depot has welcomed generations of travelers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694965/recognizing-the-south-dayton-depot-on-its-150th-anniversary"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Sesquicentennial. The perseverance of pioneers and settlers  to overcome come the challenges faced during the early years of the  village's history has persisted throughout the past 150 years. The hard  work and spirit shown by generations of village residents have made  Tontogany an outstanding example of American ingenuity.\n\nTontogany's long history dates back…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fourth child, they buy you  a house. It still hasn't increased fertility rates.  There is a crazy math set, and I have never vetted it, saying, like,  South Korea in 150-something years, there are almost no South Koreans  left. It is happening all over the industrialized world.\n\nThis is why getting tax policy, regulatory policy things, so  correct--because…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}]