[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Based on unofficial estimates, approximately 70 percent of  the Justice Department's Civil Rights Division is expected to accept  the second resignation offer, leaving fewer than 150 attorneys, as  Trump has twisted the division into something unrecognizable, a unit  that is bent on dismantling diversity, equity, and inclusion  initiatives, reversing policies…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…post-pandemic  creation assists the small business community and Arts Community who  suffered during the economic challenges of the Covid-19 Pandemic. The  MCHCC assisted in 150 micro-businesses, artisans and brick and mortar  stores getting the licensing needed to do  business legally and be part of the Mercado. This Mercado Night Market  has become…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…room, independent review has shown that their claims are  false or riddled with errors.\n\nBuying condoms for Gaza?\n\nIt didn't happen.\n\nSocial Security payments to people who are 150 years old?\n\nNope.\n\nMr. Speaker, $800 billion in savings on one contract?\n\nOops. Maybe $800 million, they are not really sure.\n\nAbsolutely nothing adds up.\n\nThese DOGI efforts…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Laurel Ridge is a not for profit nursing home and is       a part of the Ascentria Care Alliance, a not for profit,       mission driven organization that has been around for over 150       years.\n\nAs a Skilled Nursing Center we rely on a large labor force       to care for our residents. Throughout COVID many of these       positions sat vacant as undesirable…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…and kicking 17 million people off of their  healthcare.\n\nTrump's big betrayal bill--and that is what I call it because it is a  betrayal to the American people--also included $150 billion for the  Pentagon's war machine. Here we are this week, again, debating another  obscene $892.6 billion military budget. It is not helping our veterans.  That is not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Development Act, introduced by my colleague from the Pacific Northwest,  Representative Bentz from Oregon.\n\nThis bill would direct the Secretary of Agriculture to convey  approximately 150 acres of Federal land in the Mount Hood National  Forest to the City of The Dalles, Oregon.\n\nThis land is vital to the City's watershed and supports roughly 80  percent of its…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…fraud''--40 percent. First, it  was Elon Musk calling Social Security a Ponzi scheme. Then Donald Trump  spent 10 minutes in his congressional address talking about checks to  150-year-olds, which we all know is a lie. And now the Vice President  has picked up the ax and is coming for Social Security too.\n\nWe need to be very clear: What the Vice President…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689776/social-security"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…gentlewoman should read the bill.  It doesn't allow it, and I think that is part of the problem.\n\nI would also note, Mr. Speaker, in Representative Miller's district,  an estimated 150,000 women have a different name on their birth  certificate than their current photo ID. Under the SAVE Act, these  women could not use their birth certificate to register to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…seniors thousands of dollars as we speak here tonight.\n\nUnsurprisingly, the Vice President avoided discussing the awful,  unwise decisions by his administration to rip away almost $150 million  from the city that he was in by taking away $45 million from the Libbey  Glass Company to purchase two new glass furnaces that were to compete  against Chinese, Mexican,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…the cost of  their policy go up $696, without the Federal tax credits.\n\nIn Austin, Mary will pay an additional $300 per month. On the North  Side, Emily will pay an additional $150 a month, raising her cost to  $600. Beginning January 1, Rebecca will pay $796 a month.\n\nThis is totally unacceptable. All of these are too high. Let's make  healthcare available…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698790/breaking-the-gridlock-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…about $200 million, is subject almost always to a 7 percent gross  spread. That is 7 percent of the proceeds, or in the case of a $200  million offering, $14 million. On a $150 million offering, it is $10  million, well more than twice the regulatory cost that we identified in  working on the JOBS Act.\n\nWhat is very strange about that 7 percent fee…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693905/middle-market-ipo-cost-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…``taking care of  ourselves and our neighbors.''\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to celebrate Evergreen, Colorado, on its 150-year- history and join the town in looking forward to the future.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Venezuelan boats  in open waters, the amassing of naval assets around Venezuela, the  President's authorization of covert activities, the seizure of ships,  the coordinated attack of 150 aircraft that not only extracted  President Maduro and his wife but also bombed sites around the  country--this is bigger than an arrest warrant.\n\nMore than 200 enemies have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…would revoke critical       protections for the watershed of the Boundary Waters Canoe       Area Wilderness, a world-class fishing and hunting       destination averaging over 150,000 visitors annually, and       overturn existing precedent for the management of our       nation's public lands.\n\nThe Boundary Waters and downstream Voyageurs National Park…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Trump administration continues to  withhold  more than $5 billion in critical K-12 and adult education funding that  should have been released by the July 1 deadline.\n\nMore than 150 Democratic Members of the House of Representatives  joined a group of 42 Senators, including 10 Republican Senators, in  calling on Secretary McMahon and Director Vought to…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "French Hill", "party": "Republican", "sentence": "…reserves dating to       President Harrison in the 1890's, it was President Teddy       Roosevelt that established the National Forest Service in       1905 and dedicated over 150 million acres for future       generations. Included among these extraordinary resources       were both the Arkansas National Forest in 1907 (later renamed       the Ouachita…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…opportunity for individuals to come see the names of their  loved ones and patriots who otherwise may not be able to make it to  Washington, D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…third or fourth child, they buy you  a house. It still hasn't increased fertility rates.  There is a crazy math set, and I have never vetted it, saying, like,  South Korea in 150-something years, there are almost no South Koreans  left. It is happening all over the industrialized world.\n\nThis is why getting tax policy, regulatory policy things, so  correct--because…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the Centre County Grange Fair.\n\nFor more than 150 years, Centre County has welcomed visitors from  across the world to the Grange Fair. The Grange Fair has served as a  home away from home for families who, for a period of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694934/recognizing-centre-county-grange-fair"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…out  of the year. The GENIUS Act not only revolutionizes the way we do  business but preserves critical financial institutions, and they need  this opportunity.\n\nFor more than 150 years, our country has maintained both State- chartered and national banks. There are about 5,000 banks; 4,000 of  them are chartered at the State level and only 1,000 at the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…incredible landscapes. But  beneath that beauty, lies real strategic importance. Palau reminds us  that size is not what determines strength; conviction is.\n\nGuam, home to over 150,000 U.S. citizens, is central to our Indo- Pacific posture. Together, with partners like the Philippines, Palau,  and Taiwan, we are building a network of deterrence--deterrence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…more taxpayer dollars with  basically nothing to show for the expenses.\n\nThe Fiscal Responsibility Act of 2023 attempted to change course and  imposed a 2-year deadline and a 150-page cap on environmental impact  statements. However, the Council on Environmental Quality reports that  61 percent of environmental impact statements still take over 2 years…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693796/fix-broken-permitting-and-regulatory-laws"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…members. Our commitment to training is best       displayed at our world-class International Training &       Education Center (ITEC) located in Texas. The IUOE invested       over $150 million at the 265-acre ITEC facility so our       members can train with the newest advances in safety and       technology. It is the largest and most comprehensive training…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…low-income and were uninsured and didn't have the ability to  make any payments toward covering their own insurance.\n\nWhat ObamaCare does is it says if a person is 100 percent or 150  percent of poverty level, all that is required is that the person pay 2  percent of their income, the Federal taxpayers will cover the rest, it  will be sent it to the insurance…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Nation and  the faith of the people in Texas who have come together under the cross  that stands up on that hill in Kerrville and the people who have  generously contributed now $150 million and counting that are going in  to help those people, and the first responders who showed up on the  scene and the people like my friend and the former sheriff, my buddy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Eisenhower, in 1954. Later, Senator Dole became the key champion of its  reauthorization. Since its creation, Food for Peace has reached more  than 4 billion people in more than 150 countries using American-grown  commodities.\n\nAnother food aid program, the McGovern-Dole Program, was established  in 2002 through the farm bill. It originated from the partnership…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…had to make  do with only 400,000 or 450,000 non-uniformed employees in the  Department of Defense. I will point out that a lot of these employees  are making over $100,000 or $150,000 a year, with anecdotal evidence  that they do very little.\n\nOne of the reasons Congress is so irresponsible is our press corps is  asleep. I hope our press corps digs into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…about somehow  Republicans are only looking out for the big businesses. No. No, this  rule sets up the debate for overturning the CFPB rule and helping the  little guy not face $150 to $750--that is in Virginia; I don't know  about other States--in charges if they have to deal with a criminal  penalty. $50 from the merchant, and they are worrying about…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and partnerships for meaningful impact.  Beyond immediate relief, the team worked with individuals and families  who would require long-term recovery efforts. For approximately 150  permanently displaced residents, they implemented a housing eligibility  process, with the intent of ensuring fair and transparent allocation of  resources. By securing placements…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…and globally.\n\nHuman trafficking is the second largest criminal enterprise in the  world, second to only that of drug trafficking. Human trafficking  generates an estimated $150 billion a year and enslaves nearly 50  million people. The most vulnerable are our children and young adults.  They are being targeted and exploited through their phones, through…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}]