[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Based on unofficial estimates, approximately 70 percent of  the Justice Department's Civil Rights Division is expected to accept  the second resignation offer, leaving fewer than 150 attorneys, as  Trump has twisted the division into something unrecognizable, a unit  that is bent on dismantling diversity, equity, and inclusion  initiatives, reversing policies…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…post-pandemic  creation assists the small business community and Arts Community who  suffered during the economic challenges of the Covid-19 Pandemic. The  MCHCC assisted in 150 micro-businesses, artisans and brick and mortar  stores getting the licensing needed to do  business legally and be part of the Mercado. This Mercado Night Market  has become…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…room, independent review has shown that their claims are  false or riddled with errors.\n\nBuying condoms for Gaza?\n\nIt didn't happen.\n\nSocial Security payments to people who are 150 years old?\n\nNope.\n\nMr. Speaker, $800 billion in savings on one contract?\n\nOops. Maybe $800 million, they are not really sure.\n\nAbsolutely nothing adds up.\n\nThese DOGI efforts…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Laurel Ridge is a not for profit nursing home and is       a part of the Ascentria Care Alliance, a not for profit,       mission driven organization that has been around for over 150       years.\n\nAs a Skilled Nursing Center we rely on a large labor force       to care for our residents. Throughout COVID many of these       positions sat vacant as undesirable…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…and kicking 17 million people off of their  healthcare.\n\nTrump's big betrayal bill--and that is what I call it because it is a  betrayal to the American people--also included $150 billion for the  Pentagon's war machine. Here we are this week, again, debating another  obscene $892.6 billion military budget. It is not helping our veterans.  That is not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Development Act, introduced by my colleague from the Pacific Northwest,  Representative Bentz from Oregon.\n\nThis bill would direct the Secretary of Agriculture to convey  approximately 150 acres of Federal land in the Mount Hood National  Forest to the City of The Dalles, Oregon.\n\nThis land is vital to the City's watershed and supports roughly 80  percent of its…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…fraud''--40 percent. First, it  was Elon Musk calling Social Security a Ponzi scheme. Then Donald Trump  spent 10 minutes in his congressional address talking about checks to  150-year-olds, which we all know is a lie. And now the Vice President  has picked up the ax and is coming for Social Security too.\n\nWe need to be very clear: What the Vice President…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689776/social-security"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…gentlewoman should read the bill.  It doesn't allow it, and I think that is part of the problem.\n\nI would also note, Mr. Speaker, in Representative Miller's district,  an estimated 150,000 women have a different name on their birth  certificate than their current photo ID. Under the SAVE Act, these  women could not use their birth certificate to register to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…bill would  raise that to $900.6 billion, approximately $8 billion more than the  President's budget request. That excludes the July 2025 reconciliation  bill, which added over $150 billion in mandatory spending. We need to  more carefully examine how our defense spending increases year after  year, seemingly without fail, and demand the same accountability…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…more than 2 to 5 years; in this population sarcoidosis can  be debilitating and life-threatening. It's estimated that the  prevalence of sarcoidosis in the U.S. ranges between 150,000 and  200,000 with an estimated 1.2 million individuals with sarcoidosis  worldwide.\n\nI am proud to have the Foundation for Sarcoidosis Research (FSR)  based in my district,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…commissioner of the Judicial Selection Commission, and  when he sees a problem, he uses ministry to solve it.\n\nJust this summer, out of nowhere, he conjured up a summer camp for  150 children in Norwalk, Connecticut, who might not otherwise have a  way to constructively spend their days.\n\nI have always loved the quote attributed to St. Francis of Assisi.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693739/welcoming-reverend-dr-lindsay-curtis"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…bring mental health services to people where they were at, so she  created partnerships with schools, medical practices, law enforcement,  and others to facilitate more than 150 outposts for substance use  disorder care. She grew the Center's workforce by over 300 employees  and improved access to treatment for over 25,000 Coloradans in the  Front Range…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692052/recognizing-dr-kiara-kuenzler"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…assembly in Georgia, using violence  against protesters, and abusing the court process to wrongfully  imprison and charge protesters.\n\nThe Georgian people have protested for over 150 consecutive days and  are still protesting today, especially on Sundays. They are calling for  free and fair elections and the release of political prisoners.\n\nThe United States…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…would revoke critical       protections for the watershed of the Boundary Waters Canoe       Area Wilderness, a world-class fishing and hunting       destination averaging over 150,000 visitors annually, and       overturn existing precedent for the management of our       nation's public lands.\n\nThe Boundary Waters and downstream Voyageurs National Park…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and terrified, and they have  no confidence about their ability to stay warm.\n\nIt is getting cold in Vermont. You know, most families who use LIHEAP  funding, they make about 150 percent of the poverty level, that is  about $23,000 a year. You know, the cost of home heating fuel is  between 3 and 4 bucks a gallon, right now. That help is essential.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697111/low-income-home-energy-assistance-program"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…if you have tax receipts going up  3 percent or 4 percent, we are borrowing more money.\n\nLet's actually take another look at one of these. Major healthcare  programs were up $150 billion over the previous year, and the major  healthcare programs came in at a 9-percent increase from the previous  years.\n\nDoes anyone see a math problem? You have an economy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…opportunity for individuals to come see the names of their  loved ones and patriots who otherwise may not be able to make it to  Washington, D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…and throughout our districts that we support our veterans and thank  them for their service.\n\nLet me quickly walk through what is in this bill: $453 billion in  total funding, $150 billion in discretionary funding, $300 billion for  mandatory programs, $131 billion to fully fund veterans' medical care,  $2 billion for military family housing, and over…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…incredible landscapes. But  beneath that beauty, lies real strategic importance. Palau reminds us  that size is not what determines strength; conviction is.\n\nGuam, home to over 150,000 U.S. citizens, is central to our Indo- Pacific posture. Together, with partners like the Philippines, Palau,  and Taiwan, we are building a network of deterrence--deterrence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Security to help make sure  that we meet this moment.\n\nBut at the end of the day, as someone who is proud to be an  appropriator and to have the opportunity to deliver more than $150  million for my little State of Delaware, across dozens and dozens of  targeted appropriations, and then, more broadly, through all of these  different subcommittees, to help…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of people sitting in my office and  wanting money for whatever their cause is.\n\nMr. Speaker, you do realize when you start looking at this stuff, you  are talking about 140, 150-plus percent of debt to GDP. It goes from a  100 today to almost a 50 percent increase in the next 10 years. It is  uncomfortable. The primary driver of U.S. sovereign debt…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…military to keep us safe.\n\nThe global mineral race is not optional. Over the next 15 years,  demand for copper and rare earth elements is expected to rise by 50  percent; cobalt, 150 percent; and lithium, up to 500 percent. Shortages  of all the above could be upon us within a decade.\n\nYet these minerals are right here under our feet. We have the safest,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…taxpayers to send us money to make up for the  cuts we did there and spent the money elsewhere. That was the game.\n\nIf you don't believe me, here is the list:\n\nAustin, Texas, $150 million cut;\n\nBoston, Massachusetts, $12 million cut;\n\nBurlington, Vermont, $1.1 million;\n\nDenver, Colorado, $55 million;\n\nEureka, California, $1.2 million;\n\nHartford, Connecticut,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…low-income and were uninsured and didn't have the ability to  make any payments toward covering their own insurance.\n\nWhat ObamaCare does is it says if a person is 100 percent or 150  percent of poverty level, all that is required is that the person pay 2  percent of their income, the Federal taxpayers will cover the rest, it  will be sent it to the insurance…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…thinking and  decisive actions.\n\nOn January 29, Deputy Thomas responded to a severe accident on U.S.  1/Georgia 4 near mile marker 8. A semitruck had collided with a Ford F- 150, leaving several people injured.\n\nUpon his arrival, Deputy Thomas found the semitruck driver severely  wounded, suffering from a deep bleeding cut on his elbow. Without  hesitation,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688323/recognizing-hunter-thomas"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to make permanent  tax benefits for wealthy environmentalists who support them. That is  why we are where we are today.\n\nMr. Speaker, since ObamaCare has passed, we have seen 150-plus  hospitals close their doors. Since ObamaCare has passed, we have seen  premiums go up more than 80 percent. It doesn't sound like the  Affordable Care Act by any means.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…reserves dating to       President Harrison in the 1890's, it was President Teddy       Roosevelt that established the National Forest Service in       1905 and dedicated over 150 million acres for future       generations. Included among these extraordinary resources       were both the Arkansas National Forest in 1907 (later renamed       the Ouachita…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…ends today because, with the passage of the One Big Beautiful  Bill Act, we begin implementing President Trump's peace through  strength agenda.\n\nH.R. 1 includes a historic $150 billion investment in America's  national defense that will help us begin building the Golden Dome  missile defense shield to protect our homeland, begin to revitalize our…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…National Medal of Honor Day is an opportunity to pay tribute not only  to their acts of courage but also to the profound sacrifices made in  the defense of our freedoms.\n\nOver 150 years ago, on March 25, 1863, the very first Medals of Honor  were presented, establishing a tradition of recognizing those who  displayed unparalleled bravery in the face of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…about somehow  Republicans are only looking out for the big businesses. No. No, this  rule sets up the debate for overturning the CFPB rule and helping the  little guy not face $150 to $750--that is in Virginia; I don't know  about other States--in charges if they have to deal with a criminal  penalty. $50 from the merchant, and they are worrying about…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]