[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the President's decision to deploy Active-Duty marines  along with the National Guard in Los Angeles, I reintroduced this  legislation with my colleagues from California and 16 other States.\n\nThe danger of the President invoking the Insurrection Act is no  longer hypothetical or abstract; it is real. It is happening now. The  President shows no signs…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Democrats  who worked tirelessly with me on this package. H.R. 6644 includes 25  provisions that come directly from bills championed and introduced by  House Democrats and another 16 provisions that House Democrats co-led.\n\nI am excited that it includes my bill, H.R. 5077, which would allow  cities to use CDBG funds toward affordable housing construction.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…is widely accepted as free, fair, and  transparent and that the results are honored in and outside of  Honduras.\n\nAt that time, I expressed concern about a report that on July 16,  Counselor Ana Paola Hall had resigned from the National Electoral  Council due to political pressure and threats against her and her  family. I also expressed concern that…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…history as part of their scheme  to fund giant tax breaks for billionaires. As the nonpartisan  Congressional Budget Office just announced this morning, the GOP tax  scam now cuts 16 million people, up from 13.5 million people, from  their healthcare, all to give tax breaks to their billionaire friends.\n\nMedicaid covers 40 percent of all Americans with opioid…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…of Health and Human Services' Prevention and  Public Health Fund; the Patient-Centered Outcomes Research Trust Fund;  the Pediatric Brain Tumor Consortium, an association of 16 academic  centers and children's hospitals dedicated to trials of novel  treatments for pediatric brain cancer; and so much more.\n\nWe need to understand why this is happening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Billy graduated from Von  Humboldt Elementary School and Roberto Clemente Community Academy.\n\nRooted in the community that raised him, Billy served as the 26th  Ward alderman for 16 years, from 1993 to 2009, where he championed  major infrastructure and community development projects, including the  creation of Division Street's signature Puerto Rican flags,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, today marks 16 years since the Supreme  Court's disastrous decision in Citizens United.\n\nThe decision overturned critically important limits on political  spending by corporations and billionaires.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…business  as usual around here, but the daily chaos and illegal activity that we  are seeing from the Trump administration is not business as usual.\n\nThe reality is that 15 of the 16 bills we are considering today from  the Committee on Energy and Commerce, including this one, should  already be law. They were already agreed to last year as part of a  bipartisan,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…national air carrier. The money that I am making today  is far more than I ever made as a contract employee for an airline.\n\nMr. Speaker, I will tell you that during the hard, 16-hour days that  I had, much like what I have here, we weren't allowed to receive any  tips. We weren't allowed to receive any of those kinds of benefits.  Basically, if we did,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…Mr.  Speaker, it is repaid typically within 3 days on average. A typical  overdraft fee of $35, which is what we had before the rule, amounts to  an interest rate of more than 16,000 percent APR on the bank's loan of  $26. Mr. Speaker, that is usurious. American families cannot afford any  more liberation.\n\nIt is not as though we have a history here in…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689853/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…servant but a man of outstanding  character and passion. His own family full of hockey players, Dave  spearheaded the Belmont-Gilford cooperative hockey team, cultivating  the 16-year-old program that put numerous players on the ice.\n\nIn all, Dave Caron represents the very best of America's public  servants--dedicated, attentive, and unwaveringly committed…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…have healthcare. We are  going to make sure people have food assistance. We are not going to  screw them over.\n\nMr. McGOVERN. Mr. Speaker, the big, ugly bill is going to throw 16  million people off of healthcare and give people like Jeff Bezos,  millionaires and billionaires, a tax cut. If that is what you are  about, I hate to tell you, that is not…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…gov/sites/evo-subsites/mccollum.house. gov/files/evo- media-document/02-rainy-river-withdrawal-ea.pdf.\n\nMr. Speaker, I also include two letters. The first letter is a letter  dated January 16, 2026, from a group of hunters and anglers opposing  this legislation; and the second letter is a letter dated January 20,  2026, from a group of environmental organizations…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Mr. Speaker, if you are a billionaire, the economy is booming. However,  when I go home and I talk to my constituents, what they tell me is that  the price of beef has risen 16.4 percent over the last year. The price  of coffee is up a whopping 19.8 percent. The price of lettuce is up 7.3  percent. Frozen fish is up 8.6 percent. So for them, it is not…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…with great pride to  celebrate Burbank American Little League, a beloved youth organization  in my district which started in 1954 and currently serves 350 kids,  ages 4 through 16.\n\nAs a lifelong baseball fan, I love watching these young players take  the field with determination and energy. Just this summer, the minor  league division, the 10-year-olds,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694916/congratulating-burbank-american-little-league"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…to college, and school to       internships and jobs.\n\n(15) Researching effective approaches for engaging students       from groups historically underrepresented in STEM.\n\n(16) Any other activity the Director determines will       accomplish the goals of this section.\n\n(g) Evaluations.--All proposals for awards under this       section shall include…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…countries.\n\nLet's just say what you saw prior to 2017 when Republicans did the  Tax Cuts and Jobs Act, you had a tax rate of foreign drive and tangible  income at approximately 16 percent effective rate, but let's say in  Ireland, it was 13 percent. A company could easily set up their entire  tax base for that portion of their business in Ireland and pay…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…constraints. Battles such as Monte  Cassino and Anzio stand as two of the most intense of the war, costing  countless lives.\n\nToday, fewer than half a percent of the more than 16 million  Americans who served in World War II are still living today. The  veterans of the Italian campaign, including my father SSG Raymond Moran  of the 603rd Armament Maintenance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize Mr. Theodore Gomez for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project. In May, a courageous team of 16 WREC employees traveled  over 1,800 miles to the remote, rugged terrains of Arizona and New  Mexico, where they spent two weeks installing vital electrical  infrastructure for…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692595/recognizing-theodore-gomez"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize Mr. Jose Santiago for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project. In May, a courageous team of 16 WREC employees traveled  over 1,800 miles to the remote, rugged terrains of Arizona and New  Mexico, where they spent two weeks installing vital electrical  infrastructure for…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692641/recognizing-jose-santiago"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that has happened in  the United States of helping young people get healthier?\n\nRemember, under Michelle Obama's initiatives with President Obama, I  think we spent, it was $16 billion or $36 billion, but some number like  that, and it had absolutely no success. This was the dietary issues and  the food issues, trying to get young people to go exercise.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…win start and claiming the Section One title, second place finish in  the Lancaster-Lebanon League, and fourth place finish in the district  3A team tournaments. Ending with a 16-4 record, the Hempfield Black  Knights advanced to states. On May 24, Lehman and Garcia defeated their  opponents from Dallastown after climbing back from a large deficit.\n\nLehman…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692412/congratulating-cooper-lehman-and-braylen-garcia-tennis-doubles-champions"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…America, and the International  Union of Operating Engineers, in support of H.J. Res. 140.                NABTU Statement of Support for H.J. Res. 140\n\nWashington, D.C.--January 16, 2026--Today, North America's       Building Trades Unions (NABTU) President Sean McGarvey issued       the following statement:\n\n``Our nation is at a crucial inflection point.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "Mrs. SPARTZ. Mr. Speaker, I rise today to recognize Hamilton County  Sheriff Deputy Jeff Larkin, who is retiring after 16 years of service  with the Hamilton County, Indiana Sheriff's Department.\n\nPrior to his time with the Hamilton County Sheriff's Office, Deputy  Larkin served as a police officer…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…concerning the matters contained       in the person's sworn statement, as well as any other matters       related to the subject of the investigation before the       Subcommittee.\n\n16. All testimony taken in executive session shall be kept       secret and will not be released for public information       without the approval of a majority of the Members of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Carol Berti has made on through her work with Oasis  Pregnancy Centers. Carol is a rare gem in the volunteer world;  dedication is her middle name. For 16 years, Carol has served Oasis  with warmth, compassion, and dedication to the families of Oasis. Carol  was an integral part of the start-up of Oasis in 2009 and continues to…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690132/recognizing-carol-berti"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…six days a week, there was no vacation time.  After three years they sold the drug store, and took a vacation for six  months in Corpus Christi, Texas. The family lived in a 16 ft travel  trailer on the beach. Margaret and Art returned to Idaho and bought a  drug store in Parma. They operated that store for four years before  selling it, and took the…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Reaction Force from the 160th SOAR dispatched a Chinook  helicopter to rescue the SEALs, but tragically the helicopter was shot  down by a rocket-propelled grenade, killing all 16 men on board. In  total, 19 Americans died in Operation Red Wings. It was one of the  deadliest days in special warfare history.\n\nThe mission is not just a story of loss; it…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…TITLE.\n\nThis Act may be cited as the ``Assisting Small Businesses       Not Fraudsters Act''.       SEC. 2. ASSISTANCE PROHIBITED AFTER FRAUD CONVICTION.\n\n(a) In General.--Section 16 of the Small Business Act (15       U.S.C. 645) is amended by adding at the end the following new       subsection:\n\n``(h) Financial Assistance Prohibition.--\n\n``(1) In general.--An…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…its utilization by them. That has been the case, Mr.  Speaker, for well over a decade.\n\nPerry County is a very small, rural community with a population of  around 10,000. About 16 percent of the residents there live below the  poverty line. About 77 percent of the county is forested, and 72  percent of that land is privately owned.\n\nThe U.S. Forest Service…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}]