[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, I rise to commemorate Korean War  Armistice Day and to honor the millions of servicemembers who fought  during the Korean war.\n\nThis year marks the 16th anniversary of Proclamation 8399, a  proclamation to establish National Korean War Veterans Armistice Day.\n\nI am proud to have introduced legislation in this Congress to help…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Alexandria Ocasio- Cortez, places like Throggs Neck, Pelham Bay, Westchester Square, and  the like. However, Community Board 10 also includes the major complex  of Co-op City in my 16th Congressional District.\n\nCo-op City benefits from the leadership of Joseph Russo, chairman of  the community board, and the excellent district manager, Matt Cruz. Co- op City…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of California. Mr. Speaker, I rise to announce that  March 10th through March 16th marked Brain Awareness Week. The Brain  Awareness Campaign is a worldwide celebration of the brain that brings  together scientists, families, schools, and communities. Brain…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688941/recognizing-brain-awareness-week"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…also an essential  economic and trade partner of the United States and so many other  countries around the world.\n\nAccording to the World Trade Organization, Taiwan was the 16th  largest exporter and the 21st largest merchandise importer in 2023.  Those exports, especially for information and communications technology  products, make Taiwan a critical…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…this is going  to continue the cycle of pain for so many Americans.\n\nStansbury).\n\nMr. SUBRAMANYAM. Mr. Speaker, I thank my colleague and all the  speakers today. This is the 16th anniversary of Citizens United v.  Federal Election Commission. It was a 5-4 ruling. This decision  overturned longstanding precedent that we had in this country, where we…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, the 16th District of New York is lucky to  have an Education First facility located in Tarrytown.\n\nDuring the August work period, I had the opportunity to tour their  international language…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695726/education-first"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today on the 16th anniversary of the  United States Supreme Court's Citizens United decision, a decision that  disfigured our political landscape, reorienting power away from voters  and toward…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…better. Instead, House  Republicans are using their position to introduce a nonsense bill to  rename the Gulf of Mexico.\n\nThe Gulf has been known as the Gulf of Mexico since the 16th century.  Why are they making a big deal out of this now? It is because they want  to stroke the ego of Donald Trump.\n\nBack home in California, my constituents are concerned…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690938/gulf-of-america-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…a good neighbor. Vote ``no'' on the cuts to  public broadcasting.                   restore funding for lifesaving food aid\n\nMr. MAGAZINER. Mr. Speaker, I rise today for the 16th time to beg the  Trump administration to honor its word and restore funding for  lifesaving food aid for starving children.\n\nThis is Plumpy'Nut, an emergency paste that is used…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…championships this month. In the NCAA Division  III wrestling national championship, the Knights from Wartburg College  returned from Rhode Island as cochampions and with their 16th national  title--the most in Division III history. The women's basketball team at  Dordt University in Sioux Center returned to the NAIA national  championship held last week…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…deficit.\n\nWhen our brothers and sisters on the left keep saying things like  raise taxes, we have done that. Remember, we have been experimenting  with this since--what is it?--the 16th Amendment. We have had times of  raising the high marginal tax rates and low marginal tax rates.  Somehow, the size, the growth, of the economy is what fluxes.\n\nTherefore, the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "Mr. BUCHANAN. Mr. Speaker, I rise today in recognition of outstanding  school employees in Florida's 16th Congressional District.\n\nSchool employees work tirelessly because they understand that their  efforts are not just about fulfilling a job description, but about  shaping the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…time at Fort Carson, Captain Retzlaff attended the  Maneuver Captain's Career Course at Fort Benning, Georgia, graduating  in 2022. He was then assigned to the 2nd Squadron, 16th Cavalry  Regiment, where he served as an Armor Basic Officer Leader Course  (ABOLC) Tactics Instructor, training the next generation of Army  leaders.\n\nIn August 2022, Captain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "Mr. BUCHANAN. Mr. Speaker, I rise today to recognize fire, rescue and  EMS personnel who have provided distinguished service to the people of  Florida's 16th Congressional District.\n\nFirst responders, fire departments and emergency medical service  teams are summoned on short notice to serve their respective  communities. Often,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…much in the defense of our Nation. Many  of them retired their uniforms but continue their service by helping  others in their community.\n\nFour years ago, I established the 16th District Congressional Veteran  Commendation to recognize the heroic wartime sacrifices and admirable  peacetime community involvement of my constituents. These are  exceptional…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…recognize President  Wendy Wintersteen, a longtime champion for Iowa's students and a  nationally respected leader in higher education, as she moves on from  her role as the 16th President of Iowa State University.\n\nWendy's leadership has shaped the future of Iowa State and made a  meaningful difference across our state. She has led with vision,  investing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691609/recognizing-president-wendy-wintersteen-for-her-service-to-iowa-state-university"}]