[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Mr. DELUZIO. Mr. Speaker, I rise today to celebrate and congratulate  the many high school teams in Pennsylvania's 17th Congressional  District that won their WPIAL championships this fall season. Those  champions are as follows:\n\nIn football, they are Aliquippa, Avonworth, and Seton LaSalle.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699040/congratulating-wpial-champions"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…healthcare for 152,483 of my neighbors at home  who depend on Medicaid, more than 66,000 kids under the age of 19. Ten  thousand seniors back home rely on Medicaid in Illinois' 17th District  for their nursing home coverage.\n\nWhile you may see this as a numbers game in a budget, I see families.  I see neighbors. I see loved ones.\n\nLet me let you in on a…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688092/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 17th time to demand  that the Trump administration deliver on its promise to restore funding  for lifesaving food aid.\n\nThis so-called pause on lifesaving food aid is unnecessary…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692117/lifesaving-foreign-aid"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, in the ever-changing landscape of community  media, I am pleased to salute the 17th anniversary of the launch of  Scarsdale10583, the online source for local news and information in the  village of Scarsdale and in the neighborhoods of Hartsdale and Edgemont…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…thank every officer in my district, from city departments to county  and Federal agencies, for putting their lives on the line to keep our  communities safe.\n\nOn May 2, the 17th Annual Imperial Valley Law Enforcement Memorial  Ceremony brought our community together in El Centro to remember the 49  officers who made the ultimate sacrifice in their service…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691331/9999"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…her dynamic 97 years.\n\nDotty. Dot. Aunt Dot. Mrs. Christiana. Mother Dear. Ma.       Gram. Great Grammie.\n\nBut to me, Dorothy Christiana was always Dee Dee. Born on       the 17th Day of the 7th month in the year 1927 in Manchester,       Connecticut. She was the youngest of three children to Frank       & Letitia Irwin. A graduate of Manchester High…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Commendation. It is with great honor and respect that I present  retired USA Lieutenant Colonel William (Bill) Patterson Matthews with a  Congressional Veteran Commendation from the 17th Congressional District  of Texas.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Texas and the broader law enforcement  community.\n\nIt is with great honor and respect that I present Danny Wallace Smith  with a Congressional Veteran Commendation from the 17th Congressional  District of Texas. His exemplary service to our Nation and continued  contributions to his community stand as a powerful example of public  duty and honor.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…great honor to recognize the legacy and great  sacrifice of our Vietnam War veterans through The Wall That Heals,  which will be on display in Nassau County, Florida, from April 17th  through April 21st at the Northeast Florida Fairgrounds.\n\nThe Wall That Heals is a half-scale replica of the permanent memorial  in Washington, D.C., that stands six feet tall…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…lifelong service, leadership, and dedication to others. It is with  great honor and respect that I present Nola Jane Saldana with a  Congressional Veteran Commendation from the 17th Congressional District  of Texas.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…brave individuals like Tigran Gambaryan in Congress,  and I celebrate his return home to his wife Yuki and their two young  children. God bless their family.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Krysta Fowler for achieving the highest distinction  in Girl Scouts, the Gold Award. We thank Krysta for her leadership…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…recognize and thank someone  whose impact on my office and on me personally cannot be overstated, my  chief of staff, Nate Soule, as he concludes his service to New York's  17th Congressional District.\n\nWhen I first ran for the New York State Assembly in 2020, before  there was a congressional office or a seat in this Chamber, Nate took a  leap of faith…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…distributing them to the homeless and less  fortunate teens. His compassion and dedication will have a positive  impact on our community for years to come.\n\nOn behalf of the 17th Congressional District of Florida, I  congratulate Wyatt Dickinson for achieving the highest distinction in  Scouting, the rank of Eagle Scout. We thank Wyatt for his leadership…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…spay and neuter  information. Victoria dedicated 136 hours to her project, which will  have a lasting and positive impact on the community for years to come.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Victoria Morton  for achieving the highest distinction in Girl Scouts, the Gold Award.  We thank Victoria for her leadership…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690466/recognizing-victoria-morton-gold-award"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…of Pflugerville.\n\nIt is with great honor and respect that I present retired USA  Sergeant First Class Alyn Michael Macleod with a Congressional Veteran  Commendation from the 17th Congressional District of Texas. His  exemplary service to our Nation and continued contributions to his  community stand as an inspiration to us all.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…resource  box filled with toys and activities to support the well-being of  grieving children. Her efforts will have a lasting positive impact on  the community.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Dakota for achieving the highest distinction in Girl  Scouts, the Gold Award. We thank Dakota for her leadership and making…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…effects  of bullying, and creating a motivational mural to be displayed at her  school, which will have a positive impact on our community for years to  come.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Hannah for achieving the highest distinction in Girl  Scouts, the Gold Award. We thank Hannah for her leadership and making…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690867/recognizing-hannah-dickinson-gold-award"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…more than worthy of  this achievement.\n\nIt is with great honor and respect that I present William ``Bill''  Forest Harris with a Congressional Veteran Commendation from the 17th  Congressional District of Texas. His exemplary service to our Nation  and continued contribution to his community stand as an inspiration to  us all.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…many students who have made piloting their career.\n\nIt is with great honor and respect that I present Danny Charles Masur  with a Congressional Veteran Commendation from the 17th Congressional  District of Texas. His exemplary service to our Nation and continued  contributions to his community stand as an inspiration to us all.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…drive, collecting over 2,000 pairs  of socks, and establishing a permanent sock closet. Her efforts will  have a lasting positive impact on the community.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Reagan Graham for achieving the highest distinction  in Girl Scouts, the Gold Award. We thank Reagan for her leadership…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…about food  insecurity, and building a brand new food pantry to serve her  community, which will have a positive impact on our community for years  to come.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Harley Cross for achieving the highest distinction  in Girl Scouts, the Gold Award. We thank Harley for her leadership…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690443/recognizing-harley-cross-gold-award"}]