[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…office has gotten hundreds and hundreds of calls from constituents  who are worried about their Social Security benefits. My Social  Security telephone townhall had nearly 18,000 people. More than 2,000  folks responded to my survey about these problems. Why? People are  worried about their earned benefits,\n\nMr. Speaker, I will continue to stand strong…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690821/protecting-social-security-benefits"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…hospitals there--many of them not the same  party as mine--telling us what would happen if these devastating cuts  to Medicaid went through.\n\nOn Staten Island, we estimated 18,000 people would lose their jobs.  Tens of thousands would no longer get healthcare. It would cause a  recession on Staten Island--like that. Seniors at the centers--new  seniors…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…leadership, Parvin Ahmadi has made a  lasting impact at the state level. As President of the Association of  California School Administrators (ACSA), she represented more than  18,000 administrators serving six million students. She continues her  advocacy as Past President, mentoring new superintendents through  ACSA's professional development academies.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…about the gross domestic product shrinkage is evidence in  and of itself.\n\nIn Vermont, Trump's tariffs are estimated to cost Vermont households  more than $1 billion. More than 18,000 Vermonters work in industries  that are targeted by retaliatory tariffs, but virtually every Vermonter  is going to be impacted by increased costs--inflation--as a result of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…bank merger application that regulators denied  was denied in 2003, 22 years ago.\n\nMeanwhile, community banks have disappeared as the number of banks  declined from more than 18,000 in 1990 to fewer than 5,000 today.  Meanwhile, the biggest banks have grown much bigger through mergers  and, not surprisingly, are charging customers more for banking products…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Speaker, I don't know if you realize how many Social Security  recipients you have in your district, but there are over 170,000 of  them, including 134,000 retirees, including 18,000 disabled workers,  8,000 widows, 3,000 spouses, and 9,000 children.\n\nMadam Speaker, here is the most important thing. Most Members of  Congress don't realize this. Do you know…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…anyone before it  is too late. The bill would make everybody less safe.\n\nSupporters say it is needed so law enforcement can use these less- than-lethal weapons. Mr. Speaker, 18,000 law enforcement agencies are  already exempt from many of the provisions in this act and are already  using taser technologies. Everybody knows that police have access to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…impacting up to  22,000 people in my congressional district alone.\n\nTo illustrate what this means, a couple who are 60 years old in  Fresno earning $82,000 a year will pay $18,000 more per year for  coverage. A family of four in Tulare County earning $64,000 a year will  pay $2,500 more.\n\nThis is not fiscal responsibility. This is a Republican healthcare…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…welcoming 103 corps members to classrooms across our  islands. In total, the TFA network in Hawaii now has 631 corps members  and alumni, collectively improving the lives of over 18,000 students.\n\nI especially commend the program's focus on locally-rooted  leadership. TFA Hawaii has recruited 259 corps members and alumni who  are kama`aina, born and raised…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696215/congratulating-hawaii-teach-for-america-teachers"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…in the DMV region. Each year, the festival draws over 10,000  attendees and continues to showcase the community's culture. The  festival made history again in 2024 with over 18,000 guests in  attendance.\n\nI thank the Puerto Rican Alliance of Northern Virginia, and I wish  them a great event this year.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692244/recognizing-the-puerto-rican-alliance-of-northern-virginia"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…a single one--not even one single  no. With the regulators completely asleep at the switch since 1990, the  number of banks in the United States has declined from more than 18,000  to fewer than 5,000.\n\nThe biggest banks have been the beneficiaries of this consolidation  because they have grown even bigger. In the mid-1990s, the 20 biggest  banks in…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…serve my first term  this year, wildfires broke out across southern California, forcing  200,000 people to evacuate, burning over 57,000 acres of land, damaging  or destroying 18,000 homes, and taking the lives of 30 individuals.\n\nTwo weeks later, the Hughes fire erupted in my own district near  Castaic, right near where this picture behind me was taken.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689808/cuts-to-forest-service-endanger-millions"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…people collecting Social  Security benefits and a reduced staff.\n\nTo put this in perspective, in 2010, not that long ago, the size of  the Social Security workforce was 68,000, 18,000 more than what the  Trump administration is targeting for today, and the number of  beneficiaries in 2010 was 54 million Americans as opposed to 73 million  Americans today.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of devotion while his family, my  grandparents and parents, were incarcerated in camps simply because  they were Japanese Americans.\n\nUncle Mon's story is just one of nearly 18,000 Japanese-American  soldiers who embodied the motto Go for Broke. They risked everything  for a country that had denied them so much because they believed in the  promise of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690036/protecting-the-promise-of-america"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…go.\n\nYou don't have to imagine instability in Venezuela. In 2017, we had  protests on the ground. Back in the early 2000s, the then-government  had to fire or ended up firing 18,000 people in the oil industry  because there was a general strike. We have no idea and, certainly,  this President has no idea where this is going to go. He had no plan  going…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…lethal force.\n\nAlthough the regime has shut down nearly all communications, we are  seeing reports estimating that over 12,000 innocent civilians have been  killed. More than 18,000 individuals have been arrested. This level of  violence against Iran's own people is indefensible.\n\nI commend President Trump for imposing economic pressure on those who  continue…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Red Team Leader for the Commanding  General. Additionally in 2017, he served as the Joint Task Force  Commanding General for Hurricane Harvey military response, commanding  18,000 troops supporting evacuation and aid operations.\n\nFrom 2018 to 2021, MG Hamilton served as the Commanding General of  the 36th Infantry Division, where he commanded soldiers…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689353/saluting-the-service-of-major-general-patrick-hamilton"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…everything in our capacity to  support them and their families.\n\nCurrently, each Medal of Honor recipient receives a special pension  that totals roughly $1,500 per month, or $18,000 annually. The last  update to the special pension for Medal of Honor recipients was back in  2002, when Congress passed the Medal of Honor pension act.\n\nThis legislation increased…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…place in the aftermath of the devastating Los  Angeles fires.\n\nWhat we have learned has happened is absolutely beyond belief. In the  aftermath of these fires, which destroyed 18,000 homes and tragically  killed 30 people, there was a FireAid concert in which a number of  high-profile musicians generously agreed to perform and people  responded in an amazing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694134/investigation-into-the-fireaid-concert-in-los-angeles"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…exercised one time in the history of the  alliance to come to the aid of the United States and the War on Terror  in Afghanistan.\n\nSince their first mission began, more than 18,000 Danish soldiers  have deployed to Afghanistan with American and British forces.  Throughout their deployments in Afghanistan, 43 of their soldiers lost  their lives fighting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…California  (Mr. McClintock), the lead sponsor of this bill.\n\nMr. STAUBER. Mr. Speaker, I will close by saying that 2 weeks ago, in  the One Big Beautiful Bill, there were 18,000 law enforcement officers  that were to be hired. Not one of my colleagues on the other side of  the aisle voted for it.\n\nMr. Speaker, ahead of our Nation's 250th anniversary…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}]