[{"senator": "Al Green", "party": "Democrat", "sentence": "The Systemic Risk Authority Transparency Act would continue this  practice, requiring that for any use of a systemic risk exception, the  Government Accountability Office would have to produce the same post- failure report within 60 days of invocation of a systemic risk  exception and a more comprehensive report in 180 days."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Trump, Elon Musk, and House Republicans are asking us to support  axing Medicaid by $180 billion, even though food stamps reduce rural  poverty."}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "We won't be restoring food assistance today for the millions of  Americans who benefit from SNAP because House Republicans voted to cut  the number one program that keeps kids and seniors out of poverty by  over $180 billion."}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "It is a complete  180-degree shift."}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "In my congressional district, there are 180,678 people on Medicaid."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "(2) Treatment of certain breaks in presence.--\n\n(A) In general.--Except as provided in subparagraphs (B)       and (C), an alien shall be considered to have failed to       maintain continuous physical presence in the United States       under subsection (b)(1)(A) if the alien has departed from the       United States for any period exceeding 90 days or for any       periods, in the aggregate, exceeding 180 days."}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "180, YEA on  Roll Call No."}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Speaker, I represent more than 180,000 people in  western Pennsylvania who receive Social Security benefits."}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "IIJA required the Assistant Secretary to issue a NOFO for       the BEAD Program within 180 days of IIJA's enactment."}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "In fact, some 180 million people--over  68,000 communities, large and small--rely on forested lands to capture  and filter drinking water."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "The Fulton County Fair welcomed a record 180,000 visitors over the  opening weekend."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "This proposal gives the top 0.1 percent of income earners  a new tax break worth an average of $180,000."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Garamendi) to restrict  funding to create a new land-based nuclear delivery system, the  Sentinel missile, a $180 billion boondoggle he has called an endless  money pit."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "As just  one example of their work, WRTP BIG STEP recently welcomed 180 high  school students to their Milwaukee Summer Trades Academy, introducing  them to careers in construction and teaching them about skilled trade  jobs and apprenticeship pathways, so they could consider a future  career in the skilled trades."}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "180, S."}, {"senator": "James Risch", "party": "Republican", "sentence": "25-57,       concerning the Air Force's proposed Letter(s) of Offer and       Acceptance to the Government of Ukraine for defense articles       and services estimated to cost $180 million."}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "``(2) Commission rulemaking.--Not later than 180 days after       the date of enactment of this subsection, the Commission       shall initiate a rulemaking proceeding to establish a vetting       process for applicants for, and other recipients of, a new       covered funding award."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "(b) Effective Date.--The amendments made by subsection (a)       shall take effect on the date that is 180 days after the date       of the enactment of this Act."}, {"senator": "French Hill", "party": "Republican", "sentence": "10222(e))       is amended to read as follows:\n\n``(e) Assessment and Report on Sanctions With Respect to       Burmese Persons.--\n\n``(1) In general.--Not later than 180 days after the date       of the enactment of this Act, and annually thereafter for 7       years, the President shall determine whether the following       persons meet the criteria for sanctions described under       subsection (a) or under Executive Order 14014 (86 Fed."}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "(b) Report.--Not later than 180 days after the enactment of       this Act, the Director shall submit a report on the results       of the review under subsection (a) to--\n\n(1) the Committee on Oversight and Government Reform of the       House of Representatives; and\n\n(2) the Committee on Homeland Security and Governmental       Affairs of the Senate."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "(b) Conveyance Required.--Subject to this section, if the       County submits to the Secretary a written request for       conveyance of the property described in subsection (c)(1) not       later than 180 days after the date of enactment of this Act,       the Secretary shall convey to the County all right, title,       and interest of the United States in and to the property       described in subsection (c)(1)."}, {"senator": "Brian Babin", "party": "Republican", "sentence": "(2) Report on evaluations.--Not later than 180 days after       the completion of the evaluation under paragraph (1), the       Director shall submit to Congress and make widely available       to the public a report that includes the following:\n\n(A) The results of the evaluation."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "355c(d)) that occur on or after the date that is 180 days       after the date of enactment of this Act."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "(d) Procedures.--Not later than 180 days after the date of       the enactment of this Act, the Secretary of the Treasury (or       such Secretary's delegate) shall provide for procedures by       which a taxpayer may request an abatement referred to in       section 6213(b)(1)(B)(i)(V) of the Internal Revenue Code of       1986 in writing, electronically, by telephone, or in person."}, {"senator": "Roger Williams", "party": "Republican", "sentence": "(a) In General.--Not later than 180 days after the date of       the enactment of this Act, the Administrator of the Small       Business Administration shall issue rules as follows:\n\n(1) Requiring disclosure of information about a covered       solicitation that was issued and cancelled that includes the       following:\n\n(A) A justification for the cancellation of such covered       solicitation."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Customs and Border Protection not later than 180 days after       the date of the enactment of this Act that contains       sufficient information to enable such Commissioner--\n\n(1) to locate the entry; or\n\n(2) to reconstruct the entry if it cannot be located."}]