[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…you are a duck hunter on the river or a birder exploring the  coastal marshes or a family counting on clean water and flood  protection, wetlands deliver for everyone.\n\nSince 1937, the Pittman-Robertson Act has created successful  conservation models where hunters and sportsmen support wildlife  restoration through excise taxes on firearms, ammunition,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693494/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise today to commemorate the 10th  anniversary of Educators Rising.\n\nEstablished in 1937, Educators Rising, formally known as the Future  Teachers of America, serves as a nationwide movement dedicated to  eliminating the teacher shortage in America by recruiting,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688484/recognizing-the-10th-anniversary-of-educators-rising"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…certain firearms.\n\nCongress enacted the NFA pursuant to its taxing power under Article  I, Section 8 of the Constitution. The Supreme Court, in Sonzinsky v.  United States, 1937, upheld the constitutionality of the NFA's  registration and transfer provisions as ``supportable as in aid'' of  Congress' proper exercise of the taxing power. Furthermore,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…basketball, golf, soccer, and  softball, instilling excellence and pride across generations of  Panthers.\n\nPoint University was originally founded as Atlanta Christian College  in 1937, and its mission is to educate and equip students for Christ- centered service and leadership throughout the world.\n\nFor three consecutive years, Point has been recognized as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694895/recognizing-lagrange-college-panthers-and-the-point-university-skyhawks"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…this dramatic  tariff, which most historians and most economists now say prolonged the  Depression for 10 years and caused the worst part of the Depression to  actually be in 1937--7 years after the tariff and nearly 8 years after  the stock market crash.\n\nDo you know what happened to the Republicans in 1932? The Democrats  won the Presidency, and they…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Code of Federal Regulations, as       in effect on January 1, 2025:\n\n(i) Tenant-based rental assistance, as defined in section       8(o) of the United States Housing Act of 1937 (42 U.S.C.       1437f(o)).\n\n(ii) Supportive services, including health care, housing       services, permanent housing placement, day care, nutritional       services, short-term…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…historical significance of  the site and pushed for its preservation. The State of Wyoming bought  the land from local residents and donated it back to the Federal  Government in 1937.\n\nToday, it is recognized as the Fort Laramie National Historic Site.  National Park Service employees and volunteers keep the site open year- round for visitors. Through displays…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in Wisconsin in June mean? It means National  Dairy Month.\n\nI was at breakfast on the farm in Manitowoc County. I will tell you  that June has been National Dairy Month since 1937. When I think of  June, I think of cream cheese. I think of cottage cheese. I think of  yogurt. I think of raw milk. I think of pasteurized milk. I think of  Colby cheese, cheddar…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692161/june-is-national-dairy-month"}]