[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, diethylstilbestrol, or DES, is a drug that  was prescribed to pregnant women  between 1940 and 1971 to prevent miscarriage.\n\nAs early as 1953, there was evidence it didn't work. Nevertheless, it  was prescribed for decades because the FDA waited years to alert  doctors…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693582/no-apology-from-food-and-drug-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…officer to earn the rank of lieutenant general, Gregg       didn't just climb the ranks, he fundamentally redefined what       was possible.\n\nIn the unforgiving landscape of 1940's America, Gregg's       early military career could have been defined by the       limitations others sought to impose. During the Vietnam War,       his innovative supply…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…family that fled Poland in the late 1920s because       of antisemitism. Little could they imagine what was to happen       a decade later.\n\nGermany invaded Western Europe in May 1940. France fell a       month after, and Nazi occupation began immediately. Jews were       ordered to register with the police, who became close       collaborators with the occupiers.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…right through their neighborhood, cutting them       off from their businesses and jobs, leading to unemployment       and poverty.\n\nAdams-Early also faced sexism because in 1940 many people       hated the idea of a woman achieving more than them (and still       do). Women didn't even have the right to maintain a fixed       status in the military.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…this year.\n\nDuring World War II, over 18 million women stepped forward to serve  on the home front, raising the number of women in the workforce to  nearly 40 percent between 1940 and 1945.\n\nThese women served in so many capacities: pilots, mechanics,  electricians, engineers, coders, and countless other roles. Many of  them served in my district at Naval…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…All-Holiness Ecumenical Patriarch Bartholomew to our Nation's Capital  and to recognize him for his acceptance of the distinguished Templeton  Prize.\n\nBorn Demetrios Arhondonis in 1940, His All-Holiness Bartholomew  completed his undergraduate studies at the historic Theological School  of Halki. He would also pursue graduate degrees in Italy, Switzerland,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…to  resolve the AFFE issue with BDCs being removed from indices by  eliminating the double counting of fees and, consistent with this  intent, it is expected that comparable 1940 Act funds--such as interval  and tender-offer funds--would also receive identical AFFE treatment.\n\nThe Access to Small Business Investor Capital Act passed the  Financial Services…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…DOGGETT. Mr. Speaker, today, I rise to recognize Archbishop of  Constantinople-New Rome and Ecumenical Patriarch, His All-Holiness  Bartholomew.\n\nBorn Demetrios Arhondonis in 1940 on the island of Imvros (today,  Gokceada, Turkey), His All-Holiness Bartholomew was elected in October  1991 as the 270th Archbishop of the 2000-year-old Church founded by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…and New York is  yet another demonstration of his commitment to peace, his see, and the  millions of Orthodox Christians in the United States.\n\nBorn Demetrios Arhondonis in 1940 on the island of Imvros (today,  Gokceada, Turkey), His All-Holiness Bartholomew was elected in October  1991 as the 270th Archbishop of the 2000-year-old Church founded by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…steadfast in his  mission, bearing witness not only to the strength of faith but also to  the power of compassion.\n\nHis All-Holiness Bartholomew, born Demetrios Arhondonis in 1940 on  the island of Imvros was elected in October 1991 as the 270th  Archbishop of the 2000-year-old Church founded by the Apostle Andrew.  He holds the historic title of Archbishop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…and loved her, was born in Edgeworth, Pennsylvania, on April 5, 1923.\n\nShe moved to nearby Sewickley, Pennsylvania, in 1939, where she spent  the rest of her life. She was a 1940 graduate of Sewickley High School,  and shortly after graduation, she married and had two daughters who she  raised and nurtured.\n\nMany years later, in 1988, she retired from…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Draper Brown. Her family went on to live in Kansas City, Kansas, and  after her parents passed Edith moved to the south side of Chicago,  Illinois, to live with her aunt. In 1940, Edith met her husband, the  late William Henry Coleman, and relocated to Gary's Midtown  neighborhood.\n\nEdith is an accomplished scholar, having earned both a Bachelor of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…registration of the sponsor as a       broker or a dealer under the Securities Exchange Act of 1934,       or as an investment advisor under the Investment Advisers Act       of 1940; and\n\n(5) where no specific information regarding an offering of       securities by the issuer is communicated or distributed by or       on behalf of the issuer, other than--…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…freedom, interfaith  dialogue, and peacebuilding, making him the longest-serving Archbishop  of Constantinople in the history of Christianity.\n\nBorn Demetrios Arhondonis in 1940 on an island in Turkey, His All- Holiness Ecumenical Patriarch Bartholomew pursued theological studies  in Rome, Switzerland, Germany, and Greece before joining leadership…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Disclosure.\n\n(3) Business development company.--The term ``business       development company'' has the meaning given the term in       section 2(a) of the Investment Company Act of 1940 (15 U.S.C.       80a-2(a)).\n\n(4) Fee table disclosure.--The term ``Fee Table       Disclosure'' means the fee table described in Item 3 of Form       N-1A, Item 3 of Form N-2,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 4431) to amend the Investment Company Act of 1940 with  respect to the definition of qualifying venture capital funds, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…these deportees.\n\nThe reason the Soviets did this is pretty simple: They wanted to  crush civil society in newly occupied areas because they took over the  Baltic countries in 1940.\n\nThe ultimate goal was to eliminate Estonian, Latvian, and Lithuanian  national identity entirely, replacing it with, of course, a Soviet- Russian identity. The Soviets did…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689062/russia"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…dairy business in Martinsburg, Pennsylvania,  that has been a cornerstone of the dairy industry in Blair County for  85 years.\n\nRitchey's Dairy was founded by Oliver Ritchey in 1940 just outside of  Martinsburg in Blair County. With the help of his son, Paul, and his  grandson, Reid, Oliver expanded operations and delivery routes  throughout the ensuing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…and had the honor of serving as its  commander from 2011 to 2012.\n\nThe 55th Wing traces its lineage back to the 55th Pursuit Group which  was first constituted in November of 1940 and later activated at  Hamilton Field, California, in January of 1941. The 55th deployed to  England in 1943 flying P-38 Lightning and P-51 Mustang fighter aircraft  as part…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…to  revise the definition of a qualifying investment, for purposes of the  exemption from registration for venture capital fund advisers under the  Investment Advisers Act of 1940, to include an equity security issued  by a qualifying portfolio company and to include an investment in  another venture capital fund, and for other purposes, as amended.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}]