[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…of Terrell County,  Georgia. A funeral service to celebrate his remarkable and purposeful  life was held on Saturday, February 7, 2026, in Dawson, Georgia. Born  August 17, 1946, in Dawson, Georgia, John Bowens grew from humble  beginnings into a leader whose steady hands and steady heart guided a  community for more than three decades.\n\nI have had…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…addiction. When he had to make  a home visit, he often would venture to Skid Row and see the plight of  those living there. These experiences drove him to move to Skid Row in  1946 to help people beat their addiction. Almost every night, Father  Mac would walk up and down the streets of Skid Row looking for someone  to offer encouragement.\n\nThat was something…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…for her outstanding contributions to education and  community leadership.\n\nJoAnne's lifelong commitment to educational equity was shaped early  in life. Born on February 11, 1946, she attended a segregated two-room  Catholic school--an experience that profoundly influenced her  dedication to ensuring that low-income children, children of color, and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Trump has repeatedly questioned this right, threatening to  unravel one of the most fundamental principles of American democracy:  that all who are born here belong here.\n\nIn 1946, Mother Cabrini was canonized as a saint by Pope Pius XII,  becoming the first American to be beatified by the Catholic Church. She  is now recognized as the patron saint of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…legislation in the 119th Congress.                                  ______\n\nBy Mr. DURBIN (for himself and Mr. Grassley):\n\nS. 835. A bill to amend the Agricultural Marketing Act of 1946 to  establish a voluntary program to reduce food loss and waste, and for  other purposes; to the Committee on Agriculture, Nutrition, and  Forestry.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Republic of Kazakhstan inherited the world's fourth-largest  nuclear arsenal, which was also home of the Semipalatinsk nuclear test  site. From Semipalatinsk's establishment in 1946 to its decommission in  1995, Soviet authorities carried out 468 nuclear tests at the test  site. The total impact of these tests between 1949 and 1963 was 2,500  times more…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Honoring the Life of Lynne Trotter Wagstaff\n\nMr. LATIMER. Mr. Speaker, every now and then, there are people born  who personify the essence of love in action. On November 2, 1946, Lynne  Louise Trotter, later Lynne Louise Trotter Wagstaff, was born in  Harlem, New York. She was one of those people.\n\nLynne attended St. Catherine of Siena and graduated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…she has led.\n\nOn September 16, 1925, Recardina DePalma was born to Dominick and  Michelina DePalma in Port Reading, New Jersey where Dina resided for 21  years. On October 27, 1946, she married the love of her life Angelo  Boccippio and in 1953, they purchased their forever home in Woodbridge,  New Jersey. Her loved ones refer to her as a pleasure to be…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694728/recognizing-recardina-dina-boccippios-100th-birthday"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…strikes, and the historic Typhoon Louise while stationed in  Okinawa. His dedication and bravery reflect the very best of our  Greatest Generation.\n\nAfter returning home in 1946, Paul built a new life while continuing  to serve. He was later recalled to Active Duty during the Korean war,  where he was stationed in the Marshall Islands as part of a Seabee…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…seq.), the       Mineral Leasing Act for Acquired Lands of 1947 (30 U.S.C. 351       et seq., as amended), Section 402 of the President's       Reorganization Plan No. 3 of 1946, 16 U.S.C. 520, and 16       U.S.C. 508b, in order to protect and preserve the fragile and       vital social and natural resources, ecological integrity, and       wilderness…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…subsection (b)(1)(A), by striking ``other services''       and inserting ``other services (excluding grading services       performed under the Agricultural Marketing Act of 1946)''.       SEC. 11. ADVISORY COMMITTEE.\n\nSection 21 of the United States Grain Standards Act (7       U.S.C. 87j) is amended--\n\n(1) in subsection (a), by adding at the end the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the  USS Ault, part of the Seahorse Squadron, in preparation for the  invasion of Japan.\n\nAfter the war ended, Edward remained on duty during the occupation  until January of 1946. During his service, he traveled the world from  Australia to Africa to Japan and back home through the Panama Canal.\n\nHe was honorably discharged with the rank of Seaman 1st…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…World War II, the 55th Pursuit Group  earned two Distinguished Unit Citations, produced 16 fighter aces, and  was credited with 90 air-to-air victories.\n\nAfter World War II, in 1946, the group was deactivated, only to be  reactivated less than a year later as the 55th Reconnaissance Group  under the Strategic Air Command. By 1950, it would be designated…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Ralph has dedicated himself to faithfully serving our community and  country.\n\nRalph is a veteran of the Second World War and served with the United  States Army from 1943 to 1946. He participated in the South Pacific  campaign, and after being honorably discharged, he joined the Army  Reserves in 1948 where he remained until 1985. For his distinguished…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…veterans from Farmington who served in World War II.\n\nMr. Wade's military service in the U.S. Navy became a cornerstone of  his life. He enlisted at the age of 17 on August 6, 1946, and received  an honorable discharge on April 29, 1948. He served in the South  Pacific on the USS Whiteside. He earned the China Service Medal, the  World War II Victory Medal…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Tribal leader, a decorated  Navy veteran, and a beloved husband, father, and grandfather, who  passed away on the morning of June 1, 2025, at the age of 78.\n\nBorn on December 24, 1946, in Oneida, Wisconsin, to Leslie and Eva  Schuyler Danforth, Jerry devoted his life to service--first to his  country, and then to his people. He served honorably in the United…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…administration, there was a land swap that was  proposed. This was back in 1910. It was rejected by Denmark. And then,  apparently, there was actually a formal offer made back in 1946, at the  outset of the Cold War, in the Truman administration, where there was  actually an outright offer--$100 million, as I understand it, in gold-- to buy Denmark. That…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Nurse  Corps at Naval Air Station Memphis, Tennessee, where she ministered to  service members during the final months of World War II. She was  honorably discharged in January 1946 after devoting service to her  country.\n\nIn the closing days of her service, she met Ardell O. Kennedy at the  Memphis Naval Air Station. They married in January 1946 and began…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…(11) Following World War II, Second Lieutenant Lomell was       appointed as the First Director of the newly organized Ocean       County Veteran's Service Bureau, serving from 1946 until       1948, before he attended law school on the G.I. Bill.\n\n(12) Leonard Lomell and his wife, Charlotte Ewart Lomell,       settled their growing family in Toms River,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}]