[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…I remember what it was like to  breathe the air in Los Angeles in the 1980s. I have seen images of what  the air was like in Los Angeles in the 1970s and the 1960s and the  1950s. We are a basin. And with  all of that automobile traffic and all of that congestion and our  geography and topography, it means that exhaust gets trapped, that smog  gets…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…occur in the Pacific, where Taiwan is  threatened by the People's Republic of China.\n\nChina has a recent history of seizing territory. Look at the invasion  of Tibet in the 1950s. They have suppressed democracy in Hong Kong.  When the Chinese President speaks of reunification of Taiwan, we should  believe that he will attempt it. We cannot allow that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…decades, the Nevada Test Site, which is located just 100  miles north of Las Vegas, hosted over 900 nuclear  tests, more than any other place in the country. Throughout the 1950s,  visible mushroom clouds often rose over the desert and could be seen in  the distance by people who came to enjoy all Las Vegas had to offer.\n\nThese tests were conducted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…more than 25 percent, to decimate  the Office of Oceanic and Atmospheric Research would, as the former  director of that office said, take our scientific footing back to the  1950s. Their mission is to develop the best possible science to save  lives and property in a changing climate. To cut it is not fiscally  conservative, it is strategically catastrophic.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…has happened before, will  rightfully rethink who they elect so that we can preserve our economy  and our democracy.\n\nI will close, Mr. Speaker, with a little story from the 1950s. I  graduated high school in 1957. As I was about to graduate, one of my  teachers assigned me an essay to write. The essay was simply to share  what I wanted to do after graduation,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…gospel, and Latin rock artists like Carlos  Santana, Pat Boone, Johnny Mathis, Gladys Knight, Nat King Cole, and  Mahalia Jackson.\n\nHere is its history. It was written back in the 1950s for a group of  teenagers from different religions and racial and economic backgrounds.  They were brought together in California at a workshop designed to  create friendship…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…children. Like  his father and his grandfather, my dad became an educator himself,  ultimately teaching the next generation of educators at Virginia State  University.\n\nIn the 1950s, my mother had to move away from her hometown because  the State of Mississippi did not provide a good education for Black  children. The only school that did was run by the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Schools, overseeing Head Start and Adult  Education Programs.\n\nIn addition to his contributions to education, Cliff was a gifted  radio broadcaster. His journey began in the late 1950s as the host of a  Sunday morning gospel show on WCLE. In 1964, he joined WOKS radio  station, where he launched his sports announcing career, becoming a  trusted voice in the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the occasion of  its 70th anniversary. For seven decades, Bethel Temple has been a  steadfast pillar of faith, service, and fellowship in the Hampton  community.\n\nIn the early 1950s, Reverend Beverly W. Fox, then pastor of Phoebus  Assembly of God, led efforts to build a new house of worship. With the  support of the community, a modest sanctuary was completed…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…fight the chaos, we will  fight for community. We can't do it alone.\n\nJust like the civil rights movement during Reconstruction and just  like the civil rights movement in the 1950s and 1960s, it required  people coming together from all walks of life putting aside hatred and  division and loving their neighbor and their enemy. We can do that. We  need…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…testing their nuclear delivery systems, the danger grows for everyone,  including many Oregonians.\n\nIn southern Oregon, the Federal Government rushed to mine uranium in  the 1950s to fuel the Cold War. Two open-pit mines outside Lakeview in  the Fremont National Forest supplied the material that went to the  Hanford site to produce plutonium for nuclear…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…the Nevada Test Site, which is located just 100  miles north of Las Vegas, hosted over 900 nuclear tests--more than any  other location in the United States. Throughout the 1950s, visible  mushroom clouds often loomed in the distance as people enjoyed all that  Las Vegas had to offer. These tests were conducted to better understand  the power and effects…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…but too many still face obstacles to economic  opportunity, gender equality, and their fundamental freedoms.\n\nThis funding has been a core pillar of U.S. assistance since the  1950s, and it is lifesaving. Estimates suggest that each year, it  prevents 17.1 million unintended pregnancies and saves the lives of  34,000 women and girls who otherwise would…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…grandfather, my dad became an educator  himself, ultimately teaching the next generation of educators at  Virginia State University, which I now represent in Congress.\n\nIn the 1950s, my mother moved away from her hometown because the  State of Mississippi did not provide a good education to Black  children. The only school that did was run by the Catholic…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…these invasive species will be ``eely'' bad for our  native fish and plant populations.\n\nMr. Speaker, 61 native fish species are currently threatened or  endangered. In the 1950s, the United States and Canada established the  Great Lakes Fishery Commission to shore up our shared fisheries.  Decades of overfishing, invasive species, and human impact…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…District, a trusted steward of environmental protection and sustainable  water management in the Tahoe community.\n\nThe South Tahoe Public Utility District was formed in the 1950s to  protect the ecosystem of the Lake Tahoe Basin while furnishing  customers with reliable water and wastewater treatment services. Since  then, they have grown into a nationally…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to  stay together with their children.\n\nThis began in the 1960s under Lyndon Johnson, who I felt, before Joe  Biden, was the worst President in this country's history. In the 1950s,  we only had about 4 percent of American children born without a mother  and father at home. We now have over 40 percent who are born without a  mother and father at home.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…for generations and, in  some case, almost 100 years.\n\nThis overreach hurts family ranchers and contributes to a shrinking  U.S. cattle herd, now at its lowest level since the 1950s, driving beef  prices up more than 14 percent in the last year. By opening more land  and cutting red tape, this amendment empowers ranchers to expand  grazing, manage habitat,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…TANF  check, and the Pell grants, you can easily wind up in a situation in  which you are penalized $25,000 a year if you get married.\n\nThis is the primary reason why, in the 1950s, we only had about 4  percent of the newborn children in this country  born without a mother and father at home, and now, we are over 40  percent.\n\nIt is not difficult if people…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698433/republicans-have-delivered-in-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…they would lose some of these 90 benefits.\n\nMr. Speaker, a question is: Is this a penalty for getting married? It  has had a huge impact on society. I point out that in the 1950s, 4  percent of the children in this country were born out of wedlock. That  number is now over 40 percent. America has fundamentally changed  because of these programs.\n\nThe…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…family  passed the torch to MMI Hospitality Group, ensuring the resort's  continued excellence.\n\nAnother key figure in the town's development was C.V. Griffin, Sr.,  who, in the 1950s, promoted ``Land Cruises'' to draw attention to the  town's beauty and opportunity. He donated land for the town hall,  established Griffin Airways, and was instrumental in…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…He also received a Bronze Star and  the French Legion of Honor, as well as several other medals.\n\nAfter completing his military service, he started O.H. Mullen Sales  in the 1950s and owned and operated the business until the mid-1980s.  His company manufactured, sold, and distributed archery equipment. He  married Luella Conley on October 24, 1942,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…facility for the United States Marine Corps, and the Naval Air  Weapons Station China Lake was established for research, testing, and  evaluation of military weapons.\n\nIn the 1950s, NASA Armstrong Flight Research Center was the location  where many of the technologies for Project Apollo were tested,  including where the lunar landing research vehicle…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "French Hill", "party": "Republican", "sentence": "…ends in poverty, death, and despair.\n\nMr. Speaker, look at Cuba, where the warmth of communism has left  people with no rights, no freedom, and driving cars from the 1940s and  1950s; or Xinjiang, China, where the Uyghurs are imprisoned and  enslaved to labor; or certainly no modest case, the Korean Peninsula,  North Korea, where people are in darkness…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…strong and self-reliant.\n\nBeginning in the 1960s, in this country, we had a massive increase in  subsidies, which ignored a family with a mother and father at home.\n\nIn the 1950s, about 4 percent of the children born in this country  were born without a mother and a father at home. Within the next 30  years, after Lyndon Johnson and the Great Society,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Paula DelGrosso\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to celebrate the  90th birthday of Sister Paula DelGrosso.\n\nSister Paula's religious vocation began in the 1950s. After spending  more than 30 years in education, she heard a different calling, a  calling to serve her community in another way. She worked to establish  the St. Vincent…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…was gone,  shipping hundreds of jobs from rural mid-Missouri to China. The last  one to go, in the town of Macon--near where I went to school--had been  in operation since the 1950s. All that remained was a toxic waste  cleanup site for the 5,500 people in the town it left behind. Although  Toastmaster continued production in certain areas of the United…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are not going to get married. We are just  going to stop working now because of that.\n\nOf course, what happened is over time Americans' behavior changed. We  went from in the 1950s, before Lyndon Johnson was President, and in  which about 4 percent of the children were born without a mother and  father at home, to a steady increase for about 30 years…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]