[{"senator": "Norma Torres", "party": "Democrat", "sentence": "…birthday of Dr. Huu Vo and his 50 years of service to the Inland  Empire, our Nation, and beyond.\n\nDr. Vo has led a life of service to his community. He was born on  April 4, 1950, in Hue, Vietnam, and in 1968, he graduated valedictorian  from Hue National High School. Following his graduation, he attended  medical  school in Saigon. While in medical…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…military service and active support for the Puget Sound military  community through Brown Bear Car Wash.\n\nVictor valiantly served in the United States Marine Corps until the  mid-1950's, and his dedication to service continued long after his  active military duty. Upon graduating from Lakeside High School, Victor  entered the University of Washington's NROTC…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697600/recognizing-victor-odermat"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…commemorating the 100 years of the fossil  fuel industry.\n\nThis chart is of the famous Keeling Curve, which shows the dramatic  acceleration in CO2 in the atmosphere beginning around 1950.  You can see it start up in 1850, but it really kicked off after 1950.\n\nThis data, actually, from back here comes from scientists who collect  core samples in glaciers, date…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…renewed by the administration quickly and in good faith.\n\nThe New START treaty reduced the number of nuclear warheads in the  United States and Russia to the lowest level since 1950. This is not  the time to start going in the other direction.\n\nNuclear risks continue to rise, and when we see countries like Russia  testing their nuclear delivery systems,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to recognize the Deal First  Aid Squad as they celebrate their 75th Anniversary this year.\n\nIn 1950, residents of the Borough of Deal, New Jersey founded the  Deal First Aid Squad to provide emergency medical services day  and night. For 75 years, this organization has operated…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…colleagues and I introduced a resolution commemorating the  75th anniversary of the National Science Foundation. We should be  enormously proud to support the work of the NSF.\n\nSince 1950, the National Science Foundation has helped the U.S. lead  the world in science. It supported the research and key investments  that helped catalyze the internet, advanced technology…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the 75th  anniversary of Sayers Jewelers in Smyrna, Delaware, in August. Sayers  is a small, multigenerational business that has been operating in the  town of Smyrna since 1950.\n\nSayers has been supporting their neighbors throughout Kent County  year in and year out, consistently standing alongside their community  and demonstrating that successful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to  warfare. Today, the former Burma Road that he helped build is a major  corridor for China's Belt and Road Initiative. Pay attention, folks, to  oil.\n\nIn the Korean war, 1950 to 1953, we lost 36,000 U.S. troops, 36,000  U.S. war dead. It was the second most deadly war of the Cold War, which  was undeclared by a gutless Congress involved in the North…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…City and furthered  his education at Alabama A&M University in Huntsville, Alabama.  Following his studies, Cliff served our country honorably in the United  States Army from 1950 to 1953 during the Korean Conflict.\n\nIt has been said that ``Education is the passport to the future; it  belongs to those who prepare for it today.'' Cliff dedicated a  significant…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…the opportunity to  learn, grow, and succeed. I rise today to congratulate the Cherry Creek  School District on celebrating this important milestone.\n\nCherry Creek opened in 1950 with eight schools and grew to double  their enrollment by the 1970's. Today, the district serves 53,000  students over 67 K-12 schools across the Denver Metro Area. The  district's…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697488/recognizing-cherry-creek-school-districts-75th-anniversary"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…community  sparked growth, soon reaching 23 members. As the neighborhood around  them evolved, so did the church, embracing change and relocating to a  new home on West McNichols in 1950. By May 27, 1951, Trinity Church  broke ground on their new fellowship hall, proudly serving a growing  congregation of 210 strong.\n\nWhile expanding their congregation and educational…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…County.\n\nChristine Hebard-Summers, who began working for the family business  at an early age, is the third-generation owner. Her grandfather, Roy,  started the business back in 1950. Roy would take Christine to the  office back when she was in kindergarten. At the time, she would help  around the office in exchange for a toy and some candy at the Main Drug…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…made education a priority, ensuring each  child completed college and pursued careers in nursing, teaching, and  law.\n\nThe Kennedys made Poplar Bluff their permanent home in 1950. For two  decades Kathy raised her children while serving as a devoted wife and  mother and as an active leader in her church and community. She was a  charter member of Fellowship…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 1713) to amend the Defense Production Act of 1950 to include  the Secretary of Agriculture as a member of the Committee on Foreign  Investment in the United States, and for other purposes, as amended.\n\nThe Clerk read the title…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 75th anniversary of St. Mary's Rotary Club, a cornerstone of  service in our community since 1950.\n\nFor 75 years, the St. Mary's Rotary Club has exemplified the Rotary  motto  of Service Above Self through countless projects supporting local  schools, awarding scholarships,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "Ms. SALAZAR. Mr. Speaker, Nicklaus Children's Hospital, formerly  known as Miami Children's Hospital until 2015, was founded in 1950 and  is South Florida's only free-standing pediatric hospital. Staffed by  850 physicians and more than 500 pediatric subspecialists, Nicklaus is  home to the largest pediatric…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…recognize the  75th anniversary of the DeGol Organization, which is headquartered in  Altoona, Pennsylvania.\n\nThe origins of the family-owned and -operated enterprise date to 1950  when  Bruno and Lena DeGol produced a masonry plant in Cambria County.\n\nToday, the DeGol Organization includes Seven D Wholesale, DeGol  Carpet, Seven D Windows and Door, Hollidaysburg…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…recognize the 75th  anniversary of a true icon of American railroad history, the Norfolk  and Western class J No. 611 steam locomotive.\n\nBuilt right in Roanoke, Virginia, in May of 1950, this bullet-nosed,  coal-fired marvel remains a shining example of American innovation and  craftsmanship. Spanning 110 feet and weighing 872,000 pounds, the 611  generated…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Julia Letlow", "party": "Republican", "sentence": "…supermarkets, supporting small businesses, sustaining local jobs, and  fostering economic growth across Louisiana, Mississippi, and Texas.\n\nAssociated Grocers was founded in 1950 by a group of visionary  independent grocers who understood the power of collaboration in a  competitive marketplace. Over the decades, this cooperative has grown  to serve…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691354/congratulating-associated-grocers-inc-of-baton-rouge-on-their-75th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…that reflects  decades of spiritual dedication and charitable impact. It is my honor  to commend the parish on this remarkable achievement.\n\nSince its founding on November 3, 1950, Assumption BVM has dedicated  themselves to ministry and outreach. By offering a welcoming place for  worship to the residents of Feasterville, Langhorne, Oakford, and  Trevose,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…celebrates its 75th anniversary, a  proud milestone for an institution dedicated to cultivating excellence  through student engagement.\n\nJames Wood High School, established in 1950 and led by Principal Paul  Beable, became the sole high school serving Frederick County. Prior to  its opening, the county supported five smaller high schools located in  the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania, as they celebrate 75 years of service.\n\nThe methods that Blair County residents use to access information  have changed since the library system was established in 1950. However,  the mission of the library system remains the same: to provide  materials and information services for lifelong learning, enrichment,  and reading.\n\nIt has often…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…the 1920s, Turner Joel Jones acquired the Talladega Insurance Company  renaming it Talladega Insurance Agency and his brother, George, soon  joined him in the business.\n\nIn 1950, William Boyd McGehee, Jr. (Billy) left his family's pharmacy  in Montgomery, Alabama, seeking new directions. He and his wife moved  to Talladega to join her father in the…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…vital to  our mission's success in Europe.\n\nAfter the war, Mr. Holland returned to his home State of West  Virginia before settling in the Hollins area of Roanoke County in 1950  to be near family. He went on to enjoy a long and honorable career with  the General Electric Company and has been a valued member of the  Roanoke community ever since.\n\nMr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…residents of Mercer County and  the surrounding region. The hard work and spirit shown by staff have  improved the health and quality of life for countless patients.\n\nFounded in 1950, Mercer Health, known then as Our Lady of Mercy  Hospital, was established to provide care to the citizens in Coldwater,  Ohio and surrounding area. Seeing a need for a hospital,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697414/recognizing-mercer-health-on-their-75th-anniversary"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…rise to honor the 75th anniversary of the  Battle of Chosin Reservoir and recognize the heroic veterans of the  Chosin Few.\n\nSeventy-five years ago, in the bitter winter of 1950, 30,000 United  Nations forces, most of them United States Marines, were surrounded by  more than 120,000 Chinese troops near the Chosin Reservoir in North  Korea. Facing the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695858/recognizing-the-75th-anniversary-of-the-battle-of-chosin-reservoir"}]