[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Kemp, who was my  colleague when I first came here, had a similar story. A week later, I  changed my major from business to political science.\n\nMr. Speaker, 7 years later, in 1966, 5 months out of Georgetown Law  School, I was elected to the Maryland State Senate. Mr. Speaker, 15  years after that, in 1981, the voters of the Fifth District elected me…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the guiding light that shaped his decisions, his care for others, and  the moral courage that marked his long career.\n\nHis life was also defined by a love that endured: in 1966 he married  Janice Williams Bowens, his partner, confidante, and anchor. Together  they raised four children--Darrell, Brenda, Marcus, and Pamela--and  built a family that mirrored…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…30, 2023. However, the Clean Air       Act requires the EPA Administrator to grant a waiver of       preemption for a state that adopted a standard prior to March       30, 1966, if the state determined its standard will be, in       the aggregate, at least as protective of public health and       welfare as applicable federal standards. 42 U.S.C.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…honor James ``Jamie'' T.  Poston, a proud American and Vietnam combat veteran who has dedicated  his life to serving our great country.\n\nJamie entered the United States Army in 1966, deploying to Vietnam as  a Mustang crew chief.\n\nToday, at 80 years young, Jamie remains a pillar of support for our  local veterans. Every Thursday, he volunteers at the military…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and arm them with the skills that are  needed to succeed.\n\nMy favorite teacher was Rayella B. Heely, who taught my eighth grade  algebra class in Mount Vernon, New York, in 1966. She was tough, and  she did not give out easy grades. I did not get a particularly good  grade, but she taught me concepts that I remember to this day.\n\nTeachers are increasingly…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690736/to-teach-is-to-touch-a-life-forever"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Boston in 1941, attended college at the University  of Cincinnati and received a master's degree from George Washington  University before enlisting in the United States Army in 1966. After  enlisting, he completed Officer Cadet School, Army Airborne School, and  Army Ranger School before deploying to Vietnam in 1969, where he would  serve as a member of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…obvious--because, yes, for over half a century, we have been  the innovators and trailblazers in the fight against pollution.\n\nA little bit of a history refresher here. Back in 1966, California  established the first tailpipe emission standard for passenger vehicles  in the Nation, responding to California's unique air quality needs with  policy based on…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…into their district by a 5- 3 count, the vote of LHSAA principals numbered 11 yeas, 185 nays. The  rest is history.\n\nSt. Augustine gained entry through a federal court suit in 1966, the  CYO allowed St. Augustine and Xavier Prep to compete in its tournament,  and the Knights of Columbus ceased running its annual track and field  meet.\n\nOn Friday, December…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…this retreat  from knowledge. There were England's Luddites in the early 19th century  who fought the use of new textile technology. There was Mao Zedong's  Cultural Revolution 1966 through 1976 when intellectuals and scientists  were labeled the ``Stinking Old Ninth'' and were sent to reeducation  camps in the countryside.\n\nFor 75 years, the National Science…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…importance of providing service, and  utilizing good judgment.\n\nOurs is a great country, and among the things that make us great is  our system of healthcare.\n\nSpeaking at a 1966 healthcare conference, Martin Luther King, Jr.,  observed: ``Of all forms of inequality, injustice in health is the most  shocking and inhumane.'' Many of these inequalities…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…44 percent of [American Indian/      Alaskan Native] children.\n\nHow the Federal Government funds the states' Medicaid       plans.\n\nMedicaid began as an optional program in 1966 alongside       Medicare, with around 8 million people eligible for       enrollment. By the 1980s, all states had opted into providing       health insurance through Medicaid.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…his uncle, a  Korean War veteran, to continue his family's proud tradition of  military service. Answering the call of duty, he enlisted in the United  States Army in November 1966 and served with distinction as a UH-1C  helicopter gunship pilot in the 175th Assault Helicopter Unit's 3rd  Platoon Mavericks during one of the most challenging conflicts in…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…California actually chooses a policy they don't like,  they throw that principle out the window.\n\nWhen Congress passed the Clean Air Act, it gave States that had  standards before 1966 the right to apply for a waiver. Congress decided  that. For 50 years, California has used that waiver to clean up its  air. It is not just California. Other States have chosen…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…reminds bureaucrats that they ultimately work  for and answer to ``We the People.''\n\nOne transparency tool I value is the Freedom of Information Act. This  law, first enacted in 1966, requires our government to proactively make  material public and to respond to requests for documents, reports, and  many other types of information. The presumption under…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Mr. Speaker, I rise today to recognize May 22, 2025, as  Clinton Community College Day.\n\nClinton Community College was established in 1966 by the Clinton  County Board of Supervisors on the grounds of the old Hotel Champlain  on Bluff Point in Plattsburgh, New York, under Governor Nelson  Rockefeller's Administration.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…in favor of a national standard by the  Environmental Protection Agency. This allows automakers to build the  same vehicles for use by drivers all across the country.\n\nSince 1966, the Clean Air Act has given California, and only  California, the ability to seek a waiver of Federal mobile source  emissions standards. Other States can choose to adopt California's…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…today, I am honored to recognize our  September Veteran of the Month: Mr. Dale Karst.\n\nDale proudly served in the United States Air Force, entering service  on September 16, 1966. After basic training, he was stationed at  Whiteman Air Force Base with the Air Police Squadron before deploying  to Vietnam with the 377th Combat Defense Unit.\n\nHe was stationed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…House is preventing a law from being  obeyed. I didn't know we could pass a rule to prevent a law from being  obeyed.\n\nWhen the emergency powers were granted to the President in 1966, the  Emergencies Act was meant to constrain the Republic. We were already  worried about too many emergencies. Many on my side have actually  cosponsored bills that say emergencies…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…communities across  Michigan's Upper Peninsula when facing profound economic hardship from  the decline of iron and copper mining industries throughout the 1960s.\n\nOn January 21, 1966, the Bessemer Speedboys basketball team ended a  42-game losing streak, at that time, the longest ever recorded in Upper  Peninsula high school basketball history. Even in the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699253/recognizing-mr-thomas-l-pelissero-for-authoring-bring-one-home"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…biggest untapped copper-nickel find in the  world.\n\nThe Biden administration banned mining in northeastern Minnesota. He  took the mineral leases away that were in place since 1966. Yet, they  want us to compete in defense, Nassau and other areas of our  communities, with adversarial governments when we have to buy their  minerals for the F-35s, the F-22s,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…in the United States Air Force.\n\nRick went on to lead another successful career as a financial adviser  in Monument, Colorado. He often enjoyed spending time with his fellow  1966 Academy graduates and cheering on his grandchildren, whether they  were performing in a play or competing in sports.\n\nSadly, in 2021, Rick passed away with his wife, Nancy,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Commissioner and a member of the Carroll County Farm  Bureau Hall of Fame.\n\nSelection for the Hall of Fame is a high honor that has been accorded  to only 257 Ohioans since 1966. Consideration for induction is given to  those who have made outstanding contributions to agriculture, Ohio's  top industry.\n\nOn behalf of the people of Ohio's Fourth Congressional…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694257/recognizing-the-2025-class-of-the-ohio-agricultural-hall-of-fame"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…bar in both  New Jersey and the District of Columbia. He served for three years as a  legal officer in the Marine Corps, advising commands both in the U.S.  and in Vietnam. In 1966, while still on active duty, John married his  wife, Mary. After completing his service, he founded the law firm now  known as Post Polak, P.A., where he served as managing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691600/recognizing-john-post"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…politically  sensitive reconnaissance missions along the frontiers of the Soviet  Union, with frequent and sometimes deadly interactions with Soviet  fighter aircraft.\n\nIn August of 1966, the 55th Wing moved to Offutt Air Force Base,  Nebraska, where it proudly resides to this day. During the height of  the Cold War, the Wing took on nuclear command and control…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in the family.\n\nIn any event, both for the children and the men and the single women,  we would be better off retracing our steps back to the great society  years of 1965 and 1966 when, in my opinion, the worst President in our  country's history decided to institute these programs and destroy the  family. I am not sure that was the motive. I think perhaps…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…60 Years of Service\n\nMr. KILEY of California. Mr. Speaker, I rise today to congratulate  and recognize PRIDE Industries on reaching their 60-year anniversary  milestone.\n\nIn 1966, PRIDE Industries was founded in the basement of a church in  Auburn, California, by a group of parents of young adults with  developmental disabilities. These parents shared…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…servant's life reflects the hard work and dedication that  exemplifies the best of our Nation's values.\n\nRichard entered active duty at Camp Pendleton, California in May of  1966 at twenty-one years of age. He served with honor and heroism  during the Vietnam War, serving in the Mortar Battery, 3rd Battalion  13th and 5th Divisions of the Marine Corps.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}]