[{"senator": "Ami Bera", "party": "Democrat", "sentence": "…Carmichael Park and Recreation District acquired  its first land parcel that went on to become their flagship park,  Carmichael Park. After further land acquisitions between 1971 and 1990,  the district now includes 12 additional park sites.\n\nParks in the district are major community hubs that include  playgrounds, dog parks, ball fields, tennis and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696717/recognizing-the-80th-anniversary-of-carmichael-recreation-and-park-district"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…by the way,  receives more than $200 million monthly for its Social Security  recipients. Your district, Mr. Speaker, receives $354 million.\n\nThat hasn't been changed since 1971. People in America should be  outraged by the fact that Congress has not fulfilled its responsibility  to act on behalf of its citizens.\n\nSocial Security is the number one insurance…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…can't steal the power of the purse.  In the Constitution, that power of the purse is given to Congress.\n\nSenators were very concerned about the deficits that were existing in  1971, and 1972, and 1973. They averaged $20 billion a year. They  totaled $60 billion. I can tell you that now when our deficit is  running at something closer to  $2 trillion a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…playground for demolition. It is a national cultural institution,  created by Congress in 1958, and later dedicated to President John F.  Kennedy after his death. It opened in 1971 as a living memorial to a  man who believed the arts were essential to democracy itself. The name,  the mission, the existence all come from statute, law. No social media  post,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Representative Stansbury is part of legislation that seeks to expand  benefits, not just protect Social Security. Congress hasn't acted on  Social Security and its expansion since 1971. Richard Nixon was  President of the United States.\n\nMr. Speaker, because of the initiative, energy, and enthusiasm of  Members of Congress like Representative Stansbury, people…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694190/hands-off-our-social-security"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Missouri-Kansas City. In addition  to his education endeavors, Jim served during the Vietnam War in the  U.S. army as First Lieutenant and was later honorably discharged in  1971.\n\nAs an Operations Manager at Hallmark Cards, Jim had a 34-year  successful career before retiring in 2004. Being a Grandview native,  Jim decided to seek ways to get involved…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…away, but it  comes back. It is that light trying to tell us that something is wrong.  Remember, we pull over the BMW. We pull over the fancy Yukon. We pull  over the prized 1971 Corvette because we don't want to damage that  classic.\n\nWhat about the classic we are for our children? What about the  classic we are for our grandchildren? What about the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…work after they retire and then have their Social Security double  taxed. It also applies for an across-the-board increase for all of our  citizens who haven't seen that since 1971.\n\nMr. Speaker, as you know, there are 10,000 baby boomers a day that  become eligible for Social Security, and that is why it is so  important.\n\nIn your district in Illinois,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…200,000 employees and retirees of the United  States Postal Service who belong to the clerk, maintenance, motor  vehicLe, and other services divisions. It was founded July 18, 1971 as  a former clerk in the Chicago post office, beginning in 1961, prior to  the APWU being organized and accepted. I congratulate the Chicago  leadership in the personage of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697484/congratulating-the-american-postal-workers-union-chicago-chapter-0001"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…least expect them. Take  the story of McDonald's. Next week, McDonald's is celebrating 70 years  of selling hamburgers, strengthening communities, and connecting  people. Since 1971, Illinois has been home to the headquarters of  McDonald's, but the multibillion-dollar hamburger chain's history with  the Prairie State does not begin there.\n\nIn the 1920s,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…not contributed to the vitality and  success of our country.\n\nAs chair of the Congressional Black Caucus, I am proud that as our  caucus has grown from 13 visionary members in 1971 to a historic 62  members in the year 2025, 4 of whom serve in the United States Senate,  we have continued fighting to dismantle barriers, create opportunities,  and protect…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…a plan. Here is our plan. Social Security--and the American  people, especially the people in our audience today ought to  understand--hasn't been enhanced by Congress since 1971. Richard Nixon  was President of the United States. There are more than 70 million  Americans who rely on Social Security. Of those 70 million, for over 30  million of them,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…celebrate the new fire  station that just opened off of Route 50, Station 7.\n\nThis new 23,000-square-foot facility is replacing the previous fire  station that was built in 1971 and will provide crucial, lifesaving  services to over 6,000 residents, covering over 40,000 square miles of  response area.\n\nStation 7 will be staffed around the clock by career…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…serving in our United States Senate, and 58  House Members in this Congress, the largest in our history. As we say  in the Baptist church, we have come a mighty long way. From 1971, when  13 Members sat on this House floor, 12 Black men from across this  Nation and one brave, courageous, bad sister, Shirley Chisholm. My,  have we come a long way.\n\nWe come…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…at the end of February, Secretary Kennedy announced that HHS is no  longer required to undergo the public comment period--a practice that  has taken place at the Agency since 1971.\n\nAnother critical resource of health information for the American  public is the CDC's ``Morbidity and Mortality Weekly Report.'' It has  been published since 1952 and is often…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…years, to end on December 29, 2030.\n\nAlaska Natives have long experienced land-related hardships.  Recognizing this, Congress passed the Alaska Native Claims Settlement  Act in 1971 to settle the aboriginal land claims of Alaska Natives.\n\nUnfortunately, this congressional action coincided with the Vietnam  war, meaning that many Alaska Natives who were…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…recognize Hall Ambulance on its 55th anniversary and to  commend them for their significant contributions to the Central Valley.  Hall Ambulance was founded on February 10, 1971, when Mr. Harvey L.  Hall began responding to medical aid calls from his home in Bakersfield  using a single Cadillac ambulance. From these humble beginnings, Mr.  Hall built…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…they serve. The projects they have worked on vary,  ranging from food and beverage equipment to ductwork and even  hovercraft. Goodhart Sons moved to their current facility in 1971,  which has continued to expand with each generation.\n\nToday, Goodhart Sons Inc. is under fourth-generation leadership and  employs over one hundred people. Goodhart Sons has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695929/congratulating-goodhart-sons-inc-on-their-90th-anniversary"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…every workforce should be unionized, and  Iowa happens to be a right-to-work State.\n\nIt happens that I support the right of workers to organize. I joined  a union from 1962 to 1971. I was a member of the International  Association of Machinists. I am proud of my membership in that union  and the years I spent on the assembly line at Waterloo Register in…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…History Channel and in books like ``Hill 875'' and ``Dak To.''\n\nAfter his military service, Tom graduated from Florida State  University College of Law, joined the Florida bar in 1971, and gained  courtroom experience as both a public defender and as assistant State's  attorney.\n\nIn 1995, he became a partner in the renowned law firm of Smith,  Anchors, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691470/thanking-emergency-medical-services-personnel"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Carolina, and Army Management Staff College, Army Logistics Management  College, where he completed the Leadership Management Program and  Logistics Management program. In 1971, he married his high school  sweetheart, the love of his life, Paula Graham Lewis, with whom he has  shared 54 years of marriage, three kids, six grandchildren, and five  great…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and provides the vital access  necessary to develop the resources in the National Petroleum Reserve- Alaska, the ANWR Coastal Plain, and construct the Alaska LNG pipeline.\n\nIn 1971, the Department of the Interior issued Public Land Order-- PLO--5150 withdrawing from selection a 5.3 million acre stretch of  Federal land to reserve it as a utility and transportation…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…with the Augusta Environmental  Company (1981 to 1989) and Diversified Products (1976 to 1980), while  balancing his long and honorable military service in U.S. Army (1970 to  1971) and Army Reserve (1971 to 2000). He is supported by his loving  wife, BBB4 Wilbert D. Payne, Jr., and has been blessed with 4 children  and 12 grandchildren.\n\nMr. Speaker,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Born in Shreveport, Louisiana, Pastor Moore attended Booker T.  Washington High School and joined the United States Navy after  graduation. He was honorably discharged in June 1971 with the rank of  Seaman Apprentice. Pastor Moore earned his bachelor's degree in 1976  from Bishop College in Dallas and attended Perkins Theological and  Chriswell Ministry…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690155/recognizing-congressional-patriot-award-recipient-pastor-isiah-moore-jr"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…course of his life, Stan earned several meaningful honors  that meant a great deal to him, including the Man of the Year Award  from the Dauphin County Teenage Republicans in 1971, a Resolution of  Recognition from the Black Republican Council of Pennsylvania in 1982,  and a Presidential Award from the IMC of Greater Harrisburg in 2012.\n\nMr. Speaker,…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…back on Alaska and hampering domestic  energy production.'' The Arctic Slope Regional Corporation, ASRC, one  of the 12 land-owning Alaska Native corporations created under the 1971  Alaska Native Claims Settlement Act, ANCSA, and representing the  interests of more than 13,000 Inupiat shareholders, echoed those  concerns. In testimony before the Alaska…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Federal Government directed       Alaska Native people to organize into a new structure of       indigenous representation. The Alaska Native Claims       Settlement Act of 1971 (ANCSA) was a dramatically different       and transformative approach by the Federal Government to       federal Indian policy. The fact that our ancestral lands were…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…due to  illness. Additionally, Denny served his community as a volunteer  firefighter and as an Emergency Medical Technician at the Watertown  Hospital until its closure in 1971.\n\nHe contributed to the cultural life of Watertown in many ways. For  five years, Denny played with the Highliners Polka Band and later  played with John Exklund and the Midwesterners,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698267/recognizing-the-retirement-of-dennis-eugene-denny-butcher-of-watertown-minnesota"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…resident of Kaktovik--the only community located fully within  ANWR--and the President of Kaktovik Inupiat Corporation, KIC. KIC is a  village corporation established by the 1971 Alaska Native Claims  Settlement Act. KIC owns approximately 92,000 acres of surface lands,  but is completely enveloped within ANWR and hampered from developing  these acres…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…the  veteran community of Crawford County and the Commonwealth of  Pennsylvania.\n\nPhil Davis proudly served in the United States Army from January 21,  1970, to December 3, 1971. He deployed to Vietnam from January to  October 1971, serving his country during one of the most challenging  periods in our Nation's history.\n\nOn November 28, 1988, the Veterans…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697105/recognizing-phil-and-laurie-davis-as-a-community-champion-in-pennsylvania-16"}]