[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Linda McCarthy on her retirement from Mt. Baker Planned Parenthood and  thank her for her many decades of service and dedication to the people  of Northwest Washington.\n\nSince 1977, Linda McCarthy has been an advocate for women's health at  Mt. Baker Planned Parenthood, starting as a secretary and eventually  rising to become the CEO for 21 years.\n\nUnder…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689685/recognizing-linda-mccarthy"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…associate's degree from Chaffey College. Later on, she earned a  bachelor's in social work from Cal Poly Pomona, which kick-started her  journey to becoming a social worker.\n\nIn 1977, Ms. Brugger ran for the Ontario-Montclair School District  board. She served on the board for 16 years before joining the Chaffey  College Governing Board in 1993. Under her…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…grandpa was an iron ore miner--that that  continue.\n\nBut that is not what we are talking about with the President's action  here. The broad emergency power statute enacted from 1977 that the  President has used to justify these across-the-board tariffs didn't  even mention the word ``tariff.''\n\nMy colleagues and I have filed an amicus brief to the Supreme…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I, along with my Ohio colleagues, rise in  grateful memory of Ohio Congresswoman Mary Rose Oakar, who served from  1977 to 1993 in this House. She was the first Democratic woman elected  to Congress from Ohio.\n\nMary Rose was elected from the heart of the working class of people.  She exhibited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Mr. JOHNSON of Georgia. Mr. Speaker, I rise to join the Sidney family  in celebrating the life of Corey Lee Sidney, who was born on June 10,  1977, and died all too soon on October 11, 2025. He was a quiet man  with a gentle spirit, and was cherished by his family, loved ones, and  friends.\n\nCorey Lee Sidney was born in…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…2026 are       recognized for their dedication and leadership in advancing       the mission and sustaining the chapter's legacy: Ernest       Gibson (1976), Mickey S. Brown (1977), Arthur Thompson       (1978), James H. Ivory (1979-1981), Walter R. Bauldrick, Sr.       (1981), Clarence R. Lewis (1982-1984), Robert L. McMillian       (1984-1986), Harold…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…and Republican  Presidents. He was a champion for expanding access to healthcare.  Inscribed in the entrance hall of that building are words from  Humphrey's final speech in 1977. By the way, he was someone who was  loved right here in this Chamber by Democrats and Republicans. Some of  the most conservative Republicans mourned his loss, and they loved…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, yes, that is me in 1977. I was a  young law student representing Texas at the historic International  Women's Year conference in Houston.\n\nAnn Richards was right behind me. She was getting ready to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Non-Discrimination Act,  which would provide for coverage of employees of the local D.C. courts  and the D.C. Public Defender Service (PDS) under the D.C. Human Rights  Act of 1977 (DCHRA). In 2022, the D.C. Court of Appeals  held that the DCHRA, which protects employees of the D.C. government  and private employers from discrimination, is inapplicable…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698864/introduction-of-the-district-of-columbia-courts-and-public-defender-service-employment-non-discrimination-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…coins. Mentions of the society       sometimes appeared in newspaper roundups of out-of-the-way       places to visit in Manhattan.\n\nExcitement occasionally paid a call. In 1977, four armed       men overpowered two society guards, meticulously taped cloth       over display cases to muffle the sound of glass being broken       and made off with about…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…reason is  Trump doesn't have the legal authority to do that. He doesn't have the  legal authority to do what he is doing right now.\n\nTrump claims to have authority under a 1977 law signed by Jimmy  Carter, the International Emergency Economic Powers Act. This law was  so uncontroversial in 1977 that it was passed on a voice vote.\n\nNow, can you imagine?…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the American Dream.\n\nBorn in Mexico, Representative Garcia moved to the Little Village  neighborhood of Chicago in the 1960s and never left. After earning his  citizenship in 1977, Representative Garcia graduated from college and  began his career in public service with a community-based housing  initiative.\n\nSince his time as a member of the Chicago…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…Kimmitt, a decorated war  veteran who served in World War II and in Korea, devoted his career to  Senator Mike Mansfield and ultimately served as Secretary of the Senate  from 1977-1981. His uncle Jay Kimmitt spent decades on the  Appropriations Committee as a professional staff member. His aunt and  godmother Judy dedicated nearly her entire professional…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Institute in their mission of curing disease such as Hepatitis B and  Liver Cancer.\n\nMr. Kroszner began his career at the United States Naval Academy,  where he graduated in 1977 with a Bachelor of Science degree in  mechanical engineering. He spent the next 10 years of his career as an  engineer with the Naval Air Warfare Center in Trenton where he…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696849/recognizing-mr-konrad-kroszners-16-years-with-the-pennsylvania-biotechnology-center-and-baruch-s-blumberg-institute"}, {"senator": "French Hill", "party": "Republican", "sentence": "…were both the Arkansas National Forest in 1907 (later renamed       the Ouachita National Forest by President Coolidge in 1924)       and the Ozark National Forest in 1908.\n\nIn 1977, President Jimmy Carter requested that the Forest       Service undertake a review of all potential wilderness areas       across the country and make recommendations to Congress.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…planet. It is home to the Prudhoe Bay oil  field, the largest conventional oil field in North America, which has  produced over 13 billion barrels of oil since production began in 1977.  On either side of Prudhoe Bay are two Federal areas, one being the  Arctic National Wildlife Refuge and the other being the National  Petroleum Reserve in Alaska, the subject…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…section 115(h) of the Federal Oil and Gas Royalty Management       Act of 1982 (30 U.S.C. 1724(h)) or section 525(b) of the       Surface Mining Control and Reclamation Act of 1977 (30 U.S.C.       1275(b)), the deadline described in subsection (a) shall       control.\n\nMr. WESTERMAN.  677, as amended, the bill now  under consideration.\n\nI rise today in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Trump's civilian nominees has been  confirmed by unanimous consent or voice vote--again, something entirely  unprecedented in recent years. No other President since at least 1977  has failed to have civilian nominees confirmed by unanimous consent or  a voice vote at this point of his administration, except for President  Trump in his first term in office.…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…for energy resources that are absolutely essential to  the economic and national security of these United States of America.\n\nWhen the Department of Energy was organized in 1977, Mr. Speaker, the  American people were suffering from the energy security fallout of  OPEC's oil embargoes. You may remember prices went up, gas lines  formed, and our Nation's…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…my Oxford District Office.\n\nBeverly, a native of Clay County, Alabama, was born on May 6, 1959,  to W.T. and Eulene Buckhannan. She graduated from Lineville High School  in 1977 and married Andy Dale Graben on April 8, 1979. Beverly obtained  a cosmetology degree from Ayers State Technical College. She and Andy  have been blessed with two sons: Adam…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688459/recognizing-the-retirement-of-beverly-denise-buckhannan-graben"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…largest student-run philanthropic organization in the world, with  more than 16,500 student volunteers across Pennsylvania.\n\nSince partnering with the Four Diamonds foundation in 1977, THON has  ensured that not a single Four Diamonds family going through cancer  treatment has received a medical bill, thanks in large part to the  tireless efforts of Penn…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 167) to amend the Surface Mining Control and Reclamation Act  of 1977 to authorize partnerships between States and nongovernmental  entities for the purpose of reclaiming and restoring land and water  resources adversely affected by coal mining…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…National Scouting America Day, which recognizes the  legacy of the organization and the young Americans who have gone from  Scouts to leaders in their communities.\n\nOn May 17, 1977, I became an Eagle Scout myself, as a member of Scout  Troop 52 in Walker Township, Pennsylvania. Over the years, I proudly  held various leadership roles with Scout troops…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…honor the life and legacy  of my dear friend and fellow east Tennessean, Reverend Harold  Middlebrook.\n\nReverend Middlebrook moved to east Tennessee, my district, actually,  in 1977. Of course, I was in the seventh grade then. I don't know if  technically it would be called my district, but he was the pastor of  the Canaan Baptist Church of Christ.\n\nBefore…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…recognize the  life and legacy of Michael Adams, the former president of the  University of Georgia.\n\nUnfortunately, Dr. Adams passed away on January 25 at the age of 77.\n\nFrom 1977 to 2013, he served as the University of Georgia's 21st  president, transforming our State's flagship university into one of the  Nation's most prominent public institutions.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…University, located in Greencastle, in  1956. Her broadcasting career started when she joined the local radio  station WJNZ, formerly known as WXTA, as the sales manager in 1969.\n\nIn 1977, Jinsie Bingham became the first woman in Indiana to own and  operate a commercial radio station. She ran WJNZ, which is now known as  WREB and serves Greencastle to this day.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Appointed Special Advocates (CASA) provides support  to the juvenile court and its dependent children, who are innocent  victims of abuse and neglect. CASA was established in 1977 to combat  misrepresentation of these victims and Tulare County CASA was created  in 1984 by concerned members of the community. These strong advocates  step into the court…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698218/recognizing-the-tulare-county-court-appointed-special-advocates-casa"}]