[{"senator": "Norma Torres", "party": "Democrat", "sentence": "…Beta Supermarket, as an instructor  for a nursing assistant class, and as an Administrator for the  Comprehensive and Training Act Program at the Gardena Community Center.\n\nIn 1980, after completing his medical residency at the University  Hospital in Jacksonville, Florida, Dr. Vo returned to California and  treated people at Lanterman State Hospital in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Nazarelle-- children who were a constant source of joy and pride.\n\nA lifelong learner, Bishop Williams was a proud graduate of Dougherty  Comprehensive High School (Class of 1980) and Albany Technical College.  His studies continued at Georgetown College, Regents Park College at  the University of Oxford, The Interdenominational Theological Center of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…deficiencies of past policies and advancing long-      overdue initiatives.\n\nLet me give you some facts that our critics never seem to       remember. When we took office in 1980, we faced a dusty shelf       of reports which pointed out our predecessors had been so       busy spending money on new lands for parks that they       seriously neglected…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have risen more than tenfold since the  1980s and now cost the global economy over $200 billion per year.  NOAA's 5-year average of billion-dollar disasters in the period from  1980 to 2024 averaged nine of them per year; 1980 to 2024 averaged 9  billion-dollar disasters per year. From 2020 to 2024, that segment, the  average has soared to 23 per year.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…South Los  Angeles, Ms. Figueroa-Villa has devoted over four decades to the non- profit sector, most notably serving as the Executive Director of El  Centro del Pueblo since 1980.\n\nAt El Centro del Pueblo, Ms. Figueroa-Villa has worked to address and  mitigate the impacts of gang violence in Los Angeles. Thanks to her  leadership, El Centro was transformed…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…want to speak  against the effort to overturn the land management plan for the Arctic  National Wildlife Refuge.\n\nCongress established the Arctic National Wildlife Refuge in 1980 to  protect the diverse and unique, very fragile ecosystem located on 20  million acres in the northeast corner of Alaska. However, at the time,  Congress failed to permanently…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Small Business Investor Capital Act makes a  narrow technical correction to a federal securities rule that has had  major unintended consequences over the last two decades.\n\nIn 1980, Congress created Business Development Companies (BDCs) to  facilitate capital formation into small and medium-sized businesses.  BDCs provide both investment capital and management…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Medals, as the gentleman from Minnesota outlined.  They are going to three different locations. This is the highest  civilian award, and it makes that award to the members of the 1980 U.S.  Olympic men's ice hockey team, whose victory marked a pivotal moment in  American sports history.\n\nOn February 13, 1980, the U.S. hockey team historically defeated the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…are a brave and patriotic American  that embraces the First Amendment to the Constitution, and you will not  allow anyone to intimidate you.\n\nI was a missionary in Honduras in 1980 and 1981, and it was an  authoritarian society. And no one was guaranteed the right to assemble  or complain. You might do it and be OK one day; the next day you might  be arrested;…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…children.\n\nGerard would continue his Jesuit education at Rockhurst High School,  before attending the University of Missouri-Columbia, where he would  graduate with honors in 1980 with a bachelor's degree in journalism.  Following graduation, Gerard briefly enjoyed working as a reporter for  the Kansas City Labor Beacon, before joining the staff of U.S.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…contributions of Cambodian Americans and underscores the role of  refugee communities in the broader American story.\n\nStockton, which became a major resettlement site during the 1980's  and 1990's, is home to one of the largest Cambodian communities in the  United States. This exhibit reflects the significance of the city as  both a destination and a foundation…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694719/recognizing-the-opening-of-the-cambodian-experience-our-journey-to-america-finding-freedom-at-the-haggin-museum-in-stockton-california"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…appointed or elected leader  since he was 21 years old. He served on the City Council from 1985 to  1991 and the First Fire Taxation District's Board of Fire Commissioners  from 1980 to 2004. As a member of the Connecticut House, Steve  represented West Haven's 115th District from 1991 to 2017. For 20  years, he was a co-chair of the General Assembly's Public…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, Commander Janie L. Mines was the first  African-American woman to graduate from the U.S. Naval Academy in 1980.\n\nCommander Kristine Holderied, a Howard County native, was the first  woman to graduate as valedictorian not only from the Naval Academy but  from any service academy, in 1984.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Business  Investor Capital Act, makes a narrow technical correction of the  Federal securities rules that had a major unintended consequence over  the last two decades.\n\nIn 1980, Congress created Business Development Companies to  facilitate capital formation and get that capital to small- and medium- sized businesses. I want to point out that, as we…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Department of Defense, is building new  ballistic submarines on a very tight schedule to replace the aging  fleet of Ohio-class submarines, who have been on patrol starting in the  1980's. The first two submarines--USS District of Columbia and USS  Wisconsin--are under construction and fully funded with appropriations  approved by prior Congresses. The third,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…June 5,       2023.\n\n37. See 5 U.S.C. Sec. 804(3)(C).\n\n38. 5 U.S.C. Sec. 553(b)(A); see B-329926, Sept. 10, 2018.\n\n39. Batterton v. Marshall, 648 F.2d 694, 707 (D.C. Cir.       1980).\n\n40. See, e.g., B-329916, May 17, 2018.\n\n41. B-329926, Sept. 10, 2018.\n\n42. B-335629, July 8, 2024.\n\n43. B-274505, Sept. 16, 1996.\n\n44. B-238859, Oct. 23, 2017.\n\n45. See North…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "French Hill", "party": "Republican", "sentence": "…included on       the National Priorities List established pursuant to section       105 of the Comprehensive Environmental Response,       Compensation, and Liability Act of 1980 (42 U.S.C. 9605).\n\n(c) Report to Congress.--Not later than 1 year after the       date of the enactment of this Act, the Comptroller General of       the United States shall…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…assistance organizations.\n\nYes, an individual pled guilty today to a $12,000 bribe. No, that is  not the reason to shut down abruptly and end the process that has gone  on since 1980, by which this organization--which has long enjoyed  bipartisan support--makes grants at a very modest level to dozens of  African organizations and countries using matching…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699438/consolidated-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…service exemplify the highest  traditions of our Armed Forces.\n\nCWO4 McInnis devoted more than 24 years to honorable service in the  United States Coast Guard after enlisting in 1980 and completing basic  training in Cape May, New Jersey. He began his career aboard  operational cutters in the Great Lakes, supporting essential missions  including fisheries…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Mrs. Susan Harkins. It is my  distinct honor to celebrate her remarkable 45 years of service with the  Lower Bucks County Chamber of Commerce.\n\nSince joining the Chamber in 1980, Susan has been instrumental in  supporting business and leadership development in Lower Bucks County.  She began her career in the Chamber's front office, supporting groups…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 452) to award 3 Congressional Gold Medals to the members of  the 1980 U.S. Olympic Men's Ice Hockey Team, in recognition of their  extraordinary achievement at the 1980 Winter Olympics where, being  comprised of amateur collegiate players, they…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…cruising the Florida coast, living out the promise that he and his  fellow POWs made to embrace life fully if they ever got home.\n\nHowever, Allen's service didn't stop there. In 1980, he made a  daring, unauthorized voyage to Communist Cuba to rescue refugees during  the Mariel boatlift, an act of moral courage that risked his freedom  once again.\n\nIn later…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…left's war on fossil fuels. Forty years of  folly are now driving energy prices out of reach for working families  and driving those working families out of California.\n\nIn 1980, 40 refineries served the California market, producing  abundant gasoline at easily affordable prices. Mr. Latta said 14  refineries were left. His numbers are old. We are now…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…every effort is made to ensure that at least 1 Uyghur-      speaking member of the Foreign Service (as such term is       defined by section 103 of the Foreign Service Act of 1980 (22       U.S.C. 3903)) is assigned to each United States diplomatic or       consular post in China.\n\n(b) Report.--No later than 1 year after the date of the       enactment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…NPR-A.\n\nUnder the Naval Petroleum Reserves Production Act of 1976, the  approximately 23-million-acre NPR-A was designated by Congress due to  its vast energy resources. In 1980, Congress amended the act and  directed the Secretary of the Interior to conduct ``an expeditious  program of competitive leasing of oil and gas in the National Petroleum  Reserve…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…and its outcomes, yet       those concerns were ignored.\n\nThe 2022 ROD ignores congressional intent under ANCSA, the       Alaska National Interest Lands Conservation Act of 1980       (ANILCA), the National Petroleum Reserve Production Act of       1976 (NPRPA), and the Omnibus Appropriations Act of 1980. The       2022 ROD also disregards the economic…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…of the resolution.\n\nThe text of the resolution is as follows:                                H. Res. 352\n\nWhereas ``Jewish American Heritage Month'' has its origins       in 1980, when Congress enacted a Joint Resolution entitled       ``joint resolution to authorize and request the President to       issue a proclamation designating April 21 through…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "James Risch", "party": "Republican", "sentence": "…nomination       and for the 4 preceding years; (5) for persons nominated to       be chiefs of mission, the report required by Section       304(a)(4) of the Foreign Service Act of 1980 on the       demonstrated competence of that nominee to perform the duties       of the position to which he or she has been nominated; and       (6) the nominee has provided…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…importantly, money for  children's education.\n\nAs this chart shows, all of those billions did nothing to help  recover the owl. The population has declined from 1,200 pairs in 1980  to around 200 pairs today. When society enacts laws that seemingly  benefit the broader public but end up harming small communities,  society must assume responsibility for…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697659/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…government authors, and I am  going to reference George Gilder a little bit here, who was a great  sociologist, if I can call him that, who wrote ``Wealth and Poverty''  in 1980. He looked at single-parent families to see if he had any  observations. The families he looked at were specifically from the  poorer parts of Albany, New York. At the time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}]