[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…from greater       participation in rulemaking should outweigh any       administrative inconvenience or delay caused by using the       notice-and-comment procedures.      1982 Notice of Proposed Rulemaking\n\nIn 1982, HHS proposed, but never adopted, a rule clarifying       the policy announced in the Richardson Waiver and codifying       it in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…evidence of their own  scientists and do nothing.\n\nNot only did they know, but their own scientists' work was stunningly  accurate.\n\nThis is a chart from Exxon pulled from a 1982 Exxon memo. This line  in black is the predicted rise, back when this was prepared, before  1982, in CO2 concentrations. They start at 1960 and work  their way to 2100. This…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…rectify these       race-based considerations from these specific districts.\n\nIn Allen v. Milligan, 599 U.S. 1, 45 (2023), Justice       Kavanaugh noted that ``even if Congress in 1982 could       constitutionally authorize race-based redistricting under       Sec. 2 for some period of time, the authority to conduct       race-based redistricting cannot extend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Safety Board, or failure to have it at all,  as a cause of multiple aviation accidents, including a very famous one  right here on the Potomac River, a flight that took off in 1982 from  Ronald Reagan Airport.\n\nMoreover, with climate change contributing to more extreme weather  across the country, deicing fluids and equipment have become even more  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…a Gulf War veteran and  founder of the Veterans Assurance Network, which provides advocacy,  support, education, services, and resources to veterans and their  families.\n\nIn 1982, Tim joined the U.S. Air Force, where he was deployed to  Saudi Arabia during Desert Storm. There, he was exposed to toxic burn  pits and oil well fires purposely set by Iraqi…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Lanterman State Hospital in the Department of  Developmental Services. He worked there as a physician, Chief Medical  Staff, and as the Coordinator of Medical Services.\n\nIn May of 1982, Dr. Vo joined Pomona Valley Hospital and a medical  practice in Pomona. His involvement in our community has been vital not  only through his medical expertise but also through…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…legacy: Ernest       Gibson (1976), Mickey S. Brown (1977), Arthur Thompson       (1978), James H. Ivory (1979-1981), Walter R. Bauldrick, Sr.       (1981), Clarence R. Lewis (1982-1984), Robert L. McMillian       (1984-1986), Harold W. Kelly (1986-1988), Fred L. Miller       (1998-1990), Roland E. Wesley (1990-1992), George A. McCrowey       (1992-1994),…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…graduating from Minnesota's own Hennepin Vocational Technical  Education Center, Nelson began his career with the International Union  of Painters and Allied Trades (IUPAT) in 1982.\n\nIn 1992, Nelson began the first of numerous leadership roles, when he  was elected as a trustee for the Minneapolis Painters Health and  Welfare Fund and the Minneapolis Painters…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to Loudoun County Combined Fire and Rescue System.\n\nBeloved in our Loudoun County community, Chief Johnson is a fourth- generation firefighter who began his fire service in 1982. His career  led him to the Fairfax County Fire and Rescue Department where he  ascended to the rank of deputy chief in 2009.\n\nAfter 30 years in Fairfax County, Chief Johnson…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…work on the film.\n\nWhile this is Paul's first win at the Oscars, he was also nominated  for costume design in the 2022 film adaptation of the ``West Side  Story.''\n\nPaul, a 1982 Buchtel High School graduate, proudly acknowledged  during his acceptance speech that he is the first Black man to win an  Oscar for costume design, to a resounding crowd and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688615/recognizing-paul-tazewell"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…1975, as the Service League of Arlington with  45 charter members, the organization was officially welcomed into the  Association of Junior Leagues International on February 22, 1982,  becoming the 248th Junior League and adopting the name Junior League of  Arlington. Since that time, JLA has remained steadfast in its mission  to advance women's leadership…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…beginning had there been a  consistent survey, saving that company money.\n\nThis is not new. The Bureau of Ocean Energy Management has had  guidelines on marine archeology since 1982, and since have been updated  during administrations from both parties to create greater consistency  and predictability for everyone involved.\n\nThese rules have stood for 40…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…comedy  than any politician of his day. He used to say: If you have politics in  your bloodstream, only embalming fluid will replace it.\n\nI am living proof that he was right. In 1982, I decided to run for  the U.S. House of Representatives for the first time. This was after I  lost three straight elections. My wife said this is my last chance. So  I took…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…it might come  as a shock that Social Security has not been adjusted in more than 54  years.\n\nWhat do I mean by that? Some would argue that Social Security was  adjusted in 1982 under Tip O'Neill, Ronald Reagan, and Bob Dole.  Indeed, it was addressed, but Ronald Reagan wanted to privatize Social  Security. Bob Dole, a Senate Republican, said no, that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Defense  rightly wants to actually sign.\n\nWe should keep the cost and value of America's own commitment to the  transatlantic alliance actually in perspective. Take the year 1982-- right in the thick of the Reagan buildup that won the Cold War. In  fiscal 1982, sustaining U.S. military operations in Europe accounted  for less than 6.5 percent of defense…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…President of WVLT-TV in Knoxville,  Tennessee.\n\nIn addition to an Emmy Award, Wayne has earned a number of accolades,  including Ohio Valley Conference (OVC) Coach of the Year in 1982, OVC  Hall of Fame Inductee in 2004, MSU Athletic Hall of Fame Inductee in  1995, the 2017 MSU Distinguished Alumni Award, and most recently, the  MSU Founders Award for University…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…tireless efforts of local advocates like Bev  Fitzpatrick and the dedicated team at the Virginia Museum of  Transportation, the 611 has undergone two major restorations, in 1982  and again in 2014, and it continues to operate as a living monument to  our railroading past.\n\nNamed a National Historic Mechanical Engineering Landmark in 1984,  designated…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and economic development throughout Pennsylvania's 15th Congressional  District.\n\nAfter receiving a master's degree in public administration from Penn  State in the summer of 1982, Stan began his career in Titusville,  Pennsylvania, where he worked as the assistant director of the  administration of the Titusville Redevelopment Authority.\n\nFor 5 years,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697251/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…volunteer organizations. For twenty-two years he was a board member of  the Rockdale Fair Association, as well as the Goat Superintendent and  Vice-President of Fiscal Affairs. In 1982, he joined the Rockdale  Knights of Columbus, serving as Columbus Club treasurer for 18 years  and spending significant time as a Crew Leader. Since 2012, Danny has  served…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…trustee area 1 as a board member for 11 terms.\n\nKathy was born in Huntington Park, California, later moving to Mono  County with her husband and three children from Whittier.\n\nIn 1982, Kathy began her service on the Mono County Board of  Education to fulfill her mission of providing what she described as a  ``good solid education'' to the students of her…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Vocational Technical School, serving as a Junior  Firefighter, and achieving the rank of Eagle Scout, Alan has always  demonstrated a deep commitment to public service.\n\nIn 1982, Alan became an Active Member of the Plumsteadville Volunteer  Fire Company. Just three years later, he took on leadership roles both  as Recording Secretary and First Lieutenant.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, today, I rise to celebrate the North  County Food Pantry in rural Elk, Washington.\n\nNestled between the pristine forests and recovering farmland, this  small 1982 mobile home has nourished hundreds of families in body and  soul for decades.\n\nThe pantry does far more than provide food. It offers connection,  dignity, and a true sense of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…additional 4.2 million hours of paperwork  burdens on schools pulling teachers and administrators away from what  matters most--the students.\n\nPresident Reagan said back in 1982, and President Trump has recently  echoed, that we need to turn the schools back to the States and to the  local school districts. President Reagan rightly noted that `` . .…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…event of a conflict between the       deadline described in subsection (a) and a deadline under       section 115(h) of the Federal Oil and Gas Royalty Management       Act of 1982 (30 U.S.C. 1724(h)) or section 525(b) of the       Surface Mining Control and Reclamation Act of 1977 (30 U.S.C.       1275(b)), the deadline described in subsection (a) shall…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…together with their children Harper,  Hadley, and Haylyn, represent the very best of Florida agriculture.  Their family has carried forward a proud legacy of fanning that began  in 1982 when Jennifer's grandfather, Mr. Joe Bundrick, established  their beekeeping operation. Today, with the guidance of Mr. Bundrick  and the leadership of Jennifer's father, Ken,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695268/congratulating-the-tomlins-the-2025-okaloosa-county-farm-family-of-the-year"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…him, including the Man of the Year Award  from the Dauphin County Teenage Republicans in 1971, a Resolution of  Recognition from the Black Republican Council of Pennsylvania in 1982,  and a Presidential Award from the IMC of Greater Harrisburg in 2012.\n\nMr. Speaker, I am honored and privileged to recognize Mr. Stanley R.  Lawson, Sr. for his tireless, dedicated,…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…City, Florida, Joe was raised by his loving  parents, Rylon and Gail. He was active in church and sports,  demonstrating a commitment to faith and teamwork from a young age.\n\nIn 1982, he married Stacy, his lifelong partner, and together they  built a beautiful life, raising three wonderful sons, Patrick, Timothy,  and David.\n\nJoe earned a business degree…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…which are not part of the U.K. law and operate as  informal bodies. The number of sharia courts in Britain has grown to 85  since they first began operating in the country in 1982.\n\nPolls have found that 41 percent of the British public believe that  Muslim immigrants have had a negative impact on the United Kingdom.  Nearly half think that Muslim women…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…With his wife Marion right beside him, he has served the Huntsville  community in various capacities for over 30 years that included  Huntsville school teacher from 1978 to 1982, Deputy Director of  Education Service Center Region 6 from 1968 to 1982, owner of Wagamon  Printing that was opened in 1981, and Walker County Judge from 1994 to  2002.\n\nAs…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}]