[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…also take action against another poison of  our age, that of rampant gun violence.\n\nAustralia is no stranger to gun safety legislation. They famously  took strong action in the 1990s, so gun violence plummeted. Yesterday,  Australia's Prime Minister said the country will take another look at  their gun safety laws and see where they can make improvements.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of Newark Airport  have experienced increasing delays and disruptions. Airlines are  canceling flights. There is a shortage of air traffic controllers. They  are relying on 1990s technology in 2025. One Newark air traffic  controller even said that flying into Newark is ``not safe.''\n\nKeeping the flying public safe and our national air space efficient…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690645/faa"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…birthday book contains another photo of Mr. Epstein holding an  oversized novelty check from D.J. Trump for $22,500. What is that check  for? Underneath the photo taken in the 1990s, a handwritten note says:\n\nJeffrey showing early talents with money and women! Sells       ``fully depreciated''--\n\nAnd then there is a name of a woman who has been blocked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…law, which has allowed us to make steady progress to reduce air  pollution in our country.\n\nYes, in many places we are breathing cleaner air today than we were  in the 1970s or 1990s, but that improvement is not guaranteed to be  maintained if we start to chip away and backslide.\n\nThis resolution puts our previous progress in serious jeopardy, and  the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…appropriators. There were 25 million  people's lives saved, but we are saying the alleviation of poverty and  the eradication of disease is no longer the point. They did this in the  1990s, too, when they took control of the House. Do you know what they  did? They opened the door for China and Russia to go into these  countries, have geopolitical victories funded…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693708/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…grossly misunderstand and mischaracterize the sacrifices veterans and  their loved ones have made in service to our Nation. The VA  should learn from its past, when in the 1990s, GAO found that VA- insured homes foreclosed upon was the most expensive option, costing VA  an average of $25,387, which is the equivalent of $65,038 today. While  past policies…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…DuVernay shifted  roles and began working behind the camera.\n\nIn 2008, Ava DuVernay released her first documentary, This Is the  Life, about the rise of alternative hip hop in 1990s Los Angeles. Then,  in 2010, she debuted her first narrative feature film, I Will Follow,  which showed a woman's heartache after the passing of a dear relative.  DuVernay's…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…``Celebrity  Jeopardy!'' It is a pretty cool thing. Not only did he win ``Celebrity  Jeopardy!'' but as a constituent who has lived in my district in  Oakland, California, since the 1990s, he has consistently given back  philanthropically to young people and underserved communities, again  for almost 30 years.\n\nAfter winning ``Celebrity Jeopardy!'' just recently,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690855/thanking-w-kamau-bell-for-his-generous-donation-to-oakland-schools"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…has declined from more than 18,000  to fewer than 5,000.\n\nThe biggest banks have been the beneficiaries of this consolidation  because they have grown even bigger. In the mid-1990s, the 20 biggest  banks in this country held a total of 15 percent of all bank assets-- the 20 biggest had 15 percent of all the assets.\n\nToday, the top 20 hold more than 65…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Representatives to rival the General National Congress as       Libya's legislative body.\n\nHaftar, a former close Qaddafi confidant and commander who       fled to the U.S. in the 1990s to begin orchestrating efforts       to oust his ex-ally, emerged as a powerful military figure in       support of the House of Representatives. As head of the       Libyan…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…bring it  up because I didn't want to embarrass her, but she was one of the three  finest students I ever had in constitutional law. She was a straight-A  student in the early 1990s. She is a straight-A student in the 21st  century. I am proud not only that she was my student but that she is my  friend and that she is my colleague. She doesn't disgrace…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, I rise to strongly oppose H.J. Res. 24. It  is baffling to me that amidst skyrocketing electricity costs, the  highest they have been since the 1990s, we are talking about  overturning commonsense energy efficiency standards.\n\nEconomists predict these standards would save American taxpayers  billions of dollars. Mr. Speaker,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689261/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…the American Dream.\n\nAlicia was born in 1961 in Durango, Mexico, and made the brave  decision to immigrate to the United States in search of the American  Dream.\n\nIn the early 1990s, Alicia earned her certification as a certified  nurse assistant.\n\nToday, 30 years later, Alicia continues to serve her community at  French Park Care Center, where her impact…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…approved it anyway, and I know the gentleman  from Kentucky (Mr. Barr) did what Trump wanted him to do.\n\nWe already have enough megabanks with too much corporate power. In  the mid-1990s, the 20 largest banks held 15 percent of all bank assets.  Today, they hold more than 65 percent of all bank assets. The four  largest megabanks hold more assets than the next…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Trump's one big, ugly bill is all about.  It is an assault on everyday Americans to reward billionaires with  massive tax breaks. That is extraordinary.\n\nPresident Clinton in the 1990s talked about the Children's Health  Insurance Program, a program designed to make sure that children in  this country would have access to the medical care they needed to live…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…the demand; it was just  going to increase the demand for meth to come across the southern  border, and that is what happened. They created trade routes.\n\nThen along came the 1990s and unrelated to methamphetamine, we had a  lot of big drug companies and some bad actors, who decided they were  going to make more money by doing a lot of stuff they shouldn't…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…them out. Wind and solar  technologies have less overhead, longer lifespans, and higher profits  than they did when these credits were introduced nearly 30 years ago in  the 1990s.\n\nFor example, the cost of solar has decreased more than 80 percent  since 2010. Truly, the market is more than capable of supporting  continued growth without subsidies.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…counties with large swaths of Federal  forest land have received a share of Federal timber harvest revenue on  Federal land. Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber harvesting, litigation, and  misguided environmental regulations, has drastically affected county  revenue, creating very real economic…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…an unwavering commitment to  transparency, efficiency, and service to the people of her community.\n\nKarry Hepting began her career in St. Clair County government in the  late 1990s, rising through the ranks with a reputation for diligence  and fiscal expertise. She served in various key financial leadership  roles before being appointed County Administrator,…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696497/commending-karry-hepting-for-her-exemplary-leadership-and-dedication-to-st-clair-county-michigan"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…for schools, roads, and other essential  needs.\n\nTimber harvesting in the national forest system reached its peak in  the late 1980s, then dramatically declined in the early 1990s. This  decline led to significantly reduced payments to counties, notably  impacting rural schools. This trend continued throughout the decade,  and harvesting levels have…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…powerful interest group to represent them in  the halls of power.\n\nLet me tell you what 30 years of so-called free and fair trade has  meant for the folks where I am from.\n\nIn the 1990s, our political class embraced a new line of thinking:  that America could become more prosperous by opening all trade barriers  regardless of how other countries treated us.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…what are we going to do now; but it  wasn't in the late 1970s as George Gilder documented.\n\nHere we are today. We did do a little bit of looking at the welfare  programs in the 1990s under Bill Clinton, but we didn't go anywhere  near far enough.\n\nBy the way, George Gilder made another observation. When we talk  about the welfare state, it obviously affects…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…tried to count the number of  Federal criminal laws that reside within the code and estimated there  are ``about 3,000 criminal offenses.'' The American Bar Association, in  the 1990s, said it was much higher than 3,000 but couldn't figure out  the number. In 2019, the U.S. Code was estimated to have 5,199 Federal  crimes, but again, that was uncertain.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…demand for critical resources like  drinking water.\n\nRight now, nearly 40 percent of the Las Vegas Valley's water is  carried through a single pipeline that was built in the 1990s. That is  a huge vulnerability. If that line goes down, whether for repairs or  due to an outage, the entire region could face a water supply crisis.\n\nThe Southern Nevada Water…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…happening, how do we  finance this government? It is mostly individual income taxes.\n\nNow, for someone who says: Well, it should be corporate. Remember, in  the late 1980s, early 1990s, all across the country we were moving to  LLCs, professional partnerships, pass-through entities, so much of what  you would have seen back in the early 1980s, 1970s, 1960s…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…most of the tax cuts. They  campaigned on balancing the budget and cutting spending, and never do  it, ever, in the history of ever, with the possible exception of the  late 1990s when the Gingrich Republicans, combined with Clinton and, by  the way, a dot-com economic explosion, to deliver us a balanced budget.  They did it through welfare reform and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…rare earth elements. We developed the technology  to refine rare earth elements, to produce magnets that are critical in  our economy and to our national security.\n\nBy the late 1990s, most of that industry, especially refining, went  overseas. This trend has led us to where we are today. The United  States is now almost 100 percent import reliant on a dozen…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…was sold by the Indian allottee to a logging company for $60,000  in the 1960s. The logging company faced legal challenges by the U.S.  Fish and Wildlife Service in the early 1990s. In 1996, the Trust for  Public Lands purchased Allotment 1157 and sold it to the U.S. Forest  Service for $3 million. The Forest Service currently manages the land.\n\nThe Quinault…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697703/quinault-indian-nation-land-transfer-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…court. He was  threatening to have half the country secede, which, of course, drags up  memories we should never forget about the war and the genocide in those  countries in the 1990s in which many Bosnian Iowans lost family.\n\nWell, I am glad that he has since complied with the court ruling by  stepping down from his position as leader of the RS entity and…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696528/bosnia"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bond markets that we are serious about taking on our debt  and deficit.\n\nMr. Speaker, have you ever heard the term ``bond vigilantes''? It  happened to the United States in the 1990s where, suddenly, we were  making the bond markets cranky. They were starting to demand premiums.  Our debt was a fraction of a fraction of a fraction of what it is  today.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}]