[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Von  Humboldt Elementary School and Roberto Clemente Community Academy.\n\nRooted in the community that raised him, Billy served as the 26th  Ward alderman for 16 years, from 1993 to 2009, where he championed  major infrastructure and community development projects, including the  creation of Division Street's signature Puerto Rican flags, the  McCormick…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…wouldn't have covered all of the surgeries,  specialists, and the equipment that Olivia needed to thrive.\n\nHowever, gratefully for our family, the Washington State legislature  in 1993 voted to expand Medicaid. Washington was one of the first  States in the country to lead that charge. For us  that meant that we didn't have to worry about losing our house…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688135/republican-budget-betrayal"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…develop early detection tests for prostate cancer. Because  of these tests and other treatment breakthroughs, we have seen a  decrease in the death rate from prostate cancer. From 1993 to 2022, it  dropped by one-half--significant progress.\n\nThat is why we need research dollars to save lives. Similarly,  Washington State University researchers actively test…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Kazakh government doubled-down on its  commitment to global peace, security, and nonproliferation by becoming  a party to the Treaty on Non-Proliferation of Nuclear Weapons in 1993,  a member of the International Atomic Energy Agency in 1994, and a  cosigner of the Comprehensive Nuclear Test-Ban Treaty in 1996.\n\nMeanwhile, in partnership with the United…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…athletes for their dedication, their teamwork, and their  perseverance.\n\nThis year's championship marks South Side's second State title in  program history and its first since 1993, a testament to the strong  foundation built by players and coaches over many, many years.\n\nI congratulate the Cyclones on their remarkable victory. They have  made Rockville…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698103/congratulating-south-side-high-school-girls-volleyball-team"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…worker.\n\nIn 1977, Ms. Brugger ran for the Ontario-Montclair School District  board. She served on the board for 16 years before joining the Chaffey  College Governing Board in 1993. Under her leadership, Chaffey College  championed the expansion of the college from one to three campuses, the  opening of the Industrial Technical Learning Center, and the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Speaker, today, I introduce the District of Columbia  Non-Discrimination Home Rule Act of 2025, which would end the  applicability of the Religious Freedom Restoration Act of 1993 (RFRA)  to the District of Columbia government. This bill would treat the D.C.  government in the same manner as state governments under RFRA, and  allow D.C. to protect LGBTQ+…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692151/introduction-of-the-district-of-columbia-non-discrimination-home-rule-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…haven't heard our esteemed chair of the Committee on Oversight and  Government Reform complain about the laws in Kentucky. In fact, under  the National Voter Registration Act of 1993, States cannot set a voter  registration deadline for Federal elections more than 30 days before an  election.\n\nIn closing, Mr. Speaker, as I mentioned here today, no matter…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Trump  economy.\n\nThe nonpartisan Tax Foundation has said that under the watch of Trump  and Republicans, the U.S. has had the largest tax increase as a percent  of GDP since 1993 because of tariffs.\n\nThese tariffs are a tax on the U.S. and Americans. They are  estimating that U.S. households are paying a thousand dollars more in  2025, and it is going…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…before them.\n\nI mentioned Hattie Canty--I stand on her shoulders to this day.\n\nI spent a decade leading the Culinary Training Academy of Las Vegas  that she helped found in 1993.\n\nIt trains thousands of people every year with vocational skills that  help local youths, adults, and displaced workers find work in the  hospitality industry.\n\nThe spirit…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…for nuclear weapons programs to be used  for addressing the climate crisis and human and infrastructure needs,  such as housing, health care and restoring the environment.\n\nIn 1993, District of Columbia peace activists were successful in  getting a ballot initiative in D.C. passed that called for nuclear  disarmament. Since then, I have introduced a bill…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688575/introduction-the-nuclear-weapons-abolition-and-conversion-act-of-2025"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Tarrant County College before beginning a distinguished  career that spanned several decades. Sharon worked with unwavering  commitment at Standard Meat Company from 1979 to 1993 and then with  Tarrant County MHMR from 1993 until her retirement in 2014.\n\nSharon's faith was an integral part of her life. She was baptized at  an early age and remained a…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…mutually beneficial, strategic, and economic relationship between the  United States and the Pacific Island countries.\n\nThe treaty was entered into force in 1988, was extended in 1993, and  then again in 2002. Most recently, the parties began renegotiating the  treaty and its annexes in 2009 and reached agreement in 2016.\n\nThe bill today proposes adjustments…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691005/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…employees, budget cuts and proposed relocation of federal agencies, as  well as the continued prevalence of remote and hybrid work, this bill  is especially important.\n\nIn 1993, Congress created the national empowerment zone program to  encourage investment in low-income communities and delegated to federal  agencies the authority to designate communities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697733/introduction-of-a-bill-to-designate-the-district-of-columbia-as-an-empowerment-zone"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…has imposed  will amount to an average tax increase of $1,200 in 2025 and $1,600 in  2026 per household and represent the largest U.S. tax increase as a  percent of GDP since 1993.\n\nMr. Speaker, not only are Trump's policies raising prices for  everyone, they are killing American jobs. Although he campaigned on  bringing back manufacturing to the United…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…from his career in public education, closing  a chapter marked by educational leadership, unwavering support for  students, and dedicated service to his community.\n\nIn August 1993, Principal Kern began his career in education as a  Music Teacher at Maple Point Middle School. Six years later, he rose to  the challenge of administrative leadership, serving…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Angeles--School of  Public Health where he received his Master of Public Health degree. He  also attended UCLA Anderson School of Management's Health Care  Executive Program.\n\nSince 1993, Jeffrey and his colleagues at the Association of Asian  Pacific Community Health Organizations have dedicated their time and  energy to promoting advocacy, collaboration, and…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, since 1993, Congress has adopted a  resolution to recognize this third week of October as National  Character Counts Week, and, of course, we are in that week right now.\n\nAs Iowa's senior…", "date": "2025-10-20", "source_url": "https://justfacts.votesmart.org/public-statement/1696289/national-character-counts-week"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…actors  present themselves to our communities, Craig has run toward them and  worked swiftly with his fellow marshals to remove these criminals from  the streets.\n\nIn August 1993, a convicted marijuana grower walked into the Frank  Carlson Federal Building in Topeka, Kansas, for his sentencing. What  was a normal day in Topeka suddenly turned into gunfire…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…decades ahead of their time--earning a reputation for building the  ``Cadillac of Firetrucks.''\n\nThough Young Fire closed in 1991, Dick's passion for innovation never  waned. In 1993, he launched the Performance Advantage Company in  Lancaster, which continues to design and distribute tool and equipment  mounting solutions for the fire service, military,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…2nd Infantry Division in  Korea, or a tank company supporting the Armor School at Fort Knox,  Kentucky. Neither choice was a desirable option, so he chose to retire  and in 1993. he moved to Anniston, Alabama, to work at Fort McClellan.  However, he had no intentions of ending his service to the United  States. Here, he was responsible for running the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…today in memory of  Congressman Richard T. ``Dick'' Schulze, who died on December 23 at the  age of 96.\n\nCongressman Schulze represented the Philadelphia suburbs from 1975 to  1993 in the people's House. He was the driving force behind designating  historic Valley Forge, Pennsylvania, a national park.\n\nDick was the ranking member of the House Ways and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…National Telecommunications and Information Administration       Organization Act is amended by striking ``$17,600,000 for       fiscal year 1992 and $17,900,000 for fiscal year 1993'' and       inserting ``$57,000,000 for fiscal year 2025 and $57,000,000       for fiscal year 2026''.\n\n(b) Under Secretary of Commerce for Communications and       Information.--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Mr. Speaker, pursuant to House Resolution 294, I call up  the bill (H.R. 22) to amend the National Voter Registration Act of 1993  to require proof of United States citizenship to register an individual  to vote in elections for Federal office, and for other purposes, and  ask for its immediate consideration.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…recommit.\n\nSec. 4.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 22) to amend       the National Voter Registration Act of 1993 to require proof       of United States citizenship to register an individual to       vote in elections for Federal office, and for other purposes.       All points of order…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…President  Clinton, Governor of Iowa Terry Branstad, and members of the Iowa  congressional delegation to tour catastrophic flood damage in my home  State. The great flood of 1993 ravaged nine States in America's  heartland.\n\nThis reminds me of a poster we in the Midwest showed at that  particular time, and I was hoping I could round it up and show it…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…opportunity that Bobby first developed his passion for the political  arena, an opportunity he contributed to his later years of service to  Florida's agricultuie industry.\n\nFrom 1993 to 2000, Bobby served as President, Vice President, and  Director of the Orange County Cattlemen's Association. It was  during this tenure that he also began serving on the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…always had an effective game plan, and he used  it to move up the ranks quickly in the television news industry. He  served as President and General Manager of WKYT-TV from 1993 to 2013,  where he expanded news programming and earned Lexington's first Emmy  Award for station excellence. He was also promoted as Regional Vice  President of Television…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…recommit.\n\nSec. 4.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 22) to amend       the National Voter Registration Act of 1993 to require proof       of United States citizenship to register an individual to       vote in elections for Federal office, and for other purposes.       All points of order…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…energy  resources as part of an all the above energy strategy.\n\nI am proud to be the original author of the wind production tax  credit. When Congress enacted that credit in 1993, less than one-tenth  of 1 percent of U.S. electricity production came from wind. Today, it  is over 10 percent. And in my home State of Iowa, it is over 60  percent. Wind development…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}]