[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…His leadership has left a lasting mark  on both the Orthodox world and the entire global community.\n\nThis will not be his first visit to the United States. When he came  in 1997, he was received in the Oval Office by President Bill Clinton  and First Lady Hillary Clinton, who hosted a White House reception in  his honor. He was also presented with the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…on his eighth Apostolic trip  to our country during which he will receive the prestigious Templeton  Prize for his environmental advocacy.\n\nThe ``Green Patriarch's'' landmark 1997 speech in Santa Barbara--in  which he first posited the notion of ecological sin--is striking for  how revolutionary it was then, and how prescient it remains today. In  particular,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695502/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…have your own opinion, but you can't own the  facts. Far from defying Federal law, courts have actually upheld  sanctuary laws and policies. I will reference just one. In a 1997  ruling in Printz v. United States, Justice Scalia wrote:\n\nThe Federal Government may neither issue directives       requiring the States to address particular problems, nor…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…moral failing. His leadership reminds us that  stewardship of our planet is inseparable from justice for our  communities.\n\nHis leadership has been honored across the world. In 1997, he  received the Congressional Gold Medal here in the United States, and he  has been recognized internationally as one of the most influential  figures of our time. Yet the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…role he  continues to embrace.\n\nHis relationship with the United States is long and distinguished. He  received the Congressional Gold Medal from President Bill Clinton in  1997 and has since met Presidents George W. Bush, Barack Obama, and Joe  Biden, as well as other U.S. leaders, in recognition of his  contributions to global peace and understanding.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…has remained  steadfast in his mission to promote reconciliation, environmental  stewardship, and human dignity.\n\nHis contributions have been recognized around the globe. In 1997, he  was awarded the Gold Medal of the United States Congress. The Guardian  identified him as one of the world's foremost leaders in raising  environmental awareness. And Time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…learn from Patriarch Bartholomew's example. Over the past 36  years, Patriarch Bartholomew has sought to build relationships across  faith traditions, cultures and borders. In 1997, Patriarch Bartholomew  was the first Eastern Orthodox Patriarch to denounce the great horror  and evil of the Holocaust. He has traveled to Muslim-majority countries  to foster…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…Parliament, and the World Economic Forum, earning accolades from around  the world. In recognition of his global contributions, he received the  Congressional Gold Medal in 1997. In September 2025, Patriarch  Bartholomew will travel to the U.S. to receive the Templeton Prize, one  the most prestigious awards recognizing those who use the power of  science…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…been welcomed by presidents and prime ministers around the  world, addressed the European Parliament and the U.S. Congress, and was  awarded the Congressional Gold Medal in 1997. In September 2025, he  will return to the United States to receive the Templeton Prize--the  world's most distinguished award at the intersection of faith and  science.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents serving sentences for D.C. Code felonies in BOP  facilities within 250 miles of D.C. Under the National Capital  Revitalization and Self-Government Improvement Act of 1997, individuals  serving sentences for D.C. Code felonies are in BOP custody.\n\nCurrently, more than 2,000 D.C. residents are serving sentences for  D.C. Code felonies, and they…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690140/introduction-of-the-improving-reentry-for-district-of-columbia-residents-in-the-bureau-of-prisons-act-of-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…in championing environmental stewardship and has  organized several international summits to address ecological issues.  His accolades include a Congressional Gold Medal in 1997, recognition  from The Guardian as one of the world's leaders in raising  environmental awareness, and recognition from Time Magazine as one of  the world's most influential…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…a yard  recognizes his scholarly contributions in exploring the intersection of  faith and the natural world. Past recipients include Mother Teresa and  the Dalai Lama.\n\nIn 1997, he was awarded the Congressional Gold Medal in recognition  of his contributions to the United States. His efforts have fostered  dialogue among Christians, Muslims, Jews,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…money.\n\nBut then what happened? I will tell you. For 22 years, it worked  pretty well. Then along comes the Gingrich revolution, the 1994  election. Now we have the 1995 through 1997 biennium. Some things  happened then that, well, one maybe couldn't have foreseen. Maybe they  could have. There was an effort to do a balanced budget amendment. It  fell one…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…protections.\n\nThrough the tireless work to promote international peace and  religious tolerance, His All-Holiness was awarded the Gold Medal of  Congress during his visit in 1997. During this current visit to the  United States, His All-Holiness will receive the Templeton Prize, the  prestigious award honoring contribution in religion and science.\n\nI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695410/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…and the environment, he stated, ``compose a  seamless garment of existence, a multicolored cloth, which we believe  to be woven in its entirety by God.'' The world, he told a 1997  conference of environmentalists in Santa Barbara, California, ``is not  ours to use for our own convenience. It is God's gift of love to us,  and we must return his love by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…concluded that       where an RMP designates use by non-agency parties in the       areas it governs, it has a substantial effect.\\49\\ For       instance, in B-275178, July 3, 1997, we reached this       conclusion by noting that the Forest Service's RMP provided a       ``management prescription'' giving general direction on what       may occur within…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…diabolical war against a sovereign and independent  country--Ukraine.''\n\nThe Ecumenical Patriarch is a figure who has addressed the European  Parliament and the U.S. Congress (in 1997 when he received the  Congressional Gold Medal), and has met Heads of State in Great Britain,  Canada, South America, Greece, Russia, Norway, Finland, Serbia,  Romania, Bulgaria,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…as president.\n\nCathi dedicated her life's work to promoting and defending the  sanctity of life, traditional marriage and families, and religious  freedom.\n\nShe joined CAP in 1997, shortly after its founding, as legislative  counsel. Upon retirement of CAP's founder, Len Munsil, in 2005, Cathi  assumed the role of president and has since been a force…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690597/congratulating-cathi-herrod-on-retirement"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…activities that non-agency parties may engage in on public       lands substantially affect the rights or obligations of those       parties. For example, in B-275178, July 3, 1997, we concluded       that a Forest Service Land and Resource Management Plan       substantially affected non-agency parties because it       described the uses and activities…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…worker, often as the only woman in her  division. Her service took her across the world, including to the  Persian Gulf and multiple international ports. She departed the Navy in  1997. During her service she earned the National Defense Service Medal,  Armed Forces Expeditionary Medal, Sea Service Medal Deployment Ribbon  three times, and the Good Conduct…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…two business parks, two multitenant  buildings, a revolving loan fund program, $2.9 million in housing  rehabilitation programs, and the Philipsburg Main Street Program.\n\nIn 1997, the organization was named Agency of the Year by the  Pennsylvania Economic Development Association, in recognition of its  outstanding accomplishments for the region.\n\nMadam…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697251/9999"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…world leaders who commands such high-level access to  the leadership of our Nation.\n\nThe U.S. Congress expressed its profound respect and admiration for  His All-Holiness in 1997 when it awarded him the Congressional Gold  Medal, Congress' highest honor. This distinguished award has been  bestowed upon such luminaries as George Washington and Winston…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Carter", "party": "Republican", "sentence": "…with a Congressional Veteran Commendation. His life and  career are a testament to his exceptional character and unwavering  commitment to service.\n\nOn active duty from 1973 to 1997, Lt. Col. Smith served in various  locations around the globe, including Quantico, London, Brussels, Hong  Kong, Australia, and Turkey. In 1990, Lt, Col. Smith was deployed…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…exposure to  COVID-19.\n\nMy good friend from Maine Senator Susan Collins now holds the baton,  as she continues her unbroken voting streak since she was sworn into  office in 1997.\n\nDuring the 116th Congress and now the 119th Congress, I am honored to  serve as Senate President pro tempore. From this leadership position, I  open the Senate daily, lead…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…consistently concluded that       where an RMP designates use by non-agency parties in the       areas it governs, it has a substantial effect. For instance,       in B-275178, July 3, 1997, we reached this conclusion by       noting that the Forest Service's RMP provided a ``management       prescription'' giving general direction on what may occur       within…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…intertwined with the economic  vitality of Warren County, Pennsylvania. Since 1989, he has served in  some capacity with the Warren County Chamber of Business and Industry.\n\nSince 1997, he has led the WCCBI as president and CEO. He also serves  as executive director of the Warren County Development Association.\n\nJim is a native son of Warren County and a 1975…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…concluded that       where an RMP designates use by non-agency parties in the       areas it governs, it has a substantial effect.\\52\\ For       instance, in B-275178, July 3, 1997, we reached this       conclusion by noting that the Forest Service's RMP provided a       ``management prescription'' giving general direction on what       may occur within…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Parade.\n\nThis prestigious role is made even more special as Jay follows in the  footsteps of his father, James F. ``Jimmy'' Burke, Jr., who led the  same parade 28 years ago in 1997.\n\nTheir legacy is a testament to the deep tradition of this event, one  of America's oldest and grandest St. Patrick's Day celebrations.\n\nJay has long been a dedicated leader…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688723/patricks-day-parade"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…is war against religion,'' Patriarch Bartholomew has built  strong relationships with religious and political leaders in every  continent to promote unity among faiths.\n\nIn 1997, Patriarch Bartholomew became the first Ecumenical Patriarch  to visit the United States, and it is our great pleasure to welcome him  back as he meets with the President, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…in Brainerd,  Minnesota.\n\nFor over 30 years, Mac has been the trusted voice of the Brainerd  Lakes Area. He began on the Power Loon in 1992, advanced to morning co- host in 1997, and for 25 years partnered with his friend Danny Wild-- until Danny's passing in 2025.\n\nSince 1994, Mac called play-by-play for Brainerd Warriors sports,  covering over 2,000…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}]