[{"senator": "Grace Meng", "party": "Democrat", "sentence": "…justice.\n\nThere is a long and storied history of solidarity between the Black  community and the Asian American, Native Hawaiian, and Pacific Islander  communities.\n\nIn the 19th century, Frederick Douglass spoke out against the racist  Chinese Exclusion Act and used his voice to advocate for Asian  immigrants who wanted to earn the right to become U.S.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688013/standing-with-cbc-in-shared-fight-for-equality-and-justice"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…disease and mental health management. While these chronic diseases are  common, they are also manageable if we just do everything that we can  to improve access to care.\n\nIn my 19th Congressional District on the central coast of California,  the number one thing I hear about from constituents is access to  healthcare or, I should say, the lack of access…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…my family fought tooth and nail to be able to exercise that sacred  right.\n\nHistory may not repeat itself, but it sure does rhyme.\n\nMy great-grandfather, at the turn of the 19th century, in the name of  making sure that citizens voted and election integrity, had to take a  literacy test and find three White men to vouch for his character. He  got all…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699947/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…blatant  voter suppression.\n\nMs. WILLIAMS of Georgia. Mr. Speaker, voter suppression by any other  name is still voter suppression. This resolution violates the 14th  Amendment, 19th Amendment, 24th Amendment, and every tenet of a free  and inclusive democracy.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this disgrace of  a voter suppression resolution.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689998/safeguard-american-voter-eligibility-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…his desire for regime change in Venezuela. That  should not be happening. That is not the policy that we should be  headed toward. We shouldn't be wanting to go back to the 19th century  where powerful countries simply took what they could, and there was no  international law.\n\nI have a lot of things that I am concerned about. This bill, even if  we…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…our constituents after a disaster.\n\nI appreciate Mr. Murphy talking about his district in North Carolina  and the devastation that his constituents have experienced. In the 19th  Congressional District, I am at the edge of the continent as well, on  the west side of the continent, all the way across the country from Mr.  Murphy's district, but we, too,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…enthusiast, almost no one sees this treasure, which is one       reason its guardian, the American Numismatic Society, is       leaving the city where it was founded in the mid-19th       century--and moving to Toledo, Ohio.\n\nThe society announced today that it will be making a       ``strategic'' relocation to an Art Deco building on the       spacious…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…subcontractor if it       failed to use the aggregator's stablecoin. History       illustrates that when banks have entered commerce, such as       financiers did in the late 19th century during the       construction of railroads, manipulations led to frequent       economic shocks. Any stablecoin legislation should obligate       issuers to abide by…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "Mr. PANETTA. Mr. Speaker, I rise today to commend students across  California's 19th Congressional District who participate in the Day of  Silence. This is a day in which we highlight discrimination and  harassment of LGBTQ students in our schools all across…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690886/commending-leadership-of-bryce-grossman"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 19th time to call on  the Trump administration to restore funding for lifesaving food aid for  malnourished children.\n\nI am a father. I have a 3-year-old and 1-year-old at home,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…absolutely impacted people in the United  States of America. The idea that this has no impact on our citizens  doesn't matter. It just fails to recognize that it is not the 19th  century anymore. It is a globally connected world that impacts us.\n\nThe last argument I would make, Make America Great Again: We are  supposed to be the most compassionate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Americans living in more populous locations had access to  free home delivery for decades, rural Americans were still walking for  miles to retrieve their post at the end of the 19th century. In 1896,  the U.S. Post Office decided to try a new service in two counties in  West Virgina, free rural home delivery. In less than a decade, this  experiment was…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…efforts to break down lingering racial barriers.  Those efforts continue to this day.\n\nAnd our struggle to enfranchise and empower women did not end with  the  passage of the 19th Amendment. It continues to this day, as we strive  to give our daughters the same opportunities as our sons.\n\nThe confirmation of Justice Ketanji Brown Jackson to the Supreme…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…face today, including cyber threats and  the changing nature of warfare. The idea that protecting our immediate  surroundings will keep the American people safe is a dated, 19th  century idea that long ago became irrelevant.\n\nThis approach also risks taking our eye off the ball on other  critical challenges--like the one posed by China--while opening…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…history, the club has grown into the premier location for members to  enjoy organized social, intellectual, and artistic gatherings.\n\nOn May 21, 1925, just five years after the 19th Amendment guaranteed  women's suffrage, 400 women founded the Town & County Club as  Hartford's first private women's club. The club's first President, Miss  Anne Eliot Trumbull,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…Republican Party who helped champion women's rights and protections. It  was Republican Susan B. Anthony who led the suffrage movement. It was a  Republican Senator who sponsored the 19th Amendment to give women the  right to vote. It was a Republican Congress that approved it, and it  was a majority of Republican States that ratified it.\n\nIt was Republican Jeannette…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…families. As Leeds developed, so did agriculture and small- scale manufacturing that proved to be not only self-sufficient but also  the backbone of its economy. By the mid-19th century, improved roads  connected Leeds to other surrounding communities that made it a center  for agriculture and, eventually, recreation. Today, Leeds' natural  beauty has…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Charlie  Chaplin had just released a short silent film called ``Sunnyside,''  before talking pictures would be all the rage. In this very Chamber,  the House voted to send the 19th Amendment, giving women the right to  vote, to the States for ratification.\n\nToday, Mr. Speaker, I rise to celebrate the 106th birthday of someone  born that year, an American…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…foundation for a permanent community was  built in 1780 by a Wabanki known as Pierpole. Drawn by the rich natural  resources, other settlers followed, and at the dawn of the 19th  century, the town was established by Massachusetts Governor Caleb  Strong.\n\nThe rich soil supported prosperous farms and the fast-moving Sandy  River powered lumber and grain…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…thing.\n\nIt is important for the young people today that they know that there  is a strong number, it is a small number,  but a strong number of intellectuals going back to the 19th century,  actually even going back to the 18th century who are hostile to the  idea of having a man in the home.\n\nCertainly, there were people who felt this way during the French…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Washington Post; Beard, Katherine: Asahi       Shimbun; Beattie, Anita: Agence France-Presse; Beavers,       Olivia: Wall Street Journal/Dow Jones; Becker, Amanda: The       19th; Bedard, Paul: Washington Examiner; Bedford, Sarah:       Washington Examiner; Beggin, Riley: Washington Post;       Behrmann, Savannah: National Journal; Beinart, Matthew:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reversionary interest on  their land, which a railroad company originally conveyed. The  reversionary interest, which dates back to the days of the  transcontinental railroad in the 19th century, requires the land to  revert to ownership by the United States since it is no longer used for  railroad purposes. Because of this outdated encumbrance, the owners of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…100th birthday this  Thanksgiving Day, November 27, 2025.\n\nMr. Holland is a proud World War II veteran who enlisted in the  United States Army at just 18 years old. He spent his 19th birthday in  France, serving as a Staff Sergeant with the 381st Battery. He worked  as a powder man and also served in supply operations, roles vital to  our mission's success…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Sierra Nevada mountains and the  Central Valley of California for many thousands of years. Spanish  colonization devastated the Native population in the 18th century, and  the 19th century gold rush all but obliterated it. By 1913, the entire  Native population of California had plummeted from an estimated 310,000  down to just 17,000.\n\nIn the aftermath,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…refuge, and warmth for lumberjacks, hunters, fishermen, travelers, and  politicians traversing our rugged Pennsylvania Wilds.\n\nAs the logging and lumber industry flourished in the 19th century, so  did the hotel's significance. It hosted community meetings, business  affairs, social gatherings, and even served as a way station for  elected officials, becoming…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…and, indeed, directly  addresses it. Page 14, line 19 directs the States to create a process  for addressing this exact issue.\n\nMs. LEE of Florida. Mr. Speaker, ever since the 19th Amendment passed  over 100 years ago, married women have been registering to vote and  successfully voting. Indeed, I am among them.\n\nThis bill will accommodate women who change…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…into the  lives of the men and women who shaped the American West.\n\nThe museum brings history to life with exhibits that put visitors in  the shoes of miners during the late 19th and early 20th-century mining  boom. This includes exploring ``Hell Roarin' Gulch,'' a replica town  from the 1890s when Butte was known as the ``richest hill on earth.''  Guests…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700162/recognizing-the-world-museum-of-mining-in-butte-montana-in-celebration-of-americas-250th"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…stronghold for Maine's traditional lobstering sector. From its humble  beginnings to a booming fishing industry, Cutler remains a great pearl  of the State of Maine.\n\nDuring the mid-19th century, Cutler Harbor fostered substantial  growth in the town's fishing industry, lumber shipping, and small boat  operations. Known as the Harbor of Refuge, it became a safe…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699424/200th-anniversary-of-the-town-of-cutler"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…States Department of War.\n\nOver the years, Marines have been called by many nicknames, including  ``leathernecks'' due to the stiff leather collars worn in their 18th-  and 19th-century uniforms, which protected against sword slashes and  encouraged good posture; ``jarheads,'' which was initially due to the  appearance of their high-collared dress uniforms…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Corporation, the Permian Basin  Regional Planning  Commission, and the Texas Department of Transportation and their  commitment to making this vision a reality. On behalf of the 19th  Congressional District of Texas, I want to extend a heartfelt thank you  to all involved in this project for their dedication to our community.  God bless, and go West Texas.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692259/recognizing-the-groundbreaking-of-the-crossroads-business-park-in-big-spring-texas"}]