[{"senator": "Al Green", "party": "Democrat", "sentence": "…we are a GO for mission launch.'' We are a go for mission  launch.\n\nLet's go on. These are excerpts. I shall not read it all.\n\nThe next comment reads: ``1215et: F-18s LAUNCH (1st strike  package)''.\n\nThereafter: ``1410: More F-18s LAUNCH (2nd strike package)''.\n\nThereafter: ``1536: F-18 2nd Strike Starts--also, first sea-based  Tomahawks launched.''…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…is the  first time such a problem has been solved in a hypergraph setting.\n\nOwen Zhang, the son of Yunjing Ma and Geqiang Zhang, attends Bellevue  High School in Washington's 1st Congressional District, where he leads  the math club and competes in DECA events. Mr. Speaker, I ask my  colleagues to join me in celebrating Owen Zhang and this victory for…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688578/recognizing-owen-zhang-for-scientific-excellence"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…began commissioning as a  second lieutenant in the U.S. Army Judge Advocate General's Corps.  During the Vietnam war, he served as an assistant staff judge advocate  for the 1st Infantry Division, the legendary Big Red One, and later as  a staff judge advocate for the U.S. Army Support Command in Saigon.\n\nIn 1985, he was appointed assistant judge advocate…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693452/brigadier-general-donald-wayne-hansen-celebrates-92nd-birthday"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…state.\n\nMinnesotans are experiencing a coordinated violation of our civil  rights by the federal government. Journalists and protesters are being  arrested in violation of their 1st amendment rights to speech. The  right of protestors under the 2nd amendment to lawfully be armed in a  public space is being questioned by President Trump. DHS agents are…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I include in the Record the following  essay from Virginia's Fourth District Black History Month Essay  Contest--1st Place middle school contest winner, Augustus Rezba-Patel.\n\nWomen are 17 percent of active-duty U.S. military members       today. They serve in combat and leadership roles and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…names and  accomplishments of Filipino Americans, again from my Hawaii:\n\nDomingo Los Banos was Hawaii's first Filipino American       school principal and a loyal veteran of the 1st Filipino       Infantry Regiment that fought in the Philippines during World       War II.\n\nCarolina Dizon Wong broke a glass ceiling when she obtained       an M.D. degree…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Marcelino M. Gamino of Fresno were both killed in a  tragic vehicle accident while on deployment as part of Joint Task  Force-Southern Border.\n\nBoth were combat engineers with the 1st Marine Division at Camp  Pendleton, and both were far too young to be taken from their families,  friends, and fellow marines.\n\nIt is a terrible grief that these families now…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…and public servant, and I want to  acknowledge the profound positive impact she has had on community  health in her community.\n\nOn behalf of my constituents in New Hampshire's 1st Congressional  District, I thank Tess Kuenning for her selflessness and dedication to  the patients she serves. Her dedication to advocating for community  health centers has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…from around the globe and was selected as a Grand Award  Winner in the category of ``Technology Enhances the Arts.'' Anusha  Arora attends Interlake High School in Washington's 1st Congressional  District.\n\nMr. Speaker, I ask my colleagues to join me in celebrating Anusha  Arora and this victory for science education in Washington. Her work  demonstrates…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693893/recognizing-anusha-arora-for-scientific-excellence"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…headquarters to Kuwait in support  of Operations Freedom's Sentinel, Inherent Resolve, and Spartan Shield.  During her tour, she was dual hatted as the Deputy Commanding General  of the 1st Theater Sustainment Command and Commanding General of the  143rd Sustainment Command (Expeditionary). And was responsible for more  than 10,000 Servicemembers, Civilians, and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…leadership roles, including as a company commander of the Air  Naval Gunfire Liaison Company, commanding general for the 4th Marine  Division, and deputy commanding general of the 1st Expeditionary Force.\n\nHe is a distinguished graduate of the NATO Joint Warfare Officers  Course, the Naval War College Strategy and Policy Course, the Armed  Forces Work Colleges…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…and  decades of service, New Hampshire's transportation system has greatly  improved and has a clear plan for future success.\n\nOn behalf of my constituents in New Hampshire's 1st Congressional  District, I thank Bill Cass for his commitment and dedication to  helping improve New Hampshire's transportation for the past 35 years  and his 40 years of public…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I include in the Record the following  essay from Virginia's Fourth District Black History Month Essay  Contest--1st Place High School contest winner, Tanvi Palavalas.\n\nWhen Lt. Gen. Arthur J. Gregg first wore his Army uniform       during World War II, he stepped into a military that saw…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Caroline Smith, Juliette\n\nHaley Spirz, Troop 1751\n\nElyse Townsend, Troop 1331\n\nAmber Tyson, Troop 1922\n\nOlivia Van Horn, Troop 224\n\nChloe Vargo, Troop 1166\n\nOn behalf of the 1st Congressional District of Missouri, I  congratulate them on their achievement of the highest distinction in  Girl Scouts, the Gold Award. I thank them all for their leadership…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…words with action, Bartholomew launched a series of  initiatives to raise worldwide concern for the environment. In 1992 he  proposed to all Orthodox churches that September 1st be celebrated as a  special day of prayer for the environment. In 1995 he started a series  of environmental conferences, inviting prominent scientists, political  leaders,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Colorado, with the 10th Cavalry  (part of the 4th Infantry Division). It was while he was there that he  met his wife, Mary. His next assignment was back to Germany with the  1st Battalion 64th Armor Regiment for three years. During this time, he  transitioned to the M1 series tanks.\n\nLater he was assigned to the 3rd Cavalry Regiment at Fort Bliss,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…recognize Donald Maki for being  inducted into the Upper Peninsula Labor Hall of Fame. I thank him for  his dedication, compassion, and selflessness on behalf of Michigan's  1st Congressional District.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696858/recognizing-donald-maki-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…1946. During his service, he traveled the world from  Australia to Africa to Japan and back home through the Panama Canal.\n\nHe was honorably discharged with the rank of Seaman 1st class.\n\nAfter the Navy, Edward built a long and successful career in the  floral industry and was known for his love of fishing, golfing,  hunting, and making breakfast for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Johnson, North Carolina where he earned the Military Occupational  Specialty (MOS) of 0151 Administrative Clerk.\n\nFollowing his training, Timothy was assigned to the 2nd Battalion,  1st Marines, where he served as an Administrative Clerk. During his  time with the unit, he completed two Western Pacific deployments. His  dedication and preparedness during this…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…volunteering to serve his nation in the U.S. Army during World War II.\n\nThrough his service, Jim fought in the Battle of the Bulge as part of  Company B, 18th Infantry Regiment, 1st Infantry Division. It was during  that battle that Jim earned three Battle Stars and a Bronze Star.  Although injured by shrapnel during battle, Jim never received  treatment,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…PAC and held leadership roles with the National Management  Association--LSAAP Chapter. Among his proudest achievements, Gary was  honored as a Presidential Elector from Texas' 1st Congressional  District in 2024, casting his vote for Donald J. Trump in the Texas  House of Representatives Chamber in Austin.\n\nGary Singleton's lifelong commitment to his…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "John Carter", "party": "Republican", "sentence": "…service, and dedication to her Nation and Central Texas.\n\nLTC MacMillan served from 1976 to 1999, amassing experience at Fort  Liberty, West Point, Fort Cavazos, and others. As a 1st Lieutenant with  the 2nd Armored Calvary Regiment (2ACR), she managed the operation of a  Top-Secret Telecommunications Center and served as the Communications  Security (COMSEC)…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…positive impact of her service is felt across Michigan and beyond and  will continue to inspire future leaders in our movement.\n\nMr. Speaker, on behalf of the people of Michigan's 1st Congressional  District, I thank Camilla Williams for her service, her leadership, and  her enduring commitment to the conservative cause.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695818/recognizing-ms-camilla-cam-williams-for-her-dedicated-service-to-the-republican-party"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…desire to help address hunger needs in their  community and decided to participate in the Fight the Hunger, Stock the  Trailer program, run by Farm Credit Mid-America and Rural 1st.\n\nThis program challenges junior fair boards to collect as many pounds  of food as possible to donate to local organizations, addressing food  insecurity in our communities.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699469/recognizing-cj-jones-and-isaac-corcoran"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…ESOL, Reading, and  Autism Spectrum Disorders. For all of her admirable contributions to  our community, I'm truly proud to have Ms. Day-Scanlon as a constituent  in Florida's 1st Congressional District.\n\nMr. Speaker, on behalf of the United States Congress, I am privileged  to recognize Ms. Kimberly Day-Scanlon for her many accomplishments, and  her…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699161/recognizing-ms-kimberly-day-scanlon-okaloosa-county-schools-2027-teacher-of-the-year"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Arkansas, a proud American who  answered his country's call not once but three different times.\n\nFloyd first enlisted in the Navy in 1943, serving as a hospital  corpsman with the 1st Marine Division in the Russell Islands and New  Guinea. After the war, he went on to Baylor University, joined the Air  Force ROTC, and later served as a transport officer in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Speaker, I rise today to honor and thank one of the  longest-serving members of Team Scalise, a graduate of the University  of Louisiana at Lafayette, and a native of Louisiana's 1st  Congressional District, Mitchell Shea.\n\nMitchell first joined Team Scalise as an intern and later moved onto  my full-time staff as a Staff Assistant. Over the past ten years,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Recognizing his talent, the Navy  placed him in the B-12 program at Emory University, where he again  graduated valedictorian from dental school. He went on to serve with  the 1st Marine Division at Camp Lejeune, providing essential care as a  naval officer in the Dental Corps. His distinguished career spanned sea  service, Active Duty, Reserve Duty,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…has lived a life that reflects a simple but powerful  principle: when you love your community, you show up. And Joe Taylor  has always shown up.\n\nOn behalf of Pennsylvania's 1st District and the United States House  of Representatives, I express my deepest appreciation to Mayor Joe  Taylor for his service, his patriotism, and his enduring love of  community.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "John Carter", "party": "Republican", "sentence": "…than one thousand veterans, offering healing and support to those  who have served our Nation.\n\nThe program began as a collaboration between Lt. Colonel Scott Schule  of the 1st Cavalry Division Horse Detachment at Fort Cavazos (formerly  Fort Hood) and ROCK, with the goal of supporting wounded veterans  recovering at Brooke Army Medical Center Under…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689420/recognizing-the-contributions-of-ride-on-center-for-kids-rock"}]