[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Will we see years of American gunships parked off of Venezuela as  part of some new, amorphous ``Donroe Doctrine''? How do we expect to  run another country of more than 20 million people? Will U.S. forces be  used to protect oil infrastructure in Venezuela? Will our President  continue to stand by the illegitimate regime that Maduro's capture has…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…this is not a December problem. This  is not a January problem. This is a now problem. November 1, that is  when people start reenrolling--a whole bunch of small businesses, 20  million people, more than a quarter of the farmers in this country, who  are already facing, as one of my farmers said to me last week, ``a  perfect storm of ugly.'' That is about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…damage done by not extending tax credits for the Affordable  Care Act. Now this year, no longer is it theory. It is fact. It is no  longer talk. It is pain.\n\nThe fact is 20 million people are feeling the pain with their  healthcare costs going up. Millions more are losing health insurance.  In my district, tens of thousands are going to be paying more…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698808/breaking-the-gridlock-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…a cowardly bill. It does  nothing to stop the skyrocketing costs that we have been warning about  for months. Nothing in this bill will extend the tax credits that help  20 million Americans afford health insurance.\n\nThis bill won't stop the Republican cuts that will raise my  constituents' costs by $900 a month or restore coverage to millions  whose…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698375/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…waste of time. Nothing in  this Republican healthcare plan will stop Americans' healthcare  premiums from skyrocketing.\n\nWhen this bill fails to become law--and it will fail--20 million  Americans will see their premiums surge on January 1. Many will not  even be able to afford hundreds or even thousands more each month, they  will lose their healthcare…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698398/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…She comes to this role with very little experience in  education, but she has a wealth of experience in Trump world. She has  never been a teacher, but she did donate over $20 million to Trump's  campaign and organizations that are backing him. She has never been a  school administrator, but she does sit on the board of directors for  Trump Media & Technology…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is not worth the paper it is printed on, a bill that  actually kicks people off of coverage and fails to extend the tax  credits that keep healthcare affordable for over 20 million Americans.\n\nI mean, come on. Get real.\n\nJust to make sure that we all know that they aren't serious,  Republicans included a poison pill which brings us closer and closer…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…your side. They deserve the Profile  in Courage award because they are able to stand up to a President who  would rather see 15 million people lose insurance and another 20  million see their prices double. Thank the Republicans on that side for  profiles in courage.\n\nVote your conscience. Vote your constituents. This is not about  politics. It is about…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698786/breaking-the-gridlock-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…way--poof--the SEC paused the litigation and now is  in negotiations to settle that case. It is out in the open.\n\nOne shipping firm with operations in Mexico announced it has raised  $20 million to purchase the Trump coins for the express purpose of  influencing tariff policy in the United States of America.\n\nWhen Donald Trump negotiates tariffs, is he protecting…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…already been enormous.  The operations, maintenance, and personnel costs for federalizing the  500 National Guard soldiers for deployment in Illinois reached an  estimated $20 million in a 2-month span.\n\nThat comes out to more than $300,000 per day.\n\nThat bears repeating: $20 million and 500 Guard personnel away for  weeks on end from their families, their…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to this bill that does nothing, not  one thing to address the Republican healthcare crisis amid a cost-of- living crisis.\n\nMore than 20 million Americans will have to pay double, even triple  their monthly insurance premiums in just a matter of weeks, and this  bill leaves families without even a glimmer of hope…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…be standing together to talk about how we are going to lift  the least among us and make it easier for them. That is what we should  be talking about here tonight.\n\nNearly 20 million people are at risk of losing coverage and that  should be our priority. Chuy, myself, and Luis Correa, we call  ourselves the three amigos because we have so much in common,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…We welcome more.\n\nSpeaker Johnson should bring the bill to the floor immediately. Don't  send Congress on holiday without making sure that we protect healthcare  for over 20 million Americans.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698399/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of H.R. 6074, which  would extend the Affordable Care Act enhanced premium tax credits for 3  years, through 2028.\n\nWe are in the midst of a healthcare crisis. More than 20 million  Americans who get their healthcare on the ACA exchanges are going to  see their premiums skyrocket next year. That includes 250,000 people in  my home State of Massachusetts,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Medicaid and $200 billion from the SNAP  program.\n\nSeventeen million Americans will lose their health insurance. Health  insurance premiums will rise for another 20 million Americans. Three  million people will have food taken off the table, including kids,  seniors, and veterans.\n\nI can't understand the celebration of the facts that I have just  read.…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the U.S. can reliably  produce enough refined products domestically. The Energy Information  Administration projects global demand for liquid fuels to increase by  about 20 million barrels per day by 2050. Alarmingly, over the last  several years, North America has lost an estimated 1 million barrels of  fuel per day due to low refining capacity.\n\nThe…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…deficient, where were the cuts? None. They didn't say  anything. They didn't stand up for the American people. They were  silent.\n\nWhere were our good friends with the 15 to 20 million illegals coming  into this country, with the drugs flowing in, with the children that  were trafficked? Where were they? They were quiet. They didn't say a  thing. Mr. Speaker,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…immigration policed, our Democratic  friends will never be there for you. They turned their back on you and  your family and allowed this Nation to be invaded by 10, 15, 20 million  people--who the hell knows.\n\nWe are trying to fix it. We are trying to fix it, and we are not  going to give up. And until you change the policies, you never stop  illegal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Department of Health and Human Services for  awarding shockingly large amounts of grants and dollars to nonprofits  focused on aiding illegal immigrants, amounting to as high as 20  million people who illegally crossed into our country during Biden's  term in office.\n\nTaxpayer-funded awards paid for illegal aliens' housing, healthcare,  education, even music…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…of the  domestic tire manufacturing industry.\n\nThe per-company cost to comply with this rule would be four times  what EPA has suggested: 100 million in capital costs and $20 million in  other annual costs.\n\nMadam Speaker, this regulation must be rescinded. We must reinstate  common sense. Rubber tire manufacturing facilities have complied with  the existing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688526/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…leader. He  positively impacts his community, and he strives for business  excellence.\n\nHe is often recognized for his significant philanthropic efforts,  recently donating $20 million to the Savannah Community Foundation.  This generous donation is just one of many throughout his successful  career.\n\nMr. Speaker, the First District of Georgia appreciates…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Democratic colleagues have demanded that we have body-worn cameras  on ICE agents. We as Republicans have said: We agree.\n\nIn fact, the bill that you are blocking literally has $20 million and  a requirement to have body-worn cameras for law enforcement in the bill  that you are blocking. We agree. Body-worn cameras are helpful for law  enforcement and for…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…population that imperils the federally listed humpback chub below the  dam. While well-intentioned, this action comes at a steep cost.\n\nIn 2024, the bypass flows produced $20 million in lost hydropower  generation, which instead had to be replaced with power purchased on  the open market.\n\nWAPA makes these purchases using the Basin Fund, which is funded…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…That is not how you build energy security, Mr. Speaker. That is how  you weaken it.\n\nMeanwhile, global demand for fuels is still rising and is expected to  grow as much as 20 million barrels a day by 2050.\n\nThe world isn't slowing down, Mr. Speaker, and neither should  American energy.\n\nThe REFINER Act takes a serious look at that situation, directs the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…understanding that the tire industry estimates that it will cost about  $100 million to get the regenerative thermal oxidizers ordered,  fabricated, and installed and then about $20 million more per year to  operate the devices.\n\nWhile this cost is across several affected plants, these figures are  certainly much higher than the EPA's estimates.\n\nI also note…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…And remember Obama saying your premiums would go down by $2,500 if  you just passed his law?\n\nI just told you what happened with 18 of 24 for $100,000. Remember,  there are 20 million people on ObamaCare today receiving government  subsidies. When you take a look at that level of fraud happening across  the board, imagine how much taxpayer money is being…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…America. Mr. Speaker, $39,000 for  health insurance is what we have to fix.\n\nMr. GUTHRIE.\n\nMr. Speaker, we are here to solve the problem for all Americans. Mr.  Speaker, 20 million people are trapped in the Affordable Care Act  marketplace. Our proposal lowers those premiums by 11 percent.\n\nThere are over 160 million Americans who get it through their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…to undermine the Trump  administration's attempt to do that and their renewed enforcement of  our immigration laws.\n\nI know some people got used to the last 4 years, where 20 million  people came here illegally and Federal law enforcement was handcuffed  by the Biden administration to actually enforce our immigration laws-- so much so that the rhetoric…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…furniture, textiles, and Maine's first cheese factory. By the mid-20th  century, the Forster Manufacturing Company was the world's largest  maker of toothpicks, producing some 20 million per day.\n\nThe townspeople used their prosperity to built what has been called  ``the prettiest village in Maine,'' with handsome homes, churches, and  schools. Education…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Slope-produced gas to  Alaskans for their home heating and local industry needs. In addition  to providing gas to Alaska, the Alaska LNG pipeline will be able to  export 20 million tons of LNG yearly, reaching our Asian allies in 6  days with no strategic choke points. It is no exaggeration to say that  creating this pipeline is one of the most crucial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]