[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…best  people will be leaving in the weeks to come, even if they hire them  back.\n\nThere is real waste, fraud, and abuse in government. This is an  example. Mr. Speaker, $200 million of our taxpayer money is being spent  on advertisements praising Donald Trump. How do they justify this? They  aim these at their own base, to tell their own base: Hey,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…activists,  not professors, not green card holders, not asylees, not DACA  recipients.\n\nTrump and Noem have wasted millions of taxpayer dollars in their  criminal acts from a $200 million anti-immigrant ad campaign to $46  million paid to illegally detain people in offshore prisons to more  than $300 million to militarize and end parole and due process at…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690501/trump-immigration-policies"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…spouses.\n\nHere is the critical thing: Republicans should wake up in this time  of inflation. Your district and every district on average, by the way,  receives more than $200 million monthly for its Social Security  recipients. Your district, Mr. Speaker, receives $354 million.\n\nThat hasn't been changed since 1971. People in America should be  outraged…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…investor protections when people put their money in  them, because of the Securities and Exchange Commission. Yet, the  CLARITY Act would allow companies to raise up to $200 million over 4  years without any disclosure and without any transparency, just by  tokenizing their security.\n\nLet's be clear. Putting a security on the blockchain doesn't make…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693785/digital-asset-market-clarity-act-of-2025"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…higher grocery bills or the  deprivation of millions of Americans without healthcare coverage or the  kleptocratic meme coin schemes to enrich the Trump family by more than  $200 million. President Trump can simply ask Congress to pass a bill  here on Capitol Hill.\n\nAnother option is provided through a 1974 law, the Impoundment  Control Act, or ICA. Under…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…ruining American families. While there  is $230 million for the President to pay himself from the Department of  Justice, $8 million for some of his closest Senate allies, $200 million  for a pair of private jets for the Department of Homeland Security  Secretary, and $40 billion to Argentina, the American people are left  with nothing but higher costs.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…emoluments clause, unless there is  approval from the U.S. Congress. That is tomorrow night in the White  House.\n\nAnd today, the Trump administration formally accepted a $200 million  Boeing 747-8 jumbo jet as a gift from the Government of Qatar. Now,  that plane may be used as Air Force One while he is in office before it  is transferred to the Trump…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…her power for personal  benefit. She steered a Federal contract to a new firm run by a friend,  her friend. Her propaganda campaign to recruit ICE agents cost  taxpayers $200 million.\n\nShe made a video that turned the South Shore raid into something that  looked more like a movie trailer. Make no mistake, this is not a movie.  This is real life, and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…impacts to the surrounding communities.\n\nThe proposed underground route beneath the Sloan Canyon National  Conservation Area is estimated to save southern Nevadans at least $200  million, while minimizing disturbances to both residents and the local  environment.\n\nThis route for the Horizon Lateral water pipeline also ensures the  water delivery system's…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…opportunity to tell you more about what is at risk.\n\nThrough the Older Americans Act, the Administration for Community  Living runs senior centers and distributes more than 200 million meals  every year to older adults and people with disabilities through the  Meals on Wheels program.\n\nSeniors need access to nutritious food so they can lead healthy  lives.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…expenses faced by a  company seeking to go public were roughly $2 million to $4 million in  size.\n\nIt is also true that a small IPO, a medium-sized IPO, anything up to  about $200 million, is subject almost always to a 7 percent gross  spread. That is 7 percent of the proceeds, or in the case of a $200  million offering, $14 million. On a $150 million offering,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693905/middle-market-ipo-cost-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…regime.  This corruption is rampant and unending, from making untold sums off  meme coins to the latest outrage, demanding that the Department of  Justice pay him more than $200 million. That is taxpayers' money that  he wants to get his hands on. We have a President putting his financial  interests before the best interests of the American people.\n\nThis…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696353/trump-administration"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…tariffs on Bob's flour and other  Oregon ag products in retaliation for Trump's aimless war.\n\nOregon grass seed growers estimate that about half of their exports-- nearly $200 million in sales--are being canceled, thanks to the global  tariffs.\n\nDonald Trump and his advisers claim there is nothing to worry about.  They say the economists and the pundits…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…masterful job at alienating  America on the world stage, turning our back on our closest allies.  This bill goes even further. It underfunds NATO, the infrastructure, by  almost $200 million. It undermines the infrastructure projects of our  own troops in Europe that they are relying on. Our credibility as a  national security partner has been trashed by this…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…thing to do that you are cutting child nutrition  while you are spending a huge amount on a ballroom--undoubtedly a  Trumpian gold-style ballroom. How much was it: 200 million or 300  million? Some crazy, crazy sum. I can't even imagine how you could  spend that much on a room.\n\nAnd you mentioned this $20 billion bailout--20 billion with a ``b''  bailout--for…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…as a former county commissioner, I rise in  strong support of the Secure Rural Schools Reauthorization Act of 2025.\n\nSince the National Forest System was created, nearly 200 million  acres of rural America have been put aside for conservation,  recreation, and responsible natural resource development, like mining  and timber harvesting.\n\nWhen these…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…discovered that you had won the  lottery, only to find out that a cartel member had perfectly replicated  your winning lottery ticket and it was worth, let's just say, $200  million, maybe even $50 million, and you went to go turn in your  ticket, but somebody else without a valid ID stole your identity and  took your money, you would probably argue…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…support the defamatory claim, and, of course, the links didn't work.\n\nThis marks a catastrophic failure of oversight of an AI model that  has been downloaded by more than 200 million people. So last week, I  sent a letter over to Google's CEO Sundar Pichai demanding an  explanation as to why Gemma was creating these false allegations,  criminal allegations,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Under his leadership, Mobile has achieved major financial reform,  including reducing their bonded debt by nearly $210 million and their  unfunded liabilities by more than $200 million. These reforms led to  multiple credit rating upgrades and allowed for significant investments  to improve public safety, infrastructure, and city personnel.\n\nMayor Stimpson…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696270/recognizing-the-accomplishments-of-mayor-william-s-sandy-stimpson"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…return in the last year alone simply by copying the former  Speaker's stock trades.\n\nNow, this isn't a partisan issue. Republicans and Democrats together  have made over $200 million in the market last year, while Americans  got hammered by inflation and rising interest rates.\n\nMr. Speaker, I am a farm kid from Iowa. When I came to Washington, I  didn't…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691381/congressional-stock-trading-ban"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…employee work hours were spent  doing union business time in 2024 alone, according to the OPM report.\n\nThe cost to American taxpayers in salary and benefits was more than  $200 million. There was an additional $31 million cost for related  expenses, primarily the provision of Federal meeting space. The only  reason we know this is that the Trump administration…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and the DCCC will last through 2033. It says  it will only cost a few million dollars. That is outrageous. The  special election itself is going to cost between $200 million and $250  million.\n\nFinally, what it doesn't mention at all is that this is overriding,  literally, the entire rest of California's State Constitution. That is  the language that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…in 2026. In the first year alone, Treasury  reported that it helped the Federal Government identify, prevent, or  recover $108 million in improper payments, with another $200 million  expected by the end of this year. It is only common sense to make this  fraud prevention measure permanent.\n\nThis policy has already passed both the Senate and the Ways…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the Sloan Canyon  National Conservation Area. Compared to other alternatives, this  alignment minimizes impacts on neighborhoods and is estimated to save  taxpayers nearly $200 million.\n\nH.R. 972 authorizes the preferred route for this pipeline through the  national conservation area. This bill also expands the Sloan Canyon  National Conservation Area…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}]