[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…San Joaquin Valley and increase access to  the UC system, selected the Merced site in 1995 for the system's 10th  campus.\n\nThe first undergraduate class arrived in the fall of 2005, officially  marking the campus's opening. In 2009, UC Merced celebrated its first  full graduating class with First Lady Michelle Obama delivering the  commencement address.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…lessons, and eliminating honest conversations about race is  not about education, it is about control. We must ensure that  Juneteenth is not just a day off but a day of truth.\n\nIn 2005, I partnered with then-Senator Barack Obama to introduce  legislation recognizing Juneteenth. And now that it has become law, we  must defend it and the history it represents…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…today's Trump-Musk  Republican Party.\n\nLowering energy costs for consumers via efficiency gains used to be a  bipartisan issue. We made real progress on this in 1992 and again in  2005, but somewhere along the way, Republicans decided to become the  party of higher energy costs rather than the ones fighting for the  American homeowner. That is a real shame.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…contributions, and history of Caribbean  Americans in Michigan's 12th Congressional District and across the  country.\n\nCaribbean American Heritage Month, first recognized in 2005, was  established after years of global efforts to uplift our Caribbean- American neighbors. Their vibrant culture and contributions to our  country and throughout the 12th…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…than that of their urban neighbors.\n\nMaternal mortality in rural areas is nearly double that of urban  areas, and more than 200 rural hospitals have closed their doors since  2005. Over 450 more are currently at risk of shutting their doors.\n\nThis isn't hypothetical. It is happening right now. Let's be clear:  When these providers and hospitals close…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…tribute to the University  of Georgia School of Social Work for its 60th anniversary and to Deans  Charles A. Stewart (1964-1995), Bonnie Yegidis (1995-2003), Maurice  Daniels (2005-2016), Anna Scheyett (2016-2021), and its current dean,  Philip Hong (2022-present).\n\nFor six decades, the School of Social Work has advanced the  University of Georgia's teaching,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…million residents across Northern  Virginia. His dedicated service to our region is worth celebrating and  commemorating.\n\nMr. Gilbert became Executive Director of NOVA Parks in 2005 after  serving many years on the NOVA Parks Board. During his tenure as  Executive Director, Mr. Gilbert remained steadfastly dedicated to  public service in land acquisition,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…program and the Veterans' Group Life Insurance (VGLI) program from  $400,000 to $500,000. Prior to that, however, those maximum coverage  amounts had not been increased since 2005, clearly failing to keep pace  with inflation.\n\nTo ensure that we are not waiting another decade or more to improve  this benefit for our servicemembers and veterans, my good…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689628/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…(1994-1996), Austin V. Harton       (1996-1998), Kenneth R. Watkins, Sr. (1998-2000), Warren G.       Smith (2000-2002), Norman P. Fleming (2002-2004), Michael J.       Bates (2004-2005), Undray Wilks (2005-2007), David A. Lewis       (2007-2009), Rahmad D. Bauldrick, Sr. (2009-2011), Seth L.       Wilson (2011-2013), Leonard C. McKinnis, Jr. (2013-2016),…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…endoscopies.\n\nThe founders' vision of delivering safe and effective surgical care  through innovation and technology culminated in the opening of this  critical facility in September 2005. Moreover, patients and employees  have remained at the forefront of DEC's mission. As Susan Cheek, DEC's  Administrator, put it: ``Our longevity is a testament to our commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Ms. LEE of Nevada. Mr. Speaker, I rise to recognize and celebrate the  20th anniversary of the Mountain's Edge community in Clark County,  Nevada.\n\nSince its groundbreaking in 2005, Mountain's Edge has grown into one  of the most vibrant communities in the southwest area of the Las Vegas  Valley. Mountain's Edge sits at the foothills of the Spring Mountains,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691310/recognizing-the-20th-anniversary-of-mountains-edge-community-in-clark-county-nevada"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…earned a Grammy nomination in 2010 for the song ``Love''  from his album ``We Got This,'' and was awarded a National Endowment  for the Arts National Heritage Fellowship in 2005.\n\nD.C. named a park located at 2901 20th Street, Northeast, for Chuck  Brown, and named a street near the historic Howard Theater for him.\n\nI urge my colleagues to support this…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692742/introduction-of-a-bill-to-designate-the-facility-of-the-united-states-postal-service-located-at-3401-12th-street-northeast-in-washington-district-of-columbia-as-the-chuck-brown-post-office"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Department of Energy spends billions of dollars every year  supporting research, development, demonstration, and commercialization  activities. Per the Energy Policy Act of 2005, the Department of Energy  requires not less than 20 percent for research and development and not  less than 50 percent for demonstration or commercial application  activities…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688930/cost-share-accountability-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Well,  because Russia doesn't want to give up its port access to the Red Sea,  China doesn't want to abandon the nearly $6 billion of investments it  has made in Sudan since 2005, and the UAE doesn't want to abandon  Sudan's wartime gold trade. According to mining industry sources and  research by Swissaid, nearly all of Sudan's gold trade flows through…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, in 2005, the 988 National Suicide  Prevention Lifeline was launched to provide 24/7 access to counseling  and referrals for Americans in crisis.\n\nIn recognition of these challenges,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690731/defunding-suicide-hotline-for-lgbtq-youth"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…importance of the projected  growth in natural gas demand.\n\nDespite the Federal Energy Regulatory Commission being granted  increased authority under the Energy Policy Act of 2005, pipeline  project approvals are consistently delayed because of a lack of  coordination between the numerous agencies involved in the permitting  process.\n\nMy bill would make…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Mr. Speaker, I rise today in recognition of the 20th  anniversary of Operation Red Wings, a mission carried out by United  States Navy SEALs and the Army 160th SOAR in June 2005 in the mountains  of Afghanistan.\n\nOperation Red Wings was intended to disrupt anticoalition militia  activity in the Pech District of the Kunar Province. The primary target…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…member of the Zoning Hearing Board. In April  2003, he was appointed to the Township Board of Supervisors to fulfill  another member's term, and became Chairman of the Board in 2005, where  he has served for nearly 21 years.\n\nJon's career as a Civil Engineer has benefited the Township greatly.  As a graduate of Penn State's Engineering program, he always…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…things, and they are  wrong on this, too, and they are out of step with the country.\n\nAmericans of all political persuasions have supported tighter  election laws for decades. In 2005, former President Jimmy Carter, a  Democrat, joined former Secretary of State Jim Baker, a Republican, to  form a Commission on election integrity. They identified voter ID…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…hub for  garment and shoe manufacturing. In the 1970s, southeast Missouri was  home to as many as 90--90--shoe plants. The last shoe factory from that  era closed for good in 2005. It had begun as a five-story, 92,000-foot  international shoe plant in Cape Girardeau, nicknamed ``the Pride of  Southeast Missouri.'' At one point, it employed 1,200 workers,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…enjoyed being chairman of the Red       River Valley Billy Graham Crusade in 1987, and being a member       of the Lutheran Health and Banner Health Systems boards from       1990-2005. Being on these boards sparked his love of travel,       taking trips to the British Isles, Scandinavia, Europe, the       Middle East, and Australia. He led many bus tours…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…solutions. If I came to  you right now and said--let's see if I can find the right charts here.\n\nI did a whole presentation over and over the last 3 weeks on Medicare  Advantage. In 2005, the Republican idea was to buy capitated managed  care policies for seniors. The idea was that there would be a benefits  package and the insurer would actually make money…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…which allowed him to obtain experience in both patrol and  corrections. In 2003, Lieutenant Doolittle was brought on as a full- time deputy sheriff and worked in the jail.\n\nIn 2005, Lieutenant Doolittle was transferred to patrol. He was  responsible for the I-80 corridor, all the way from Bell Road in Auburn  to Donner Summit. During this time, Lieutenant…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…in 1975. He went on to serve 25 years with  Fairfax County, ultimately retiring as a captain, and then brought his  leadership to Shenandoah County, where he has served since 2005,  including the past 9 years as chief.\n\nChief Williams has been a unifying force, skillfully bridging the gap  between volunteer companies and career staff. Under his leadership,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Americans.\n\nOur Nation's energy future should be driven by innovation. American  technological innovation have allowed us to reduce emissions more than  any other Nation since 2005, all while achieving record energy  production.\n\nWe need a regulatory framework that incentivizes innovation and  rewards it when it happens. That means eliminating one-size-fits-all…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…comes in and says, Medicare Advantage, when you do the risk adjustment,  it comes in at 120 percent of fee-for-service. That is a 25 percent  gap. In the original design, in 2005, the Medicare part C was supposed  to come in at 95 percent.\n\nI know it is geeky, but this is a stunning amount of money. We will  spend hours here arguing about millions of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Americans on the national organ transplant  waiting  list. We should have confidence that our organ transplant system is  efficient and fair. Sadly, my oversight dating way back to 2005 has  uncovered decades of corruption and mismanagement in this donation  system. It has left vulnerable patients to die on waiting lists while  unused organs from generous American…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…the department through many major changes and  challenges during his 22 years of service, including the construction  and completion of Carver's new fire station. Completed in 2005, the new  fire station replaced the Old Carver Fire Hall, which originally opened  for service around 1880.\n\nThe Old Carver Fire Hall stored the volunteer Carver Fire  Department's…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "Mr. BABIN. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 359) to Amend the Energy Policy Act of 2005 to require reporting  relating to certain cost-share requirements, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688929/cost-share-accountability-act-of-2025"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…He later became an assistant manager at Walmart Store 894 in Tulsa,  and that launched a career with the Nation's leading retailer, with  promotions to CEO of Sam's Club in 2005, Walmart International in 2009,  and finally CEO of the entire enterprise in 2014.\n\nWith a market cap of $195 billion, under his tenure Walmart's value  has increased by more…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}]