[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…them to more clearly weed out other       potential factors.\n\nRegardless of race, exposure to cigarette smoke, or factors       like education and pets, kids tested between 2007 and 2011       had healthier lungs than kids the same ages tested between       1994 and 1998.\n\nI will skip some of the additional scientific details and jump to  more of the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…visiting artist programs--and organized a  Spring Sing performance at UCSB's Campbell Hall that brought together  hundreds of students and families.\n\nFollowing her retirement in 2007, JoAnne continued her public service  by directing the Santa Barbara County Spelling Bee, co-founding the  Santa Barbara Martin Luther King, Jr. Committee, and serving on the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…was born in Livonia and is a proud graduate of  Stevenson High School. In 2004, Matthew answered the call to serve  others by becoming a firefighter in one of our counties. In 2007, he  made the decision to serve our Nation by joining the U.S. Army. He was  deployed to Kuwait and Iraq from December 2007 to 2009. Unfortunately,  he was there when a horrific…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…General President. Nelson also helped  mobilize members to advocate for union priorities and has been a strong  partner for my office in advocating for organized labor.\n\nSince 2007, Terry has served as the co-chair of the Finishing Trades  Institute of the Upper Midwest (FTIUM), helping FTIUM gain  accreditation in 2018. He has long advocated for expanding…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…required many federal agencies to provide such  information each of the last several years, but this bill would codify  this requirement and apply it to all federal agencies.\n\nIn 2007, the Government Accountability Office (GAO) examined spending  on advertising contracts with minority-owned businesses by five federal  agencies--the Department of Defense,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…(1996-1998), Kenneth R. Watkins, Sr. (1998-2000), Warren G.       Smith (2000-2002), Norman P. Fleming (2002-2004), Michael J.       Bates (2004-2005), Undray Wilks (2005-2007), David A. Lewis       (2007-2009), Rahmad D. Bauldrick, Sr. (2009-2011), Seth L.       Wilson (2011-2013), Leonard C. McKinnis, Jr. (2013-2016),       Eddie H. Reynolds (2016-2018),…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…a focus  on rehabilitation rather than punishment. For example, Texas, a state  known for its traditionally tough stance on crime, has undertaken  significant reforms since 2007. These reforms have focused on  encouraging local, evidence-based supervision for low-level youth  offenders, which has led to a significant reduction in the state-level  committed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…He graduated from  New York University with a degree in politics. He then returned home  and got involved in his local community. He managed our dear friend  Gerry Connolly's 2007 campaign for chairman of the Fairfax County Board  of Supervisors, and a year later he managed Gerry's successful campaign  for Congress.\n\nWhile a new Member, James is no stranger…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…was responsible for more  than 10,000 Servicemembers, Civilians, and Contractors deployed  throughout the Central Command Theater of Operation.\n\nHer other deployments were in 2007 to the CENTCOM Deployment  Distribution Operations Center (CDDOC) at Camp Arifjan and Kuwait in  support of Operations Enduring Freedom and Iraqi Freedom. And in 2004  to Balad,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…the set, reconnect with participating schools, develop new  production schedules, and train students. Their commitment ensured that  the program never missed a season. Since 2007, ASMW has aired every  Saturday evening from January through June on NEPM/WGBY-TV, welcoming  schools from across western Massachusetts and northwestern Connecticut  to compete…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…STC. This bill is essential for enhancing cities'  security against nuclear and radiological threats.\n\nThe STC program was created by the Department of Homeland Security in  2007. It began as a pilot program in high-risk cities to detect nuclear  and radiological threats. Since then, it has expanded to include  additional cities, offering equipment,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…career.  Whether during her time with the South Shore YMCA, Quincy Community  Action, or DOVE, she has dedicated her career to working for the  betterment of her community.\n\nIn 2007, Kathy oversaw the old St. Boniface Church's transition into  the new Germantown Neighborhood Center in Quincy. Kathy then went on to  lead the center, which serves over 2,000…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ends meet. They are just signaling that  they love coal.\n\nThat is particularly shameful when we consider coal consumption has  declined by nearly two-thirds since its peak in 2007. Instead of  celebrating the newer sources of cleaner and cheaper energy,  Republicans are frantically trying to turn back the clock and ignore  Americans' pleas for real and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…and  other highly targeted cities with programs like Securing the Cities are  so crucial.\n\nThe Department of Homeland Security launched the Securing the Cities  initiative in 2007 as a pilot program to assist the New York City metro  area in detecting and preventing nuclear or radiological threats. The  program has since expanded and currently provides…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…saw stops in Pittsburgh, Richmond, and Raleigh  before he returned to Philadelphia in 1994. He would go on to serve as  the President and General Manager of WPVI beginning in 2007, making him  the longest-serving General Manager in the station's history.\n\nThroughout the entirety of his tenure, Prazenica played a critical  role in maintaining WPVI's status…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "John Carter", "party": "Republican", "sentence": "…of Commerce and as a tri-county  soccer official. His leadership extends to his faith community as well,  where he has held the title of deacon at Temple Bible Church since  2007, following a decade of service as a deacon at First Baptist Church  of Killeen.\n\nI join Lt. Col. Smith's family, friends, and colleagues in saluting  his honorable contributions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…congressional press galleries;\n\n[Whereas Douglass delivered the keynote speech at the       unveiling of the Emancipation Memorial in Washington's       Lincoln Park;\n\n[Whereas, in 2007, Douglass was recognized by placing a       plaque and painting of him in his honor in the House Press       Gallery;\n\n[Whereas, in 2012, Congress passed and the President signed…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "James Lankford", "party": "Republican", "sentence": "The committee issued this report on January 31, 2026, as required by  the Honest Leadership and Open Government Act of 2007.\n\n31, 2026]              Annual Report of the Select Committee on Ethics                       119th Congress, Second Session\n\nThe Honest Leadership and Open Government Act…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…my amendment directs the Army Corps of Engineers and  EPA to publish a revised compensatory mitigation rule that incorporates  advances in science and lessons learned since 2007; promotes  equivalency and flexibility among mitigation options, providing  builders additional options beyond mitigation bank credits; speeds the  approval of mitigation banks,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…risks to our national security. Ensuring  that CFIUS has the right expertise and authority to evaluate these  transactions is more important than ever.\n\nFor the first time since 2007, H.R. 1713 would formally add a Cabinet  Secretary to CFIUS, giving the Secretary of Agriculture an official  role in reviewing relevant agricultural transactions for national…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…1995, as  Recreation Leader. In July of 1996, he was promoted to Recreation  Center Director at Carver Community Center and established the Good  Choices Program. In March of 2007, Mr. Folks was promoted to Parks and  Recreation Director. He was appointed interim City Manager in June of  2019 and became City Manager on October 28, 2019. He is an active…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688463/recognizing-the-retirement-of-steven-d-folks-sr-as-city-manager-of-anniston-alabama"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Lewisville High School in  1975 as a star football and track athlete. He began his career working  for the McKinney Fire Department and in the oilfield industry. From  1983 to 2007, Mark worked for the Addison Fire Department before being  selected to serve as the Assistant Fire Chief and Fire Marshal for the  Celina Fire Department in 2008. He served…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Director for my  predecessor, Congresswoman Jo Ann Davis. I am grateful that Joe brought  his past public service expertise when he began serving as my District  Director in 2007. Joe is a native Virginian, an Air Force veteran, and  a graduate of the University of Virginia.\n\nIn his 25 years of service, Joe has proven to be an indispensable  member of…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700090/recognizing-joe-schumachers-25-years-of-dedicated-public-service"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…District Championship and  capturing their first Regional Championship since 2021. Their  remarkable determination propelled them to the State Semifinals for the  first time since 2007--an extraordinary milestone in the program's  history.\n\nBeyond their dominance in competition, these student-athletes  demonstrated the same level of excellence in the classroom,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688924/recognizing-the-clarkston-high-school-wrestling-teams-outstanding-season"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…1987, rising through the ranks to eventually become  Assistant Fire Chief in 2003.\n\nAfter 20 years of service with the Anniston Fire Department, he  retired on February 13, 2007. Chief Sparks became full-time Fire Chief  for the City of Oxford on March 3, 2007.\n\nChief Sparks is involved in several civic organizations in his  community. He is currently…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697974/recognizing-the-retirement-of-chief-gary-sparks-as-fire-chief-for-the-city-of-oxford-alabama"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…just that.\n\nMr. LANGWORTHY. Mr. Speaker, I didn't serve then, so I am not sure.\n\nMr. Speaker, we had to go and do a little research, but in the 110th  Congress on August 1, 2007, when considering House Resolution 3162, the  Democrats did indeed convene a Rules Committee meeting at 1 a.m., and  they gaveled out at 3:07 a.m.\n\nThey have done exactly the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Air Force Base is one of the most important contributors to  northern Utah's economy and livelihood, employing over 23,000 military  and civilian employees. Every year since 2007, they have given one  individual the Community Wingman Award in recognition of their support  for the base and its personnel. This gives the base an opportunity to  recognize…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…1994, George Atsma began his own dairy legacy when he started  building his own herd in Tipton, California. A few years later, he  purchased property just east of Tulare, and by 2007 had completed  renovations and moved his herd to the new site. Today, he operates both  a successful dairy and a calf ranch with his wife, Tina, and their six  children: Joshua,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698674/recognizing-the-atsma-family"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Volunteer Fire Company for 45 years. He has also worked  alongside the local VFW and American Legion.\n\nMark has received various awards for his leadership over his career.  In 2007, he was recognized by the Lycoming County Department of Public  Safety and the Pennsylvania State House of Representatives.\n\nMr. Speaker, Mark has dedicated his career to serving…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698576/recognizing-mark-lusk"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the Best Children's Hospitals ranking.\n\nStead Family Children's Hospital has appeared in rankings every year  since the U.S. News and World Report launched these indexes in 2007.  These rankings reflect more than numbers; they represent the hospital's  commitment to high-quality, compassionate, and innovative care.\n\nStead is home to Iowa's only level…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696467/recognizing-stead-family-childrens-hospital"}]