[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Mr. Trump now an  avocado nationalist?\n\n``Then, there is the prospect of retaliation, which Canada and Mexico  have shown they know how to do for maximum political impact. In 2009,  the Obama administration and congressional Democrats ended a pilot  program that allowed Mexican long-haul truckers into the U.S. as  stipulated in NAFTA. Mexico responded…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…best practices and actions the agency could take so that our  communications networks are secure, reliable, and compatible with each  other.\n\nCSRIC has been in existence since 2009 and was rechartered in 2024  under the Biden administration and former FCC Chairwoman Rosenworcel  for another 2 years. It has served the FCC well by operating in a  collaborative…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Watkins, Sr. (1998-2000), Warren G.       Smith (2000-2002), Norman P. Fleming (2002-2004), Michael J.       Bates (2004-2005), Undray Wilks (2005-2007), David A. Lewis       (2007-2009), Rahmad D. Bauldrick, Sr. (2009-2011), Seth L.       Wilson (2011-2013), Leonard C. McKinnis, Jr. (2013-2016),       Eddie H. Reynolds (2016-2018), Decature Tounsel (2018-2019),…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…Once he arrived in Washington, he rolled up his sleeves and got to  work.\n\nBill fought relentlessly to secure the designation of the Great Falls  as a National Historic Park in 2009. When it was signed into law by  President Obama, it was a proud day for our city and our entire State.\n\nThis designation unlocked a flood of new rehabilitation and expansion…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691127/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…for your time, Jose Urias\n\nBusiness Owner & Co-Coordinator of the Massachusetts TPS       Committee                                __________\n\nHello, my name is W.V., and in 2009 my life changed       unexpectedly.\n\nI traveled to Florida for a brief vacation. During that       time, a family member living in New Jersey became seriously       ill, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…generation firefighter who began his fire service in 1982. His career  led him to the Fairfax County Fire and Rescue Department where he  ascended to the rank of deputy chief in 2009.\n\nAfter 30 years in Fairfax County, Chief Johnson was appointed as  chief of the Loudoun County Combined Fire and Rescue System in 2018.  During his tenure, he led a department…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…think, as you know, Mr. Speaker, last month the U.S. economy shed  over 100,000 jobs--100,000. It was the worst month with respect to job  losses since the Great Recession in 2009.\n\nPrices are going up across the board. Everything is getting more  expensive. Orange juice is more expensive. Ground beef is more  expensive. Countless Americans across our…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…freshman at WSU and now returns each year despite his national-level  career. Host Beth Ward, an award-winning journalist, has brought her  talent and warmth to the program since 2009. Production Manager Alex  Simisky, a former student crew member himself, now oversees the  University's TV studios and ensures the smooth operation of each  season.\n\nDespite…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…500th anniversary of the Greek       Orthodox Community in Venice, among others;\n\nWhereas, he has visited the United States during the       Clinton (1997), Bush (2004), Obama (2009) and Biden (2021)       administrations;\n\nWhereas, His All-Holiness was elected in October 1991 as       the 270th Archbishop of Constantinople-New Rome and       Ecumenical…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694760/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew-i-archbishop-of-constantinople-new-rome"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…maintaining WPVI's status as the home of the most-watched local  news broadcast in Philadelphia, Action News, a title which the station  and program have held for nearly 50 years. In 2009, he oversaw the  construction of a state-of-the-art, 110,000 square foot digital  broadcasting facility next to the station's previous home. His  unwavering commitment to his…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…a firefighter in one of our counties. In 2007, he  made the decision to serve our Nation by joining the U.S. Army. He was  deployed to Kuwait and Iraq from December 2007 to 2009. Unfortunately,  he was there when a horrific bomb changed his life forever. It took us  3 years as a country to recognize his sacrifice.\n\nSince his return, Mr. Fisher has continued…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…system D.C. has had in place since 1992, that has produced       higher appearance rates than the national average without       wealth-based pretrial detention. Between 1990 and 2009 the       number of people charged with an offense who received cash       bail jumped from 37 percent to 61 percent. Cash bail has,       historically, disproportionately impacted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…know if you have ever seen aluminum get made, but it is  really like baking a cake, and steel and all of that. The steel, oh, my  gosh, when I was working for the President in 2009 and '10, we spent  time with the Steelworkers and the steelmaking process.\n\nThese smelters are $6 billion. It confuses me how we are going to get  a $6 billion smelter in the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Humboldt Elementary School and Roberto Clemente Community Academy.\n\nRooted in the community that raised him, Billy served as the 26th  Ward alderman for 16 years, from 1993 to 2009, where he championed  major infrastructure and community development projects, including the  creation of Division Street's signature Puerto Rican flags, the  McCormick Tribune…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…for seniors, families, and veterans, including 74,000  people in my district.\n\nVivian, in New Rochelle, said: I have been delivering food to seniors  and people in need since 2009. I do this every day because I know what  it is like to be in need myself. I had to stop working when I was  diagnosed with pancreatic cancer and now I rely on SNAP, and it…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691426/gop-tax-scam-hurts-women-and-families"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in 1973.\n\nAfter over 40 years in the home furnishings industry, working side by  side with both his wife, Nancy, and his daughter, Barbara, he and Nancy  retired in 2008.\n\nIn 2009, they moved to Grass Valley. They were not entirely sure what  they wanted to do in retirement, but they met some wonderful friends  and soon became very involved with the Tea…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…to  prevent these birds from wiping out their stock. The Aquaculture  Depredation Order is nothing new. It is the same commonsense tool that  was easily reinstated in 2003, 2009, and 2014.\n\nAquaculture farmers have been struggling for years with the  importation of nondomestic catfish flooding the market. Every year,  American catfish farmer communities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Incident Database (referred to in this section as the       ``Database'') established by section 563 of the Duncan Hunter       National Defense Authorization Act for Fiscal Year 2009 (10       U.S.C. 1561 note).\n\n(b) Plan.--\n\n(1) In general.--Not later than 60 days after entering into       the memorandum of understanding required under subsection…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…1970. He then moved on and  entered an extensive career with Texas Instruments in their Facility  Maintenance Division earning the following trade licenses before  retiring in 2009: Master Plumber in 1981 and Journeyman's Electrician  in 1995. Apart from work, he became a Master Mason in the Milam Lodge  No. 2 in Nacogdoches, TX in 1972 and continues as…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…middle name. For 16 years, Carol has served Oasis  with warmth, compassion, and dedication to the families of Oasis. Carol  was an integral part of the start-up of Oasis in 2009 and continues to  be a cornerstone of the ministry at the Land O' Lakes center. Her  unwavering desire to be a light to each woman who walks through the  door of Oasis is a…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690132/recognizing-carol-berti"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Ms. Nichol's record of civic service is both extensive and  distinguished. She began her public service on the Royse City Council,  serving from 1995 to 2005 and again from 2009 to 2015. Her steady  leadership and dedication to progress led the people of Royse City to  elect her mayor--a position she proudly held from 2015 to 2021 and to  which she…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698359/recognizing-the-success-of-janet-nichol"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…retirement of Cardinal Timothy Michael Dolan,  whose leadership has profoundly shaped the Catholic faith in New York  and across our Nation.\n\nSince becoming archbishop of New York in 2009, Cardinal Dolan has  been a steadfast advocate for religious freedom, Catholic education,  and the dignity of every person. He has led with conviction,  compassion, and humor,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Trump's Education Secretary  just last evening. So compared to previous Presidents, this is a  remarkable pace. More confirmations than President Obama had at this  point in 2009; more confirmations than President Biden had in 2021. It  surpasses the timeline of any President in recent history.\n\nPresident Trump's nominees are strong. They are smart.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…takeover  by the theocratic despots who introduced a reign of terror that has  gone on now for decades.\n\nTwice before, Iranians were on the verge of overthrowing this regime.  In 2009, as Iranians took to the streets during the so-called Green  Movement, they looked to the United States for support but got only  silence. In 2016, the American Government sent…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…earned her law degree. Kathy was subsequently admitted to the Illinois  Bar, practicing law for 39 years before relocating to Florida, where  she joined the Florida Bar in 2009 and continued her legal career for  an additional 14 years. Kathy has since retired from practicing law but  remains active in her donation of time and legal expertise to the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Although not a member state of the United Nations, the       Republic of Kosovo is a member of both the IMF and the World       Bank, having joined both organizations on June 29, 2009.\n\n(14) On October 26, 2021, Secretary of State Antony Blinken       issued a statement in support of Taiwan's ``robust,       meaningful participation'' in the United Nations…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…deported in 2002.\n\nWe have a Sudanese illegal alien convicted of homicide.\n\nWe have a Laotian illegal alien convicted of two counts of homicide  with a deportation order since 2009.\n\nWe have an illegal alien from Sierra Leon convicted of two counts of  homicide with a deportation order since 2022.\n\nWe have a Mexican illegal alien convicted of homicide…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…While on patrol, Lieutenant Doolittle became a field training  officer, which gave him the responsibility of training new deputies in  law, policy, tactics, and procedures. In 2009, he joined the special  enforcement team, which is the equivalent of a SWAT team, and was  selected as the element leader for the chemical agents unit.\n\nThat year, Lieutenant…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…worked as Manheim  Township's Director of Zoning and Planning, Director of Planning at  Dave Miller/Associates, and Assistant Township Manager in East Donegal  Township. In 2009, he was promoted to Township Manager, where he has  served East Donegal since.\n\nDuring his tenure as Township Manager, Mr. Butler helped with the  Donegal Region's Comprehensive…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687958/congratulating-jeffrey-butler-on-his-retirement"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Opposites Attract: How a Conservative Texan Helped a Liberal Arkansan             Enact the Sweeping Arkansas Wilderness Act of 1984                    (By J. French Hill, April 25, 2009)   BEFORE THE ARKANSAS HISTORICAL ASSOCIATION SOUTHERN ARKANSAS UNIVERSITY                             MAGNOLIA, ARKANSAS\n\nTwenty-Five years ago in 1984, a dedicated group of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}]