[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…prosecutorial trends.\n\nI would like to say when my family and I spent the 2\\1/2\\ years in  court that we did in Jacksonville, Florida, when my son was murdered in  November of 2012, the Crime Victims Fund of Florida helped to support  the representative and to provide the representative who spent day  after day with us making sure that we had the resources…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…playing  a concert on a hot and humid day on the U.S. Capitol Grounds in 2010 in  support of statehood.\n\nChuck Brown was born on August 22, 1936, and passed away on May 16,  2012. He was a D.C. resident most of his life. He taught himself to  play guitar, becoming a virtuoso singer, songwriter, guitarist and band  leader. His musical catalogue spanned…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692742/introduction-of-a-bill-to-designate-the-facility-of-the-united-states-postal-service-located-at-3401-12th-street-northeast-in-washington-district-of-columbia-as-the-chuck-brown-post-office"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Man brew.\n\nThe World Beer Cup, otherwise known as the ``Olympics of Beer,''  evaluates beers from around the world and recognizes the top brewers  and their beers. Founded in 2012 and nestled in the Heart of the  Rockies, Elevation Beer Company produces seasonal Belgian ales,  specialty brews, and barrel-aged beers that put a twist on traditional  styles…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694717/recognizing-elevation-beer-company"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…their lives on  the line for us deserve better.\n\nMr. Speaker, I will take a point of privilege to say that when I lost  my son, Jordan, in Jacksonville, Florida, on November 23, 2012, at a  convenience store gas station by a man who never should have had a gun,  that convenience store family, the owners, at least had the decency to  put a plaque up in remembrance…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…rid our politics of Big Money and root out foreign  interference.\n\nIt includes the DISCLOSE Act, which I have cosponsored--Senator  Whitehouse's bill--in every Congress since 2012, to end secret money in  our politics. The DISCLOSE Act also makes it harder for billionaires  and others to hide their contributions by ending the use of transfers  between…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the 2000  cycle had $18 million in spending, and the 2004 cycle had $13 million  in spending. The 2008 cycle had $16 million. It kind of leveled off.\n\nThen, you look at the 2012 cycle, after Citizens United: $231 million  in  spending. In the 2016 cycle, there was $682 million in spending. By the  2020 cycle, we are in the billions now, $1.2 billion.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…research and innovation. Maryam  was entrusted with the responsibility of nurturing the VA's first  Specialty Team Advising Research (STAR), which she led with distinction  from 2012 until her retirement this year. Her leadership at STAR has  improved the quality of life for our Nation's veterans, spurred health  care business development and encouraged…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…pride and a  touch of sadness. After 13 years of service to this body as a chief of  staff, Richard Kirk McPike is leaving my office.\n\nKirk has been the leader of my team since 2012, setting up the  office, building LGBTQI+ political infrastructure, helping me earn the  Veterans' Affairs' Committee gavel and so much more.\n\nKirk's proudest accomplishments…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699962/recognizing-richard-kirk-mcpike"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…shadow of Columbine. They  have borne witness to an endless onslaught of mass shootings. Each  tragedy is piled on top of the last one during their young lives.\n\nIn the summer of 2012, a gunman walked into a crowded theater in  Aurora, CO, and killed 12 innocent people and wounded 58 more. We lost  sons and daughters and friends and neighbors, all full of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…face an  additional burden to register to vote simply because they changed their  last name after marriage. Simply put, this Republican bill is about  voter suppression.\n\nIn 2012, Minnesotans rightly rejected a state constitutional  amendment that would have imposed voter ID requirements. Each election,  Minnesotans turn out at the highest levels in…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…clear, despite their marketing, TASERs are not always       ``less-than-lethal,'' as claimed in H.R. 2189. Perhaps they       are less lethal than other firearms, but between 2012 and       2021, 538 people were killed by TASERs or stun guns. And       studies that have found TASERs have only minor health impacts       were not only primarily funded by…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…``DACA'' means deferred action granted       to an alien pursuant to the Deferred Action for Childhood       Arrivals program announced by President Obama on June 15,       2012.\n\n(5) Disability.--The term ``disability'' has the meaning       given such term in section 3(1) of the Americans with       Disabilities Act of 1990 (42 U.S.C. 12102(1)).…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…everybody that uses those public  lands.\n\nWhen I served on the U.S. Federal committee to advise the Forest  Service, we got all of these stakeholders together to implement the  2012 planning rule, and it was the same deal. We did it deliberately.  We did it with all stakeholders at the table. These RMPs are actually  developed with public input from every…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…targeting--for tax breaks for  them, we are targeting millions and millions of Americans who rely on  things like Medicare.\n\nI started my speech with John Lewis. Let me quote him now. In 2012,  he said:\n\nHealthcare is a right, and it is not a privilege, not just       for some people but for all people.\n\nJohn Lewis was a visionary.\n\nSo let me tell you a bit more…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…of the Affordable Care Public  Education Committee in the Kansas City Metropolitan area, she advocated  for the expansion of Medicaid and accessible healthcare. In March of  2012, her efforts were recognized, and Alice received the Champion of  Change award from President Barack Obama at the White House. Gender  equity and advocating for policies that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…up-to-date  information, whether it is news, airfares, the weather, or Supreme  Court case citations.\n\nAccording to the GPO, the number of print copies of CONAN requested  in 2012 by the House, Senate, and the Joint Committee on Printing was  just over 1,000. Ten years later, in 2022, the number of requested  copies dropped to just 659.\n\nIt is no coincidence…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…cornerstone of support and  opportunity for local youth for over 60 years.\n\nThe club is located on land currently owned by the city of Paducah,  which has held the property since 2012. For over 60 years, the Oscar  Cross Boys & Girls Club has been a force for good in Paducah and has  had a positive impact on thousands of children who have come through  its…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…deeply engaged in civic life. He served multiple terms as president and  song leader of the century-old Mexia Lions Club and founded the ``Red,  White, and Blue Car Show'' in 2012, which became the club's major  fundraising event. He has also been a dedicated member of the First  Baptist Church of Mexia since 1992, serving as a deacon, Sunday school…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "John James", "party": "Republican", "sentence": "…and promised us  affordable care. He said that if we like our doctor, we can keep him;  and if we like our plan, we can keep it.\n\nThat was determined to be the biggest lie of 2012.\n\nWhat we got instead was the most expensive healthcare system on the  Earth with hospitals and insurance companies cashing in while working  families foot the bill.\n\nIn the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Willow Project will produce 576 million barrels of oil and non-gas  liquids over 30 years and generate $5.9 billion in revenue for the  Federal Government through 2053.\n\nIn 2012, the Obama administration, issued the first integrated  activity plan, IAP, addressing management for the entire NPR-A, but  only made available 11.8 million acres of the Reserve…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and ``could  be lifted consistent with the protection of the public's interest.''  BLM recommended that PLOs be lifted on 50.1 million acres of land it  manages in Alaska. In 2012, then Secretary of the Interior Ken Salazar  wrote Alaska Governor Sean Parnell that ``BLM is committed to working  with the State to consider further modifications of PLO 5150``…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…County's Veterans Services Director and the  Administrator of the Ocala/Marion Veterans Memorial Park. He and his  staff were awarded the ``Service Office of the Year'' in 2009 and 2012,  making Marion County the only county to have received the award twice  from the Department of Florida and the VFW.\n\nI congratulate him on an incredible career and thank him…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…the FDA. It was the  first-ever market incentive for pharmaceutical companies to develop  childhood cancer treatments. Prior to that, there were none.\n\nSince its inception in 2012, 63 vouchers have been awarded for  treatments of at least 39 different rare pediatric diseases, 36 of  which previously had no FDA-approved treatments. These diseases  typically…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…long-term well-being. However, today nearly three in four school- age children are not getting their recommended daily intake of dairy.\n\nSince whole milk was removed from schools in 2012, we have seen  declines in milk consumption, increased food waste, and growing  concerns about childhood nutrition. This legislation is a commonsense  solution that simply gives…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…support of H.R. 3301, the ELEVATE  Act, and thank Congressman Nunn for his leadership on this forward- looking and bipartisan bill.\n\nOne of the key successes of the JOBS Act of 2012 was the creation of  emerging growth companies, or EGCs, small and midsized firms given  tailored disclosure requirements to encourage them to go public. These  companies are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692762/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reservations, terms, conditions, and       covenants described in the quitclaim deed from the United       States to the City of Paducah, Kentucky, executed on April       27, 2012, and recorded by the Clerk of the County Court of       McCracken County, Kentucky, on pages 247 through 260 of Deed       Book 1229.\n\n(c) Conditions of Extinguishment.--In…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Technology           or Capability (Sec. 36(b)(5)(C), AECA)\n\n(i) Purchaser: Government of Israel.\n\n(ii) Sec. 36(b)(1), AECA Transmittal No.: 12-69; Date:       December 14, 2012; Implementing Agency: Air Force.\n\nFunding Source: Foreign Military Financing.\n\n(iii) Description: On December 14, 2012, Congress was       notified by congressional certification…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Carolina, Mac enlisted  in the United States Marine Corps as an infantry officer in 1987. Mac  remained on active duty for eight years and continued his reserve duty  through 2012. During his distinguished military career Mac was also a  Reconnaissance Officer and deployed to the Middle East in support of  Operation Desert Shield, Desert Storm, and in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…amended by striking ``Assistant       Secretary'' each place the term appears and inserting ``Under       Secretary''.\n\n(11) Middle class tax relief and job creation act of       2012.--Title VI of the Middle Class Tax Relief and Job       Creation Act of 2012 (47 U.S.C. 1401 et seq.) is amended--\n\n(A) in section 6001 (47 U.S.C. 1401)--\n\n(i) by striking paragraph…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…school, was  another place that lost a Toastmaster factory. In 2011, the town of  about 8,000 people lost its modular home manufacturing factory to the  housing crisis too. In 2012, its bread factory filed for bankruptcy. In  2013, Nordyne, which manufactured air and heating products, announced  it would be moving production from Boonville to--guess where--Mexico,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]