[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…held several key positions,  including Event Manager, Director of Operations, Building Manager, and  Facility Manager, before being appointed Executive Director on October  8, 2014. In every role, Jim led with humility and purpose, ensuring  that the Convention Center served as a welcoming, world-class venue for  both residents and visitors.\n\nUnder his…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…spanned several decades. Sharon worked with unwavering  commitment at Standard Meat Company from 1979 to 1993 and then with  Tarrant County MHMR from 1993 until her retirement in 2014.\n\nSharon's faith was an integral part of her life. She was baptized at  an early age and remained a devoted member of the Lake Como Church of  Christ, where she was a constant…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…becoming a  trusted voice in the Chattahoochee Valley sports community. His  dedication to broadcasting earned him induction into the Chattahoochee  Valley Sports Hall of Fame in 2014.\n\nCliff was not only committed to education and broadcasting but also  to his community. As the saying goes, ``Service is the rent that we pay  for the space that we occupy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Janicki's service as a County Commissioner for Skagit  County, Washington.\n\nCommissioner Janicki was first elected to the Skagit County Board of  County Commissioners in November 2014, following a career of more than  thirty years as the Chief Financial Officer for Janicki family  businesses.\n\nDuring her eleven years in office, Commissioner Janicki has been…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…path, the annual deficit is projected to reach  $2.9 trillion by 2034.\n\nOur national debt has reached unprecedented levels as well. In 2004,  the total debt was $7 trillion. By 2014, it had increased to $18  trillion. In 2019, it stood at $23 trillion. Today, our total debt has  surpassed $36 trillion.\n\nOur gross debt-to-GDP ratio is now 124 percent, the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…2026.      Speaker Mike Johnson,      House of Representatives.      Minority Leader Hakeem Jeffries,      House of Representatives.\n\nTo Speaker Johnson and Leader Jeffries: In 2014, a       Washington, DC resident (name withheld to protect the       victim's privacy) abused his wife with a TASER, repeatedly       shocking her in the face and head. While…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…laid out today, those terms include  ceding Ukraine's territory to Russia. I say no. Nyet. Nemaye. No.\n\nThe fact is Russia is losing the war it started without provocation.  In 2014, she began during the Olympics, so no one would notice how she  went in the back door. It is losing the war that Putin started. He  escalated it in even bloodier fashion when…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…improbably elevated  into an American Secretary of Defense, announced that NATO membership  for Ukraine was off the table. Going further, he suggested that  Ukraine's return to its 2014 borders was no longer in the cards.  Hegseth thereby deprived Ukraine and the West of two of their most  valuable bargaining chips in determining the shape of any peace  agreement…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…According to the U.S. Center for Disease Control and Prevention, of  the 172,258 men in the United States who were diagnosed with prostate  cancer, only 28,343 men died of it in 2014.\n\nThis supports the thought that screening programs may be detecting  what otherwise might be a silent disease. If caught in time, it doesn't  have to be a death sentence.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. government, but not to state governments.\n\nWhile RFRA was designed to be a shield to protect religious freedom,  it is being used, as evidenced by the Supreme Court's 2014 Hobby Lobby  decision, as a sword to discriminate against the LGBTQ+ community and  women. Republicans in Congress have cited RFRA as a justification for  trying to overturn…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692151/introduction-of-the-district-of-columbia-non-discrimination-home-rule-act-of-2025"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Dallas Police Department and the  Lansing, Michigan, Police Department before becoming Police Chief and  then City Administrator for the City of Chowchilla, California.\n\nIn 2014, Mr. Varney came to Madera and was elected to serve as the  Madera County Sheriff. In 2020, the Madera County Board of Supervisors  appointed Mr. Varney as County Administrative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…attack or stroke and provide high- quality care. In these high-pressure cardiac situations, timely care  from an EMS team can be the difference between life and death.\n\nSince 2014, Evergreen Fire/Rescue (EFR) has been honored with this  award four times. EFR Chief Dave Montesi attributes the team's success  to their experienced paramedics, most of whom…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…Festival and won the award for Best Direction. This  film elevates the stories of women of color whose lives are unsettled  when a spouse becomes incarcerated.\n\nAva DuVernay's 2014 film Selma followed the civil rights march  shepherded by Dr. Martin Luther King, Jr. that resulted in the  enactment of the Voting Rights Act. When developing this film, DuVernay…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…and Civil Rights Review Team  for President Barack Obama's Presidential Transition Team.\n\nGiven his high qualifications and extensive experience, it is no  surprise that in 2014, the good people of Prince George's County,  Maryland elected Mr. Barron to the House of Delegates. In the state  legislature, he prioritized public safety and criminal Justice…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…catastrophic and even increases the anti-choice provisions in  the bill by a dramatic amount. It will mean that nearly one in seven  Americans who has been insured through ACA since 2014 will be subject  to this change.\n\nAnd while our communities get sicker, our kids get hungry.  Republicans weren't satisfied with simply making 4 million kids go  hungry. They…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "John Thune", "party": "Republican", "sentence": "…something that the Federal  Government--those are programs that have been in place for a really  long time.\n\nBut if you look at what has happened in the Consumer Price Index  since 2014--so take this stretch right here. That is the blue line. The  blue line is how much costs have gone up in our economy overall. That  is about 39 percent over the past 10, 11,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…University in 2003 with his Bachelor of Business  Administration. He began his career out of college as a financial  advisor and sales representative for multiple firms. In 2014, Nate  joined the Utter, Pike, & Dobbs Private Wealth Management Group of  Wells Fargo Advisors, where he currently serves as a partner and  managing director. In addition to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690209/recognizing-congressional-patriot-award-recipient-nate-pike"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Russia and the West.\n\nIn this same speech, he says the West is primarily at fault for the  conflict in the world today and that it was the West that incited a  Ukrainian coup in 2014 and further unrest in Eastern Ukraine in 2022,  which necessitated Russian military action to liberate the people of  Crimea and Eastern Ukraine. Putin says that the war would…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…launched a career with the Nation's leading retailer, with  promotions to CEO of Sam's Club in 2005, Walmart International in 2009,  and finally CEO of the entire enterprise in 2014.\n\nWith a market cap of $195 billion, under his tenure Walmart's value  has increased by more than 350 percent and a current market cap of  around $900 billion. His leadership…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…related to compliance with other Federal       law;\n\n(4) modernize the recordkeeping requirements contained in       the original depredation order; and\n\n(5) remove the June 30, 2014, expiration date contained in       the original depredation order.\n\n(c) Renewal.--Not less than once every 5 years after the       date on which the Secretary reissues the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…poisoning from hemp-derived products, and so are children all across  the country. It is not just a Kentucky problem.\n\nHow did we get here? Let's go back to the beginning.\n\nBack in 2014, I lead the effort to secure pilot programs for  industrial hemp, and I led the effort to legalize the crop in 2018.  This industry has seen tremendous growth, especially in…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…for the community.\n\nMayor Manier has earned numerous accolades including the President's  Servant Leader Award from Eureka College, being named Washingtonian of  the Year in 2014, and being elected twice as the Second Vice President  of the Illinois Municipal League.\n\nUndoubtably, Mayor Manier's leadership will leave a lasting impact on  the city of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689608/commending-mayor-gary-manier-for-24-years-of-service-to-central-illinois"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…longstanding inefficiencies in the appeals  process. When combined with the high volume of cases, it has resulted  in a backlog of over 650 pending appeals dating all the way back to  2014.\n\nThe IBLA receives on average 290 appeals per fiscal year. Of those  cases that are not resolved on jurisdictional or procedural grounds,  only 2 percent are decided in favor…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691037/expedited-appeals-review-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Institute, and       activities relating to the national cybersecurity awareness       and education program under section 303 of the Cybersecurity       Enhancement Act of 2014 (15 U.S.C. 7443).\n\n``(3) Review and update of resources.--Not later than two       years after the date of the enactment of this subsection and       not less frequently than…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…interest and our values.  And, of course, that shapes their actions and their decisions.\n\nIn February 2022, Russia invaded Ukraine, escalating a war that had  started back in 2014 and continues today with massive casualty figures  on both sides now ranging into the millions. October 7, 2023, Hamas  terrorists,  who are Iranian proxies, launched the deadliest…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Veterans' Advisory Committee, which  allowed the Congresswoman to gain additional insights, perspectives,  and ideas to drive her oversight and legislative agenda.\n\nIn July 2014, Mac landed his next role in Congress working for the  Select Committee on Benghazi. He was initially hired to serve as the  Select Committee's Senior Counsel and then moved…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…House of Representatives.\n\nAn Altoona, Pennsylvania native, Christopher began his near decade  long career on the Hill a year after graduating from Pepperdine  University in 2014. Christopher has served in many different roles  during his tenure and worked for Representatives Sean Duffy (WI-07),  Keith Rothfus (PA-12), Jim Sessenbrenner (WI-05), and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…corruption, or acts of       violence or intimidation in relation to the blocking of Euro-      Atlantic integration in Georgia:\n\n(A) Any individual who, on or after January 1, 2014, has       served as a member of the Parliament of the Government of       Georgia or as a current or former senior official of a       Georgian political party.\n\n(B) Any individual…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…recognitions including the very special Vatican Award,  which required many levels of nomination to be considered and the  Benemerenti Medal from Pope Francis given to him in 2014, recognizing  65 years of service to the Roman Catholic Church.\n\nWith his wife Marion right beside him, he has served the Huntsville  community in various capacities for over…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…prevent these birds from wiping out their stock. The Aquaculture  Depredation Order is nothing new. It is the same commonsense tool that  was easily reinstated in 2003, 2009, and 2014.\n\nAquaculture farmers have been struggling for years with the  importation of nondomestic catfish flooding the market. Every year,  American catfish farmer communities lose…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}]