[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…held several key positions,  including Event Manager, Director of Operations, Building Manager, and  Facility Manager, before being appointed Executive Director on October  8, 2014. In every role, Jim led with humility and purpose, ensuring  that the Convention Center served as a welcoming, world-class venue for  both residents and visitors.\n\nUnder his…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…spanned several decades. Sharon worked with unwavering  commitment at Standard Meat Company from 1979 to 1993 and then with  Tarrant County MHMR from 1993 until her retirement in 2014.\n\nSharon's faith was an integral part of her life. She was baptized at  an early age and remained a devoted member of the Lake Como Church of  Christ, where she was a constant…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…becoming a  trusted voice in the Chattahoochee Valley sports community. His  dedication to broadcasting earned him induction into the Chattahoochee  Valley Sports Hall of Fame in 2014.\n\nCliff was not only committed to education and broadcasting but also  to his community. As the saying goes, ``Service is the rent that we pay  for the space that we occupy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Janicki's service as a County Commissioner for Skagit  County, Washington.\n\nCommissioner Janicki was first elected to the Skagit County Board of  County Commissioners in November 2014, following a career of more than  thirty years as the Chief Financial Officer for Janicki family  businesses.\n\nDuring her eleven years in office, Commissioner Janicki has been…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…path, the annual deficit is projected to reach  $2.9 trillion by 2034.\n\nOur national debt has reached unprecedented levels as well. In 2004,  the total debt was $7 trillion. By 2014, it had increased to $18  trillion. In 2019, it stood at $23 trillion. Today, our total debt has  surpassed $36 trillion.\n\nOur gross debt-to-GDP ratio is now 124 percent, the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…2026.      Speaker Mike Johnson,      House of Representatives.      Minority Leader Hakeem Jeffries,      House of Representatives.\n\nTo Speaker Johnson and Leader Jeffries: In 2014, a       Washington, DC resident (name withheld to protect the       victim's privacy) abused his wife with a TASER, repeatedly       shocking her in the face and head. While…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…laid out today, those terms include  ceding Ukraine's territory to Russia. I say no. Nyet. Nemaye. No.\n\nThe fact is Russia is losing the war it started without provocation.  In 2014, she began during the Olympics, so no one would notice how she  went in the back door. It is losing the war that Putin started. He  escalated it in even bloodier fashion when…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…improbably elevated  into an American Secretary of Defense, announced that NATO membership  for Ukraine was off the table. Going further, he suggested that  Ukraine's return to its 2014 borders was no longer in the cards.  Hegseth thereby deprived Ukraine and the West of two of their most  valuable bargaining chips in determining the shape of any peace  agreement…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…for unprovoked war and  atrocities on a sovereign nation.\n\nIt was Russia's invasion that shattered Ukraine's peace, beginning  with the invasion and annexation of Crimea in 2014 and through the  full-scale invasion that began just over 3 years ago. Russian forces  are committing horrific and documented war crimes against Ukrainian  soldiers and innocent…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688193/rapid-response-subgroup"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Newlands' name next to the fountain. A resolution to remove Newlands'  name from the fountain was first introduced by the D.C. Chevy Chase  Advisory Neighborhood Commission in 2014. On July 27, 2020, the  commission voted unanimously to ask the National Park Service (NPS) to  remove the plaque bearing Newlands' name and to begin discussion on a  new name…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Dallas Police Department and the  Lansing, Michigan, Police Department before becoming Police Chief and  then City Administrator for the City of Chowchilla, California.\n\nIn 2014, Mr. Varney came to Madera and was elected to serve as the  Madera County Sheriff. In 2020, the Madera County Board of Supervisors  appointed Mr. Varney as County Administrative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…attack or stroke and provide high- quality care. In these high-pressure cardiac situations, timely care  from an EMS team can be the difference between life and death.\n\nSince 2014, Evergreen Fire/Rescue (EFR) has been honored with this  award four times. EFR Chief Dave Montesi attributes the team's success  to their experienced paramedics, most of whom…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…and Civil Rights Review Team  for President Barack Obama's Presidential Transition Team.\n\nGiven his high qualifications and extensive experience, it is no  surprise that in 2014, the good people of Prince George's County,  Maryland elected Mr. Barron to the House of Delegates. In the state  legislature, he prioritized public safety and criminal Justice…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…Festival and won the award for Best Direction. This  film elevates the stories of women of color whose lives are unsettled  when a spouse becomes incarcerated.\n\nAva DuVernay's 2014 film Selma followed the civil rights march  shepherded by Dr. Martin Luther King, Jr. that resulted in the  enactment of the Voting Rights Act. When developing this film, DuVernay…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…catastrophic and even increases the anti-choice provisions in  the bill by a dramatic amount. It will mean that nearly one in seven  Americans who has been insured through ACA since 2014 will be subject  to this change.\n\nAnd while our communities get sicker, our kids get hungry.  Republicans weren't satisfied with simply making 4 million kids go  hungry. They…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…recognitions including the very special Vatican Award,  which required many levels of nomination to be considered and the  Benemerenti Medal from Pope Francis given to him in 2014, recognizing  65 years of service to the Roman Catholic Church.\n\nWith his wife Marion right beside him, he has served the Huntsville  community in various capacities for over…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…interest and our values.  And, of course, that shapes their actions and their decisions.\n\nIn February 2022, Russia invaded Ukraine, escalating a war that had  started back in 2014 and continues today with massive casualty figures  on both sides now ranging into the millions. October 7, 2023, Hamas  terrorists,  who are Iranian proxies, launched the deadliest…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…something that the Federal  Government--those are programs that have been in place for a really  long time.\n\nBut if you look at what has happened in the Consumer Price Index  since 2014--so take this stretch right here. That is the blue line. The  blue line is how much costs have gone up in our economy overall. That  is about 39 percent over the past 10, 11,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…organization.\n\nAfter graduating from Oklahoma State, Riley moved to Washington,  D.C., to work for then-Chairman Lucas on the House Agriculture  Committee. There he was part of the 2014 farm bill and later spent a  few months with Senator Lankford before serving as the director of  advocacy and government relations for the national FFA organization.\n\nHe would…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…addresses a serious concern regarding  the manufacturing and selling of unregulated, intoxicating THC products  nationwide.\n\nI led the effort to legalize industrial hemp through the 2014 pilot  program and the 2018 farm bill. Unfortunately, companies have exploited  a loophole in the 2018 legislation by taking legal amounts of THC from  hemp and turning it into…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696662/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Outstanding Alumnus of the  University of Louisiana in 2008, introduction to the Louisiana Aviation  Hall of Fame in 2011, and the Oklahoma Military Hall of Fame in 2012.  In 2014, he was the recipient of the Congressional Gold Medal as a  member of the American Fighter Aces.\n\nColonel DeBellevue and his wife, Sally, have raised a family grounded  in service,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Steinert Jazz, a group  dedicated to supporting the Steinert High School Jazz Band Program. In  this role, he helped organize events and fundraisers for these  students. Between 2014 and 2017, he volunteered with the music program  at Princeton High School. Additionally, for the past decade, he has  volunteered as a docent for Cranbury Historic Home Tours.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "French Hill", "party": "Republican", "sentence": "…clerk-typist back in  1982. After taking time away to earn an engineering degree from the  University of Memphis, she returned to the department as a civil  engineer in 1998.\n\nIn 2014, she was promoted to deputy director and chief operating  officer, and she became the agency's first female director in early  2020.\n\nLorie guided the department through the…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…passed away in the tragic helicopter accident in  Washington, D.C., on January 29.\n\nSergeant O'Hara was a native of Lilburn, Georgia, who began serving  in the Army in July of 2014 when he enlisted at the age of 18. He  served a tour in Afghanistan in 2017 and then was deployed at Hunter  Army Airfield in Savannah, Georgia. Most recently, he was serving…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687967/mourning-the-loss-of-staff-sergeant-ryan-austin-ohara"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…House of Representatives.\n\nAn Altoona, Pennsylvania native, Christopher began his near decade  long career on the Hill a year after graduating from Pepperdine  University in 2014. Christopher has served in many different roles  during his tenure and worked for Representatives Sean Duffy (WI-07),  Keith Rothfus (PA-12), Jim Sessenbrenner (WI-05), and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…realignment of Highway 50  in California, the rancheria has become largely landlocked. This has  prohibited the Tribe's growth and restricted its housing opportunities.\n\nIn 2014, roughly 41 acres of BLM land were placed into trust for the  Tribe to assist with Tribal housing needs. Developing the land for  housing has proved difficult, however, due…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Russia and the West.\n\nIn this same speech, he says the West is primarily at fault for the  conflict in the world today and that it was the West that incited a  Ukrainian coup in 2014 and further unrest in Eastern Ukraine in 2022,  which necessitated Russian military action to liberate the people of  Crimea and Eastern Ukraine. Putin says that the war would…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…prevent these birds from wiping out their stock. The Aquaculture  Depredation Order is nothing new. It is the same commonsense tool that  was easily reinstated in 2003, 2009, and 2014.\n\nAquaculture farmers have been struggling for years with the  importation of nondomestic catfish flooding the market. Every year,  American catfish farmer communities lose…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…one of the rising stars of the       New York delegation, sometimes referred to as ``Brooklyn's       Barack.'' Hakeem is committed to electing a Democrat majority       in 2014 and is encouraging his friends to participate in the       DCCC fundraising dinner with President Obama and Hakeem       Jeffries.\n\nIt ends with a number for Jeffrey Epstein…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Tom Prior has made in our community through his  volunteerism at the Good Samaritan Clinic in Pasco County since 2014.  Tom began volunteering in the clinic's pharmacy and quickly became one  of the clinic's Eligibility and Referral Specialists. Tom reviews the  applications for the clinic's…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692163/recognizing-tom-prior"}]