[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…form dubbed a FedAccount, holds the promise to address some       of the problems with the payment system.\n\nConceived by Lev Menand of Columbia Law School in June       2018, the CBDC would be a Federal Reserve account. It would       be available to ``any U.S. resident or business in digital       wallets operated by the Federal Reserve, the Post…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Our commonsense plan to require price disclosures in direct-to- consumer drug ads has already passed the Senate one time before.  Senator Grassley and I worked together in 2018, because we knew that 88  percent of the American people support what we are doing--disclosure of  price and reduction of the cost of drugs to consumers.\n\nIn fact, because of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…advocating for organized labor.\n\nSince 2007, Terry has served as the co-chair of the Finishing Trades  Institute of the Upper Midwest (FTIUM), helping FTIUM gain  accreditation in 2018. He has long advocated for expanding educational  pathways for trade students and I had the pleasure of working with him  on my bipartisan Supporting Apprenticeship Colleges…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Brothers Big Sisters of McHenry County, an  organization that provides critical mentorship services to children,  helping them develop the confidence they need to succeed. Since 2018,  she has been a passionate advocate for the organization, opening doors  of opportunity for countless young people. Furthermore, Ms. McClain has  dedicated her time and expertise…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…legislation committed to moving this  Nation forward.\n\nMr. Speaker, I don't say that lightly. I look at Representative  Houlahan and Representative Baird, two Members of the class of 2018,  both in their fourth term. I have passed legislation with both of them.  Now they have joined together to pass H.R. 730, a STEM bill, science,  technology, engineering, and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…CORREA. Mr. Speaker, today, I rise to recognize the birthday of  Vietnamese human rights defender Le Dinh  Luong. Mr. Le is a peaceful activist and a prisoner of conscience.\n\nIn 2018, he was persecuted for campaigning for compensation for  Vietnamese fishermen affected by the Formosa environmental disaster.  Mr. Le is not the first Vietnamese individual…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, 7 years ago, on June 28, 2018, a gunman who  should never have been able to purchase a firearm, walked into the  Capital Gazette and killed five members of our hometown newspaper:  Gerald Fischman, Rob Hiaasen,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693114/capital-gazette-shooting"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…respectful care. This       work has been more than a job--it has been my way of giving       back and contributing meaningfully to the country that       offered me protection.\n\nIn 2018, conditions in Haiti worsened significantly       following the assassination of the president. Gang violence       and widespread kidnappings escalated, making everyday life…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…freeze. That took place because that grid was  unified, and they couldn't call in power from elsewhere.\n\nThis graph does two things. It takes a look at 1 month, August back  in 2018, and it looks at what power costs at different levels of demand  on the grid. So in 2018, if you had 40 units of gigawatts of demand,  then you were paying about 20 cents per…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…David A. Lewis       (2007-2009), Rahmad D. Bauldrick, Sr. (2009-2011), Seth L.       Wilson (2011-2013), Leonard C. McKinnis, Jr. (2013-2016),       Eddie H. Reynolds (2016-2018), Decature Tounsel (2018-2019),       David A. Lewis (2019-2020), Ashton L. Clark (2020-2022),       Rahmad D. Bauldrick, Sr. (2022-2024), L. Bernard Jakes (2024-      2025),…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…what happened. President Trump has been  openly trying to get Jimmy Kimmel fired since his first term. Press  reports detail White House staff calls to Disney as far back as 2018 to  complain about Kimmel's jokes, but now, President Trump has a willing  partner at the FCC with Chairman Carr.\n\nAn agency that once prized its independence is now overtly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…the Appropriations Committee, Senator  Shelby, along with other Republicans and in working with Democrats,  vowed to return to regular order and committed to it.\n\nIn May of 2018, President Trump submitted a rescissions package just  like the one we are contending with today. Enough Republicans joined  all of the Democrats in opposing it. It failed,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…aggressive sales goals and  associated incentive compensation plans could encourage employees'  gaming and create compliance problems.\n\nThe bank was fined again and again until, in 2018, I pushed the bank  regulators to use their full toolkit to hold a repeat offender like  Wells Fargo accountable. The Federal Reserve, under former Chair Janet  Yellen's leadership…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…community  engagement with a Carnegie Research Classification.\n\nUC Merced was the first public research university in the Nation to  reach verified operational carbon neutrality in 2018, and in 2020,  completed its ``UC Merced 2020 Project'' which was the largest social- infrastructure public-private partnership in U.S. higher education at  the time. This project…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…complaints  with the CFPB over these unfair and deceptive practices, like  skyrocketing fees.\n\nJust one example: A servicemember in Connecticut filed a claim with  the CFPB in 2018 about Wells Fargo's predatory overdraft practices. He  reported he had an overdraft protection turned off his account, but  Wells Fargo still allowed autopayments to be taken…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…revitalization of Opelika's downtown. Because of the  influx of citizens, over 2,500 new single-family homes have been built.  He created the Commission on Crime & Violence in 2018 to help decrease  crime.\n\nA graduate of Southern Union State Community College, Fuller was  President and CEO of Fuller Broadcasting Company, Inc. from 1985 until  1998. His…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Brannon Rains on his  career with the House Committee on Energy and Commerce.\n\nA Dundee, Oregon native and 2018 graduate of Oregon State University,  Brannon began his career in the U.S. House of Representatives as an  intern for his home state Congressman, Representative Greg Walden…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690576/recognizing-brannon-rains"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…International Protection       and Enhancement Initiative (TAIPEI) Act of 2019.\n\n(9) In its fact sheet, entitled ``U.S. Relations with       Taiwan'', published on August 31, 2018, the Department of       State asserts: ``The United States supports Taiwan's       membership in international organizations that do not require       statehood as a condition…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…treatment, and recovery for millions of Americans suffering  from substance abuse disorders.\n\nThanks to the investments from the original SUPPORT for Patients and  Communities Act in 2018 and the efforts of the Trump administration, we  are finally starting to see a decrease in the overdose death rate.\n\nFlorida is a shining example of this progress. In Florida,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691878/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…amounts in reserve until  the consideration of reconciliation legislation.\n\nFor purposes of enforcing the Senate's pay-as-you-go rule found in  section 4106 of the fiscal year 2018 congressional budget resolution, I  am resetting the Senate's scorecard to zero for all fiscal years.\n\nThe 2025 congressional budget resolution's budgetary levels and the  budget…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…adversaries of items required for       supporting undersea cables consistent with United States       policy described in section 1752 of the Export Control Reform       Act of 2018 (50 U.S.C. 4811).\n\n(b) Matters To Be Included.--The strategy required under       subsection (a) shall include the following:\n\n(1) An identification of items required for supporting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…well over 31,000 jobs to foreign trade. By 2010, our trade deficit with  Mexico had cost us 12,600 Missouri jobs. By 2013, we had shipped 44,200  Missouri jobs off to China. By 2018, Missouri had lost more than 90,000  jobs in manufacturing alone--over 25 percent of our industrial base.\n\nUntil a few decades ago, southeast Missouri was a national hub for…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…assessment and antifraud       strategy for APTC, we reviewed documentation of CMS's       policies and fraud risk management activities related to       APTC. This included CMS's 2018 fraud risk assessment for       APTC. Additionally, we interviewed agency officials about       CMS's fraud risk management activities in this program. We       reviewed relevant…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…proved critical in his unique ability to  support my efforts on behalf of the men and women at Sheppard Air Force  Base in Wichita Falls, Texas. Having trained at Sheppard in 2018, where  he completed the Air Force's Maintenance Officer Fundamental Course, he  brought firsthand understanding of the world-class technical training  and education that Sheppard…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of  Chicago, Kate began her career as a Staff Assistant for Senator Mark  Kirk (IL) before becoming Legislative Assistant and Correspondent for  Senator Dan Sullivan (AK). In 2018, Kate joined President Trump's  administration serving as Deputy Director of Legislative and  Intergovernmental Affairs for the National Telecommunications and  Information…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695125/recognizing-kate-oconnor-harper"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…significant voluntary steps to       identify and implement cleaner engineering technology       solutions within their operations and facility designs. For       example, since 2018, members of The Environmental       Partnership, a voluntary industry initiative administered by       API and whose members represent nearly 70 percent of U.S.       onshore…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, I rise today to discuss the original  intent of the 2018 farm bill's Federal hemp legislation and the need to  restore it.\n\nEarlier this year, a report from the University of Kentucky found  that cannabis-related poisonings among…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Springs, Florida. I rise to honor the  retirement of Steve Kennedy, longtime City Manager for the City of  Green Cove Springs.\n\nSteve joined the city as City Manager on October 1, 2018, following  more than 38 years of exemplary municipal service in Georgia. During  his nearly seven-year tenure here, he led with vision, steadiness, and  a keen sense of public…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…regarding  the manufacturing and selling of unregulated, intoxicating THC products  nationwide.\n\nI led the effort to legalize industrial hemp through the 2014 pilot  program and the 2018 farm bill. Unfortunately, companies have exploited  a loophole in the 2018 legislation by taking legal amounts of THC from  hemp and turning it into intoxicating substances…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696662/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…capacity supporting the  Committee on House Administration and the Subcommittee on Modernization  and Innovation.\n\nNoah has served as the Deputy House Legislative Counsel since 2018,  helping lead the office and manage a committed team of experts to  provide the House with impartial and confidential drafting and  counseling services for bills, amendments,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}]