[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "President, Secretary Esper, and Administrator Gaynor:\n\nWe write today to raise a number of issues impacting the National Guard personnel deployed in support of the fight against Coronavirus Disease 2019 (COVID-19)."}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Now, 2019 was a tough year for you, and 2020 will  be worse."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Department of Education's (``Department'') 2019       Borrower Defense Rule (``2019 Rule'') pursuant to the       Congressional Review Act."}, {"senator": "Michael F. Bennet", "party": "Democrat", "sentence": "Senator Michael Bennet today released the following statement after the Senate passed the bipartisan, bicameral emergency supplemental funding bill to respond to the Coronavirus Disease 2019 (COVID-2019)."}, {"senator": "Tom Udall", "party": "Democrat", "sentence": "2891, Udall's Tribal Wildlife Corridors Act of 2019, which he introduced last November with U.S."}, {"senator": "Robert Menendez", "party": "Democrat", "sentence": "As of December 2019, Turkey was the world's second worst jailer of  journalists with 47 in prison, coming in close second to China with 48."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "That is what the President said on May 8, 2019."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "The Senate confirmed Judge Walker to the District Court for the Western District of Kentucky in October 2019, with no Democratic votes."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Brown, Jamie Raskin, and David Trone today announced $500,000 in federal funding to support Maryland's response to the 2019 novel coronavirus (COVID-19)."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "United States Senator Elizabeth Warren (D-Mass.) sent a letter to Attorney General William Barr and Executive Office for Immigration Review (EOIR) Director James McHenry urging them to close immigration courts in light of the coronavirus disease 2019 (COVID-19) pandemic."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "Northwell's 101,000-square-foot, state-of-the-art Core Lab, which opened in 2019, is part of the Clinical Laboratory of New York Alliance formed in 2014 by Northwell and NYC Health + Hospitals to integrate laboratory services."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "Senator Gary Peters (MI) was recognized as the 12th-most bipartisan Senator -- and 3rd most bipartisan Democrat -- in new rankings released today by the non-partisan Lugar Center and McCourt School of Public Policy at Georgetown University for his work in 2019."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "Approximately 5.8 million Americans live with Alzheimer's disease, and Alzheimer's and other dementias are anticipated to cost $290 billion in 2019 alone."}, {"senator": "Michael B. Enzi", "party": "Republican", "sentence": "Since CBO's June 2019 Long-Term Budget Outlook, Congress  has passed and the President has signed legislation that would add more  than $2 trillion to our national debt over the next 10 years."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "\"I plan to explore options that protect taxpayer dollars and target medical resident training to best serve patients.\" Grassley, in an October 2019 letter, raised a series of questions about whether Medicare's GME program, which doles out close to $15 billion annually to incentivize the training of new physicians, is effectively and efficiently achieving its goals."}, {"senator": "James Lankford", "party": "Republican", "sentence": "Congratulations to John and his family for finally reaching this milestone after a long process together.\"\n\nHeil was nominated by President Trump on November 6, 2019."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Today's funding will be used to support wide-spread testing efforts by increasing capabilities to help track the spread and impact of the coronavirus disease 2019 (COVID-19)."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "(a) In General.--The additional preventive care services       and items for chronic conditions that may be treated as       preventive care for purposes of section 223(c)(2)(C) of the       Internal Revenue Code of 1986 as set forth in IRS Notice       2019-45 shall have the same force and effect as if included       in the enactment of this Act."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Senator John Hoeven today outlined federal resources made available in the Coronavirus Aid, Relief, and Economic Security (CARES) Act, legislation approved by Congress last week that will provide support to combat the health and economic impacts of the coronavirus disease 2019 (COVID-19) pandemic."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Department of Agriculture (USDA) announcing the third and final tranche of 2019 Market Facilitation Program (MFP) payments:\n\n\"Thank you to President Trump and Secretary Perdue for their continued support for American agriculture."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Senator Dan Sullivan (R-Alaska) today welcomed a report from the Administrative Office of the United States Courts detailing 100 public events promoting pro bono legal services for survivors of domestic violence and sexual assault that were held in 2019 in 86 judicial districts across the country in accordance with the Pro Bono Work to Empower and Represent (POWER) Act, Sullivan's legislation that was signed into law in 2018."}, {"senator": "David Kustoff", "party": "Republican", "sentence": "If I could, I will share just a few statistics:\n\nBetween 2019 and 2022, there was an 87 percent increase in theft from  mailboxes, according to the U.S."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "BLM published a draft EIS on August 30, 2019 and held 22 public meetings in affected communities, Anchorage, Fairbanks, and Washington, DC."}, {"senator": "John Boozman", "party": "Republican", "sentence": "Richard Lawrence, VA's Undersecretary for Benefits, 119,000 veterans are awaiting a compensation and pension (C&P) exam, up from 64,000 in November 2019."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "The results of the study came out in December of 2019 and helped inform the senators' ongoing effort to establish the creation of a Livestock Dealer Statutory Trust."}]