[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Celebrating Independence High School Varsity Winter Guard's 2025                       Scholastic State Championship\n\nMr.", "title": "Congratulating Chief Keith Johnson on His Retirement", "date": "2025-04-08"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "They  are relying on 1990s technology in 2025.", "title": "Faa", "date": "2025-05-05"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Grassley and  I are trying to do the same thing today by introducing the Trade Review  Act of 2025.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2025-04-03"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "President, we are quickly approaching the end of  2025, and this past year, particularly here in Congress, we have been  met with a lot of challenges, chaos, as well as change.", "title": "Unanimous Consent Requests--The Calendar", "date": "2025-12-17"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "President, I was absent on Saturday, August 2, 2025,  for rollcall vote no.", "title": "Vote Explanation", "date": "2025-08-02"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "The fraternity's 2025 International Achievement Week is from November  10, 2025, to November 17, 2025.", "title": "Recognizing Omicron Kappa Kappa Chapter of Omega Psi Phi Fraternity, Inc. for its Achievement Week and Honorees", "date": "2025-11-20"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "These five journalists earned top honors in the 2025 Ohio's Best  Journalism contest sponsored by the Cleveland, Columbus, and Cincinnati  chapters of the Society of Professional Journalists.", "title": "Recognizing Canton Repository Reporters", "date": "2025-07-22"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "910, the Taiwan Non- Discrimination Act of 2025, sponsored by Representative Kim from  California and cosponsored by Representative Green of Texas.", "title": "Taiwan Non-Discrimination Act of 2025", "date": "2025-06-23"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "1860,  the Women Veterans Cancer Care Coordination Act of 2025, as amended.", "title": "Women Veterans Cancer Care Coordination Act", "date": null}, {"senator": "Al Green", "party": "Democrat", "sentence": "This story from The Washington Post is dated June 9, 2025.", "title": "And Still I Rise: Denouncing the President's Authoritar-Ianism and Recognizing the Impeachment Warriors", "date": "2025-06-10"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "I celebrate the Boston Passport Agency's centennial milestone on  September 17, 2025, which marks Constitution Day and Citizenship Day.", "title": "Recognizing the Boston Passport Agency", "date": null}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Over the past few weeks, we have heard alarming reports that the  Trump administration wants to make good on its Project 2025 promise to  ``break up and downsize'' and privatize portions of NOAA, including the  National Weather Service.", "title": "National Oceanic and Atmospheric Administration", "date": "2025-02-26"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "2753, the Hands Off Medicaid and  SNAP Act of 2025, which would block the Republican budget from cutting  Medicaid or SNAP benefits and kicking people off of these lifesaving  programs.", "title": "Providing for Consideration of H.R. Support for Patients and Communities Reauthorization Act of Providing for Consideration of H.R. Save Sba From Sanctuary Cities Act of Providing for Consideration of H.R. American Entrepreneurs First Act of and Providing for Consideration of H.R. Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-04"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Speaker, I include in the Record an April 2, 2025, letter  addressed to Pam Bondi from 500 law firms and lawyers across the  Nation.", "title": "No Rogue Rulings Act of 2025", "date": "2025-04-08"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Most recently, the 2025 National Security Strategy asserts  that ``the Indo-Pacific is already and will continue to be among the  next century's key economic and geopolitical battlegrounds,'' reaffirms  our commitment to a free and open Indo-Pacific and prioritizes winning  the economic competition over the long term in the region.", "title": "Supporting the Prosper in the Pacific Act", "date": "2025-12-11"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "Speaker, I rise today to congratulate the high  school athletes from Wisconsin's Seventh District who competed in the  State championships during the 2025 spring sports season.", "title": "Congratulating High School Athletes From Wisconsin's Seventh District", "date": "2025-06-25"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "1084, which is the North  Dakota Trust Lands Completion Act of 2025.", "title": "Unanimous Consent Requests--The Calendar", "date": "2025-12-17"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "In 2025, 99 percent of Miami-Dade County Public Schools earned school  grades of A, B, or C, and the district achieved a record-breaking  graduation rate of 95.2 percent.", "title": "Congratulating St. Theresa Catholic School", "date": "2025-11-19"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Speaker, I rise today to recognize a distinguished  public servant from Hancock County, Mississippi, Brian ``Hooty'' Adam,  who will retire on December 21, 2025, after more than four decades of  serving his community.", "title": "Recognizing Brian ``hooty'' Adam", "date": "2025-11-18"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "72) relating to a  national emergency by the President on February 1, 2025, and ask for  its immediate consideration in the House.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "This Act may be cited as the ``Combatting International       Drug Trafficking and Human Smuggling Partnership Act of       2025''.", "title": "Combatting International Drug Trafficking and Human Smuggling Partnership Act of 2025", "date": "2025-11-19"}, {"senator": "James Risch", "party": "Republican", "sentence": "(vii) Date Report Delivered to Congress: September 9, 2025.", "title": "Arms Sales Notification", "date": null}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Speaker, I rise today to recognize  the Susquehanna Regional Emergency Medical Service, which recently  received the 2025 Dick Ferneau Career EMS Service of the Year Award.", "title": "Recognizing Susquehanna Regional Emergency Medical Service", "date": "2026-02-03"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "1949, the  Unlocking our Domestic LNG Potential Act of 2025.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "In 2023, he was appointed as the full-time Police Chief of  Robinson, where he later retired in August 2025.", "title": "Recognizing Danny Wallace Smith with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "On day one, President Biden placed a moratorium on  public land energy development that never truly went away until January  20, 2025, when President Trump was sworn into office and signed an  Executive order.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological", "date": "2025-02-25"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Caballero, MPH, who has received the Hepatitis B Foundation's 2025  Community Leadership Award.", "title": "Recognizing Jeffrey B. Caballero, Mph, Executive Director of the Association of Asian Pacific Community Health Organizations (Aapcho)", "date": "2025-08-15"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "He will be publishing his second book in Fall of 2025  titled Texas Ranger, Wise County.", "title": "Recognizing Congressional Patriot Award Recipient Sheriff Lane Akin", "date": "2025-04-28"}, {"senator": "French Hill", "party": "Republican", "sentence": "3390, the  Bringing the Discount Window into the 21st Century Act of 2025, which  has received broad bipartisan support in the Financial Services  Committee.", "title": "Bringing the Discount Window Into the 21st Century Act", "date": "2026-02-09"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Speaker, I rise today to speak in favor of the  Entrepreneurs with Disabilities Reporting Act of 2025.", "title": "Entrepreneurs with Disabilities Reporting Act of 2025", "date": "2025-06-03"}]