[{"senator": "Susie Lee", "party": "Democrat", "sentence": "Ms. LEE of Nevada. Mr. Speaker, I rise to recognize the week of March  24th to March 28th of 2025 as National Area Health Education Centers  Week, or AHEC week.\n\nSouthern Nevadans are facing a dire shortage of health care  providers, which means longer wait times, fewer choices,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689206/recognizing-national-area-health-education-centers-week"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "File: B-337673.      Date: January 16, 2026.                                    digest\n\nIn March 2025, the National Credit Union Administration       (NCUA) announced that it would no longer require federally       insured credit unions with more than $1 billion in assets to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…up on the 1-year  anniversary of when her uncle became the statistic of a Black man more  likely to die because of a heart attack, I am going to follow the theme  of the 2025 National Minority Health Awareness Month: Advancing  Commitments to Eliminate Health Disparities. I am going to fight any  effort by our President or my colleagues on the other…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…relationships.\n\nRecognizing this, successive administrations have committed to  deepening U.S. engagement in the region, including through trade and  investment. Most recently, the 2025 National Security Strategy asserts  that ``the Indo-Pacific is already and will continue to be among the  next century's key economic and geopolitical battlegrounds,'' reaffirms…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…I rise today to recognize the  National Roofing Contractors Association headquartered in Itasca,  Illinois, on the occasion of National Roofing Week between June 1-7,  2025.\n\nNational Roofing Week honors the efforts of thousands of roofing- related workers and businesses across the country, as well as the  industry's commitment to public service in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Speaker, today, I rise to recognize Aarit Koul as the  champion of the week for Ohio's 13th Congressional District.\n\nAarit, a freshman at Jackson High School, recently won the 2025  National Civics Bee. He competed against finalists from 38 other States  in five rounds, including one in which he presented a societal problem  and offered his suggestions for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I rise today to recognize May 12 to May 18,  2025, as National Salvation Army Week.\n\nFounded in 1865, the Salvation Army has been unfailingly committed to  serving those in need without discrimination. For more than 150 years,  the…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690965/national-salvation-army-week"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise to congratulate and recognize the  extraordinary bravery of Tesfaye Deyasso, who was named the 2025  National Hero of the Year by the National Association of Letter  Carriers.\n\nOn April 18, 2024, Mr. Deyasso witnessed a car drive off the highway  and crash into a barrier, erupting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690461/recognizing-the-extraordinary-bravery-of-tesfaye-deyasso"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…on the harmful consequences that it has on the  everyday lives of hard-working Americans.\n\nLet's first take a quick bird's eye view of the situation. At the  start of 2025, our national debt sat at a staggering $36.2 trillion.  Today, thanks in part to the irresponsible ``Big Ugly Bill'' that  Republicans and President Trump passed this summer, that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…KAPTUR. Madam Speaker, I rise today to highlight a bipartisan  resolution introduced alongside my northwest Ohio colleague,  Bob  Latta. It proclaims May 9 to May 18, 2025, as National American Birding  Week.\n\nEach spring, 3.5 billion birds from over 350 species migrate through  the United States to their breeding grounds. They stop along the shores…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…to their loved ones.\n\nIn February, the Defense POW/MIA Accounting Agency, DPAA, the Agency  primarily responsible for recovering America's servicemembers, unveiled  its 2025 National POW/MIA Recognition Day poster. Each year, the Agency  creates a poster commemorating the lives of U.S. servicemembers still  unaccounted for from past conflicts and showcasing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695075/national-powmia-recognition-day"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…day and leave this Nation a better  place.\n\nI am proud to have the support of more than 20 of my colleagues to  honor Charlie by dedicating his birthday--October 14, 2025--as  ``National Day of Remembrance for Charlie Kirk.''\n\nI want to thank my Senate colleagues for uniting together to honor a  great American patriot, a leader and friend.\n\nCharlie will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695709/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…patients. I also applaud their efforts to reduce unnecessary healthcare  costs.\n\nToday, I recognize these efforts on behalf of my constituents,  celebrating June 11, 2025, as National Time Out Day in District 21 and  across Texas.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692335/recognizing-national-time-out-day"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…today, I rise to congratulate and honor Dr.  Roosevelt Nivens, Superintendent of Schools for Lamar Consolidated  Independent School District for recently being named the 2025 National  Superintendent of the Year by The School Superintendents Association.\n\nDr. Nivens leads the way with innovation, high standards,  accountability, and joy for leading.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700275/congratulating-dr-roosevelt-nivens"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Mrs. MILLER-MEEKS. Mr. Speaker, I rise today to recognize Georgia  Clark, a student from West Liberty, Iowa, who represented our State  with pride and excellence at the 2025 National Civics Bee.\n\nCompeting against top middle schoolers from across the country,  Georgia placed in the top ten, a tremendous achievement.\n\nHeld in Washington, D.C., on Veterans…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…unanimous ``yes'' to advance to Hollywood.\n\nOn behalf of Fergus Falls and all of Minnesota, I wish Chris the best  of luck in the next round.    Glencoe-Silver Lake FFA Named 2025 National Model of Excellence Winner\n\nMrs. FISCHBACH. Madam Speaker, I rise today to honor the Glencoe- Silver Lake FFA chapter for being named the 2025 National Model of  Excellence…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700169/congratulating-chris-tungseth"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…extends beyond the classroom.\n\nThis year, Pennsylvania has special reason to celebrate. Ashlie  Crosson, an English teacher of Mifflin County High School, has been  named the 2025 National Teacher of the Year. A first-generation college  student, Ms. Crosson earned degrees from Susquehanna University and  Penn State and previously taught in Bellefonte, near…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690925/recognizing-ahslie-crosson-during-national-teacher-appreciation-week"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "Mrs. HOUCHIN. Mr. Speaker, I rise today to commemorate National PEO  Week, which starts May 18 and ends May 24, 2025.\n\nNational PEO Week will celebrate the important contributions of the  professional employer organization (PEO) industry, which provides  payroll, employee benefits, compliance assistance…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I rise to recognize Valencia Abbott, of  Rockingham Early College High School, who was recently named the 2025  National History Teacher of the Year.\n\nThis is a monumental accomplishment and one that speaks volumes to  Ms. Abbott's passion for education and her dedication to the students…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…this important legislation,  which the House Oversight and Government Reform Committee unanimously  passed last year and the House later passed as part of the fiscal year  2025 National Defense Authorization Act.\n\nI also thank the Cybersecurity, Information Technology, and  Government Innovation Subcommittee ranking member, the gentlewoman from  Ohio (Ms.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Max Miller", "party": "Republican", "sentence": "Mr. MILLER of Ohio. Mr. Speaker, I rise today to congratulate the  Independence Police Department for receiving the 2025 National Officer  Safety and Wellness award in comprehensive wellness. This is the top  award in the country, and Independence Police Department is the first  in Ohio ever to win…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, as a former county commissioner, I rise in  strong support of the Secure Rural Schools Reauthorization Act of 2025.\n\nSince the National Forest System was created, nearly 200 million  acres of rural America have been put aside for conservation,  recreation, and responsible natural resource development,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "Mr. DesJARLAIS. Madam Chair, I thank Chairman Rogers for the time.\n\nMadam Chair, I rise today in favor of the fiscal year 2025 National  Defense Authorization Act. This bill fundamentally reforms defense  acquisition to support a fighting force that will stand against those  who threaten the United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to  congratulate Penn State wrestling, the 2025 NCAA Division 1 national  champions.\n\nContinuing their dominance of NCAA wrestling, the Nittany Lions  brought  their 13th national title to Happy Valley.\n\nUnder the leadership of Coach…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689222/congratulating-penn-state-wrestling"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…to  the national debt. I was first elected to Congress in 2010. The debt  was $9 trillion. In 2017, I left for a period of time, it  was $18 trillion. Now we are in 2025, and the national debt is $36  trillion of debt. That is going to be put on the backs not only of our  children and grandchildren, but it is going to be put on the backs of  us as Americans…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}]