[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, here is the question: Do we pursue the  20th century energy vision featuring dirty, expensive fossil fuels, or  do we pursue the 21st century energy vision featuring inexpensive and  clean, renewable energy?\n\nTrump's energy emergency declaration is about one thing: He is  choosing the strategy of dirty, expensive…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 6644, the Housing for the 21st  Century Act, sponsored by myself and, of course, by Representatives  Hill, Cleaver, and Flood.\n\nOur housing and homelessness crisis has reached a breaking point, as  millions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Island, that ``the Government of the  United States . . . gives to bigotry no sanction, to persecution no  assistance.''\n\nIf these words are to mean something in our day in the 21st century,  we must insist that men like Ed Martin and his anti-Semitic associates  and friends have no place representing the people of the United States  in our government.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…communities need additional assistance and  capacity. That is why I am so incredibly grateful that the House passed  the Housing Our Communities Act, part of the Housing for the 21st  Century Act legislative package.\n\nThe Housing Our Communities Act directs the HUD Secretary to  establish a competitive grant program to support a wide range of  affordable…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699987/housing-is-a-human-right"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the workers.\n\nWell, I wanted to echo what President Trump said briefly there before  he was corrected by Mr. Miller. I was just in upstate New York in the  Adirondacks in the 21st Congressional District represented by Ms.  Stefanik. I met a bunch of dairy farmers there, who told me it was  impossible for them to find workers to work the farms. With the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…strategies_cost-of-federal-mandates-to-retain-fossil- burning-power-plants.pdf\n\nHttps://energyinnovation.org/wp- content/uploads/Coal-Cost-Update.pdf\n\nMr. Speaker, we cannot win the AI race of the 21st century with  energy policies from the 20th century. Not only is it bad policy, but  it is soul crushingly expensive to do so.\n\nHardworking American families are just looking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…all-electric vehicles. No. Trump is  saying we want to take away all those tax breaks too. Let's just make  it easy for the Chinese to take over the electric vehicle industry of  the 21st century. Let's just hand it over to them on a silver platter.\n\nWe are only 5 percent of the world's population. The other 95 percent  is going electric.\n\nThe other 95 percent…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this one big, ugly bill will do, devastate everyday  Americans.\n\nLinda writes to us, a small business owner. I believe she is from the  North Country. She lives in New York's 21st Congressional District, Mr.  Speaker. Linda is a flower farmer and flower importer in upstate New  York. Her small business has been impacted by Trump's tariffs on  products…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise in support of H.R. 6644, the Housing  for the 21st Century Act, which makes improvements to Federal programs  that will support housing development and affordability.\n\nThis bipartisan bill will broaden access to homeownership,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…embarrass her, but she was one of the three  finest students I ever had in constitutional law. She was a straight-A  student in the early 1990s. She is a straight-A student in the 21st  century. I am proud not only that she was my student but that she is my  friend and that she is my colleague. She doesn't disgrace us in any  way. She goes to work every day…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…are so many things that  we as a country should be doing to deal with medical innovation. I will  be the first to say: Republicans and Democrats have failed to step up  to the 21st century and do things that really can create more  efficiencies in our healthcare system.\n\nI really hope to see more bold thinkers about creating real  efficiency. But  what…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Corps provided job training, education and  housing for thousands of low-income, at-risk youth, preparing  Minnesota's workforce to meet the challenges and opportunities of the  21st century, including jobs in renewable energy and efficiency.\n\nWe cannot afford to abandon these investments during a worsening  climate crisis. American families are already…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…However, our Republican friends tell us that that means  that the Federal Government should be stuck with 1776 technology while  the competitors of the dollar race forward in the 21st century.\n\nThe largest super-PAC expenditures in history occurred last year. The  crypto industry spent more on independent expenditures--look at this.  If you combine all of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…unfortunately, is really substantively the bill that  she put forward and is really the real author of, but it carries  somebody else's name. It is the same with the Elizabeth Dole 21st  Century Veterans Healthcare and Benefits Improvement Act. It is an  amazing piece of legislation and amazingly substantive. The Elizabeth  Dole 21st Century Veterans Healthcare…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…struck down this  frivolous decree so that crane operators, laborers, and electricians  can get back to work this morning to create a modern and robust energy  grid for the 21st century.\n\nJudge Lamberth, a Reagan appointee, thoroughly reviewed the record of  the New England-based Revolution Wind offshore project and correctly  determined that the Department,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…feels it is only  right to celebrate both the storied past and bright future of the  College by holding Clinton Community College Day on May 22, 2025.\n\nOn behalf of New York's 21st Congressional District, I am proud to  celebrate Clinton Community College, its board, its staff, its faculty,  and most especially its students, past, present, and future.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…We are about to pass and the President will enthusiastically sign the  most sweeping upgrades to DOD's business practices in 60 years. This is  a monumental achievement.\n\nThe 21st century poses threats that will require the most creative  and innovative defenses. Americans are already building the technology  to meet those threats, and these reforms will…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…STUTZMAN. Mr. Speaker, I thank my colleague, Congressman  Haridopolos, for organizing this evening's event.\n\nI am proud to say that this body just passed the Housing for the 21st  Century Act in a strong bipartisan manner. Owning a home is the  American Dream. It is one of the best investments any person can  possibly make here in America.\n\nAt a time…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…fentanyl, and give our Border Patrol agents the  resources that they need.\n\nOur bill invests in our national security by ensuring our defense  systems are prepared to handle 21st century threats. It invests in  cutting-edge technology that our warfighters and our military needs for  its readiness. This package invests in modernizing our Nation's air…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the United States of America in Congress assembled,       SECTION 1. SHORT TITLE; TABLE OF CONTENTS.\n\n(a) Short Title.--This Act may be cited as the ``Housing       for the 21st Century Act''.\n\n(b) Table of Contents.--The table of contents for this Act       is as follows:  Sec. 1. Short title; table of contents.               TITLE I--BUILDING SMARTER…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, I thank the gentleman for yielding.\n\nI rise today in support in the Housing for the 21st Century Act.  After years of inaction, my home State of California has earned an F in  housing affordability. Under Gavin Newsom and Sacramento leadership,  hardworking families…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I thank the chairman, my good friend from  Arkansas, for yielding me time today.\n\nMr. Speaker, I rise in strong support of the Housing for the 21st  Century Act.\n\nThis legislation will lower housing costs for millions of Americans,  including tens of thousands of Tennessee families whom I represent.\n\nI am proud that my…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…history.\n\nA ``no'' vote on this bill is a vote for sabotaging the United  States' energy dominance and blocking critical investments to  revolutionize our military to address 21st century threats.\n\nIt eliminates over $700 billion in wasteful Medicaid spending for  illegal aliens and people who can work but refuse to work, instead of  America's most vulnerable.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693198/one-big-beautiful-bill-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…strong support of H.R. 2189,  the Law-Enforcement Innovate to De-Escalate Act of 2025, bipartisan  legislation that modernizes our Federal firearms laws to better align  with 21st century technology and the real-world needs of law  enforcement officers and the communities they protect.\n\nThe bill does something straightforward but important. It creates…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699900/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…this bill comes.\n\nMr. Speaker, it is not too often we have the opportunity to take a  piece of legislation that is over 100 years old in its origin and  modernize it into the 21st century. That is what we have done with the  technological advancements and the transparency.\n\nI am very proud of the work that our Agriculture Committee has done.  I certainly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Memorial  Day. Marie and David Troy are an  example to New Yorkers and to Americans. I truly respect and admire  them for their enthusiasm and patriotism.\n\nOn behalf of New York's 21st District, I want to thank Marie and  David Troy for being model citizens of our community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694912/recognizing-marie-and-david-troy"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…reauthorized NTIA  since 1992, before many of these responsibilities existed or were  relevant. This legislation ensures that NTIA has the right structure  and resources to fulfill its 21st century mission as directed by  Congress.\n\nToday's NTIA plays a key role in our effort to maintain global  leadership in wireless communications. NTIA has important statutory…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…each and every one of my colleagues in this body, from both  sides of the aisle, Mr. Speaker, understands and realizes the important  role that critical minerals play in our 21st century economy. This will  only increase as time goes on.\n\nWe have tremendous mineral wealth in our country, not only in my  district in northern Minnesota, which is home to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…environmental reviews have gone into the  region, and with good reason.\n\nThe minerals in the Duluth Complex include copper, nickel, and  cobalt. They are the ones that make up the 21st century economy and  help it run. They are the essential inputs for telecommunications  devices, cutting-edge defense systems, and much more.\n\nAs we are all keenly aware, the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…one of our  communities. As of 2025, my home State of Michigan was short more than  141,000 homes, leaving many qualified home buyers on the sidelines.\n\nThe Housing for the 21st Century Act will help increase home  production, which to date has failed to keep pace with rising demand,  leading to more affordability challenges for all Americans.  Additionally,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699804/housing-for-the-21st-century-act"}]