[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…destroying our Nation's pipeline of scientists,  technologists, and innovators.\n\nA teacher from my district has been dismayed that the President plans  to cut the NASA budget by 24 percent. This will end educational  programs that get students excited about the sciences. Do we want to go  to Mars? Who is going to take us there? It is going to need the  ingenuity…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…in the dark that  have a lot of questions, have a lot of questions about what is  happening here, about why it is necessary to cut a program like  Medicaid--that insures 24 percent of Americans--to the bone in order to  finance a tax cut for the very, very wealthy.\n\nOne of the things I just wanted to set up for you here is, you know,  just to note that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…last couple of years, we have made  significant progress in addressing the opioid overdose crisis. Last  year, the Centers for Disease Control and Prevention announced a 24  percent decline in drug overdose deaths for the 12 months ending in  September of 2024, compared to the previous year. This is encouraging  news, but I am deeply concerned that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…including fundamental research, education, and  broadening participation efforts.\n\nOther agencies have been impacted by the funding cuts, including NIH  by 37 percent, NOAA by 24 percent, the EPA by 54 percent, NASA's  science arm by 46 percent, and the Department of Energy Office of  Science by 14 percent, among many others.\n\nLong term, these cuts will have…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…program, also  known as HIDTA.\n\nFar too many Americans have been tragically impacted by our nation's  opioid epidemic. Thankfully, there is hope. Overdose deaths dropped by  24 percent from September 2023 to September 2024, and while that's  something to celebrate, we have a long way to go.\n\nThe 33 regional HIDTAs across the country are comprised of federal,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…You are seeing this downward trajectory, but let me just put the  numbers on it.\n\nIn 2023, there were 659 mass shootings in America. In 2024, there  were 500. That is a 24-percent, 1-year decline in mass shootings. That  means that there were 160 mass shootings that didn't happen and 160  communities that were not terrorized in 2024. And this bill…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…suggests 16 percent of Americans think the U.S. military  should get involved in the conflict between Israel and Iran--one-sixth,  16 percent--60 percent say we should not; 24 percent are not sure.\n\nWe need to have this debate in front of the American public and let  them  watch us debate the stakes of this. And it might be that colleagues in  this body…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…destabilizes lives--causing people to lose their       jobs, homes, or even custody of their children. Research       shows that the likelihood of a future arrest jumps from 24       percent after one day in jail to 45 percent after three days,       proof that unnecessary detention fuels instability and       recidivism. When someone cannot afford bail, they…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…same day.\n\nSo on April 9, the President said: Well, we will wait--we will wait  90 days on those additional tariffs; on the EU for 20 percent; the 32  percent for Fiji; the 24 percent additional for Japan--we will put that  aside, but we are going to keep the 10 percent on.\n\nNow, for a big company, maybe they can figure that out. They can ride  that out,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…from being totally there for the public you're       servicing,'' she said.\n\nAsked about worsening phone service, Dudek told reporters       in a call last week that ``a 24 percent answer rate is not       acceptable.''\n\n``I want people who want to get to a person to get to a       person,'' he said, adding that ``all options are on the       table''…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…troubling rates. A 2021 Air Force study supported by  additional Department of Defense research found that aviators face a 29  percent higher likelihood of testicular cancer, a 24 percent higher  likelihood of melanoma, and a 23 percent higher risk of prostate cancer  compared to their civilian counterparts.\n\nThese are incredibly healthy, in-shape, well-tested…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…to our economy cannot be overstated.  The National Science Board's 2024 Science and Engineering Indicators  report estimates that our country's STEM workforce constitutes 24  percent of all U.S. jobs. Further still, the Bureau of Labor Statistics  predicts that the need for STEM jobs will increase by another 11  percent by 2032.\n\nAmerica's education…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…However, so many care so much more about winning the next election.\n\nThe point I am trying to make is: You look at the next 10 years,  okay, there is growth. Mr. Speaker, 24 percent of the growth in  spending over the next 10 years is interest, 31 percent of the growth  in spending over the next 10 years is Social Security and disability,  28 percent…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…people are experiencing a housing  crisis that has been years in the making.\n\nFrom 2020 to 2024, the cost of a home soared 37 percent. Over that  same period, rents increased 24 percent. Many communities, including  those that I represent in the Lehigh Valley and the Poconos, have seen  even sharper increases. In Allentown, home prices have increased 63…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…Northport VA Medical  Center on Long Island, right in the heart of my district, conducted the  first of its kind study on this issue. From a small sample of 50  Vietnam veterans, 24 percent tested positive for exposure to the liver  fluke parasite.\n\nThat study raised the alarm and called for further research,  standardized treatment, and expanded access to care…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…skyrocketing costs of utilities in Colorado,  and that has happened during the last 4 years under Democrat control  both at the Federal and the State level.\n\nColoradans are paying 24 percent more in electricity now than they  were just 4 years ago, and it is easy to see why. The Colorado Public  Utilities Commission and statewide Democrats have been enacting…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…jobs? Are we  going to allow the doubling of senior poverty in America in 7 years at  the same time we are bankrupting much of the medical system?\n\nIn 7 years, grandma gets a 24 percent cut in her check and our model  says that it will double the poverty of seniors. Yet, often the  solution we get is, well, we will just raise taxes.\n\nOkay. The first year…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…take in in tax receipts, we spend $1.39. We spend  $1.39 for every dollar we take in tax receipts. If you saw that  previous chart, you would have noticed that only about 24 to 26 percent  is in discretionary, what we really get to vote on. That is why we end  up having to use what we call these reconciliation budgets.\n\nThe 1974 Budget Control Act allows…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…year, there is actually a fairly large  dividend given to the trust fund. It is demographics. We had the baby  boomers.\n\nIn 6\\1/2\\ years, if we followed the law, there is a 24 percent cut  coming to Social Security recipients, which will double the poverty of  seniors in America. Our math is that it will double the number of baby  boomers who are homeless.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…infrastructure and housing affordability while cutting wasteful  spending and reducing the Federal bureaucracy. In fact, this bill  codifies DOGE cuts, like reducing HUD staff by 24 percent and DOT by 5  percent, helping to rightsize the Federal workforce.\n\nWhen it comes to aviation safety, a top priority, FAA funding is  increased to $22.2 billion, including…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is empty in 6.5 years. That  means 7 years from now, if you are on Social Security, if we follow the  law as it is today and Congress continues to fail to act, you get a 24  percent cut. Our model says we double senior poverty in 7 years. We  will double the number of baby boomers who live on the street.\n\nIn 6.5 years, the Medicare trust fund is empty,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$638 billion. If you don't fix it,  you double senior poverty. You double the number of baby boomers who  will live on the street, and everyone's Social Security check has a 24  percent cut.\n\nHow many people have you heard this week get behind the microphones  and say maybe we should actually start to adopt technology,  modernization, deal with the reality…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Forgive me. I enjoy tormenting you. I don't  mean to.\n\nThink of this: In 7 years, the Social Security trust fund is empty.  Under the law--under the law, grandma takes a 24 percent cut in her  check. In 7 years, we double senior poverty in America.\n\nYet, if you are an idiot like I am, and you get up and say: We really  should work on this. The Democrat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…truly astounding when you consider what has actually happened  with homelessness in California during that time. During the  Governorship of Gavin Newsom, we have seen a 24 percent increase in  homelessness. The population is now over 187,000 people, and roughly  half of all unsheltered homeless in the United States are in  California.\n\nWe have continued…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…until the Social Security trust fund is empty. No one  stole the money. We just didn't have enough young people to keep the  ratios. So, in 7 years, the math right now says a 24 percent cut.\n\nIn 7 years, we double senior poverty in America. In 7 years, the math  says: You are going to start to see baby boomers doubling homelessness.  In 7 years, the Medicare…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}]