[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…toward the gunman and was shot in the head.  Miraculously, he survived. That same day, just blocks away at JCTC, two  people were shot, and Chea'von Moore was killed at just 24 years old.\n\nMr. Speaker, I stand here today as a lifelong Louisvillian, still sad  my community joined the long list of cities devastated by mass  shootings. On behalf of all of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690063/stopping-senseless-gun-violence"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…to pursue his  dreams and to help his mother. He was only 26 years old.\n\nCarlos came from Mexico, seeking a better life, and was willing to  work hard for it. He was only 24 years old--taken from us far too soon.\n\nSix individual lives, connected to their coworkers through service,  connected to their families through love, connected to our community…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Republicans say that this bill will stop noncitizens from voting, but  as the ranking member from the Rules Committee pointed out, nonpartisan  studies have found that over 24 years and out of hundreds of millions  of votes cast, there has been proof of this happening exactly 77 times.\n\nTo be clear, voter fraud should be punished to the fullest extent…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699937/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President. This is,  indeed, a dark day. Yesterday was a dark day--dark days because of  lives that have been lost. This day, the USA Today has published an  article styled: ``24 years after 9/11, alliances fractured,'' referring  to what happened on 9/11, the lives that were lost to terrorism.\n\nThen, Mr. Speaker, there is another article that I would call…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…favorite hiking trails and biking routes,  ATV trails, and fishing streams are in these protected roadless areas.\n\nWhen the Nation debated the merits of the roadless rule 24 years ago,  the Forest Service held 600 public meetings around the country. These  were attended by tens of thousands of Americans. I should know, I  attended one of them. The Forest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…and a Master of Science from Florida State University in  1973. Geraldine F. Thompson served for six years as an Orange County  Public Schools teacher. She later served for 24 years as an  administrator at Valencia Community College, where she established the  College Reach Out Program, which enabled thousands of low-income and  disadvantaged students…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, 24 years ago today, our Nation was changed  forever. I remember that day as a high school student. Standing along  the Hudson River, a cloud of smoke and destruction hung over the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695319/recommitting-to-civility-and-unity"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…OMAR. Mr. Speaker, I rise today to recognize Sue Abderholden for  her transformational leadership and advocacy for accessible mental  health services in Minnesota.\n\nDuring her 24 years of service as the executive director for the  National Alliance on Mental Health Illness Minnesota, she helped pass  over two dozen landmark laws that reshaped education,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691125/recognizing-sue-abderholden"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…had the pleasure of asking  Gerard to serve on the Mayor's Race Relations Task Force and on the  Board of Directors of the Mayor's Corps of Progress.\n\nFor the past nearly 24 years, Gerard has worked at Truman Medical  Centers (now called University Health), our area's safety net provider,  helping to advance issues of health care access and health equity…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…recognize and honor Sue  Abderholden for her decades of tireless service and steadfast  commitment to Minnesotans living with disabilities and mental  illnesses.\n\nFor the past 24 years, Ms. Abderholden has served as Executive  Director of the Minnesota chapter of the National Alliance on Mental  Illness.\n\nUnder her leadership, our state has become more compassionate,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690723/recognizing-sue-abderholden-for-her-work-on-behalf-of-those-with-disabilities-and-mental-illnesses"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…community.\n\nAfter receiving his Bachelor of Science in Education from Texas A&M  University, Lt. Col. Matthews served with distinction in the United  States Army for over 24 years. His military career included service in  over 30 countries, and a particularly harrowing tour in Vietnam from  1967 to 1968 with the 11th Armored Cavalry Regiment (Blackhorse),…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…MILLER-MEEKS. Mr. Speaker, I thank Chairman Bost for yielding  time.\n\nMr. Speaker, I rise in strong support of H.R. 1969, the No Wrong Door  for Veterans Act. As an Army veteran of 24 years, a physician, and a  Member of Congress, I have seen the toll that service can take on our  veterans, not just physically but mentally and emotionally. I have  heard from…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691507/no-wrong-door-for-veterans-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…progressive, soft-on-crime policies.\n\nInstead of addressing the clear epidemic of youth crime in this city,  the D.C. Council increased the age of youth offenders to individuals 24  years old and younger. Meaning fully grown, legal adults in the  District of Columbia can receive sentences meant for children.\n\nThis is simply insane, and that is why I introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Michigan's 9th Congressional District.  His more than two decades of dedicated service exemplify the highest  traditions of our Armed Forces.\n\nCWO4 McInnis devoted more than 24 years to honorable service in the  United States Coast Guard after enlisting in 1980 and completing basic  training in Cape May, New Jersey. He began his career aboard  operational…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…West Virginia. She died on Thanksgiving Day. She was  only 20 years old.\n\nThe other is Andrew Wolfe. He is a staff sergeant in the Air Force,  also from West Virginia, and is 24 years old. He remains hospitalized  in critical condition, fighting for his life.\n\nWe join all Americans in praying for them and their families.\n\nThe terrorist who attacked them…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…model; it might affect my--look, do  you care about the future?\n\nI have a 2\\1/2\\ year old we have adopted. My wife is my age. When my  little boy becomes--I think my math was 24 years old--so 22 years from  now, every tax in the United States has to have doubled just to  maintain baseline services because that is our burn rate. This place is  absolutely…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Mr. LaHOOD. Mr. Speaker, today, I rise to honor and congratulate Gary  Manier for his 24 years of service as the Mayor of Washington,  Illinois.\n\nMayor Manier is a proud Washington native and graduated from  Washington Community High School in 1972. Gary attended Illinois…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689608/commending-mayor-gary-manier-for-24-years-of-service-to-central-illinois"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…on the mission  that Charlie lived for of open debate in a free society in the greatest  nation that the world has ever known.\n\nWhen al-Qaida terrorists attacked our Nation 24 years ago, they had  one goal--to destroy America. They didn't see us as Democrats or  Republicans, red States or blue States. They just saw Americans, one  nation under God, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise in support of H.R. 4922 so that we  may redefine what is considered to be a youth offender from 24 years to  18 years and repeal the D.C. criminal court provision that allows  youthful offenders to receive sentences less than the mandatory minimum  required by law.\n\nThere is no question…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…was a comprehensive study that the American  Institutes for Research published. It was a meta-analysis that actually  looked at 23 preexisting studies of TFA's impact across 24 years.  Included in that were 63,134 teachers who taught 5 million students.\n\nWhat did this comprehensive meta-analysis find? TFA teachers have had  a consistent and significant…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Kristin Amato has made through her work with the  CARES Senior Clinic. Kristin has over 24 years in nursing experience.  She has worked in ER department's, home health, orthopedics and will be  a nurse practitioner in June 2026. She uses her time and talents to  help…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690989/recognizing-kristin-amato"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…The last time we truly came together around our shared ideals and  aspirations in a sustained way and stood solidly together on the common  ground of our body politic was 24 years ago today. The tragedy of  September 11 crystallized America's transcendent values in a way that  made every degree of difference seem trifling.\n\nWe were all Americans then,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}]