[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…When Dr. King spoke at the march on  Washington, he said that in many ways the marchers had come to collect  on a promissory note in our Declaration of Independence written 250  years ago, which promised that all men were endowed by their creator  with the inalienable rights of life, liberty, and the pursuit of  happiness. Thomas Jefferson didn't mean…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Representatives of the people  should be involved in a discussion about how we solve this problem--the  Constitution says so--and the questions raised here.\n\nFor the first time in 250 years, the United States military is  deliberately targeting civilians. They may be awful civilians, I will  grant you that, but they are deliberately targeting civilians. We have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698242/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…lost on me that I am standing in this Chamber, in  this seat of power from which wars have been launched and the fates of  millions have hung, a Chamber where in the nearly 250 years of this  great Nation, only 3 percent of the people who have ever stood here on  this floor have been women. That is why we must stand up, why we must  demand accountability,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…what it  is today without the social, economic, and cultural contributions and  the many sacrifices of historically marginalized but important  communities.\n\nAs we celebrate 250 years of America, it is critical that we tell  their stories--stories that are central to the country and truly define  our communities. One such story is the revitalization of…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…that have appeared in the news, devastated by Russian attacks.\n\nThose people are resilient. They are fighting for their freedom, much  like we fought for our freedom almost 250 years ago. We are going to  celebrate that anniversary in one short year. Can we imagine what it  would have been like if France did not intervene on our behalf? We have  a portrait…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…wants. The President wants  our Nation's Capital to be the safest, cleanest, most welcoming city.  DC gets 26 million tourists every year. In 2026, we are going to  celebrate 250 years. We want to show off DC and the whole region. If we  allow this mistake to take place, DC will lay off cops. It will close  schools. It will shut down our trash removal.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688853/district-of-columbia-local-funds-act-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…press;  or the right of the people peaceably to assemble.''\n\nI read these words today, the very first of the Articles of our Bill  of Rights, the First Amendment, because 250 years later, our President  does not seem to recognize them.\n\nWe were born from assembly. We live by free speech and a free press.  These are the core tenets of our United States.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699729/violating-core-tenets-of-our-united-states"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…their ideas and their thoughts across.  They look up at a Capitol that inspires them, that moves them, and that  brings together our democracy.\n\nNext year, we will celebrate 250 years of America's very existence as  a Nation. It is really quite something. In some ways it seems like a  long time, and it also seems like a short time. We know we are still…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…examine their conscience, renew their courage, and carry out the  responsibilities that the first Article of the Constitution demands.  Only in that way can we ensure that our 250 years will be a preface to  a stronger and brighter beacon in a free and principled democracy. It  will be a nation of laws, not of men. It will be a nation respected  around the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the least violent people in  the greatest numbers, who pose minimal pushback, with the real mission  to scare all immigrants, legal or otherwise.\n\nAmerica has existed for 250 years without mass detention centers, but  apparently, Noem and her cohorts plan for a different America to start  the next 250 years, one where masked, unmarked agents seize people…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Mr. President, this year our Nation will celebrate its  250th birthday--250 years in which our country has built on the  foundation that is our Constitution.\n\nThe Framers could not conceive exactly what the future would bring,  but they did anticipate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…after the Second Continental  Congress, Benjamin Franklin was asked: Do we have a monarchy or a  republic?\n\nHe solemnly replied: a republic, if you can keep it.\n\nFor nearly 250 years, those immortal words have lived at the heart of  our Republic. Representative democracy is not just something that  appears, it doesn't happen by accident, and it isn't…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689123/a-republic-if-we-can-keep-it"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…their oversight duties outlined in that  same constitution, like Representative LaMonica McIver and Senator Alex  Padilla.\n\nNext year we have the opportunity to celebrate 250 years of a  remarkable idea of power derived from the people, not from a king, but  only if we take action now.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692516/government-of-the-people-not-of-the-king"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…grow up in the Commonwealth of Virginia without getting  history lessons, and those lessons stuck with me. I am cognizant that  next year we have the opportunity to celebrate 250 years of an  extraordinary, revolutionary, radical idea that had never been tried,  truly, before in the world: the idea that the power of government  derives from the people,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…taste of civil service and his introduction to the people  of Sangamon County.\n\nBut Abraham Lincoln is not the only person whose life has been shaped  by the Post Office. For 250 years, the U.S. Post Office has provided  essential services that connect Americans, support commerce, and  strengthen the foundations of our democracy. Founded during the Second…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Commission that  was tasked with preparing for our Nation's 250th anniversary  celebration, it has been a privilege over the past decade to work on  bipartisan legislation to honor 250 years of America's independence.\n\nBefore I go on, I must recognize what a privilege it has been to  serve with my Democrat sponsor of this legislation, Bonnie Watson  Coleman.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…our Nation's 250th birthday, an incredible feat as our Founders came  together, found common ground, and voted to declare independence from  Great Britain.\n\nOver the past 250 years, America has embodied the shining city on the  hill that John Winthrop envisioned in his famous 1630 sermon. Grounded  in the ideas at the heart of the Declaration that all…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the uniform.  I have served beside heroes, and I know what it means to be part of  something bigger than yourself.\n\nThe Army isn't just celebrating a birthday. It is marking 250 years  of grit, honor, service, and rolling along. Here is to those who came  before us, those serving now, and those yet to wear the uniform.\n\nHappy birthday to the United States…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…various food that features  commodities grown in the Commonwealth of Pennsylvania.\n\nThis year's Farm Show theme, ``Growing a Nation,'' is particularly  fitting as we celebrate 250 years since our Founding Fathers signed the  Declaration of Independence.\n\nFor generations, American farmers have not only fed this country,  they have helped to feed the world,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Corps. I have been fortunate enough to have a brother who served  in the Marines in World War II. I have had a grandson in the Marines in  the last 10 years.\n\nFor the last 250 years, the Marine Corps has faithfully defended our  Nation with a distinct fighting spirit, and I am confident that the  Marines will continue to do that.\n\nThank you to our dedicated…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Mall,  right here in Washington, DC. I encourage Americans of all walks of  life to participate in local celebrations across our beautiful country.\n\nI am grateful to celebrate 250 years of freedom and honor all those  who served in uniform to keep us free for generations yet to come.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…engine of thoughtful and deliberative  policymaking. It wasn't meant to be easy. In fact, difficulty is what  separates serious legislating from political performance.\n\nIn her 250 years, America has never shied away from hard work, nor  does the Appropriations Committee in carrying out our constitutional  responsibilities for fiscal year 2026. Even after…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…service: honoring fallen comrades while supporting veterans, their  families, and our local communities.\n\nAs we commemorate this remarkable milestone, we recognize not only  the 250 years of service and sacrifice by the United States Marine  Corps but also the enduring legacy carried forward by the brave men and  women who wear, or have worn, the Eagle, Globe,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696572/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…country, and to serve and protect us against our enemies. They serve a  noble cause. May they ever carry the torch of liberty and continue to  serve honorably for the next 250 years.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…for families and history buffs alike. However, this  prosperous community in upstate New York would not exist if not for a  series of legendary events that took place nearly 250 years ago.\n\nIn September 1777, General Horatio Gates led Continental Army troops  against the British empire in present-day Saratoga County. In the  ensuing Battles of Saratoga,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…elections. In addition, the SAVE America Act  requires individuals to present a valid photo identification before  voting.\n\nOur Founders set forth our electoral processes 250 years ago based  upon the simple and ultimate principle that only Americans should vote.  However, in this age of progressive, suicidal empathy, basic concepts  such as voter ID…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…socialism vision  with New Yorkers. He pledged to ``replace the frigidity of rugged  individualism with the warmth of collectivism.''\n\nHere in our Nation's semiquincentennial, 250 years of liberty, the  new mayor rejected the fundamentals of American hard work and the  extraordinary benefits of markets that have freed billions from hunger  and poverty around…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…dedicating the cemetery at  Gettysburg. At that point, it was ``four score and seven years ago.''  Today, it would be 12 score and 10 years ago because we, this year,  celebrate 250 years since the founding of our Republic through the  Declaration of Independence in Philadelphia.\n\nI have often asked myself: If I served in this body, in this Chamber,  if I…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Republic's  history. On this day in 1775, the Continental Congress formed what  would become the U.S. Marine Corps under the command of Major Samuel  Nicholas. Since its founding 250 years ago, the Marine Corps has stood  as a symbol of excellence and steadfast commitment to defending our  homeland. From the Revolutionary War to the present, our marines have…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698198/recognizing-veterans-day"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Washington, has been charged by Congress to be the first to  interpret the faithful execution of the Constitution and the amazing  amount of laws that have been passed in our nearly 250 years.\n\nDuring those decades, one after another, all the way back with  Marbury v. Madison, there have been disagreements and the Court has  interpreted, but those interpretations,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}]