[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…negotiable.\n\nThat is not just an attack on historians or park rangers. It is an  attack on democracy itself, and the timing could not be more ironic.\n\nAs we approach America's 250th birthday, our national parks should be  a place of reflection, learning, and honest celebration. Instead, we  are fighting simply to ensure that these public lands continue to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…is about controlling knowledge and  history itself. Those whose histories, whose stories, and whose people  are lifted up, especially as this country is celebrating its 250th  birthday.\n\nWe are here tonight to say: Not on our watch. We will not let this  country slide into an Orwellian or authoritarian state where we cannot  even tell our own histories.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Mr. President, this year our Nation will celebrate its  250th birthday--250 years in which our country has built on the  foundation that is our Constitution.\n\nThe Framers could not conceive exactly what the future would bring,  but they did…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, next year our Nation will celebrate its 250th birthday.  H.R. 4285, the STARS Act, would mark that milestone on September 17,  2026, by providing free entrance to National Park Service sites and  waiving standard amenity recreation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…sacrifice,  and strength; and filled with moments that showcase the character and  resolve of our soldiers and support teams across the globe.\n\nIn 2025, the Army marked its 250th birthday with community  celebrations and tributes to the generations that defended our Nation.  Its annual Year in Review also features stories of soldiers preparing  for future…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698838/recognizing-the-us-army-2025-year-in-review"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "Ms. MALOY. Mr. Speaker, Americans are preparing to celebrate the  250th birthday of the United States in 2026.\n\nHow do you properly celebrate 250 years of freedom? One very uniquely  American way is to spend time in what Wallace Stegner called ``the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…America's 250th Act.\n\nThe greatest experiment in the history of the world, the United  States of America, is still going stronger than ever, and 2026 marks  our Nation's 250th birthday, an incredible feat as our Founders came  together, found common ground, and voted to declare independence from  Great Britain.\n\nOver the past 250 years, America has embodied…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, in honor of America's 250th birthday,  Members of Congress from the Treasure State are highlighting  exceptional Montanans each month who embody the spirit of our great  state and Nation.\n\nLast year, rodeo…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699393/recognizing-rodeo-hall-of-fame-member-flint-rasmussen"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…future of this  country. I am committed to ensuring that we act, not just speak,  because the time to confront rising hate is now.                    Celebrating U.S. Army's 250th Birthday\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise to celebrate the 250th  birthday of the United States Army.\n\nAs a 24-year Army veteran who is married to a 30-year Army veteran,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…young children, and his family, friends, and supporters. Last  week, President Trump invited the Nation to commit to praying for the  country for 1 hour a week ahead of our 250th birthday. I would  encourage us to accept that challenge. It is hard to hate someone when  you pray with them and for them regularly.\n\nOne of the greatest blessings of this job…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…constitutional Republic.''\n\nThis bipartisan bill will give our Nation the opportunity to honor  John Adams and his family with the memorial they deserve. As America  approaches its 250th birthday, there is no better time to honor a  family whose ideas and sacrifices helped build our Nation and protect  its principles for generations to come.\n\nI commend Representative…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Army's 250th Anniversary\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to say happy birthday to  the U.S. Army.\n\nOn June 14, we will celebrate a remarkable milestone: the 250th  birthday of the United States Army. For 2\\1/2\\ centuries, the Army has  stood as a pillar of strength, sacrifice, and service. From the  earliest days of our Nation's founding…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…freedoms that the Army  has defended for 250 years, and I will continue to defend that in the  future. And I want to thank President Trump for bringing attention to  the 250th birthday of the U.S. Army with the festivities that are going  on this weekend in Washington, DC.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…a great moment for us to experience on the floor of the House on  Tuesday night.\n\nWe are proud that the greatest Nation in the history of the world  will celebrate its 250th birthday in just a few months. The state of  our Union is strong because President Trump is putting Americans first.\n\nMr. President, 250 years after a small group of brave men founded…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, in just a short time, our Nation will  celebrate America's 250th birthday. This is a moment to reflect on how  far we have come as a nation and the shared ideals that have carried us  through challenge and triumph.\n\nAmerica 250 is not simply…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "Mr. BURLISON. Mr. Speaker, I rise to recognize the brave members of  the U.S. Marine Corps as they celebrate their 250th birthday today.\n\nThe Marine Corps was born in Philadelphia on November 10, 1775, when  two battalions of Continental Marines were established as a service  branch of infantry troops…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today ahead of June  14th to celebrate an extraordinary milestone, the United States Army's  250th birthday.\n\nEvery year, just a few weeks after Memorial Day, our country  celebrates our Army's birthday. This marks the anniversary in 1775 when  the Continental Congress authorized…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692561/united-states-armys-250th-birthday"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Speaker, I rise today to congratulate Pella  Marching Dutch for their outstanding 2025 season and their well-earned  invitation to perform at the celebration of our Nation's 250th birthday  in Washington, D.C., next year.\n\nThis remarkable ensemble consists of 226 students who represented  their community with excellent success, competing across multiple…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…never forgotten.\n\nMr. Speaker, I congratulate John Gilman and thank him for his  bravery, his sacrifice, and his continued example to us all. As we  approach America's 250th birthday, let us honor veterans like John  Gilman not only with medals but through our daily commitment to live up  to the freedom they fought to defend.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}]