[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…other life- threatening illnesses caused by their exposure to radiation. Taxpayers  are still paying the price from the arms race.\n\nThe Federal Government has paid out more than $27 million to more  than 430 Oregonians who were uranium workers exposed to fallout or  downwind of testing. This is what happens when we forget what nuclear  proliferation cost…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the country gets huge and endless deficits and trillions more  in debt.\n\nNewsweek reported this week that the current Congress is one of the  least effective ever, passing only 27 bills since January 3, far fewer  than in previous Congresses at the same point. Unfortunately, the  biggest, ugliest bill we passed, and the rescissions package will  contribute…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…February       25, 2025, seeking factual information and the agency's legal       views on this matter. Although EPA resubmitted the Notices of       Decision to GAO on February 27, 2025, with additional       information in the corresponding CRA reports, the agency       still did not address the statements in the notices regarding       the inapplicability…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, I rise today to recognize the  extraordinary career of San Ramon, California, Police Chief Denton  Carlson as he retires after 27 years of service.\n\nChief Carlson began his law enforcement career in 1998 and later  joined the San Ramon Police Department during its founding in 2007.  Quickly rising through…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697972/recognizing-police-chief-denton-carlson"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…reject this bill that bill rips health care from 17 million  Americans, with over 535,840 Illinoisans expected to lose their health  insurance, including 102,174 children and 27,000 seniors in my District  alone.\n\nI reject this bill that will close hospitals and kick people out of  their nursing homes--not only in my district but across the country,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…billion in projects in 16 States, all of which are led by  Democrats.''\n\nHere is the kicker: ``But some of the projects are in Republican  congressional districts, including a $27 million grant in Colorado's  Eighth Congressional District, which Representative Gabe Evans, a  Republican, represents.''\n\nGabe Evans is the author of this legislation we are…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Ms. RANDALL. Mr. Speaker, I thank Ranking Member Garcia and  Congressman Golden for the opportunity to speak on Protect America's  Workforce Act.\n\nMr. Speaker, I represent 27,000 Federal employees who have been  through  an incredibly challenging year marked by reckless DOGE firings, chaotic  rehirings, and unprecedented uncertainties.\n\nThey have…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697989/protect-americas-workforce-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…standards for our Nation. I am very proud of that law and the work I  played over in the House authoring it.\n\nAnd the industry, they were able to do it. They were still stuck at  27 miles a gallon. That was the law from 1975. It was 2007, 32 years  later. They still couldn't figure out how to improve the efficiency of  the vehicles which we drive.\n\nMeanwhile,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…reports obtained by NBC4 Washington confirmed that  the Washington, D.C., Metropolitan Police Department was investigating  Representative Cory Mills for an alleged assault of a 27-year-old woman  that took place on February 19, 2025, at the residence of  Representative Cory Mills.\n\nWhereas, the first police report, provided to NBC4 Washington by a  source…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…relief, food assistance, shelter, rehabilitation programs, and  youth development initiatives in local communities across the United  States.\n\nThe Salvation Army serves more than 27 million Americans annually,  offering compassion, hope, and support to the most vulnerable  populations, including individuals experiencing homelessness, veterans,  seniors,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690965/national-salvation-army-week"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…tracking system to ensure guards are  qualified and posts are staffed adequately.\n\nDespite these efforts, however, guards failed to detect prohibited  items in about half of the 27 covert tests that the Government  Accountability Office investigators conducted just last year.\n\nAdditionally, the new FPS tracking system has not worked well enough  to replace…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…what they voted for and celebrated on  July 4.\n\nAs Republicans moved this megabill through Congress, Democrats did  our best, in the minority, to push back. Over the course of 27 hours,  Senate Democrats forced votes on many amendments to put Republicans on  notice and show their constituents what their real positions are on  issues. It was the longest…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, I rise to congratulate the College of San  Mateo's football team, the Bulldogs, on becoming back-to-back  champions. Their dramatic 28-27 victory in the California Community  College Athletic Association Championship was their impressive third  title in 4 years.\n\nWhile the San Francisco Bay Area welcomes the NFL…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699641/congratulating-college-of-san-mateos-football-team"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Americans.\n\nNo. 26, fired the Director of the Consumer Financial Protection  Bureau because he favors the interests of his billionaire buddies over  those of American consumers.\n\nNo. 27, gutted Federal protections for worker safety.\n\nNo. 28, scrubbed the mention of climate change from any Federal  Agency in our country.\n\nNo. 29, froze $10 billion in disaster…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…He says he cares about childhood cancer. He slashed the funding for  child cancer research.\n\nHe says his tariffs are good for farmers. Last time he did this,  farmers lost $27 billion.\n\nHe says he supports law enforcement. He pardoned the people who beat  police officers on January 6. He pardoned them: people who tried to  overturn the election, people…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Risch", "party": "Republican", "sentence": "…troops, and they were inside  Venezuela, on Venezuela's soil, for less than 2 hours. Those troops  engaged with some unfortunate Cuban guards, who are no longer with us,  for 27 minutes. That is what this was made up of. It was incredibly  brief, targeted, and very successful.\n\nThe War Powers Act requires a President to submit a report to  Congress within…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…behalf of  Iowans, given my assent or dissent to nominations and legislation on  matters both foreign and domestic on issues from A to Z.\n\nFor a period of time spanning more than 27 years, I held the longest  voting streak in Senate history. My 8,927 consecutive rollcall votes  ended in November of 2020, when I was quarantined for exposure to  COVID-19.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…by the end of 2026.\n\nThis is because we are going to see a severe decline in in-State  production. Indeed, it could fall from over 34 million gallons per day  in 2023 to just 27 million gallons by the end of 2026. Then you factor  in the higher transportation costs. You are going to see Californians  not only paying these astronomical prices at the gas…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Speaker, only 31 percent of the American people have any faith in the  print media in this country, and they are very, very wise in that  assessment. That is almost as low as the 27 percent of Americans who  have faith in the Democratic Party right now.\n\nI would like to clarify something else that was said. It was said  that Republicans hate universities…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…measures that home builders must take to comply with       their NPDES permit, without imposing numeric discharge       limits.\n\nNAHB additionally urges passage of Amendment 27, submitted       by Representative Crawford, pertaining to compensatory       mitigation. Compensatory mitigation has become a significant       cost and barrier for builders:…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economics class? Creative destruction  is what brings us to that next level of productivity, which raises  wages.\n\nFor working people in my district, who are not making about 27 or 28  percent more than the first year of the Biden administration, they are  poor today. I think at the end we came in number two. Yet, I have seen  some numbers in Arizona…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…of the Senate rules beyond mere       allegation or assertion: 10.\n\n(3) The number of alleged violations for which the       Committee staff conducted a preliminary inquiry: 27. (This       figure includes 5 matters from previous years carried into       2025.)\n\n(4) The number of alleged violations for which the       Committee staff conducted a preliminary…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…outstanding contributions to education and workforce  development at Eau Gallie High School in Melbourne, Florida, where he  teaches aviation fabrication and assembly technology.\n\nHis 27 years of technology and CTE teaching experience are best  defined by his passion and dedication to helping students succeed in  the aerospace industry. As a veteran of the Coast…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690495/congratulating-bill-mcinnish"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…lower costs. In  reality, premiums have increased nearly 80 percent since the so-called  Affordable Care Act was enacted. The average premium for family  coverage is nearly $27,000 per year.\n\nA report from the Government Accountability Office confirms what  Republicans have said for years. There is significant fraud associated  with COVID-era enhanced…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Commissioner of Social Security under paragraph (3)       or (11) of the error.''.\n\n(c) Effective Date.--The amendments made by this section       shall take effect on December 27, 2026.\n\nMr. SMITH of Missouri. Madam Speaker, I yield myself such time as I  may consume.\n\nMadam Speaker, I rise in support of the Ending Improper Payments to  Deceased People…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…along the border reached a new  historic low on June 28, when CBP had the lowest number of  apprehensions in a single day in agency history.\n\nUnder the previous administration, 27,766 illegal migrants were  paroled and released into the country in June alone. Madam Speaker, 1  year later, zero migrants were paroled into the country--again,  promises made,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, had I been present, I  would have voted NO on Roll Call No. 26, NO on Roll Call No. 27, and  YEA on Roll Call No. 28.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699029/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…alone  would be strategic malpractice.\n\nWe are courting Russia and its GDP of $2.5 trillion at the expense of  longstanding bonds with Europe and its GDP of--listen to this--$27  trillion? Europe collectively has a GDP of $27 trillion. Russia's is  only $2.5 trillion. That doesn't even align with U.S. economic  interests, let alone our values.\n\nLast…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…children and families by halting so-called gender-affirming care for  children in this country.\n\nAs another testament to his impressive pace, President Trump has also  signed 27 bills into law, the greatest of which, the One Big Beautiful  Bill Act, delivers tax cuts to American families, solidifies funding  for America's Golden Dome, and defunded Planned…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Assistant for the Energy  and Commerce Committee in January of this year and was a critical farce  in making sure committee markups and hearings went smoothly, including  a nearly 27 hour long markup to help pass our portion of President  Trump's One Big Beautiful Bill.\n\nSoon, Emily Hale will depart the House Committee on Energy and  Commerce to serve another…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}]