[{"senator": "George Whitesides", "party": "Democrat", "sentence": "…the lives of 30 individuals.\n\nTwo weeks later, the Hughes fire erupted in my own district near  Castaic, right near where this picture behind me was taken. It forced  over 30,000 people to evacuate.\n\nCompared to most, we were relatively lucky. Given wind conditions and  the brave work of our firefighters, many of whom were employed by the  U.S. Forest…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689808/cuts-to-forest-service-endanger-millions"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, more than 17 million seniors  live on less than $30,000 a year. Yet, Republicans look to weaken or  sever lifelines like Medicaid, Medicare, and Social Security.\n\nPresident Trump announced a plan to fire 12 percent of Social  Security…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689232/seniors-need-social-security"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…how much these things could cost.  The HSA is a thousand-dollar average. Look at the average cost for  heart surgery. Just the surgery, not even the stay, is between $30,000  and $200,000 just for the procedure. I don't even know how much my  cancer surgery cost because I had health insurance. I didn't have to  check it like that. We had to pay some deductible,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Doug Collins announced that he would be  abandoning his disastrous plan to fire 83,000 VA employees, and the  reason is pretty simple: The Trump administration is set to lose 30,000  employees at the end of the year. That number is incredibly worrisome.  It is a significant number. The VA typically has a net gain of 10,000  VA employees every year. Yet,…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…cutting more than $1 trillion from Medicaid,  Medicare, and the Affordable Care Act. These deep cuts will allow the  richest Americans to receive, on average, an additional $30,000  annually, while the poorest Americans will lose approximately $700  annually.\n\nThis legislation is a complete betrayal of the American people,  extending additional tax breaks…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693211/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…more easily than we are able to do in Congress.\n\nIn Virginia, about 350,000 people benefit from the Affordable Care  Act premium tax credits, enhanced premium tax credits, 30,000 in my  district, the Fourth Congressional District.\n\nFor a family of four that earns $129,800 a year, they are looking at  premiums that will increase by $4,675. A family of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Secretary Collins' ability to recruit and retain the  top-level talent we need for caring for veterans at VA.\n\nEarlier this month, Secretary Collins celebrated, celebrated that  30,000 VA employees will be departing the agency by the end of this  fiscal year under his tenure. Can you imagine that, Mr. Speaker? The  head of an organization was patting themselves…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…are doubtful that any tariffs, no matter how  drastic, can recreate the economy of the past, when one steel company's  facilities in Bethlehem, Pennsylvania, alone employed 30,000 people.  Manufacturing is still the biggest industry in the Lehigh Valley, with  investment booming in recent years. At the same time, leaders are proud  that they managed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…recycled EV batteries in Kentucky. That would have helped us  compete with Chinese batteries.\n\nMr. Speaker, $197 million was supposed to help a plant in St. Louis  producing 30,000 metric tons annually of critical minerals products.  Mr. Speaker, $117 million was intended to support production of  synthetic graphite, including construction of a large…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…We don't have to guess what would happen if this bill were to pass.  In 2011, Kansas had a proof-of-citizenship requirement.\n\nMs. BONAMICI. Mr. Speaker, in Kansas, more than 30,000 U.S. citizens,  12 percent of everyone seeking to register to vote, were barred from  voting.\n\nOther States have tried. In all of them, a significant number of  citizens have…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690002/safeguard-american-voter-eligibility-act"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…window of a U.S. citizen born in  Honduras. He was thrown on the glass-covered ground in handcuffs after  he already identified himself to agents.\n\nIt was fear when more than 30,000 Charlotte-Mecklenburg students, 21  percent of the student body, were absent from school on the Monday  after the raids began because parents were terrified that their  children…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697455/fighting-dhs-immigration-raids"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Americans is one that is vital for my home State and for  many others across the country.\n\nToday, USPS delivers more mail than any other company in the world.  There are more than 30,000 Post Offices that serve 169 million homes  across the United States. Americans rely on the United States Postal  Service to deliver their medications, Social Security checks,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…going up $8,400.  Jeffrey doesn't have that money.\n\nSecond is people like a couple out in Western Massachusetts, whose  annual premium is doubling, from $15,000 a year to $30,000 a year. They  are going to owe $1,000 more a month for their health insurance, which  is going to be bigger than their mortgage. Do you hear what I am  saying, Republicans?…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…insurrectionists but demonize immigrant neighbors who have committed no  violent crimes and are being denied due process. Immigration arrests  under the Trump administration average 30,000 a month--and yet, less  than 5 percent of those individuals have been convicted of a crime.\n\nThis sober anniversary is a moment of reflection, especially for  those of us who…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…these tanks are leaking over 1,000 gallons of  waste in a year into the ground. So this waste is making its way to the  Columbia River, which supplies drinking water to nearly 30,000  residents in the Tri-Cities.\n\nThe Federal Government, as I mentioned, is legally and morally  obligated to clean up the dangerous mess it left on the sprawling  Hanford Site.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…revenues from oil and gas development for  their everyday lives. In fact, Alaska Natives who are enrolled  shareholders of the Arctic Slope Regional Corporation collect nearly  $30,000 a year thanks to responsible oil and gas development on the  North Slope.\n\nThe Biden administration failed to properly consult with the people  of the North Slope when they…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…need to know right now if they should be contacting an estate planner  for the massive tax hike that is coming.\n\nParents need certainty that their guaranteed deduction of $30,000  won't be cut in half and that their child tax credit won't be slashed  from $2,000 to $1,000.\n\nFollowing passage of the Trump tax cuts, wages increased by 4.9  percent, the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…even looked at what is in this bill  before attacking? Is it cruel to suggest that American taxpayers  shouldn't have to pay $60,000 to celebrate DEI in the Netherlands or  $30,000 to foster ``queer-feminist discourse'' in Albania?\n\nIs it cruel to cut a program spending $700,000 to expand fruit and  jam sales in Honduras?\n\nBy the way, speaking of jam,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692542/rescissions-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Medicaid. Under President Obama, we had virtually no eligibility  checks. People could walk in, and the Medicaid folks would say: How  much do you make a year? They could say $30,000 a year, and they would  say, OK, you qualify.\n\nNow, I trust people. I have said it before on this floor. I play  cards with my friends all the time. They are friends. I cut…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…would include if, say, a single parent had a husband or a wife  and the single parent was not working or making very little. If they  married someone with an income of $30,000, $40,000, or $50,000, they  would lose the benefits from that program.\n\nWe are all familiar with some of these larger programs. I think most  people wouldn't be able to name all…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Section 8 vouchers, whatever. In any event, it is not unusual to look  up a hypothetical in which if a woman marries say the father of her  children, she will lose $25,000 to $30,000 a year.\n\nThis is why since the Great Society in the 1960s we have gone from a  situation in which in the fifties, 4 percent of the children in this  country were born out of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…nerve damage, brain injuries, burns, scars.  Some live with paralysis and are confined to wheelchairs. The mental  wounds of war are also present as we remember the more than 30,000  veterans who have committed suicide since Washington's misguided  project to remake the Middle East.\n\nWhile our soldiers carry out their missions with honor, the  Washington…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…is. When we look at  the mayor of New York City, he wants to have government-owned grocery  stores. People will be able to choose about 400 or 500 items instead of  the 30,000 or 40,000 items they could choose today, all in  consideration of the blue-collar Joe Bag of Doughnuts, the forgotten  worker.\n\nThis is why Donald Trump was elected. We care about…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…to prepare for the long trip to Ford Field,  the Maroons suddenly needed tens of thousands of dollars for buses,  lodging, and meals. Our Yoopers stepped up, raising nearly $30,000 in a  matter of days with the entire community pulling together because they  believed in this team.\n\nCoach Brandt restored U.P. Power to Michigan high school football,  bringing…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697511/recognizing-menominee-maroons"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…higher than that of any State and nearly three times that of  Islamabad, Pakistan, and 18 times that of communist-run Havana, Cuba.  That same year, the city recorded nearly 30,000 crimes, including  thousands of violent offenses, robberies, and car thefts.\n\nSo far in 2025, D.C. has already seen over 2,200 violent crimes and  more than 120 homicides,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…transforming our State's flagship university into one of the  Nation's most prominent public institutions.\n\nUnder his visionary leadership, enrollment grew from nearly 30,000 to  35,000 students, Federal research expenditures nearly tripled, and the  endowment more than doubled.\n\nDr. Adams oversaw more than $1 billion in campus construction and  renovation,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "John James", "party": "Republican", "sentence": "…times in the country. If  you want a flat-screen TV, Mr. Speaker, you can have one delivered to  your doorstep in hours. However, a lifesaving dialysis machine will  cost you $30,000 and might take you weeks to get.\n\nDo you know why, Mr. Speaker?\n\nIt is because government doesn't meddle in television manufacturing  and people have choices.\n\nMr. Speaker,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Department has charged numerous brokers with       enrolling people in ObamaCare plans, or switching them to new       plans, without their consent. GAO identified at least 30,000       applications in 2023 and 160,000 in 2024 that had ``likely       unauthorized changes by agents or brokers.''\n\nGAO also found that incomes weren't later verified for…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…who was involved in these unspeakable crimes. We want  justice for the survivors. That is why we are doing this investigation.\n\nThe House Oversight Committee obtained over 30,000 pages of documents  from the estate. Unlike the Democrats, who only released 10 of those  over 30,000 pages of documents, Republicans on the House Oversight  Committee released…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…money.\n\nNobody is eligible for all 90 programs at once, but I don't think it  is difficult to find hypotheticals in which a parent alone is eligible  for maybe $25,000 or $30,000 that they would lose if they were married  to the other parent. In other words, it seems like the policy of the  United States is to try to discourage the strong families,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}]