[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…rise today to commemorate  the 350th anniversary of the martyrdom of Guru Tegh Bahadur, the  revered Ninth Guru of Sikhism--the world's fifth-largest religion, with  nearly 30 million followers worldwide, including one million here in  the United States.\n\nA champion of religious freedom for all, Guru Tegh Bahadur  courageously confronted the Mughal Emperor…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…hard to quantify. Mr. Speaker, 174 Capitol Police  officers were injured while protecting this sacred place, and 5  officers lost their lives. The Capitol itself sustained $30 million in  damages. In total, that day cost American taxpayers $2.7 billion, Mr.  Speaker. Think of that.\n\nWhile the insurrectionists did not succeed that day, they did cause  even…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698520/solemnly-recognizing-the-5th-anniversary-of-january-6"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…cost that we identified in  working on the JOBS Act.\n\nWhat is very strange about that 7 percent fee is that, regardless of  what period of time you examine, IPOs from about $30 million up to  about $200 million are always subject to a 7 percent fee. Now, all of  us who observe markets know that that is odd behavior in what should be  a competitive market.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693905/middle-market-ipo-cost-act"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…renewable energy and funds USGS climate science.\n\nFunding for the Environmental Protection Agency's environmental  justice, a top target for this administration, is included at $30  million. The continuation of these grants is a sharp rebuke of this  administration's attack on communities of color and low-income  communities facing high pollution burdens.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Trump administration to fully eliminate large portions of this program.\n\nAs we look ahead to an election year, this bill increases funding for  election security grants by $30 million, providing States and  localities with the resources that they need to shore up our election  infrastructure and defend our democracy against any form of  interference that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Act. I am the co-lead on this  legislation, along with my friend, colleague, and fellow Air Force  veteran, Representative Downing.\n\nDuring the COVID-19 pandemic, more than 30 million small businesses  were negatively impacted. The Federal Government took action to ensure  that an unprecedented amount of money flowed into small businesses in  the form…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…that program, but  it is critically important to our communities and to the small business  community.\n\nThis bill also increases funding for election security grants by $30  million. I created that program, along with Bob Ney from Ohio, when we  passed the Help America Vote Act. We all want to make sure our  elections are run well. At that point in…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…plant closed. Those were  our UAW brothers and sisters. There were others that have left our  region behind.\n\nIt is through that prism that we see the Trump administration's $30  million clawback of Federal funding awarded to Syracuse, New York. This  was funding for a project that had bipartisan support and passed in a  Republican-majority House. It is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…covers 70 to 80 million Americans, and the new  wrinkle is that this proposal doesn't just cut healthcare for tens of  millions of Americans; estimates are that it could be 30 million  Americans that lose healthcare under the Republican proposal.\n\nNo, this is even more difficult to swallow for the American public  than the 2017 attempt to cut and eliminate…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…children, but they account for only about 15 percent of the       program's spending.\n\nIn 2023, KFF found that of the 72 million people enrolled       in Medicaid, about 30 million were children. Millions more       children are enrolled in the Children's Health Insurance       Program, which some states run with Medicaid expansion funds.\n\nThey are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…similar blacklist policy could cost them nearly $10 million. In  Arkansas, the State retirement system estimated comparable restrictions  could reduce returns by $30 million to $40 million a year. In Indiana,  an analysis found it could cost pension returns as much as $6.4 billion  over 10 years.\n\nThis legislation is not about protecting retirees. It…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…obsession is going to prove to be, I  am sad to say, very expensive. Whatever happens will also take time.  Forces of sabotage may lurk in an impoverished nation of over 30  million people, and its institutions are run down. Is the Trump  administration assuming the task of nation building? That could add  billions and even trillions to our debt.\n\nWhen…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…recently, a convicted money launderer wrote  the code so that the United Arab Emirates could buy $2 billion of  Trump's stablecoin, which allowed President Trump to earn $30 million  on the transaction.\n\nNow, this convicted felon--\n\nMr. CASTEN. Mr. Speaker, I should clarify that the convicted felon I  am referring to is the guy who ends up trading--…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693832/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…it has been used to pump up profits, in fact,  illegally on several occasions.\n\nMr. Speaker, in 2017, TCF National Bank was cited by CFPB and  ultimately settled. It paid $30 million for its abuse of overdraft  fees.\n\nIn 2020, TD Bank was sanctioned $123 million for, among other  violations, deceptive practices related to debit card overdraft.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689853/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…on a foreign country.\n\nAnd let me tell you, every country is unique and difficult to  micromanage from afar, but Venezuela is a complicated country. We are  talking about 30 million people. We are talking about active, armed  insurgency groups. What happens when you try this Iraq-Afghanistan  strategy is that, in the short term, it breeds resentment…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "French Hill", "party": "Republican", "sentence": "…retire from the Nature Conservancy  offices in Arkansas.\n\nDoug's efforts and expertise in conservation have enriched our State.  Doug's leadership helped drive more than $30 million in public funding  to Arkansas for forest management.\n\nHe also cofounded the Fire Learning Networks, a national  collaboration of fire practitioners helping 14 countries…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…schools around 20 U.S. military bases.\n\nChina is not the only country making sizeable investments in K-12  classrooms across the country. The Qatar Foundation allocated $30.6  million to various schools around the Nation.\n\nWhat did they get, Mr. Speaker?\n\nWhat do you get for $30 million invested in our schools?\n\nIt is a clear act of anti-Semitism. Classroom…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "Mr. MACKENZIE. Madam Chair, I rise in support of this amendment by my  colleague from Pennsylvania that increases funding by $30 million for  procurement of the Army's heavy dump trucks and offsets it with a $30  million reduction to future tactical unmanned aircraft system  development. While that development…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693689/department-of-defense-appropriations-act-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…500 rioters were arrested, and at least a dozen LAPD officers were  injured.\n\nLocal and State leadership clearly could not contain the chaos. The  riots have cost at least $30 million to pay overtime and repair  property damages to city buildings. This doesn't include the small  businesses and other private entities whose businesses fell victim to  the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Texas, and the power of the  faith of the people of this Nation who have responded. Millions of  dollars have come into the Community Foundation of the Texas Hill  Country, $30 million last week, and I think that number is rising.\n\nI thank all the members here in this delegation. Most of them have  reached out to me personally.\n\nTo my friends and colleagues…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…from Idaho's First  District and the gentlewoman from Washington's Eighth District.\n\nHydropower is critical to our Nation's energy mix, supplying power to  approximately 30 million homes and businesses and accounting for 40  percent of the Nation's black start capacity.\n\nHowever, the average age of a hydropower facility in the United  States is 60 years.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…software, and KGV-135A COMSEC chips. The total cost of the       new MDE articles was $479 million, and the total cost of the       new non-MDE items articles was $30 million. The total       notified cost of MDE increased to $837 million, and the total       notified case value increased to $889 million.\n\nThis transmittal notifies the inclusion…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…I am proud to have led the charge in the early 2000s to make health  savings accounts accessible and a stronger option for Americans.\n\nToday--would you believe it--over 30 million Americans have a health  savings account with an average balance of more than $3,000.\n\nSenate Republicans, through the One Big Beautiful Bill, went a step  further, strengthening…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693915/health-savings-accounts"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Control Act, as           amended\n\n(i) Prospective Purchaser: Kingdom of Saudi Arabia.\n\n(ii) Total Estimated Value:\n\nMajor Defense Equipment* $70 million.\n\nOther $30 million.\n\nTotal $100 million.\n\nFunding Source: National Funds.\n\n(iii) Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase:\n\nMajor Defense…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…spending that they never want to vote for.\n\nWe can't do that.\n\nWe have to actually lead. In a Republican form of government there  are 435 of us representing 300 and, what, 30-something million  Americans. I represent about three-quarters of a million people. In a  Republican form of government I am supposed to take the hard votes. I  am supposed to go back…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "James Risch", "party": "Republican", "sentence": "…36(b)(1) of the Arms Export Control Act, as           amended\n\n(i) Prospective Purchaser: Government of Japan.\n\n(ii) Total Estimated Value:\n\nMajor Defense Equipment * $30 million.\n\nOther $52 million.\n\nTotal $82 million.\n\n(iii) Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase: Foreign Military       Sales…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}]