[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…from Mesa earlier this year and was  found brutally murdered 2 weeks later off of U.S. Highway 60.\n\nMonths later, her case remains unsolved. Emily Pike, like Hanna  Harris 30 years ago and hundreds and hundreds of native women and  girls, should be alive today.\n\nIt is far too common that their cases go cold and that loved ones are  left without answers…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690670/expression-of-outrage-on-national-day-of-awareness-for-missing-and-murdered-indigenous-women-and-girls"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…retirement.               recognizing anaheim police chief rick armendariz\n\nMr. CORREA. Mr. Speaker, I rise today to recognize Anaheim Police  Chief Rick Armendariz, who, after 30 years at Anaheim Police, will be  retiring from law enforcement.\n\nIn 2019, Chief Armendariz joined the Anaheim Police Department.  During his time as chief, Chief Armendariz championed…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…lived in my district in  Oakland, California, since the 1990s, he has consistently given back  philanthropically to young people and underserved communities, again  for almost 30 years.\n\nAfter winning ``Celebrity Jeopardy!'' just recently, he gave a  million dollars--the full winnings--back to the community, specifically  to the school district in Oakland,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690855/thanking-w-kamau-bell-for-his-generous-donation-to-oakland-schools"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…realizing that these  standards will save consumers $3.1 billion and are good for the  environment because they cut 32 million metric tons of carbon dioxide  emissions over 30 years.\n\nAll major manufacturers already sell models that meet these  standards, which is why they widely support the standards. Consumer  groups, efficiency advocates, and consumers…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688290/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…breaks for billionaires. It  becomes just fine to do a bill that savages child nutrition to do tax  breaks for billionaires. It becomes just fine to run up debt over the  next 30 years $30 trillion to fund tax breaks for billionaires.\n\nThat is the way the authoritarian personality is connected to the  policies that emerge from bills that authoritarian champions.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…inserting political controls on NIH       science research, FDA approvals, and CDC guidance.\n\nFor the sake of power, they are destroying an enterprise       that added more than 30 years to U.S. life expectancy and       made America the world leader in medical technology and       innovation. We need you in Congress to stop this process.       USAID cannot…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Speaker, I rise today to recognize and congratulate  Amanda Barlow, for the 30 years of service she has given to the Federal  Government at the Department of Health and Human Services'  Administration for Children and Families.\n\nMs. Barlow has been with ACF…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…years  compared to current law--are you really going to invoke, for a  reconciliation bill that, for the first time, continues that ``Red  Sea'' in years 11 through 30--11 years, 30 years out, extending beyond  the 10-year window, in direct violation of the ruling of the  Parliamentarian in 1996, in direct violation of a section of 313 that  says that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…big fat F. In  Georgia, just 1 year ago, Democrats lost that State house district by  22 points. Last night, they won it. We have had the first Democratic  mayor in Miami in 30 years--what used to be a Republican redoubt. Those  elections are another warning shot from the ballot box: Americans are  tired of paying more for the things they need. They are…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…after a decade of service to  the MCHCC.\n\nAnnissa Fragoso was born and raised in the City of Tracy and moved to  the community of Merced in 1995 where she has resided for 30 years. She  earned her Associate of Arts degree in Criminal Justice from Merced  Community College in 2012. Ms. Fragoso has owned the Farmers Insurance  Agency in downtown Merced,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…been delayed under the first Trump administration on behalf of the  oil and gas industry. These updates were estimated to save households  nearly $1 trillion annually over 30 years and save the average family  at least $100 per year in lower utility bills. They were also estimated  to cut approximately 2.5 billion metric tons of carbon emissions over…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Agreement:  restaurants, retailers, trucking companies, and chambers of commerce.\n\nThis is all to overturn an effective and enforceable agreement that  has been in place for almost 30 years, and it drives us away from  Mexico at a time when we should be expanding our relationship with  Arizona's and America's largest trading partner.\n\nEnding the Tomato Suspension…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694013/terminating-tomato-suspension-agreement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Recognizing Loudoun Wildlife Conservancy\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to recognize the Loudoun  Wildlife Conservancy as it celebrates 30 years of service to our  community.\n\nAn organization initially founded by 3 individuals has now grown to  over 600 volunteers. The conservancy has led the charge on habitat  conservation,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to look at the guests  whom we have brought--not only my guest, Michael Missal, the former  inspector general of the VA, but also a U.S. Air Force veteran with  more than 30 years of military service who retired from a lifetime of  dedicated service to his country in November and immediately  rededicated himself to serving his fellow veterans at the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…by $4  trillion, cutting $1.5 trillion in vital programs, giving $7 trillion  in permanent tax breaks to billionaires, and raising the debt by $37  trillion over the next 30 years.\n\nHow are Republicans going to pay for it? On the backs of the American  people with cuts to Medicaid, food assistance, housing, school meals,  clean energy, and selling your…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689886/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…without the Affordable Care Act, she  would have died 10 years ago because insurance would have dropped her.  And if her rates double, she will need to close her business of 30  years.\n\nThis is one of many stories of entrepreneurs and families, of  veterans, of servicemembers, of constituents that have reached out to  me.\n\nThere is an urgency about reopening…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…our community lost two of our local heroes when a  cowardly criminal gunned down two of Virginia Beach's finest during a  routine traffic stop.\n\nOfficer Chris Reese was just 30 years old, having served with both  the Virginia Beach Police Department and the Virginia Beach Sheriff's  Office for the last 6 years. He leaves behind a loving wife. He will be…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687949/moment-of-silence-in-honor-of-cameron-girvin-and-christopher-reese"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in 7 years, we go from $1 trillion a year on  Medicare to $2 trillion. We double Medicare spending in 7 years.\n\nNow, part of that is demographics. Starting, functionally, 30 years  ago, we started having a lot fewer children. So if we took today and  stepped back 20 years ago, we had about 35 million of our brothers and  sisters who were 65 years old,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…child born to this country over  the next 4 years. That child will be able to track their investment  account. Usually a person doesn't even start investing until they are  30 years old.\n\nThe best estimates are you graduate college. You have a little bit of  student debt. You start a new job. You don't really start contributing  to an IRA until you are…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Commendation Medal, and the Combat Action  Ribbon, among other service and campaign awards. He is also authorized  to wear the Navy and Marine Corps Parachutist Insignia.\n\nAfter 30 years of faithful and honorable service, Timothy retired  from the United States Marine Corps. His experience, professionalism,  and devotion to country have left a lasting impact…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Julie Humes of Donnellson, Iowa, a flight nurse with Air Evac Lifeteam  and a recipient of the American Ambulance Association's prestigious  Star of Life award.\n\nFor over 30 years, this award has recognized the best of our EMS  professionals, those who go above and beyond the call of duty. Julie  was nominated by her peers for her heroism during a severe…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Americans have a chronic  disease. A third of our children are prediabetic or diabetic. We simply  can't continue to live in that direction.\n\nWe were being told the last 20, 30 years to eat food from factories  rather than foods from the farm. And these ultraprocessed foods were  marketed as healthy. Well, people followed the advice in good faith,  and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Academy Days for the entire Idaho Delegation--an event for Idaho's high  school students to learn about our Nation's military academies. This  tradition has lasted for nearly 30 years. She also put together the  Veterans History Project, a Library of Congress project that collects,  preserves and makes accessible firsthand the recollections of veterans…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Before becoming town supervisor,  Jim served for 2 years on the town board.\n\nA lifelong Rockland County resident, Jim and his wife, Jackie, have  lived in Stony Point for 30 years with their two children and now their  grandchildren. Community and family remain central to his life. Jim and  his wife are active parishioners at Immaculate Conception Church…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…family with a mother and father at home.\n\nIn the 1950s, about 4 percent of the children born in this country  were born without a mother and a father at home. Within the next 30  years, after Lyndon Johnson and the Great Society, that 4 percent  increased to over 40 percent. Many other problems came with it.\n\nWhy did that happen? It happened because, right…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of the military''; and\n\n(3) by adding at the end the following:\n\n``(e) Reports for the Coast Guard.--\n\n``(1) In general.--Not later than April 30, 2025, and April       30 every 2 years thereafter, the Secretary of the department       in which the Coast Guard is operating shall submit to the       Committee on Commerce, Science, and Transportation of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…that the rule would carry a minimum price tag of nearly  $1 billion with minimal energy usage reduction. My colleague mentioned  that it would be a savings of $6 billion over 30 years. What he didn't  mention is the cost of replacement equipment with these new energy  efficiency standards could be tens of thousands of dollars, adding up  to billions and…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…legally enforceable measure,       determined acceptable by the Secretary, that--\n\n``(i) keeps housing affordable to low- and moderate-income       persons for not less than 30 years; and\n\n``(ii) enables low- and moderate-income persons to rent or       purchase the housing for homeownership; and\n\n``(E) maintains preemptive purchase options to purchase…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the change in interest rates--Social Security and  Medicare and their interest carry are responsible for almost  functionally every dime of debt from today through the next 30 years.  It is $116-some trillion of debt.\n\nThe rest of the budget actually has about a $9 trillion positive  balance because its growth is slower than the growth of tax receipts…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…recognizing  65 years of service to the Roman Catholic Church.\n\nWith his wife Marion right beside him, he has served the Huntsville  community in various capacities for over 30 years that included  Huntsville school teacher from 1978 to 1982, Deputy Director of  Education Service Center Region 6 from 1968 to 1982, owner of Wagamon  Printing that was opened…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}]