[{"senator": "Ed Markey", "party": "Democrat", "sentence": "7, eliminated the Office of Climate Change and Health Equity,  which addresses greenhouse gas emissions from the health sector and  facilitates interagency coordination to address climate change impacts  on the public health of all 330 million Americans.", "title": "Trump Administration First 100 Days", "date": "2025-04-30"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "Just the surgery, not even the stay, is between $30,000  and $200,000 just for the procedure.", "title": "Medical Bills Are Too High", "date": "2025-12-01"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Terra, which was a stablecoin, collapsed at 30 cents and wiped out  $40 billion in investor value.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Just 3 days after I was sworn in to Congress to serve my first term  this year, wildfires broke out across southern California, forcing  200,000 people to evacuate, burning over 57,000 acres of land, damaging  or destroying 18,000 homes, and taking the lives of 30 individuals.", "title": "Cuts to Forest Service Endanger Millions", "date": "2025-04-08"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "If  China had just done comparative advantage, then they would have been  growing rice for 30 years.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Her costs are going up 30  percent because of tariffs, and she is faced with two awful choices:  raise prices or lay off employees.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "This is  alarming when an app is the top news source of Americans under the age  of 30.", "title": "Tiktok", "date": "2025-06-18"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "What we have just done  is open up the Congressional Review Act from that little 6-month  period--60-day period; I am sorry--all the way back to when the CRA was  passed, 30 years.", "title": "H.J. Res. 88", "date": "2025-05-21"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "30.", "title": "Nominations En Bloc", "date": "2025-10-07"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "These are people who  comprise roughly 30 percent of marketplace enrollees.", "title": "Healthcare Subsidies and Rescissions", "date": null}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "BioMADE is a private-public partnership with nearly 300 members  across 37 States.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "All it would take is a minority of 30 Senators to introduce related  bills, and the Senate would be bogged down voting on Agency grocery  lists all day long.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-20"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "The CFO may be removed only for cause by the Mayor, subject to the  approval of two-thirds of the Council and a 30-day congressional review  and comment period.", "title": "Introduction of the District of Columbia Chief Financial Officer Salary Home Rule Act", "date": "2025-12-23"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Nearly 30 percent of the Federal workforce is made up of veterans.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Here is $30 trillion that we have to go to public markets.", "title": "Facing Fiscal Reality", "date": "2025-11-20"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Report on Director's Initiatives Group\n\nThe Committees direct that, not later than 30 days after       the date of enactment of the Act, the Director of National       Intelligence shall provide to the Committees a briefing on       personnel matters of the Director's Initiatives Group, which       shall include: (1) a list of personnel of such group from the       date of the creation of the group; and (2) funding sources       for personnel of such group.", "title": "Explanatory Statement for the Intelligence Authorization Act for Fiscal Year 2026", "date": "2025-12-17"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "This is day 30 of the Federal Government shutdown.", "title": "Vote Explanation", "date": "2025-10-30"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I am going to  start my 30 minutes.", "title": "Fiscal Responsibility", "date": "2025-05-01"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Donna was a first grade teacher for over 30 years.", "title": "Recognizing Donna Autry", "date": "2025-12-15"}, {"senator": "John Thune", "party": "Republican", "sentence": "We have a January 30 deadline to fund the government, and nobody  should want a repeat of the recent Democrat shutdown at the end of this  month.", "title": "Senate Agenda", "date": "2026-01-05"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I rise today to honor the late  Nicholas Pappas, a distinguished gentleman who devoted more than 30  years to the restaurant scene in Savannah, Georgia.", "title": "Congratulating Greg Parker, Retailer Executive of the Year", "date": "2025-06-10"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "We celebrated for a complete--oh, I don't know--30 seconds maybe.", "title": "-9999", "date": "2025-08-02"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "Nearing 30 years of distinguished service, Sergeant Major Watts  served with valor in Operation Iraqi Freedom and Operation Enduring  Freedom, earning the Bronze Star Medal and Combat Action Badge.", "title": "Recognizing Sergeant Major Harold M. Watts, III Service to the National Guard Bureau", "date": "2025-07-17"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Speaker, I rise today to recognize  Denise Sticha for 30 years of dedicated service to communities across  Pennsylvania's 15th Congressional District and beyond.", "title": "Recognizing Denise Sticha", "date": "2026-01-06"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "And all of these men--they were all men--20 to 30, came in  with something that we didn't even know what the disease was.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the National Highway Traffic Safety Administration Relating to ``Federal Motor Vehicle Safety Standards; Fuel System Integrity of Hydrogen Vehicles; Compressed Hydrogen Storage System Integrity; Incorporation By Reference''", "date": "2025-05-21"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Pursuant to rule XXVI, paragraph 5(a), of the Standing Rules of the  Senate, the following committees are authorized to meet during today's  session of the Senate:                         commitees on armed services\n\nThe Committee on Armed Services is authorized to meet during the  session of the Senate on Tuesday, June 24, 2025, at 9:30 a.m., to  consider nominations in open session.", "title": "Authority for Commitees to Meet", "date": "2025-06-24"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "The average age of our fighter fleet has grown from 10 years to 30  years, and 51 percent of the Air Force's service-retained fighting  force is in the Air National Guard.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Young Kim", "party": "Republican", "sentence": "The  riots have cost at least $30 million to pay overtime and repair  property damages to city buildings.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "Nearly 30 percent of all abortions in the United States are  performed on women in college.", "title": "Pregnant Students' Rights Act", "date": "2026-01-22"}]