[{"senator": "Greg Landsman", "party": "Democrat", "sentence": "…healthcare.\n\nAs you all know, they expire at the end of the year. If Congress does  nothing, costs will skyrocket, and people will lose their healthcare.\n\nIn my district alone, 32,000 people will see their costs skyrocket,  and 14,000 people will lose their healthcare entirely. This means that  people will be unable to afford their medicine, kids will…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697053/congress-must-act-on-healthcare"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Electric prices are good with  me.\n\nSo that is a pretty big hit.\n\nEven among Republicans, 25 percent say it hits them a lot, 29 percent  say it hits them a decent amount, and 32 percent say it hits them a  little bit. Only 11 percent say: None at all. Electric prices are cool.\n\nSo electric prices are going up, and they are going up big time, and  they…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…promise  kept to his fellow citizens.\n\nIn 1992, the people of Terrell County placed their trust in John  Bowens and elected him, Sheriff. That trust was repaid every day, for  32 years. He served longer than any sheriff in the county's history and  became the longest-serving African American sheriff elected in the  State of Georgia. But these distinctions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Captain Michelle  Wiltrout, who retired this year from the Summit County Sheriff's  Office, as this week's Champion of the Week for Ohio's 13th  Congressional District.\n\nFor 32 years, Captain Wiltrout, dedicated her career to serving and  protecting the people of Summit County in a wide range of roles. Her  work has spanned the corrections division,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691913/captain-michelle-wiltrout-named-ohios-13th-district-champion-of-the-week"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Mr. Speaker, may I inquire as to how much time I have  remaining.\n\nMr. NEAL.  Salinas).\n\nMr. NEAL.  I can't wait for the  Republican Party to meet that waitress who is making $32,000 a year and  tell her in this tax bill the Republican Party just gave her 68 cents  more a day because that is the reality of what this tax bill is about.\n\nWe could also say…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…million in federal benefits to the people of North  Carolina. Over the same period, the staff in my Washington, D.C. office  researched hundreds of policy questions, drafted 32 bills, amendments,  and resolutions, and responded to more than 43,000 messages from  constituents.\n\nThese numbers are an impressive but inadequate measure of my staff's  contributions.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688691/recognizing-my-congressional-staff-in-honor-of-national-employee-appreciation-day"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…bring bear spray and whips to the Capitol. The man who  attacked him was also a fugitive from justice at the time he came here.  He had been released on bond from Texas. He was a 32-year-old man, and  he was charged with online solicitation of a minor.\n\nFortunately, it was an undercover officer posing as a 15-year-old  girl, but there was an arrest warrant…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…come here. So let's keep it real.\n\nMr. Speaker, if you want to talk about housing, this administration  is proposing to terminate section 8, cutting rental aid and evicting  32,000 families from their homes. This President even refused to come  to Altadena after the urban fires. That is how little this  administration thinks about Black communities.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…FOR CERTAIN FULL-TIME NATIONAL GUARD                     DUTY PERFORMED IN A STATE, TERRITORY, OR THE                     DISTRICT OF COLUMBIA.\n\nSection 502(f)(2)(A) of title 32, United States Code, is       amended to read as follows:\n\n``(A) Support of operations or missions undertaken by the       member's unit at the request of the President or Secretary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, my Pennsylvania district is  home to more than 32,000 veterans, many of whom rely on physical and  mental health care from three VA medical centers: Lebanon in Berks  County, Coatesville in West Norriton, and Philadelphia for…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688623/fighting-for-our-veterans"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…ACA premium  tax credits expired December 31, 2025, and now health coverage is more  expensive and families are already feeling the impact.\n\nIn my district, 90 percent of the 32,000 people who get ACA coverage  rely on those subsidies. Four out of five were previously able to find  plans for $10 or less per month. That safety net is now gone. Families…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…funding as part of a bogus  investigation into nonprofit support for undocumented immigrants.\n\nNo. 30, cut cancer research funding.\n\nNo. 31, cut diabetes research funding.\n\nNo. 32, cut HIV-AIDS research funding.\n\nNo. 33, cut heart disease research funding.\n\nNo. 34, cut mental health research funding.\n\nNo. 35, cut family caregiving research funding.\n\nNo.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…energy  bills.\n\nThis resolution targets these standards, not realizing that these  standards will save consumers $3.1 billion and are good for the  environment because they cut 32 million metric tons of carbon dioxide  emissions over 30 years.\n\nAll major manufacturers already sell models that meet these  standards, which is why they widely support the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688290/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…safe as a result.\n\nHow will firing transportation safety experts make America greater?\n\nIf you live in Chicago, you will remember last July's derecho, when a  record-breaking 32 tornadoes ripped through the Chicagoland area. Eric  Carothers remembers it well. At the time, he was an intern for the  National Weather Service in Chicago under their Pathways…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…do more about.\n\nI was on one of the cable shows last night, talking about this  specific issue. So to date, there have been 6 or 7 strikes in the  Caribbean that have killed 32 people, and, you know, some of those were  trafficking drugs.\n\nThose routes, by the way, Senator Merkley, are used generally to  traffic cocaine and marijuana through the Caribbean,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…of Alabama. Mr. Speaker, I rise to recognize and honor Dr.  Ken Bodiford. Dr. Bodiford served as Director of Bands at my alma  mater, Jacksonville State University. During his 32-year tenure, he  transformed the Marching Southerners into one of the most respected and  accomplished collegiate marching programs in the Nation.\n\nUnder Dr. Bodiford's leadership,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Mazurkiewicz was the recipient of the  Rochester Police Department Life Saving Award, Officer of the Month  Award, 17 Excellent Police Service Awards, 7 Unit Commendation Awards,  32 Chief's Letters of Commendation, and the Good Conduct Award for 29  years of service without a sustained complaint.\n\nBeyond his duties as an officer with the Rochester Police…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…continue to illegally return with the sole intent--the sole  intent--to commit crime here in the United States.\n\nThe original version of this bill, Mr. Speaker, was drafted after a  32-year-old woman, an American woman, was tragically murdered by an  illegal alien who had five felony convictions and had been deported  multiple times from the United States.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…fewer than 50 employees offering health coverage has  dropped from 39 to 30 percent.\n\nSmall businesses have ranked the cost of health insurance as their  number one problem for 32 straight years. For nearly four decades, it  has remained the top concern. In fact, 98 percent of small businesses  report that healthcare costs will become unsustainable in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the retirement of  Colorado Springs Fire Marshal Brett Lacey.\n\nMarshal Lacey joined Colorado Springs Fire Department in 1992, and he  has faithfully served our community  for 32 years. Marshal Lacey was instrumental in helping protect our  community through his leadership in prioritizing structure and  vegetation management, as he established a nationally…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689254/recognizing-the-retirement-of-colorado-springs-fire-marshal-brett-lacey"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…investigate a simple question: Why is it so stunningly easy to commit  fraud against the State of California?\n\nDuring the COVID era, we saw fraud unlike we had ever seen when $32  billion in unemployment benefits were purloined from fraudsters,  international criminal syndicates, who were easily able to just defraud  Gavin Newsom's Unemployment Department.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…(ii) shall not be made of any organic or inorganic material       that poses a high risk of degrading.\n\n(3) Size.--The Time Capsule shall be not more than 50       inches wide, 32 inches deep, and 48 inches high.\n\n(4) Consultation.--In carrying out this subsection, the       offices described in paragraph (1) may consult with the       Architect of the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…this community and strengthens the bonds that make  living in close-knit towns so special.\n\nIn 1991, Alan married his true love, the late Desiree Bleam. Together  they shared 32 years of love, laughter, and devotion. Alan stood by her  side through her 13-year battle with Scleroderma, providing unwavering  support and care, in both his personal and professional…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Washington.\n\nThey are getting nervous. They are feeling the heat from people back  home, Mr. Speaker, that are angry, saying why did you vote--those  waiters and waitresses, who make $32,000 a year, when they keep hearing  them talk about billionaires. They are not voting against billionaires.  They are voting against waiters and waitresses earning $32,000 a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…pottery classes; $2 million for sex changes and  LGBT activism in Guatemala; $33,000 for being LGBTI--I can't even keep  up with this stuff; $6 million to fund tourism in Egypt; $32,000 for  transgender comic books in Peru; and $1 million to help disabled people  in Tajikistan become climate leaders.\n\nIs that what Democrats think their taxpayer dollars should…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…(AURs).\n\nTwenty-eight (28) GBU-53 SDB-IIs (AURs).\n\nThirty (30) KMU-556 Joint Direct Attack Munition (JDAM)       tail kits for GBU-31.\n\nTwenty (20) KMU-559 JDAM tail kits for GBU-32.\n\nTwenty-four (24) KMU-572 JDAM tail kits for GBU-38.\n\nTwenty-four (24) MK-82 500 lb general purpose bombs.\n\nThirty (30) MK-84 2,000 lb general purpose bombs.\n\nTwenty-one (21)…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…reporting foreign gifts and  contracts.\n\nAccording to The Wall Street Journal, in the last 12 years, U.S.  schools had nearly 3,000 contracts with China valued at no less than  $2.32 billion. That raises an important question: Why would a country  that certainly doesn't have the best interests of American students in  mind pay such enormous sums to American…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…will serve throughout Texas and the U.S.  in underserved communities. Since Dr. White coming to the helm, the  medical school secured an investment from the State of Texas for $32  million and an additional $23 million in pledges and gifts in 2023  alone.\n\nIt's not just in the classroom that Dr. White is making a difference.  On the fields and courts,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…recognize the extraordinary  accomplishments of the Salem High School debate team, which recently  claimed its second consecutive VHSL Class 4 State championship with a  decisive 32-8 victory over Dominion High School. This victory marks the  20th State title for legendary Head Coach Mark Ingerson, 18 in speech  and forensics and now 2 in debate.\n\nSalem's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…without a doubt, that the previous administration welcomed  millions of illegal aliens into our country when, during the first 50  days of the Trump administration, ICE made over 32,809 arrests, which  included 14,111 convicted criminals, including 1,155 criminal gang  members.\n\nWe cannot allow those kinds of folks who are in our country illegally  to take…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}]