[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Black men be placed in pretrial detention at a       disproportionate rate, but in 2022, The U.S. Commission on       Civil Rights found that Black men received bail amounts 35       percent higher than white men and 16 percent higher than       Latino men. The presence of cash bail destabilizes people's       lives, with pretrial detention increasing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, at 3:35 in the morning, a favorite time of  Republicans for taking up this bill, we consider a travesty.\n\nThe Senate took an ugly bill, went out and whipped it with an ugly  stick, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693175/one-big-beautiful-bill-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Americans who have  paid into this system all their lives, they get below-poverty-level  checks from their government because Congress hasn't acted.\n\nMr. Speaker, for more than 35 million people, this is the only  pension they will receive, and Congress hasn't responded.\n\nAgain, I applaud Mr. Jeffries for saying, yes, what we need is an  across-the-board…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…debit card. He is 14, and he uses it for small  stuff and things like buying PlayStation skins, Fortnite skins,  whatever kids buy. If he accidentally spends more than he has, $35, in  my opinion, is too high of a penalty. The average American kid would  have to work 5 hours at the Federal minimum wage to get that back. I  think that is crazy.\n\nEvery American…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689843/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…tell my colleagues who. It is the  American people.\n\nOur morning coffee, our kids' chocolate, lifesaving medical devices,  those are the Canadian goods that are being hit by 35 percent tariffs.  Americans are paying more for healthcare and their daily essentials  during an affordability crisis, all because of a manufactured emergency  and one person's…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…putting food on the table is about to get  exponentially harder thanks to the $187 billion Republicans cut from  SNAP in their big, ugly law.\n\nThese harmful cuts impact roughly 35,000 Rhode Islanders.\n\nWe saw the devastating consequences of SNAP uncertainty when  Republicans let funding for the program lapse during the government  shutdown. Demand at food…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697956/snap-cuts-in-rhode-island"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Church in Waycross, Georgia.\n\nIn 1984, he co-founded First Monumental Faith Ministries alongside  his loving wife, First Lady and Co-Overseer, LaVerne Shinault Carter.  For 35 remarkable years, he shepherded his congregation through  blessings, baptisms, weddings, and offered comfort to grieving  families. Under their dynamic leadership, First Monumental…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…50 Years; Gerald Curry, 45 Years; Robert Drummer, 40 Years;       Julius Reynolds, 40 years; Earl Smith Jr., 40 Years; Shun       Williams, 40 Years; Michael Craghead, 35 Years; Michael       Kennebrew, 25 Years; Joseph Nelson, 25 Years.\n\nBasileus Bricks: Michael Welch, Chairman, Charles Drew       Blood Drive; Sanford Crenshaw, Vice Basileus;…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…be denied. The first year alone, we treated 58,000 people with the care  that they needed in Colorado. This is 5 years with implementation. It  is the reason why we now have a 35 percent reduction in overdose deaths  in Colorado. It is overwhelmingly the reason.\n\nAddressing the Medicaid barrier is so important. Let me explain why.  People who struggle…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…to the SNAP  program, yes, on food stamps, which would impact 300,000 people in my  district, many of them children and seniors who rely on the benefit to  eat.\n\nMr. Speaker, 35 percent of them are children.\n\nThis will be the largest cut to the Food Stamp Program in our  Nation's history. In the middle of the night, Republicans will cut  Medicaid and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Dinh was commissioned as an  officer in December 1995 and graduated from the Armor Basic Officer  Leader Course in September 1996.\n\nColonel Dinh served our country honorably for 35 years, culminating  in his service as commander of the 455th Chemical Brigade in Sloan,  Nevada. Colonel Dinh's leadership positively impacted the lives of  countless servicemembers.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…strongly oppose this bill, which repeals the police  accountability and transparency law that the District of Columbia  enacted in 2023.\n\nLast year, violent crime in D.C. was down 35 percent, reaching an  over 30-year low. This year, violent crime in D.C. is down 28 percent  compared to the same period last year.\n\nD.C.'s Comprehensive Policing and Justice…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Desmond Tutu, among others.\n\nEcumenical Patriarch Bartholomew is a world-leading advocate for  interfaith dialogue and peace. As Ecumenical Patriarch of  Constantinople for nearly 35 years, the Patriarch has taken on the most  difficult issues facing the world, whether it's building bridges  between East and West, protecting our environment, or fostering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, the 12th Congressional District congratulates  Reverend Lydie Ngoie and the members of Trinity Faith United Methodist  Chuich on 35 years of spiritual worship and leadership in our  community.\n\nTrinity Faith blossomed from humble beginnings. Founded in 1918 in  the basement of a building under construction…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…decided to strip Medicaid coverage from almost  65,000 children in my district alone.\n\nAlmost 40 percent of children in Washington State get their  healthcare through Medicaid, 35 percent of moms giving birth and their  newborn babies rely on Medicaid for their healthcare, and the MAGA  majority wants to strip away their healthcare.\n\nIf any of my colleagues…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…mentoring programs to  feeding the hungry, the church has never wavered in its mission to live  out the love of Christ.\n\nMr. Speaker, I thank the entire church family for their 35 years of  faithful service, and I pray for many more years of impact and growth.\n\nGod bless Abundant Life Evangelistic Church, and God bless the great  State of Mississippi.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Monday night in Salem, Virginia, the Knights defeated powerhouse  Springfield College in a thrilling straight-set sweep of 25-20, 25-23,  and 27-25, capping an extraordinary 35-1 season. This victory wasn't  just a win on the court but the culmination of years of hard work,  perseverance, and belief.\n\nLed by veteran Coach Tom Peterson, who has now guided…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…enough people are having  children, and that is not only a problem for the country; it is a  problem for individuals who, I think--I am told, many of which regret  when they are 35 or 40, not having children when they were younger.\n\nPeople want to use the tax code to incentivize people to have more  children. There are a variety of ways you can do that.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…one, it  was never voted on, not in Sacramento, not in Washington. Number two,  it does have a nationwide impact. Number three, it is not just a  problem for the future. The 35 percent mandate goes into effect next  year.\n\nTherefore, we must act with urgency to democratically reverse that  which was unilaterally imposed. It will be one of the most important…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Federal taxpayers. Mr. Speaker, 85 percent of  all the revenue, I should say, that the insurers receive are coming  from the Federal taxpayers. Insurers received at least $35 billion in  Federal subsidies in 2024 for people who didn't use their plan a single  time. Mr. Speaker, $35 billion went into the pockets of insurance  companies for people who…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…(30) Zionsville, Indiana.\n\n(31) Louisiana State University, Baton Rouge, Louisiana.\n\n(32) Montz, Louisiana.\n\n(33) Springwater Township, Minnesota.\n\n(34) Grass Valley, Nevada.\n\n(35) Swanzey, New Hampshire.\n\n(36) Kinnelon, New Jersey.\n\n(37) Flanders, New York.\n\n(38) Glendale, New York.\n\n(39) Riverside, New York.\n\n(40) Pendleton, New York.\n\n(41) Weddington,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Third Congressional District. I  would like to highlight, in particular, a teacher from the Roseville  Joint Union High School District, Brandon Dell'Orto, who has dedicated  35 years of his career to educating the students of our community.\n\nMr. Dell'Orto is a passionate historian and a mentor. He spent most  of his career teaching AP U.S. History,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…resource management       activities, all projects approved to take place, and all       persons or entities using the forest. As such, it was a rule       of general applicability.\\35\\ Likewise, the North Dakota RMP       establishes land use designations that govern all activities       conducted by any person or entity on BLM-administered land       and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…There is a lot going on in the country right now--a lot. There is a  lot of anger, there is a lot of frustration, and there are a lot of  questions about what happens next.\n\nFor 35 years, students have gone to their flagpole and have prayed  for the Nation. My simple request of them again this year is to do it  again. This Nation could use some prayer.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…back to beg for the bare minimum. She told me that she  doesn't trust Republicans to protect her healthcare. Based on their  votes, she is right.\n\nCongress listened to her plea 35 years ago. Now, the wealthy  interests and Trump's pressure are just too much. Republicans won't  listen to a word from Julie or the 80 disabled advocates who came with  her.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…this day is about.\n\nThe days of weakness on the world stage and dependence on foreign  adversaries for our energy needs are over.\n\nI am proud to rise in support of H.J. Res. 35 to repeal the Biden  administration's harmful rule establishing a natural gas tax and help  the United States reclaim energy dominance.\n\nThe Biden administration had an all-out…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688181/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…outdoor opportunities, Jim has worked  to make Warren County a prime destination. He was instrumental in  expanding the Trails at Jakes Rocks mountain bike system, which  features 35.2 miles of premier hiking and biking trails in the  Allegheny National Forest. This is a significant regional asset that  has an economic impact of more than $10 million annually.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…That is certainly a whole lot more than  the average fee for insufficient funds currently that are being charged  by financial institutions, banks, and credit unions of about $35.\n\nFurther, Mr. Speaker, if a criminal charge is brought, then you may  have the cost of an attorney, and you have to spend a day in court  trying to work it out. If you pay it…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…providing them with information on Senior  Crime Prevention and Elder Fraud & Abuse.\n\nOutside of work, Deputy Larkin has been a steadfast Boy Scout Leader  for Troop 132, for over 35 years. An avid sports lover, Deputy Larkin  is also a referee for many local high school sports leagues. Deputy  Larkin is a graduate of Ole Miss University. He has given back…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…continuing certification courses for commissioned firefighters, his  positive impact extends to other fire departments across the State of  Texas.\n\nNow, as he retires from Station 35 in the critical Fort Worth  Alliance Airport Corridor, Mr. DeWitt holds the distinction of being  the department's senior-most engineer and a certified Aircraft Rescue  and Fire…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}]