[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Chair, I rise in support of my amendment  to H.R. 3898, the PERMIT Act, and in opposition to the underlying bill.\n\nFor the last fifty years, the Clean Water Act has provided the  federal government with the means to hold polluters…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Chair, I rise today to speak in opposition to H.R.  3898.\n\nClean water used to be something we all agreed upon. The Clean Water  Act was originally passed by an overwhelmingly bipartisan majority  because we understood that clean…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698023/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "Ms. POU. Mr. Chair, I rise to oppose this bill, H.R. 3898, because it  is an affront to environmental stewardship everywhere. It undermines  the 50 years of vital, clean water progress and weakens the ability of  States like New Jersey…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698035/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Speaker Johnson: On behalf of the more than 140,000       members of the National Association of Home Builders (NAHB),       I am writing to convey our strong support for H.R. 3898, the       PERMIT Act, which will provide necessary clarity and       confidence required under the Clean Water Act (CWA)       permitting process. Because clear and predictable…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…TAYLOR. Mr. Chair, I thank Chairman Graves and Chairman Collins  for their hard work on this pragmatic and effective piece of  legislation.\n\nI rise today in support of H.R. 3898, the PERMIT Act, which would cut  red tape within the Clean Water Act's permitting processes. This  legislation will provide much-needed regulatory certainty for America's…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698025/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES.  3898.\n\nMr. GRAVES. Mr. Chairman, I yield myself such time as I may consume.\n\nMr. Chair, I am proud to rise in support of H.R. 3898, the Promoting  Efficient Review for Modern Infrastructure…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "…these young people can get out there and chase  their version of the American Dream.\n\nMr. Chair, I urge all my colleagues to support this piece of  legislation. Let's get H.R. 3898 passed out of the House and sent over  to the Senate.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698036/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…amendment is so great, you are not even  going to believe it.\n\nMr. Chair, I yield myself such time as I may consume.\n\nMr. Chair, I rise today in support of my amendment to H.R. 3898, the  PERMIT Act, that offers a solution to compensatory mitigation.\n\nA lack of wetland mitigation credits is holding back residential  housing construction, and the available…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Chairman, I rise today in support of H.R. 3898, the  PERMIT Act.\n\nOur permitting system is a great burden to our Nation. Permitting  delays infrastructure projects indefinitely and stops us from bringing  critical energy…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…leadership. It is better  outcomes for communities. It is locally driven, not federally mandated.\n\nMr. Chair, I urge my colleagues on both sides of the aisle to support  H.R. 3898 and my amendment, and I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}]