[{"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Alexandria Cardinals on Championship\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate the Alexandria  Cardinals basketball team on defeating Mankato East for their first- ever 3A Boys championship title.\n\nThe senior co-captains, Sam Hagstrom and Chase Thompson, were  especially excited, saying: ``It has been a fun ride,'' and, ``We ended  things with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate Adam Kingston  of Manheim Township on winning a gold medal in the Class 3A 3,200-meter  run at the PIAA track and field championship on May 24.\n\nThe 2025 PIAA Class 3A track and field championship saw students from  across Pennsylvania's 11th Congressional…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691936/congratulating-adam-kingston-gold-medal-runner"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…first time in 32 years.\n\nThis remarkable victory is a testament to their talent, hard work,  and perseverance. Under the leadership of Coach Edwards, rightfully  named VHSL Class 3A Coach of the Year, these young men came mentally  prepared and demonstrated the power of teamwork and determination to  bring home the school's second State trophy.\n\nTheir success…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate Cooper Lehman  and Braylen Garcia of Hempfield High School on winning the 2025 PIAA  Class 3A boys' Tennis Doubles championship on May 24.\n\nSenior Cooper Lehman and freshman Braylen Garcia dominated the 2025  tennis season. Their doubles team was instrumental in Hempfield's…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692412/congratulating-cooper-lehman-and-braylen-garcia-tennis-doubles-champions"}, {"senator": "John Rose", "party": "Republican", "sentence": "…nail-biter as  the game was tied up for much of the night. Nonetheless, it ended with  the Upperman Bees defeating the Tullahoma Wildcats 65-55.\n\nThis TSSAA Division 1 Class 3A BlueCross basketball championship win  at Middle Tennessee State University puts their team at 32-3 on the  season.\n\nAgain, I congratulate the players and their families. I also…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…playoffs, the St.  Simon's team overcame adversity to make their first State title series  since 2018. The boys swept their opponents from Pinewood Christian to  earn the GIAA Class 3A baseball State championship and made history for  their athletic program.\n\nUnder Head Coach Tim Orlosky, these young men exhibited persistence,  sportsmanship, and humility in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…CLINE. Mr. Speaker, I rise today to recognize the exceptional  achievements of Lord Botetourt High School Lady Cavaliers basketball  team, who were recently crowned the 2025 Class 3A State champions.\n\nThe Lady Cavaliers capped an extraordinary 26-3 season by toppling  previously undefeated James Monroe, earning the program's fifth State  title since 1995.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…Joseph Huskies State Champions\n\nMr. YAKYM. Mr. Speaker, I rise today to honor and congratulate the  South Bend Saint Joseph Huskies on their remarkable triumph in the  Class 3A State basketball championship this past weekend.\n\nThe Huskies made history with this win, the first-ever boys'  basketball State championship. Winning a State title is an achievement…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise to congratulate the Indiana High  School Athletic Association 3A football State champions, the Cascade  Cadets.\n\nThe Cascade High School football team triumphed over Fort Wayne Luers  with a 29-14 victory, securing the first football State…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697559/congratulating-cascade-high-school-cadets-football-team"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…SMUCKER. Mr. Speaker, I am pleased to congratulate Sophia Rivera  of Ephrata High School on winning gold medals in both girls' shot put  and girls' discus at the 2025 PIAA Class 3A Track and Field  Championship, held on May 23 and 24.\n\nThe 2025 PIAA Class 3A track and field championship took place on May  23 and 24,  during which Ephrata junior Sophia Rivera…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691701/congratulating-sophia-rivera-girls-shot-put-and-discus-state-champion"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate Cocalico High  School's girls' soccer coach, Mr. Dan Hogan, on receiving the 2025 W.  Gene Davis Memorial Award as Class 3A girls Coach of the Year by the  Pennsylvania Soccer Coaches Association (PSCA). I am equally pleased to  recognize his colleague, Mrs. Lynn Parmer, for being named the  Assistant…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699464/congratulating-coach-dan-hogan-and-coach-lynn-parmer-on-coaching-honors"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…Speaker, I rise today to proudly recognize  the Fort Worth Trinity Valley School girls' soccer team for capturing  their fourth consecutive Southwest Preparatory Conference Class 3A  state championship--an outstanding achievement that reflects sustained  excellence and dedication.\n\nThe Trinity Valley Trojans secured the title with a commanding 6-0  victory…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700251/congratulating-the-trinity-valley-girls-soccer-team-on-their-fourth-consecutive-3a-state-championship"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today to congratulate Empire High  School's softball team for winning the 3A State Title.\n\nThe Ravens scored a run in the bottom of the eighth inning to defeat  Yuma Catholic 1-0, earning their second straight State title and the  fourth title in the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691459/recognizing-empire-high-schools-softball-team"}]