[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Mr. MAGAZINER. Mr. Speaker, I rise today in honor of Dave Chenevert,  who is retiring after 14 years as executive director of the Rhode  Island Manufacturers Association and 41 years in the manufacturing  industry.\n\nDave built RIMA into a powerful advocacy organization for the  manufacturing industry, championing workforce development and  education,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…Speaker, 60 percent of Americans can't afford a basic quality of  life, 45 percent have had to skip a doctor's appointment or a  prescription because they can't afford it, and 41 percent are living  with medical debt. The American people are simply not making it.\n\nNot only is that crisis real, it is a crisis that Republicans  promised to solve. Voters…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696729/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…costs down on day one.\n\nInstead, the opposite has happened. Food costs are rising. His own  USDA, the U.S. Department of Agriculture, recently reported egg prices  could rise 41 percent over the next year. Since taking office, he has  done nothing to help families struggling at the grocery checkout.\n\nAs a result, big corporations are consolidating, creating…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…enforcement to implement  crime-fighting strategies that reduced violent crime.\n\nMost importantly, Mr. Barron got results. During his tenure, Maryland  saw homicide rates drop by 41 percent. He established a new Violent and  Organized Crime Section within the office and instructed his  prosecutors to utilize an ``Al Capone'' model of prosecution, using all…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…because of the type of care which they provide.\n\nNo. 39, froze funding for community health centers in our country.\n\nNo. 40, ordered the suspension of EV charging funding.\n\nNo. 41, tried to rename the Gulf of Mexico.\n\nNo. 42, illegally rescinded $80 million in congressionally  appropriated FEMA funding for New York City bank accounts.\n\nNo. 43, fired--and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Hemlock--you  want to make sure that Michigan has its fair and equal representation.\n\nHowever, Mr. Speaker, it has been a point of frustration for my State  of Michigan that in my 41, nearly 42 years  of existence on this Earth, that my State is always losing  representation every time we dare to reapportion the size of the  Chamber.\n\nNow, we are a close-knit…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…PURPLE KNIGHT DISTRICT & STATE PLAYOFF RECORD\n\nGeorge Washington Carver, 33-0\n\nJohn McDonogh, 21-0\n\nJoseph S. Clark, 51-0\n\nJesuit 35-7\n\nArchbishop Rummel, 19-6\n\nHoly Cross, 41-7\n\nDeLaSalle, 33-0\n\nChalmette, 34-0\n\nArchbishop Shaw, 26-0\n\nBrother Martin, 7-0                                STATE PLAYOFFS\n\nGeorge Washington Carver **, 29-8\n\nWest Jefferson…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…campaigned on lowering prices. He pledged to ``bring  food costs down on day one.'' Instead, the opposite has happened. His  own USDA recently reported egg prices could rise 41 percent over the  next year. Since taking office, he has done nothing to help families.\n\nThis is shameful, because the alternative is clear. A few weeks ago,  I reintroduced…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Foreign Service, Class of       Counselor, to be Ambassador Extraordinary and Plenipotentiary       of the United States of America to the Hashemite Kingdom of       Jordan.\n\n41. Calendar Number 417: Jacob Helberg, of Florida, to be       an Under Secretary of State (Economic Growth, Energy, and the       Environment).\n\n42. Calendar Number 418: Benjamin…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…and the upgrading of Fire Station  No. 11 through a cooperative, grant-funded project with North Fork  Mono. He also oversaw Madera County's continuing expansion along  Highway 41 with the Riverstone and Tesoro Viejo developments.\n\nMr. Varney was instrumental in establishing the Sheriff's Foundation,  which has raised more than a half-million dollars.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…billion and  $190 billion in costs to states from 2026 to 2034--\n\nPutting that burden from $72 billion to $190 billion on States--\n\nincreasing the state costs of expansion by 41 to 108       percent and [thus] jeopardizing [medical] coverage for       millions.\n\nForty states plus Washington, D.C. have adopted the       Medicaid expansion--\n\nForty States,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…utilities have either raised or proposed higher rates that will go into  effect next year.\n\nHere is the proof. Here is a report from September of this year:  ``Residents in at Least 41 States and Washington, D.C., Are Facing  Increased Electric and Natural Gas Bills.''\n\n``Utilities are increasing prices for customers across the country.''  Including all the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…earned Social Security benefits. Without Social  Security, 52.2 percent of older women would live in poverty. About 45  percent of Black seniors, 52 percent of Latino seniors, and 41 percent  of Asian-American seniors rely mostly or only on Social Security for  income. This effort to gut Social Security is an appalling illustration  of the highest level of…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…news reports with a clear tone, the       study found, 80 percent were negative--much higher than under       Clinton (60 percent), George W. Bush (57 percent), and Obama       (41 percent).\n\nSoon, Trump administration officials were feeling besieged.       Not a single week went by in which press coverage wasn't at       least 70 percent negative. And…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…I could rely upon, and my staff  and I took every possible opportunity to work with him and his team.\n\nMayor Van Dusen has dedicated 52 years of his life to public  service--41 of those years serving as an elected official with the  Village of Skokie. Mayor Van Dusen has been a proud Skokie resident  since 1974, and it comes as no surprise that his…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688871/recognizing-the-career-of-skokie-mayor-george-van-dusen"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Appropriations Committee, who have played a  critical role in getting us to where we are today; to the Cloakroom  staff; to every Senate staffer on both sides of the aisle, who has  spent 41 days coming into work without pay; to the custodial staff,  who, again without pay, have kept this building and the Senate office  buildings livable; to all institutional staff,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696667/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…notice       such that a small business concern seeking contract       opportunities using the single, Government-wide point of       entry described under section 1708 of title 41, United States       Code, can easily identify and understand such covered notice.\n\n(c) Rulemaking.--Not later than 90 days after the date of       the enactment of this Act,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691850/plain-language-in-contracting-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…highest standards of Michigan agriculture.\n\nTo commemorate this accomplishment, this afternoon, I am introducing  a resolution congratulating Korson's Tree Farms.\n\nIt has been 41 years since a Michigan-grown Christmas tree was  displayed in the White House, and bringing this tradition back  highlights the strength and quality of Michigan's growers.\n\nKorson's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697288/recognizing-korsons-tree-farms"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…Federal minimum wage. According to the National Restaurant Association,  tipped servers nationally make a median income of $27 an hour, with the  highest paid workers in the $41 an hour range.\n\nThe tip credit also offers flexibility for operators to invest in  their businesses and staff. Without it, restaurant operators would be  forced to make some…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Definitions.--In this section:\n\n(1) Defense and civilian agency.--The term ``Defense and       Civilian agency'' has the meaning given the term ``agency''       in section 133 of title 41, United States Code.\n\n(2) Director.--The term ``Director'' means the Director of       the Office of Management and Budget.\n\nMr. Speaker, the lowest price technically acceptable,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688342/safe-and-smart-federal-purchasing-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…branch, until recently, has been slow  processing applications and conveyances, leaving many veterans in  limbo.\n\nAs of January 2025, out of more than 2,000 eligible veterans, only 41  applications have been certified, and only 18 veterans have received  their conveyances.\n\nFortunately, executive orders issued by the current administration  have reinstated…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693425/land-conveyances-for-alaska-native-vietnam-veterans"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…cost of housing.\n\nHe also commented that we are only appropriating and considering our  appropriations bills yet today, but we weren't the ones who shut down  the government for 41 days, preventing us from doing our appropriations  work. They did this. The Democrats shut down the government to fight  for taxpayer-funded healthcare subsidies that would go…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…by the same means, and with the same jurisdiction, powers,       and duties as though all applicable terms and provisions of       the Federal Trade Commission Act (15 U.S.C. 41 et seq.) were       incorporated into and made a part of this section.\n\n(B) Privileges and immunities.--Any person who violates       this section shall be subject to the penalties…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Speaker, I urge all of our colleagues to support this bipartisan,  commonsense piece of legislation which passed out of the Ways and Means  Committee unanimously by a vote of 41-0.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…American businesses, including those in North Carolina that  have built reliable partnerships in Haiti.\n\nLast month, the Ways and Means Committee passed this bill  unanimously, 41-0, a strong bipartisan signal that these programs work.\n\nMr. SMITH of Missouri. Madam Speaker, I yield such time as he may  consume to the gentleman from Nebraska (Mr. Smith).…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…make a point how  Washington finances 366 days of spending in 2024. The top 20 percent of  earners covered 201 days. For the next core tile down, the next 20  percent covered 41 days. The middle earners, the middle 20 percent,  paid for 17 days of government spending. The bottom 40 percent pay for  4 days of government spending. Then 103 days we finance…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…firefighters with  the Keller Fire Department in the early 1980s. He joined the Fort Worth  Fire Department on May 6, 1988, as a full-time commissioned firefighter  in Class 41. Over his career, he served in four stations, including the  historic Downtown Station 1, where he was assigned on December 12,  1997. The following year, he was promoted to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthcare economics. We are trying to understand what the  hell is going on with these numbers, but you start looking at it after  the COVID subsidies.\n\nDo you know you got 41 percent of the population that is actually  supposed to be just receiving government subsidies to make it more  affordable and they are paying zero?\n\nDo you understand what they…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…information required under subsection       (a) shall be made publicly accessible on the single,       Government-wide point of entry described under section 1708       of title 41, United States Code.\n\n(c) Covered Solicitation Defined.--In this section, the       term ``covered solicitation'' means a solicitation of a       Federal agency for a procurement…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691760/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…safety of the Haitian people and the interests of the United States.\n\nTo its credit, the Trump administration responded swiftly. Within  days of taking office, it approved nearly $41 million to support the  Haitian National Police and the Kenyan-led Multinational Security  Support Mission. It also issued a humanitarian waiver to keep emergency  relief flowing.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}]