[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…what  happened just a short time ago? A piece of this went to the Court and  in their shadow docket. The question was, Could the administration  slow-walk funding to the last 45 days of the fiscal year and then bring  over a request for us to undo that funding--it is called a rescission-- and then, because it was a 40-day, 5-day grace period, pause,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…prosecuted by the Federal  Government of the United States for his involvement in the trade of  narcotics? He was found guilty of having been involved and was  sentenced to some 45 years in prison as a result. He once boasted as  President that he would ``stuff the drugs up the gringos' noses.'' He  accepted a $1 million bribe from El Chapo--one of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Juan  Orlando Hernandez, the former President of Honduras who was convicted  in a U.S. court for smuggling more than 500 tons of cocaine into our  country and was sentenced to 45 years.\n\nThe President is also threatening violence against our very Members  of Congress who simply reminded our military of their constitutional  duty not to follow illegal…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697535/venezuela-boat-strikes"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…BACKGROUND       Broadband Equity, Access, and Deployment (BEAD) Program\n\nThe Infrastructure, Investment, and Jobs Act (IIJA)       established the BEAD Program, and appropriated $42.45 billion       for it. The BEAD Program is a grant program administered by       NTIA that funds high-speed broadband access initiatives, with       particular focus on unserved…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…mean  shattered families, deeper uncertainty, and an America that is sicker  and poorer.\n\nThis is what is happening to Catherine right now. She is on a  fixed income--roughly $45,000 a year--with a house payment and two kids  in college. Because of the ``Big Ugly Bill's'' failure to extend the  ACA tax credit, her premiums have gone up $800 a month this…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…lose their       jobs, homes, or even custody of their children. Research       shows that the likelihood of a future arrest jumps from 24       percent after one day in jail to 45 percent after three days,       proof that unnecessary detention fuels instability and       recidivism. When someone cannot afford bail, they can sit in       jail for days,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…and International       Security.\n\n44. Calendar Number 424: Michael DeSombre, of Illinois, to       be an Assistant Secretary of State (East Asian and Pacific       Affairs).\n\n45. Calendar Number 427: Todd Wilcox, of Florida, to be an       Assistant Secretary of State (Diplomatic Security).\n\n46. Calendar Number 428: Neil Jacobs, of North Carolina, to…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…due to the administration's policies, both  tariffs and otherwise. I don't think they realized or thought through  the effect of these policies on Main Street America.\n\nOver 45 percent of Americans are employed by small business. They are  the backbone of Main Street and our economy.\n\nThe administration and my colleagues on the other side have to think…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691262/rising-costs-for-small-businesses"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…hospitals.  It can be up to about half of the payer mix.\n\nWhat is a payer mix? It just means you might get paid by private  insurance 30 percent, you might get paid by Medicaid 45 percent, you  might have a little VA, and you might have a little private pay; it  adds up to 100 percent. As you look at your revenue picture, 40, 50-- sometimes even more--percent…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…gave billionaires a tax break. They are  defunding Tribal radio and rural broadcasting while Trump  burns through $56 million of taxpayer money on golf and throws himself  a $45 million birthday parade.\n\nRepublicans are engaged in waste, fraud, and abuse. That is the  definition of it. That is the definition of destruction, deception, and  corruption.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…section 1012(b) provides that absent Congress's completion of action on  a rescission bill rescinding all or part of amounts proposed to be  rescinded within the prescribed 45-day period, such amounts must be  made available for obligation,'' which requires that the ``budget  authority must not be expired.'' And I remain in agreement with Senator…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…PhD\n\nOmega Man of the Year: Sanford Crenshaw\n\nSuperior Service Award: Brian Bond\n\nService Pins: Gerald Hamilton, 55 Years; Howard Foard Jr.,       50 Years; Gerald Curry, 45 Years; Robert Drummer, 40 Years;       Julius Reynolds, 40 years; Earl Smith Jr., 40 Years; Shun       Williams, 40 Years; Michael Craghead, 35 Years; Michael       Kennebrew,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…alone, that jeopardizes care for nearly 3  million people, including 100,000 people struggling with addiction.\n\nIn my district, that means risking medical care for more than 45,000  people under the age of 21 and more than 15,000 people over the age of  60.\n\nThese are children and seniors, vulnerable people who rely upon  Medicaid for their health and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688326/funding-medicaid-is-not-negotiable"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…1981, the voters of the Fifth District elected me  to the United States House of Representatives.\n\nI stand here now, after some 60 years in public service, including  nearly 45 years as a Member of this House. I have won elections and  lost a couple. I celebrated triumphs and suffered setbacks. I enjoyed  friendships and endured hardships.\n\nAs the song…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…community-based, hands-on approach has played a key role in  driving down gun violence in our neighborhood of Little Village. New  Life Centers Community Care programs also serve more than 45,000  individuals in need of housing, food, and other necessities. Its Pan de  Vida Fresh Market distributes food to more than 35,000 individuals per  year, filling the gaps that…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the Trump administration,  there was DNA testing. It was ended during the Biden administration.  They said it took too much time. I inquired about the amount of time.  It took 45 minutes.\n\nWhat we know from the time we did DNA testing, 30 percent of the  children that were DNA tested by border agents shared no relation to  the illegal aliens who were…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Assistance for Veteran  Empowerment program, protects veterans' Second Amendment rights, and  invests heavily in general military construction.\n\nI proudly represent more than 45,000 veterans in Pennsylvania's Ninth  Congressional District. When I include their families, many of whom  have served or are preparing to serve, well over 100,000 Pennsylvanians…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…and (4) as paragraphs       (2) and (3), respectively; and\n\n(C) in paragraph (3), as so redesignated, in subparagraph       (A)(ii)--\n\n(i) by striking ``60'' and inserting ``45''; and\n\n(ii) by striking ``90'' and inserting ``67.5'';\n\n(2) in subsection (c)(1)--\n\n(A) by redesignating subparagraphs (A) and (B) as       subparagraphs (C) and (D), respectively;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695427/edith-nourse-rogers-stem-scholarship-opportunity-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…earning more and are in a better spot than  they were before entering the program. VR&E currently does not track  those results.\n\nAt a recent hearing, VA told the committee that 45 percent of  veterans who successfully complete the program reenter it later. This  does not show that the program is working for veterans. In fact, Mr.  Speaker, it shows that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695445/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Mr. SMITH of Nebraska. Mr. Speaker, I rise today to recognize the  career of Doug Kennedy, who is retiring after 45 years of serving  southeast Nebraska as a radio broadcaster.\n\nDoug's service as a reporter and news director for KWBE in Beatrice  has spanned a remarkable seven different station…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "David McCormick", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. McCORMICK). On this vote, the yeas are 52,  the nays are 45. The motion is agreed to.\n\nThe motion was agreed to.", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694594/cloture-motion"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…many  rescue operations when the county experienced major floods.\n\nBeyond his role as sheriff, Mark has volunteered for the Old Lycoming  Township Volunteer Fire Company for 45 years. He has also worked  alongside the local VFW and American Legion.\n\nMark has received various awards for his leadership over his career.  In 2007, he was recognized by the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698576/recognizing-mark-lusk"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…person, partnership, or corporation with respect to whom the       Commission has jurisdiction under section 5(a)(2) of the       Federal Trade Commission Act (15 U.S.C. 45(a)(2)),       including--\n\n(A) a hotel or short-term rental;\n\n(B) a third-party online seller; or\n\n(C) an intermediary.\n\n(4) Covered services.--The term ``covered services''--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to celebrate the birth of  Reese Patricia Fritsch.\n\nReese was born on October 7, 2025 at 2:45 P.M. at Luminis Health Anne  Arundel Medical Center weighing seven pounds, two ounces and measuring  21 inches long to loving parents Taylor and Kristin Flukey Fritsch, who…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696399/recognizing-reese-patricia-fritsch"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…that is not what you hear from the abortion lobby. You  hear about how safe it is. It ain't safe. They suffer things like  sepsis, infection, and hemorrhaging, all within about 45 days.\n\nLet me also say to my colleagues, another method of aborting a baby  is dismemberment. It tears the child's fragile body to pieces and  includes decapitation. Until rendered…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…MACKENZIE. Mr. Speaker, I rise today to honor the life and  service of Jim VanWert, a dedicated member of the Lower Macungie Fire  Department, who recently passed away after 45 years of service to our  community.\n\nJim devoted his life to protecting others, serving in many roles over  the decades, including nearly 25 years as assistant fire chief.\n\nJim's…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Ukraine. I thought President Putin did. I am  beginning to wonder.\n\nPresident Trump, who is leading these negotiations, first asked for a  cease-fire. He said: For 30 days--maybe 45, 60 days--I am asking both  Russia and Ukraine to lay down their arms.\n\nPresident Putin said: No, I won't agree to a blanket cease-fire, but  I will stop bombing infrastructure…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…are from the great State of New York. Forty-five  years ago tonight, Team USA, led by Herb Brooks and 12 Minnesotans,  beat Finland for the gold medal, and I congratulate them 45 years  later.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, I rise to offer an epilogue on my just- completed Hoosier Heartland Tour across Indiana's Sixth District.\n\nI participated in 45 events. I engaged meaningfully with 1,800  Hoosiers. I reported back on my work in Congress. I listened to their  concerns and priorities.\n\nI met with leaders in our communities,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…wake up every day and see it as their sole  mission to flood the United States with lethal drugs. My Democrat  colleagues want to ignore that.\n\nSinaloa and Jalisco alone have 45,000 members combined. The Gulf  Cartel has 50,000 members. MS-13 has another 30,000. They are coming  across the Gulf constantly. Mr. Speaker, 365 days a year, 7 days a  week,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}]