[{"senator": "John Larson", "party": "Democrat", "sentence": "…address the  body with regard to Social Security and the lack of congressional  action.\n\nIt might interest people in the audience to know, Mr. Speaker, that  it has been over 50 years since Congress has enhanced Social Security  on behalf of  its recipients. That is why I have introduced legislation specifically  to address this issue.\n\nYet, Mr. Speaker,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…into the news cycle, so folks don't know what  really happened in those committees. I am going to say, in those  committees we talked about cutting State Department by close to 50  percent, terminating workers in the State Department, finalizing the  shuttering of USAID.\n\nPeople might say, well, what is USAID? Well, part of what USAID does  is contract…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the  millions of Americans who rely on the services it provides. That  includes the U.S. Department of Education, which does critical work to  ensure our country's more than 50 million--50 million--public school  students can get a quality education.\n\nInstead of trying to strengthen the Department of Education's support  for our Nation's public schools,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…administration's  proposed cuts to crucial programs, programs that make our communities  safer and support our law enforcement. Our fight was fruitful.\n\nFor example, we secured $50 million for community violence  intervention and prevention initiative grants, despite the President  and the House Republicans' attempts to eliminate this funding that so  many…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698757/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "The result was announced--yeas 45, nays 50, as follows:                        [Rollcall Vote No. 259 Leg.]                                  YEAS--45       Alsobrooks      Baldwin      Bennet      Blumenthal      Blunt…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691404/motion-to-discharge-s-res-195"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…declared war, a President who has  declared that he visited with corporate America before taking kinetic  activity in Venezuela, where do we stand?\n\nWell, the Members of the Senate, 50 of them, stood with this  resolution. I would stand with them. I stand with them now, 50 of them  who stood for this resolution.\n\nMr. Speaker, 50 Members were antithetical to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…commercialization  activities. Per the Energy Policy Act of 2005, the Department of Energy  requires not less than 20 percent for research and development and not  less than 50 percent for demonstration or commercial application  activities to be provided from a non-Federal source so that all  stakeholders have some skin in the game and to control costs…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688930/cost-share-accountability-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…families.\n\nMr. Speaker, after these Supreme Court interpretations and these  actions by these southern legislatures, let me tell you what happened  in South Carolina. When more than 50 percent of the population was  African American, they had zero representation here in the Congress. In  fact, the last African American left Congress in 1897, and there was…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…flags and parades.  It is also about creating policies, putting in place protections, and  the persistence of a community to achieve equality.\n\nYes, we are proud of the past 50 years of Santa Cruz Pride, but we  are also determined now more than ever to continue our march forward.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692043/recognizing-santa-cruz-pride-parades-50th-anniversary"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…gentleman's amendment must be considered alongside the  House Republicans' efforts to decimate GAO's budget. Last summer, House  Republicans proposed cutting the GAO budget by 50 percent. Fortunately,  that was restored in the final version, but it is curious that the  House Republicans now want to give the GAO more work after they were so  intent on…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Parks is so critical. This nonpartisan organization is made up of more  than 4,800 current, former, and retired National Park Service  professionals, people who have devoted over 50,000 years of combined  service to caring for our most valuable, natural, and cultural  resources. These are experts. These are the stewards of our shared  history.\n\nWe owe it…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…in this one big, ugly  bill.\n\nThis bill also represents an assault on nutritional assistance here  in the United States of America. We have made great progress over the  last 50-plus years as it relates to hunger in this country, great  progress, but we are still dealing with the reality that tens of  millions of people in this country go to bed every…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…spotted owl range.\n\nThe MBTA prohibits the lethal removal of protected       migratory bird species, including the barred owl, unless       authorized by FWS in accordance with 50 C.F.R. parts 13 and       21. As part of the Barred Owl ROD, FWS approved the issuance       of a Special Purpose Agency Species Protection Permit to the       FWS Oregon Fish…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…missed a payment.\n\nIt is, for capitalism and entrepreneurialism, our safety net. Yet,  Mr. Speaker, as you know, Congress has not acted on enhancing Social  Security in more than 50 years. Richard Nixon was the President of the  United States the last time Congress, whose responsibility it is, did  anything to extend benefits. That includes a COLA that is…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…and even just a couple of hours ago, here on this floor, we were all  glued to our phones. We were, like, oh, man, this lovers' quarrel is  getting messy.\n\nElon Musk, around 2:50 p.m. yesterday afternoon--we were in the DOGE  Subcommittee when it happened. He tweeted this. Elon Musk tweets:  ``Call your Senator, Call your Congressman, Bankrupting America…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…innovate and our  military to keep us safe.\n\nThe global mineral race is not optional. Over the next 15 years,  demand for copper and rare earth elements is expected to rise by 50  percent; cobalt, 150 percent; and lithium, up to 500 percent. Shortages  of all the above could be upon us within a decade.\n\nYet these minerals are right here under our feet.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…doctors can be few  and far between in rural areas.\n\nBut thanks to the working families tax cut legislation, however, help  is on the way. Republicans' legislation created a $50 billion Rural  Health Transformation Program to address the rural healthcare crisis.  Instead of a top-down, Washington-dictated approach, we are giving  States the resources…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…where we want our  dollars to be spent?\n\nWe know, without a doubt, that the previous administration welcomed  millions of illegal aliens into our country when, during the first 50  days of the Trump administration, ICE made over 32,809 arrests, which  included 14,111 convicted criminals, including 1,155 criminal gang  members.\n\nWe cannot allow those kinds…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…archival paper; and\n\n(ii) shall not be made of any organic or inorganic material       that poses a high risk of degrading.\n\n(3) Size.--The Time Capsule shall be not more than 50       inches wide, 32 inches deep, and 48 inches high.\n\n(4) Consultation.--In carrying out this subsection, the       offices described in paragraph (1) may consult with the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…FFA Organization has grown into a  dynamic force in agriculture, education, leadership development, and  career preparedness.\n\nWith over 1 million members and chapters in all 50 States, Puerto  Rico, and the U.S. Virgin Islands, FFA stands as a pillar of strength  for young men and women pursuing careers in agriculture, agribusiness,  and related fields.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…SECRETARY OF AGRICULTURE ON THE                     COMMITTEE ON FOREIGN INVESTMENT IN THE UNITED                     STATES.\n\nSection 721(k) of the Defense Production Act of 1950 (50       U.S.C. 4565(k)) is amended by adding at the end the       following:\n\n``(8) Inclusion of the secretary of agriculture.--The       Secretary of Agriculture shall be a member…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…country. It requires our schools to  identify and support students who need services, including children  experiencing homelessness and those attending private schools.\n\nFor 50 years, IDEA has been the backbone of special education,  ensuring access, accountability, and equality for millions.\n\nAs we honor IDEA's 50th anniversary, I am proud to introduce…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…the Senate.\n\n(2) Intelligence community.--The term ``intelligence       community'' has the meaning given such term in section 3(4)       of the National Security Act of 1947 (50 U.S.C. 3003(4)).\n\nMr. GUEST.  4070.\n\nMr. Speaker, I rise in strong support of H.R. 4070, the Tren de  Aragua Border Security Threat Assessment Act.\n\nTren de Aragua, a gang formed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…quite astonishing. They want funding for healthcare for illegal  immigrants, and they want more subsidies for pandemic-era health  insurance, all while actually repealing a $50 billion healthcare fund  for rural hospitals that was put in the One Big Beautiful Bill. How  does that make sense? In the meantime, vital programs that support  hard-working…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…show you here, first off, where most people get  their health insurance coverage in this country. So you have got, in  the individual marketplace, which is the blue here, almost 50 percent  of Americans--that is about 150 million Americans--who get their  healthcare coverage through their employer. So they are in the small  group plan, the large group plan,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…great heroes, Captain  Allen Colby Brady of Pensacola and his outstanding service to the  United States.\n\nCaptain Brady lived as a resident of Pensacola off and on for nearly  50 years, becoming a permanent resident in 1994 after marrying his  wife, Dianne, in 1994. Born in 1929 into a naval family, Captain Brady  committed to attend the Naval Academy…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "French Hill", "party": "Republican", "sentence": "…record straight: The top 1 percent are paying more in  taxes than they have ever paid in the history of the country. They pay  45 percent of all the taxes in this country, and 50 percent of us are  paying the least amount of tax they have ever paid in American history.\n\nThis bill goes on to support border security and national defense,  which President…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688083/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…during the period from February 10, 2026,       through July 31, 2026, shall not constitute a calendar day       for purposes of section 202 of the National Emergencies Act       (50 U.S.C. 1622) with respect to a joint resolution       terminating a national emergency declared by the President on       February 1, 2025, April 2, 2025, July 30, 2025, or August…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…REMOTE ACCESS OF ITEMS UNDER THE EXPORT                     CONTROL REFORM ACT OF 2018.\n\nThe Export Control Reform Act of 2018 is amended as       follows:\n\n(1) In section 1742 (50 U.S.C. 4801), by adding at the end       the following:\n\n``(15) Remote access.--The term `remote access' means       access on a purposeful, knowing, reckless, or negligent basis…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…small  business have limited bargaining power when it comes to negotiating  lower insurance costs for their workers. Since 2010, the share of small  businesses with fewer than 50 employees offering health coverage has  dropped from 39 to 30 percent.\n\nSmall businesses have ranked the cost of health insurance as their  number one problem for 32 straight…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}]