[{"senator": "John Larson", "party": "Democrat", "sentence": "…children or stand with Elon Musk and Trump  to make sure that $2 trillion is cut so that it can make way for  further tax cuts for the Nation's wealthiest 1 percent.\n\nAt over $500 billion, I would think Mr. Musk might say: Do you know  what? This is a great Nation that has provided me these great  opportunities. How about we care for them the same way this…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Republicans passed a bill to cut nearly a  trillion dollars from Medicaid and the Affordable Care Act, which will  strip healthcare coverage for more than 15 million people. Over $500  billion in cuts to Medicare will be triggered by this law, harming  America's seniors. In their signature law, Republicans slashed  nutrition benefits for poor families, which will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…That is right--the  biggest cut in history, while all of these other costs are going up.  Their budget cut Medicaid by over a trillion dollars and will trigger  more than $500 billion in Medicare cuts.\n\nHow does that happen? Well, the debt is so high from that bill  because of the trillion dollars in tax cuts to the wealthiest Americans  and the trillion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the money to buy Greenland but not to help  fund healthcare for the American people. They have the money. Donald  Trump wants to expand the size of the military budget by $500 billion  which he just posted today, but they don't have the money to fund  healthcare for the American people. They have the money for ballrooms  and lavish parties.\n\nHere is an…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698586/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…reconciliation bill added $3.3 trillion to the deficit over the 10-year  budget window. By abusing the authority under section 312, the  Republicans claim that H.R. 1 actually saves $500 billion. The Finance  Committee title alone adds $3.5 trillion to the deficit over the 10- year budget window. But the Republican's claim, alleging section 312  authority, that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…trigger a sequestration, an automatic cut to the Medicare system.  Medicare is the system that provides health insurance for people over  65 and people on disability.\n\nThat is $500 billion over the next 10 years. Again, it is going to be  a cut across the board to hospitals, to physicians, and to a whole  series of medical devices and pharmacy products that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…means more death and destruction from extreme weather  events, such as the Los Angeles wildfires and Hurricanes Helene and  Milton. By the way, those three events caused $500 billion worth of  damage--those three events, all related to climate change, all related  to the warming of the atmosphere.\n\nJust assume that the ceiling here on the Senate floor…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…their jurisdiction is Medicare  and Medicaid. You can literally cut everything else that they have  jurisdiction over and that only gets you about $380 billion, so at  least $500 billion, by definition, in order to follow and carry out  these instructions, have to come from Medicaid.\n\nNow, finally, because I know we have a lot of speakers on this side,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…on Trade for working so hard to make sure  that we reauthorize AGOA.\n\nLast year alone, AGOA imports totaled $8 billion. Moreover, since  2002, AGOA has spurred more than $500 billion in exports to the United  States.\n\nHowever, this year, the impact of the reciprocal tariffs, coupled  with the expiration of AGOA on September 30, threaten to erode 25 years…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…what we should be doing.\n\nIn addition to the cuts to Medicaid, this bill will result in the  largest cut to Medicare in American history--by some estimates, more  than $500 billion in cuts to Medicare as a result of the Republicans'  one big, ugly bill.\n\nThis bill will also result in a devastating blow to the Affordable  Care Act. That is no surprise…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't cut  Medicare or CHIP, there is only $381 billion left to cut in E&C's  jurisdiction. Even if you cut literally every single other dollar, you  are still at least $500 billion short, half a trillion dollars short.\n\nI guess I understand why President Trump suggests that you all close  your eyes before voting on this steaming pile of Medicaid cuts.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…fuel to Republicans' larger  assault on Americans' access to quality, affordable healthcare.\n\nRemember, Mr. Speaker, Republicans already slashed $1 trillion from  Medicaid, $500 billion from Medicare, and let Trump steal billions in  medical research. With this bill, Republicans dump massive healthcare  price hikes on struggling Americans. Millions will…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…billionaires and the  biggest corporations. It takes healthcare aware from 17 million  Americans. People will die, and 42 million Americans will go hungry.  This bill triggers $500 billion in Medicare cuts. It increases the  budget deficit by $3.3 trillion.\n\nPresident Trump and House Republicans have abandoned their promise to  lower the cost of living. They…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693171/one-big-beautiful-bill-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…our chance at a livable future.\n\nSenate Republicans are doubling down on egregious attacks against  historic investments in the Inflation Reduction Act, cutting more than  $500 billion in investments and programs, threatening hundreds of  thousands of jobs, and raising monthly household energy bills.\n\nIn 2024--this is the big number--in 2024, 94 percent…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…breaks over extending the Affordable  Care Act tax credits for our hardworking families.\n\nThat is all on top of the $1 trillion that Republicans slashed from  Medicaid and $500 billion from Medicare. Over 203,000 people will lose  coverage in my district. Let's be really clear: Many of them will get  needlessly sick or die.\n\nThankfully, Democrats refused…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…lives, and save communities.\n\nNow, we can ask ourselves if FEMA were to move forward with the plan  to cut BRIC, what would be the alternative? Flooding costs up to almost  $500 billion in damage every year throughout the United States, not  just Louisiana. Again, $500 billion in damage that we have to pay after  the fact versus investing a few million…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in America. That is mostly from reduction in immigration and the  fact that our fertility rates continue to fall, but think of this.\n\nThat missing 5.3 million people is $500 billion over that timeframe  in lost tax receipts. When I use the term ``demographics'' on our debt,  it is a function. Our debt is a function of the fact that our society  has…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…big industries for my  State in North Dakota. We are slamming the breaks on the Biden  administration's radical energy agenda. The one big, beautiful bill  repeals over $500 billion in the style of Green New Deal spending and  boosts mineral development to reduce our reliance on China for critical  materials.\n\nIt ends electric vehicle mandates and subsidies…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ceiling, let's say a month or two from  now, Treasury is going to need to pay back those dollars plus the  interest. They are going to come to market with $400 billion, $500  billion, $600 billion of borrowing. Just be prepared for what is really  going on in the interest rate markets, the debt markets, and will we be  beyond some of the discussions of trade…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Cuts and Jobs Act helped people get off SNAP, which is  a good thing. A GAO report last year showed improper payments could be  costing the Federal Government more than $500 billion annually.\n\nI am not here to fight with my colleagues on the other side of the  aisle. I am here to fight on behalf of the American people, and that is  exactly what we are…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…demanding we give them more  money.\n\nWhat happens when we raise that debt ceiling, Mr. Speaker, and we  have to come to market--Treasury has to come to market--with $500  billion to $600 billion functionally to catch up and refund all  the accounts we have been borrowing from? That is what is done in  extraordinary measures. We grab every account and use…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…most. As a result of the One Big Beautiful Bill  Act, the top 1 percent will pay more in Federal taxes than they did  before the Tax Cuts and Jobs Act of 2017.\n\nIt ends $500 billion in Biden-era tax breaks and special interest  giveaways to wealthy individuals and large corporations. It stops a  Biden-era $1,700 tax increase.\n\nWorking families making…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]