[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Department was awarded Class 1 status by the Insurance Service Office  for its outstanding protection of residents, and was one of only  thirteen Class 1 departments that serve over 500,000 constituents.  Throughout his service, Chief Baker has championed the physical and  mental well-being of his team through workplace wellness programs, and  we are incredibly…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…state's population.\n\nTo maintain equitable access to burial benefits in a national  cemetery for veterans residing in Hawaii, where the next closest  national cemetery is over 2,500 miles way, our Nation must begin the  construction of a new cemetery. The work should start immediately, as  developing a new national cemetery involves many phases, including…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Republicans passed a bill to cut nearly a  trillion dollars from Medicaid and the Affordable Care Act, which will  strip healthcare coverage for more than 15 million people. Over $500  billion in cuts to Medicare will be triggered by this law, harming  America's seniors. In their signature law, Republicans slashed  nutrition benefits for poor families, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…$955 million.\n\nThe President is actively trying to revoke permits for the Revolution  Wind project, which was fully permitted and 80 percent complete,  supporting more than 2,500 U.S. jobs across  construction, operations, shipbuilding, manufacturing. The project was  just steps away from powering more than 350,000 homes in Rhode Island  and Connecticut,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…reducing  the burden on emergency rooms and jails. Dow's commitment to  environmental conservation resulted in the protection of 30,000 acres  of land and the restoration of 500 acres of fish and wildlife habitat,  including the successful resurgence of the Kokanee salmon population.  Through his advocacy for sustainable transportation, he expanded…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691034/recognizing-the-contributions-of-dow-constantine"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…here as being the Ph.D. physicist in Congress.  Before that, I was a manufacturer.\n\nWhen I was 19 years old, my little brother and I started a company in  our basement with $500 from my parents. That company now manufactures  more than half of the theater lighting equipment in the United States.  Our company does hardware, software, sheet metal, wiring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…simple--nothing more, but nothing less.\n\nRepublicans are raising prices by excluding clean energy from their  emergency, meaning families could see electricity bills go up by $500 a  year. Republicans are killing jobs by gutting domestic energy  investments that we made, that have created so many new good-paying  jobs. Republicans are rewarding China…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…administration's flood of illegal actions. That is  why I rise today in opposition to this bill.\n\nMr. Speaker, I include in the Record an April 2, 2025, letter  addressed to Pam Bondi from 500 law firms and lawyers across the  Nation.                                                      April 2, 2025.      Hon. Pamela Bondi,      Attorney General of the United States…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…criminality against a free nation is  nothing new, and Ukraine has repeatedly seen double-tap strikes  specifically targeting first responders over the past 4 years, with  over 500 killed.\n\nYesterday, 3 days after that attack, Sergiy Smolyak, a 56-year-old  responder, was laid to rest. This champion of healing and compassion  served as a medic for 25 years…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698971/russian-air-attack-on-kyiv"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…couple who are 60 years old in  Fresno earning $82,000 a year will pay $18,000 more per year for  coverage. A family of four in Tulare County earning $64,000 a year will  pay $2,500 more.\n\nThis is not fiscal responsibility. This is a Republican healthcare  tax hike on working families, imposed in the richest country in the  world. I think it is unacceptable.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…effort on the floor by renaming the Gulf of  Mexico. I think the Gulf of America Act is an absurd bill. It is  political theater. The Gulf of Mexico has held that name for over 500  years. Spanish explorers from Spain chartered these waters hundreds of  years before the United States ever existed. Let's call this bill for  what it is. It is a vanity project.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…words of another Delawarean,  a single mom: ``Without Medicaid, neither of us would have health  insurance. My employer doesn't offer health coverage, and I can't  afford the $500 a month private plan with high deductibles and out-of- pocket expenses. If we lose Medicaid, we lose everything.''\n\nShe added this: ``P.S., I am a healthcare worker with a bachelor's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…first 100 days have also  escalated this relentless assault on the checks and balances that have  been the foundation of our great Nation.\n\nOn day one, he pardoned more than 1,500 criminals who stormed this  very building on January 6. Hundreds of them were convicted of  violently assaulting law enforcement officers. It was a blatant and  disgusting disregard…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today in support of the more  than 28,000 farms that engage in agritourism across the country, 1,500  of which are in the Commonwealth of Virginia.\n\nAgritourism, for those who don't know, is exactly what it sounds  like. We are bringing tourists to farms or agricultural venues…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…for that purpose.\n\nSo how is this Republican so-called healthcare plan going to help  someone who works in a hardware store, who owes $12,000 a year in  premiums, and has a $7,500 deductible? How does that $1,000 help anyone  whose premiums will be $19,000 next year? How does $1,000 cover  $19,000, which would have been covered? How does that $1,000 help…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…keep your  doctor; he said that if you like your healthcare plan, you can keep  your healthcare plan; and he also said that it would reduce healthcare  costs by an average of $2,500 per American consumer--none of which has  proven to be true. Democrats preferred to write the bill all by  themselves and then misrepresent to the American people about their…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, last Monday marked a somber  milestone. It was 500 days since the horrific attacks on October 7,  2022, when Iranian-backed Hamas terrorists launched the most harrowing  assault on Israel and the Jewish people since the Holocaust.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…here in order to achieve what we want, which is $100 million for some  research--they usually don't do that. They just come in and say: We  need $100 million for research or $500 million for research or $1  billion for some program, and I have to say no. I always say no.\n\nI tell my farmers who come in and are just dying for relief because  we have messed…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…prohibits the council from  weakening mandatory minimums on sentencing guidelines any further.\n\nMake no mistake, carjackings and robberies by juveniles are out of  control. More than 500 minors were arrested for robbery in 2023, and  more carjackings were committed by juveniles. Every American should be  able to visit their Nation's capital without fear of being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…access essential support such as medical  treatments, PTSD therapy workshops, employment opportunities, and  veterans' benefits. His non-profit has successfully helped over 1,500  veterans and continues to make significant contributions to his  community today.\n\nAbove all, Scott is a devoted father to three children-Alaina,  Scottie, and Kai. Together,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Economic Advisers, an even larger 65  percent of workers in North Dakota are in occupations that are likely  eligible for overtime and could also benefit.\n\nWe cut taxes on up to $12,500 of overtime pay for more than 80  million hourly workers. This is estimated to increase yearly take-home  pay by more than $1,400.\n\nThe bill also eliminates Federal taxes on…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…solving skills that members develop prepare them for a wide range of  careers and civic responsibilities.\n\nMany former FFA members have gone on to serve in Congress, lead  Fortune 500 companies, and contribute meaningfully to their local  communities, including the recently confirmed U.S. Secretary of  Agriculture, Brooke Rollins, the first Secretary of Agriculture…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…increased to $22.2 billion, including $10.3 billion for air traffic  control operations, $4 billion to modernize facilities and equipment,  and additional resources to hire 2,500 new air traffic controllers.  This will help keep America's skies safe.\n\nThe bill also invests $64 billion in highway infrastructure,  including $879 million for priority needs,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…highest distinction that any member of the Armed Forces can earn, the  Medal of Honor.\n\nSince 1863, Presidents of the United States have awarded the Medal of  Honor to more than 3,500 of the bravest men and women ever to wear the  uniform of this Nation. Each one has demonstrated valor, gallantry, and  heroism above and beyond the call of duty, with acts…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Ambulance for its foundational leadership, recognizing the  organization among seventeen native Californians who helped shape  emergency medical services nationwide. Today, more than 500 dedicated  employees continue Mr. Hall's legacy, upholding a mission rooted in  care, compassion, and service.\n\nMr. Speaker, Representative Vince Fong and I invite our colleagues…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…healthcare services and improve community health  outcomes.\n\nThe task force addressed this need by designing 30,000 locally  manufactured 988 Lifeline challenge coins; distributing 500 copies of  the book ``988/End the Stigmas,'' designed by local artist and mental  health advocate John Schlimm; and installing a digital billboard on the  Elk County highway…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697845/congratulating-cameron-elk-suicide-prevention-task-force"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…department  within the Federal Government, is now borrowed. Instead of long-overdue  streamlining, the Democrats are pushing for a tax increase that will  amount to about $1,500 on a family earning just $75,000.\n\nAt Yosemite National Park, in my district, disgruntled employees hung  a giant American flag upside-down on El Capitan the other day, ruining…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…loans totaling $333 million to borrowers over 115 years old--one  more time, that is $333 million of taxpayer dollars that went to  borrowers over 115 years old--and more than 5,500 loans totaling $300  million to children under 11 years old. Is that where we want our  dollars to be spent?\n\nWe know, without a doubt, that the previous administration welcomed…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…also be mounted on a variety of platforms including vehicles,       aircraft, and watercraft. The system weighs 49.5 pounds and       has a maximum range in excess of 2,500 meters. The system is       highly lethal against tanks and other systems with       conventional and reactive armors. The system possesses a       secondary capability against…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…as Congress, to do everything in our capacity to  support them and their families.\n\nCurrently, each Medal of Honor recipient receives a special pension  that totals roughly $1,500 per month, or $18,000 annually. The last  update to the special pension for Medal of Honor recipients was back in  2002, when Congress passed the Medal of Honor pension act.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}]