[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Subcommittee on Trade for working so hard to make sure  that we reauthorize AGOA.\n\nLast year alone, AGOA imports totaled $8 billion. Moreover, since  2002, AGOA has spurred more than $500 billion in exports to the United  States.\n\nHowever, this year, the impact of the reciprocal tariffs, coupled  with the expiration of AGOA on September 30, threaten to erode…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Chair, 2.8 million acres of farmland protected;  35,000 miles of fish passages opened; nearly 1,500 new public water  access sites established; upgrades to every large wastewater treatment  plant in the watershed to improve water quality; and the largest oyster  reef restoration…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698039/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…destruction and devastation wrought by Donald Trump's illegal  dismantling of the U.S. Agency for International Development. Estimates  are that more than 760,000 people, including 500,000 children, have  died over the past year since American assistance suddenly vanished-- 760,000 people. Worse, millions more are expected to die in the next 5  years if the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…here as being the Ph.D. physicist in Congress.  Before that, I was a manufacturer.\n\nWhen I was 19 years old, my little brother and I started a company in  our basement with $500 from my parents. That company now manufactures  more than half of the theater lighting equipment in the United States.  Our company does hardware, software, sheet metal, wiring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…not  what we should be doing.\n\nIn addition to the cuts to Medicaid, this bill will result in the  largest cut to Medicare in American history--by some estimates, more  than $500 billion in cuts to Medicare as a result of the Republicans'  one big, ugly bill.\n\nThis bill will also result in a devastating blow to the Affordable  Care Act. That is no surprise…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…concerned about how this blaze would impact our homes and  livelihoods.\n\nBut thanks to the work of multiple agencies, this wildfire was fully  contained in just six days. Nearly 500 personnel battled the blaze from  across agencies including the California Department of Forestry and  Fire Protection, Alameda County Fire Department, South San Joaquin  County…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…our chance at a livable future.\n\nSenate Republicans are doubling down on egregious attacks against  historic investments in the Inflation Reduction Act, cutting more than  $500 billion in investments and programs, threatening hundreds of  thousands of jobs, and raising monthly household energy bills.\n\nIn 2024--this is the big number--in 2024, 94 percent…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…entire agencies, fire thousands of  Federal workers without cause, and generally wreak havoc across the  government.\n\nLast month, DOGE decided unilaterally to cancel more than $500  million of Department of Justice grant funding for local law  enforcement, public safety, and crime prevention programs all over the  country in our communities.\n\nWhat did…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…some ESG funds do better,  some do worse, just like all other categories of funds. The committee  chair's opening statement suggested that ESG funds don't do as well as  the S&P 500. The fact is, most funds don't do as well as the S&P 500  index funds, but the other funds are not restricted. A consideration,  not a mandate, of ESG factors ought to be allowed.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…of Virginia--Kathleen, a mother of two and a  small business owner living in Newport News, saw her premium for her  family of four increase from 544 bucks a month to over $1,500 a month.  That is a yearly increase of about $11,500 a year--a pricetag that her  family just can't afford. She told me she came up to the Hill before  New Year's hit and that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…You will recall that the funding bill included a provision that many  Senators were simply not made aware of. It came in at the last minute.  It set up a special payday of $500,000, paid for by the taxpayers, for  a select--a select--group of eight Senators. That policy is simply  wrong. It goes against everything that we are supposed to be doing as…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Americans will  simply choose not to purchase the coverage, and the premiums will, on  average, double for the remaining people on the exchange. So that  meager $1,000 to $1,500 provided by my colleagues, Senators Cassidy and  Crapo, in health savings accounts is nowhere--nowhere--close to  covering the out-of-pocket deductible of a $7,000 typical associated…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…state's population.\n\nTo maintain equitable access to burial benefits in a national  cemetery for veterans residing in Hawaii, where the next closest  national cemetery is over 2,500 miles way, our Nation must begin the  construction of a new cemetery. The work should start immediately, as  developing a new national cemetery involves many phases, including…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…international  community.\n\nDo you know who will come out ahead? China, Russia, Iran.\n\nAll of this is being done in the name of combating waste. I will tell  you what waste is: 500 tons of food grown by American farmers destroyed  at a cost of $130,000 to American taxpayers because of the chaos caused  by dismantling USAID. It was left there to expire.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, today, I rise to recognize May 2 as  Nonketotic Hyperglycinemia Awareness Day.\n\nNKH is a rare genetic disorder, and there are only 500 kids in the  world living with it, four of them calling the Commonwealth of Virginia  home.\n\nToday, I am proud to be joined by one of these incredible kids, my  constituent…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690619/recognizing-nkh-awareness-day"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…material, emotional, and  spiritual support during and after pregnancy. This life-affirming work  has saved lives, eased the transition into motherhood, and directly  impacted over 1,500 families each year. Cheryl's continued leadership  has improved the lives and wellbeing of countless children, mothers and  fathers across Western New York, and I am so grateful…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689281/recognizing-cheryl-calire-for-her-steadfast-service-and-dedication-to-the-saint-gianna-molla-pregnancy-outreach-center"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…that  my team and I have been pushing over the last several months, including  a permanent increase to the child tax credit and additional support for  families in the range of $500. Families are going to get a $2,500 tax  credit with respect to their dependents.\n\nIt also makes the adoption tax credit partially refundable up to  $5,000 to help children…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for their infants and young children to include:  formula, diapers, pull ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing were distributed. These volunteers have a `can do' attitude no  matter how large the challenge.\n\nThey also have tremendous teamwork. They sort through all…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…here inside the United States. Let that sink in. This is an  urgent reminder that national security starts with border security.\n\nUnder Joe Biden and the Democrats, more than 1,500 illegal immigrants  from Iran crossed our southern border, and 729 of them were released  into our country by Joe Biden. And that might just be the tip of the  iceberg because,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…number of loans made by such development       companies; and\n\n``(C) an analysis of the program risk for such loans with a       dollar value--\n\n``(i) less than or equal to $500,000;\n\n``(ii) greater than $500,000 and less than or equal to       $1,000,000;\n\n``(iii) greater than $1,000,000 and less than or equal to       $2,000,000; and\n\n``(iv) greater…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…expenses.\n\nBy the way, the health savings account, it has been shown, empowers,  encourages somebody to make wise decisions. If she knows that ``I can  get the x ray here for $500 or down the street for $2,500,'' she is  going to go where she gets it for $500. That begins to lower costs  because the people who are more expensive will lower their costs.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…President Trump's no tax on tips and no  tax on overtime. I have done that, and it is no surprise that they  welcomed that with open arms.\n\nSingle filers can now deduct up to $12,500 on qualified overtime  income. A lot of our law enforcement personnel and first responders  work more than one job. They may work a side job in security or  something like that.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…alphabet soup of agencies and departments.\n\nWe did some calculation, and during her time in my office alone, not  counting her time with Congressman Pitts, Joanne helped more than 7,500  individuals and secured over $46.8 million in savings and benefits that  were rightfully owed to the people we serve.\n\nThose numbers only tell part of the story. Joanne always…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…headquartered in my hometown of Peachtree City, and  3 years ago, it opened a state-of-the-art facility in Griffin, Georgia,  two cities I proudly represent in this Congress.\n\nOver 500 of my constituents are working to manufacture and market the  very water heaters the Biden administration attempted to outlaw. This  job-killing regulation imposed by the Biden…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Imagine the  ire that so many people have.\n\nMr. Speaker, if you talk to a family of four and talk to the parents,  they are going to say, for a family of four, they pay like $1,500 to  $2,000 a month for private healthcare. Yet, a person who comes into the  country illegally pays zero in healthcare because they get Medicaid  services where there is not…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…bills.\n\nThat is why, as a part of budget reconciliation, Congress passed  legislative language to permanently increase the child tax credit,  index it to inflation, and add a $500 increase, bringing the total tax  credit to $2,500. Changes to the tax code, including expanding the  child tax credit, will help save the average family more than $1,300 a…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692096/child-tax-credit"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Bexar County DA downgraded the DWI. He pled guilty to obstructing  a passageway, but he violated the probation. He got arrested again. He  was let go after posting a bond of $1,500. He failed to show up.\n\nHe was arrested a fourth time in November of 2024. He was sentenced  to time served. He assaulted a girlfriend and fled the scene. After  shooting Jimmy,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…and  accomplished collegiate marching programs in the Nation.\n\nUnder Dr. Bodiford's leadership, the Marching Southerners expanded  from approximately 140 members to more than 500, becoming one of the  largest collegiate marching ensembles in the country. His vision and  commitment to excellence elevated the Southerners to national and  international…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…0                  *  Yes ---------------------------------------------------------------------------------------------------------------- * = between zero and $500,000.                           summary of legislation\n\nOn March 12, 2025, the Senate Committee on Commerce,       Science, and Transportation ordered reported 14 bills. This…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694306/ads-for-mental-health-services-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…nonexistent.\n\nThe number of net jobs that were added to the California economy was  exactly zero for the month of January. By comparison, Texas added  27,900; Florida added 16,500; and even New York added 20,100.  California added zero. Indeed, California is one of only five States in  the country that has not recovered the jobs that it lost during the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]