[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…reconciling any differences in a way that maximizes aviation safety to  ensure that all of the recommendations of the NTSB can be adopted.\n\nMr. Speaker, I thank the families of flight 5342 who have been a  driving force for the ROTOR Act and for aviation safety reform. These  families have been advocates, experts, and champions all in the face of  tremendous loss.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700105/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…DAVIDS of Kansas.  I rise in support of H. Res. 153, expressing condolences to  the families, friends, and loved ones of the victims of the plane crash  of American Eagle Flight 5342 and U.S. Army call sign PAT 25,  introduced by my colleagues from Kansas, Representatives Ron Estes and  Tracey Mann. I thank both Congressman Estes and Congressman Mann for…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…condolences, and the  very real grief of my constituents and neighbors, to what has already  been said.\n\nWe are here today to honor the lives lost on American Eagle Flight  5342 and the brave souls aboard the PAT 25 helicopter. Each of them was  more than a passenger and more than a soldier. They were loved ones-- friends, parents, classmates, children,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Mr. Speaker, I am proud to be a cosponsor of the  ROTOR Act. I thank the sponsor as well.\n\nOn January 29, 2025, a U.S. Army Black Hawk helicopter and American  Airlines flight 5342 collided midair outside of DCA, and 67 lives were  lost.\n\nAmong the victims were families from my community in northern  Virginia. We lost children, parents, and members of…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700113/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…bill represents a major  step forward for aviation safety.\n\nNot even 1 year ago, 67 people lost their lives when a Black Hawk  helicopter collided with American Airlines Flight 5342 over the  Potomac, and it was one of the deadliest aviation disasters in history.  I do thank the families who are represented in the gallery today for  their steadfast support.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. Speaker, last month marked the 1-year anniversary of the D.C.  midair collision where a U.S. Army Black Hawk helicopter collided with  American Airlines Flight 5342 near Washington National Airport, or DCA,  tragically claiming all 67 lives aboard both aircraft.\n\nIt was the first mass-casualty commercial plane accident in the  United  States…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700110/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…DCA air collision.\n\nSo I hope that my colleagues here will help us make changes to this  section of the Defense Authorization Act. We know how important this  is, the Flight 5342 passenger families, the Lilley family, along with  myself and Senator Cruz, have been trying to sound the alarm bells  around the Capitol in the airspace about why we shouldn't…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…(Ms.  Davids) for yielding.\n\nOn January 29, our community in northern Virginia was shattered.\n\nMr. Speaker, 67 lives were taken from us far too soon when American  Eagle Flight 5342 and Army flight call sign PAT 25 collided. Many of  those on Flight 5342 called Virginia's 10th District home, and they  leave behind countless family members, friends, and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688367/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…for holding this session for such a great and worthy  cause.\n\nMr. Speaker, I rise today in solemn remembrance of the lives lost in  the tragic crashes of American Eagle Flight 5342 and PAT 25.\n\nTo the families, friends, and loved ones of the 67 victims, we offer  our very deepest condolences. No words can ever ease the pain of such a  devastating loss,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of Columbia Fire  and Emergency Medical Services Department, whose swift and selfless  actions in the aftermath of the devastating collision between American  Airlines Flight 5342 and a United States Army Blackhawk Helicopter over  the Potomac River showed heroism in the face of tragedy.\n\nWhen the unthinkable happened on that cold January evening, it…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690276/recognizing-the-heroism-of-the-district-of-columbia-fire-and-emergency-medical-services-department"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Mr. President, in January of this year, tragedy struck just  a few miles from here when an Army Black Hawk helicopter collided with  American Airlines Flight 5342 at Ronald Reagan Washington National  Airport. Sixty-seven souls were tragically lost in an instant.\n\nAfter the crash, it quickly became evident that there were  commonsense…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…from Washington State, thank you very  much for the opportunity to join with you today and throughout a long  process since January 29, earlier this year.\n\nThat flight--Flight 5342--originated in Wichita, KS, and, as we know,  on January 29, it collided with an Army Black Hawk helicopter, and it  changed the way we look at air safety every moment since…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…Speaker, I thank Representative Mann for managing the  floor time on this resolution.\n\nMr. Speaker, I rise in support of H. Res. 153, a resolution honoring  the victims of Flight 5342 and Black Hawk PAT 25 and offering  condolences to the families, friends, and loved ones.\n\nFirst, I offer my own condolences, prayers, and support to those who  are mourning…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…occasion for me and for  many people I know, and I rise this evening to recognize and honor the  67 lives we lost, 1 year ago tomorrow, on January 29, 2025.\n\nOn that night, Flight 5342 took off from Wichita, KS, and flew toward  our Nation's Capital with 64 passengers on board. In Washington, DC, a  Black Hawk helicopter with three Army soldiers would soon…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…suspend the rules and agree to the  resolution (H. Res. 153) expressing condolences to the families,  friends, and loved ones of the victims of the crash of American Eagle  Flight 5342 and PAT 25, and for other purposes.\n\nThe Clerk read the title of the resolution.\n\nThe text of the resolution is as follows:                                H. Res. 153\n\nWhereas…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}]