[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…a big tax bill giving enormous benefits to the richest Americans.\n\nThen they said: You know, the problem with that is the Democrats  won't work with us. They won't give us 60 votes to do that. Oh, I know,  they said, we will do a nuclear option. We will repurpose the deficit- decreasing bill from 1974 and say that it can be used in order to  actually…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…many ways around the procedural shortcut of going nuclear,  where a majority of the Senate shoves its view on the minority, without  consideration, without cloture, without 60 votes, without negotiation,  just rolling the minority in order to get what they want done. That  ought to be a last recourse for a desperate majority, but instead it  was the first…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…very rules of this body, to make our air less  clean.\n\nTo do so is complicated. It requires a lot of parliamentary  maneuvers. Why?  Because to make the air dirtier requires 60 votes, and they don't have  60 votes, or it requires Republicans to break their word, to eliminate  the filibuster so they can do the bidding of those who would pollute  our air.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…motions to proceed to  that legislation are generally fully debatable?\n\nMr. WHITEHOUSE. That is correct. And for those of you following this  at home, ``fully debatable'' means 60 votes are required to end debate,  which Republicans do not have.                            Parliamentary Inquiry\n\nMr. President, I have a further parliamentary inquiry.\n\nMr. WHITEHOUSE.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…side. We produced a measure that had the  support of business and labor and Democrats and Republicans.\n\nWe brought it to the floor of the U.S. Senate and passed it with over  60 votes. It was a glorious day and a great celebration. What was it  all about? It was all about the 11 million undocumented people in the  United States coming forward and registering…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…reconciliation bill that adds tens of trillions to the debt?\n\nIt started in 1996, when the Republicans wanted to pass tax giveaways  for the wealthy and didn't have the required 60 votes so they turned to  the reconciliation process. Except they had one problem, reconciliation  wasn't supposed to increase the deficit in the first 10 years. Instead  of finding…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…magic trick. Before dinner yesterday, these bills  to gut California's Clean Air Act authority were recognized as regular  bills, subject to the filibuster rule requiring 60 votes to move  forward, open to full debate and amendments, but somehow, after  dinnertime yesterday, once Senate Republicans were done with overruling  the Parliamentarian, these…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…CRA, does not apply, that these are not rules; that if they want  to strike down California's clean air rules, they can do so but not in  this summary fashion, not without 60 votes.\n\nThat is the ruling that the Parliamentarian has reaffirmed and which  the majority now wants to strike down.\n\nBut let's be clear. Going to the GAO was nothing out of the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…they would have to get the law  passed in the Senate. And in the Senate, that was subjected to having  to negotiate with the Democrats in order to get past cloture and get 60  votes and then get the bill signed by the President. That is the proper  way to proceed when you want to amend a law. But Big Oil didn't care to  do that because it knew it had…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…not happen.\n\nLet me be clear. I will not let this noxious bill, the SAVE Act,  become law. Every Senate Democrat, every single one of us, is united  against it. They need 60 votes. The SAVE Act is dead on arrival.\n\nI would like to say it louder so my friends in the House and the  rightwing over here can hear: The SAVE Act is dead on arrival.\n\nDemocrats…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…fast-track, filibuster-free lane really meant a lot  here in the Senate because we are the ones who have the 60-vote  requirement. The House doesn't have a requirement for 60 votes, for  three-fifths of the body on anything. So it was really all about here,  about the Senate's sense that we should only drop to 60 votes for bills  that reduced the deficit.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…vote.\n\nOne vote, that is all I am asking. Give us a vote on passage of the  Major Richard Star bill, and it would be passage by a 60-vote margin,  filibuster proof. If we get 60 votes, the bill passes. If not, it goes  down. Let's do it before the end of the year.\n\nI happen to think that we ought to spend whatever time is necessary  on this bill. But I…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…our first vote will be 5:30 on Monday.  There is time. There is just no desire to go through the process.  Right?\n\nSo it is true--I am not actually sure that you would have 60 votes  for that, but there is a way to test it, and that is to file cloture on  a new standing order or a new resolution or whatever the procedural  pathway is.\n\nWhat Senator Lankford…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…know my Republican colleagues have been fighting against ObamaCare  for years now. I can remember back when it was first passed 15 years  ago in this Chamber. There were over 60 votes to repeal and replace the  ObamaCare piece of legislation. They kept going year after year after  year. Somewhere along the way, about 5 years in, they found out that  the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…tell the truth in this process.\n\nIf we could pass this budget with 51 votes, and we didn't, then that  point would be valid and that criticism would be just. We don't have 60  votes in the Senate. We are relying on Democrats to join us in order to  get it over the finish line.\n\nA deal was cut, apparently, where we made a deal that we said we will  pass…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…out of 58 of the President's civilian nominees have  required cloture votes, an unprecedented number for recent  administrations; and of those 57 nominees, 17 received 60 or more votes  in support on their final confirmation vote--in other words, support  from a number of Democrats as well as Republicans. And yet Democrats  dragged out those nominations…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…60-vote number is simply a fake filibuster--a  zombie filibuster, as my friend, Mike Lee, calls it, meaning it is an  arbitrary rule that was put in place to, yes, if you have 60 votes, you  can shut off debate.\n\nThe core of the Senate--the core of the filibuster was about people  being able to speak. Because on the Senate floor, you can speak, you  can…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…until November 21--a short period of time--is designed to  avoid that dysfunction, to avoid that uncertainty. All that is required  is that we pass the continuing resolution, 60 votes in the U.S. Senate,  to keep the government functioning so--and this is the reason it makes  no sense to me--so that we can pass the remaining appropriations bills,  all but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…our Conference.\n\nFrequently, Republicans have to go home and explain why they aren't  getting done what they want to get done. It is because the rules in the  Senate require 60 votes to break a filibuster, which means that you  need Chuck Schumer to sign off in order to get almost anything done in  the Senate.\n\nHowever, three times in this 2-year period,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694987/calling-for-use-of-reconciliation-process"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…poll from the Pew Research Center, 95 percent of Republicans and 71  percent of Democrats polled all support voter ID. My friends, if an 80- 20 issue such as this cannot get 60 votes in this 100-person Chamber,  something is amiss.\n\nNow, some of my colleagues have raised concerns regarding voter  suppression. They warn that many U.S. citizens do not have…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Congress are using the powers  that we have before us in an obvious narrow majority and in a narrow  majority in the Senate, where you have to get things through the Senate  with 60 votes. We  are using the tools in front of us to try to limit and minimize the  damage caused by the previous administration and, frankly, our  colleagues on the other side of the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Washington, and the  lie is this: Republicans control the Presidency, the House, and the  Senate, so it is on the Republicans for shutting it down. That is a  lie. It takes 60 votes to get something done here in the U.S. Senate.  We are looking for five Democrats to join us.\n\nIt is already bipartisan. Three Democrats have joined us. If five  more join…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696364/government-funding"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reconciliation budget. It is not a regular budget. This is  a budget that opens up the ability, because of the insanity we go  through, of moving something through the Senate and its 60 votes. With  the 1974 Budget Control Act, this is the dance we go through.\n\nThe other thing I am going to try to walk through is where the actual  math lays in the box that has…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…new political age where nothing seems  to be normal.\n\nSo we proposed a very simple thing; that this would be helpful to do  in what is called a standing rule. It would take 60 votes to be able to  move this, and we would have a standing rule to say here is how this  could be done. Up to 15 out of a committee would come to the floor en  bloc. We would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "John Thune", "party": "Republican", "sentence": "…are using this strategy even on noncontroversial  nominees. Almost a quarter of the nominees whose confirmation process  Democrats have dragged out actually got more than 60 votes here on the  Senate floor.\n\nThe American people gave President Trump a mandate, and he deserves  to have his team in place to execute that mandate for the American  people.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…these reconciliation budgets.\n\nThe 1974 Budget Control Act allows us to move a bill, if it has  certain fiscal properties to it, through the Senate without having to  get 60 votes. It is all a dance to deal with the 60 votes. If we were  actually a little more honest about math, maybe we wouldn't have to do  this dance.\n\nWhy this is important is--I…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…may hear from  your local Congressman that all sorts of things can't be done because  we have a 60-vote rule in the U.S. Senate, and we can't pass many bills  without the 60 votes, including the big appropriation bills that have  to pass every year.\n\nHowever, once a year, and due to a quirk, three times in the 2 years  that this body is elected, we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694922/passing-bills-with-51-votes-in-senate"}]