[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…so much.\n\nMr. Speaker, I rise because dismantling the Department of Education  is not just bad policy. It is dangerous for North Carolina's children.  In my State, more than 60 percent of students rely on Pell grants and  Federal aid to afford college. Nearly 1.5 million K-12 students depend  on title I IDEA school nutrition and other Federal supports.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698938/protecting-education-for-children-with-disabilities"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…our own vehicle emissions standards, Republicans  seem to be putting the wealth of the Big Oil industry over the health  of our constituents.\n\nWhat happened? You know, nearly 60 years ago, it was Republican  Governor Ronald Reagan who established the State Air Resources Board in  California. And 3 years later, it was Republican President Richard  Nixon…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…children. Next week, the supporters of Head Start from across  Metropolitan Atlanta will gather to wish a happy birthday to this  critically important Federal program.\n\nMr. Speaker, 60 years ago, President Lyndon Baines Johnson spoke from  the Rose Garden to announce the opening of 2,000 child development  centers across the country.\n\nProject Head Start was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…in 1962, Congress authorized a 130-mile pipeline, known  as the Arkansas Valley Conduit, to deliver clean, reliable water to  communities in southeastern Colorado. More than 60 years later, the  project remains uncompleted, while communities in the region continue  to face unreliable water supplies and serious water quality challenges.\n\nThe drinking…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…licensed in an expeditious  manner, foreign partners often seek greater speed and clarity regarding  the process.\n\nThis bill simply institutes reasonable timeframes of up to 60 days  for a licensing decision to be made. This does not preordain an  outcome. The State Department can still either return such licenses for  adjustment or modification due…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694831/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Assistance Programs at the U.S. Department of Agriculture, ending  subsidies that go directly to farmers for schools and costing  Massachusetts alone and our farmers $18 million.\n\nNo. 60, ordered the closure of the environmental justice offices at  the Environmental Protection Agency and not just at headquarters but at  all the regional EPA offices as well.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…general statement relating to the rule,'' and the rule's       proposed effective date. CRA allows Congress to review and       disapprove of federal agency rules for a period of 60 days       using special procedures. If a resolution of disapproval is       enacted, then the new rule has no force or effect.\n\nCRA adopts the definition of rule under the Administrative…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…of the purse.\n\nMr. Speaker, I encourage my colleagues to vote ``no,'' and I reserve  the balance of my time.\n\nMs. DeLAURO. Mr. Speaker, I remind the majority leader that for a 60- year-old couple earning $82,800 per year, their premiums will rise by  over $17,000. This is a 255 percent increase.\n\nMs. DeLAURO.  Wasserman Schultz), who is the distinguished…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…the so-called SAVE Act.\n\nAs a daughter of Selma and the Representative of Alabama's civil  rights district, the fight for voting rights is very personal to me. It  was in Selma 60 years ago where John Lewis and hundreds of foot  soldiers were bludgeoned on the Edmund Pettus Bridge for the equal  right of every American to vote. The legislation before us…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…with great honor that I rise today to  co-anchor this Congressional Black Caucus Special Order hour along with  my distinguished colleague from Oregon (Ms. Bynum).\n\nFor the next 60 minutes, Members of the Congressional Black Caucus  have an opportunity to speak directly to the American people about  Black History Month, an issue of great importance not…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…extending healthcare stuff  today.\n\nIn my own State of Wisconsin, Mr. Speaker, 279,000 people receive  credits to help make insurance coverage affordable. In my State, for a  60-year-old couple not yet eligible for Medicare, earning $85,000 a  year, they will see their premiums increase by $23,281 a year. A family  of four earning $133,000 a year would…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Adrian  Jenkins, Jr., his late daughter Sharon Jenkins Hicks, grandchildren and  great-grandchildren, who will carry his laughter, his stories, and his  legacy forward.\n\nFor over 60 years Mr. Jenkins served Mount Zion Baptist Church as a  deacon, offering his time, prayer, wisdom and treasure. As a proud  member of Alpha Phi Alpha Fraternity, Inc. for 70…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…not  want to be held accountable by their own shareholders for material ESG  risks.\n\nIt all comes down to time horizons, as Mr. Casten said. When I was  State treasurer, I had 60,000 people who were relying on me for their  retirement. I had people who were 90- or 100-year-old retirees, and I  had first-year teachers who were 23 years old. I owed just…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…Congressional Budget Office warns that this bill would cause at  least 13.7 million people to lose coverage.\n\nMr. Speaker, 42 percent of my constituents depend on Medicaid, and 60  percent of children in the district depend on Medicaid. Republicans are  choosing to strip healthcare from those who need it most to provide tax  cuts to billionaires.\n\nMr.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691437/trumps-one-big-ugly-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Jeffries bill.\n\nMr. PALLONE. Mr. Speaker, before I yield time, I will make sure that  the gentlewoman from Iowa knows that without the ACA tax credit  extension, a middle-class 60-year-old couple in her district is seeing  their premium go up by $1,422 per month.\n\nClark), the Democratic whip.\n\nMr. PALLONE. Mr. Speaker, before I yield time, I will make…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698391/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…do want prices to go down. We don't want it to be $5 a gallon.\n\nI was putting gas in a rental car in California, and I looked over at  the guy next to me. I paid probably $2.60 a gallon in Kentucky, and I  think it was $4.80 there. I said: Do you guys have any idea what the  rest of America is paying for gasoline?\n\nWe are here to address it, and we…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…away on February  16, 2025, and is survived by his loving wife, Vickie, son, Thomas,  daughter, Rachel, and his five grandchildren. Bobby was a loyal friend  of mine for almost 60 years who dedicated his life to advocating for  Florida's agriculture industry. Born on April 6, 1942, in Samson,  Alabama, Bobby later moved to Florida, where we shared an alma…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…critical minerals list  in Alaska. We have base metals, precious metals, and of course we have  rare earths in abundance. We have incredible timber resources, and we  produce about 60 percent of America's seafood. Alaska is a crucial  State, and I am proud to be a member of our House's Western Caucus.\n\nI am the only Member from the State of Alaska. We have…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689194/work-highlights-of-western-caucus"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Spanish, they  ensure no one is left out of critical recovery conversations--like when  a displaced family in a shelter needed urgent help. A FaceTime call  quickly turned into a 60-mile drive to provide in-person support, gifts  for the children, and hours of comfort and reassurance. Their actions  transformed a moment of isolation into one of connection…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…retiring after 30 years of professional service.\n\nTony also gave back to his community as a volunteer firefighter with  the Haverstraw Fire Department Relief Hose Company No. 3 for 60 years,  serving as fire chief.\n\nTony was an avid gardener and fisherman, built his own boat, and ran  Rainbow Gardens, known locally for its tomatoes.\n\nA devoted husband, father,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…reestablishing America's strength in the world. He is stopping our tax  dollars from funding woke, perverted projects that the other side of  the aisle seeks to push.\n\nToday, 60 percent of American taxpayers are facing rising taxes and  uncertainty. To address these challenges, this resolution provides for  the extension of the Trump tax cuts, funds…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688049/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…relating to the rule,'' and the rule's       proposed effective date. CRA allows Congress to review and       disapprove rules issued by federal agencies for a period of       60 days using special procedures. If a resolution of       disapproval is enacted, then the new rule has no force or       effect.\n\nCRA adopts the definition of ``rule'' under the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…fighters.\n\nThey received numerous accolades for their service, including 3  Distinguished Unit Citations, 96 Distinguished Flying Crosses, 14  Bronze Stars, 744 Air Medals, at least 60 Purple Hearts, and one Silver  Star.\n\nColonel Davis went on to become the first African-American brigadier  general in the United States Air Force.\n\nIt is totally appropriate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696983/tuskegee-airmen-moment-of-silence"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…have reduced total emissions by 20 percent-- double the output--double the output and a 20-percent reduction in  emissions. We have been able to increase crude oil production by 60  percent over the same time period.\n\nWhen I was Governor of North Dakota in 2000, our State was producing  less than 100,000 barrels a day. We took that up to 1.5 million barrels…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Democrats are using this strategy even on noncontroversial  nominees. Almost a quarter of the nominees whose confirmation process  Democrats have dragged out actually got more than 60 votes here on the  Senate floor.\n\nThe American people gave President Trump a mandate, and he deserves  to have his team in place to execute that mandate for the American  people.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "James Risch", "party": "Republican", "sentence": "…our own backyard to go after threats to the American people.\n\nThese strikes have been discrete; they have been intermittent, with  little risk, if any, to U.S. servicemen. No 60-day clock has been  triggered, as many Democrats have tried to argue today.\n\nI wish my colleagues would join me here today in congratulating the  President for what he has done…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Act.\n\nMr. Chair, I will talk about Texas for just a minute. The Texas Gulf  Coast boasts 23 commercial seaports, 7 of America's largest petroleum  refineries, 3 LNG plants, and 60 percent of the Nation's strategic  petroleum reserve.\n\nAs the energy capital of the world, we understand the critical  importance of this very important, very good bill. Our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, first of all, I will assure the Chair that  I will not be speaking for 60 minutes. I will be kind of amazed if I  get to 25.\n\nWe now go on a work period back in the district for a little over a  week. I think there are certain topics that haven't been…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "Mr. CRAPO.  65, H.J.  Res. 60.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690732/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Lumbee Tribe of North Carolina the full Federal recognition they have  been unfairly denied for decades.\n\nThroughout recorded history, the Lumbee Tribe, comprised of nearly  60,000 members, has called southeastern North Carolina home. Despite  their long history and cohesive culture, the Lumbee have never had  access to the same Federal benefits enjoyed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]