[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…serving on boards, making investment decisions, and  building wealth that lasts.\n\nThat is why I fought to pass the Minority Business Resiliency Act,  now law, and secured $600 billion for community development, financial  institutions, and minority depository institutions during the pandemic.  That is why I continue to support the Minority Business Development…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…disabled loved ones.\n\nAcross the country, there are over 53 million Americans who currently  provide uncompensated care for their families, which provides an  estimated $600 billion in uncompensated care each year. Let that sink  in.\n\nBy protecting the health of caregivers, respite care decreases the  need for professional long-term care and allows…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Republican budget would cut $715 billion from Medicaid. They are  going to freeze this thing called a provider tax, which means that the  Federal Government is going to give $600 billion less to hospitals  across this country.\n\nThat is going to mean, according to the independent Congressional  Budget Office, that almost 8.6 million people will lose their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…conceivable number  that the Republicans are talking about cutting out of the Medicaid  program.\n\nThat number is almost $100 billion a year, $100 billion out of  roughly $600 billion in spending. Mind you, that is not trimming. That  is taking a wheel off the car.\n\nHere is what is going to happen. As I said, Medicaid covers 80  million Americans with…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…majority could cut literally every  program under the Committee on Energy and Commerce except for Medicare  and Medicaid and only get to $200 billion. Where does the other $600  billion-plus come from?\n\nIt can only come from kicking people off of their health insurance so  that Elon Musk and the billionaires can get another tax cut that they  don't need.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…give them more  money.\n\nWhat happens when we raise that debt ceiling, Mr. Speaker, and we  have to come to market--Treasury has to come to market--with $500  billion to $600 billion functionally to catch up and refund all  the accounts we have been borrowing from? That is what is done in  extraordinary measures. We grab every account and use that cash,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthcare spending is people who are  not taking their drugs for hypertension and are not taking their  statin. Mr. Speaker, 16 percent of U.S. healthcare spending is over  $600 billion a year.\n\nThere are solutions. We can make a difference. Embrace the  technology. Change the cost. Have a healthier society. It is the most  powerful thing we can do for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Well, we all know what happened. For decades, they lied about that.  The last report USTR did on China's theft of intellectual property  rights from the United States was $600 billion a year. Madam Wu Yi lied  to President Bush in the Oval Office, no doubt about that.\n\nI was also part of Secretary Rice's senior leadership at the State  Department, taking…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are  going to save it?\n\nThe first year, my math, actually the Joint Economic economists'  math, the first year--so if the trust fund is gone in 2033, in 2034 it  is over $600 billion just to make up that shortfall. That makes what we  are talking about here in the budget resolution tiny. Those are only  like $200 billion a year. We are talking $600 billion…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…say a month or two from  now, Treasury is going to need to pay back those dollars plus the  interest. They are going to come to market with $400 billion, $500  billion, $600 billion of borrowing. Just be prepared for what is really  going on in the interest rate markets, the debt markets, and will we be  beyond some of the discussions of trade where…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…should expand the benefit. Great. Tell me how to finance it.\n\nIf the first year where the Social Security trust fund is completely  empty--our rough math is it is over a $600 billion a year shortfall. I  think that is the entire corporate income tax.\n\nThere is this lack of understanding of the scale. We are in trouble.  What is wrong with this place?…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…spending money, balance the budget tomorrow. I can do it, except you  would have to get rid of every bit of government, every bit of defense,  and then you tell me about the $600 billion you want me to remove from  Medicare, Social Security, military pensions. What do you want to do?\n\nThat is the reality. Just interest this year will be 3 percent, maybe…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "John Thune", "party": "Republican", "sentence": "…before the pandemic.\n\nBut many of the law's provisions are expiring at the end of this  year, and if we don't extend the Tax Cuts and Jobs Act, small  businesses will face a $600 billion tax hike in 2026. Republicans do  not intend to let that happen, but we don't just want to extend the  TCJA's provisions. We want to give small businesses certainty by making…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trust fund, which is gone in 8 years. Then, all of a sudden, we have to  figure out--what is it, the first full year of Social Security trust  fund being empty is $600 billion or $609 billion, something of that  nature. It depends on workforce participation at the time that is done.  That makes the dollars we were talking about today tiny.\n\nWell, we have…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker, in 7 years, the Social Security trust fund is empty.  Meaning, in 2033, if you are going to cover Medicare and Social  Security, you are approaching almost $600 billion. How many of us get  behind these microphones and actually talk about things that are truly  terrifying?\n\nAre we really going to avoid dealing with our actual jobs? Are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…poverty. That is how  immoral this place is.\n\nRemember, our math from last year is the first full year with the  Social Security trust fund gone. Just the shortfall is over $600  billion. The scale of what we are talking about is brutal.\n\nMr. Speaker, you intend to be here for another decade, so you are  going to get to deal with it. Every day we wait, that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…math.\n\nThen we have the brain trusts who say we will just borrow the money  each year. Did they hear the math? In 2033, the year the trust funds  are empty, it is well over $600 billion. You are going to borrow  basically half. That is 40 percent equal to what is the--well, actually  almost 60 percent equal to today's defense budget. We will just throw…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}]