[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…they don't need. This legislation is the most  regressive giveaway and wealth transfer that Congress has ever  considered. The top 20 percent of income earners will get at least 68  percent of the tax benefits and everyone else will see their costs  increase. The poorest Americans will be paying for tax breaks for the  richest.\n\nI'm a policymaker, mom,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Republicans are fighting for billionaires like Donald  Trump and the top 0.1 percent who will get an average tax cut of  $309,000 per year, while those earning less than $50,000 get 68 cents a  day.\n\nTo my Republican colleagues, there is still time to join Democrats in  preventing this despicable bill from becoming law.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693164/one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…people in  Connecticut rely on Medicaid for their health insurance coverage; 30  percent of them are children.\n\nIn fact, in Connecticut, Medicaid covers 41 percent of births and 68  percent of people living in nursing homes. The majority of people in  nursing homes, in other words, depend on Medicaid, and they could well  be thrown out of those nursing…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to draw attention to the 68,000  manufacturing jobs lost across our country in 2025 as a direct result  of President Trump's reckless tariffs and DOGE cuts.\n\nWhy did he visit Detroit yesterday when his…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699062/manufacturing-jobs-lost-due-to-trump-tariffs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washington, D.C.  Admission Act, grants D.C. residents full local self-government and  voting representation in Congress. H.R. 51 reduces the size of the  Federal District from 68 square miles to 2 square miles, consisting of  the White House, the Capitol, the Supreme Court, The National Mall and  remaining under the control of Congress.\n\nThe new State…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washington, D.C. Admission Act, grants D.C. residents full local self- government and voting representation in Congress. H.R. 51 reduces the  size of the Federal district from 68 square miles to 2 square miles,  consisting of the White House, Capitol, the Supreme Court, and The  National Mall and remaining under the control of Congress. The new  State…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…bus to go to the Social  Security office that now has shorter hours and longer  lines because they are trying to get a claim that they have earned. Who  tells a 75-year-old, a 68-year-old, an 80-year-old grandparent to go  suck it--basically, figure out how you are going to survive. We are  going to cut all of this from you, but I still want to visit…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…fact. Yet, here is the real fact and the scam  that is being presented to the American people with this legislation:  If you made under $50,000 last year, you are going to get 68 cents a  day in terms of your tax relief. The Senate was too generous. They were  at 73 cents, so the House Republicans wanted to go back to 68 cents.\n\nHere is the real kicker:…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…resolution is written is to comply with the War Powers  Act. The resolution would simply prevent further escalation. If you are  watching at home, read it yourself, H. Con. Res. 68. The reason we  think we need to do that is because the administration already did not  get permission before escalating the first time.\n\nBy the chairman's logic, the only time…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Members of Congress--6, 5  Latinos, 4 Asians, a total of 15 persons of color that we could  identify as such.\n\nAs of January 3, 2025, in this Congress, the 119th Congress, we have  68 Black persons, from 6 to 68; Latinos, from 5 in 1965 to 58; Asians,  from 4 in 1965 to 24--a total of 150.\n\nMr. Speaker, I submit that a good many of these 150 are currently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…serve as a lifeline for seniors and people with disabilities,  giving the in-person assistance to ensure they receive their correct  benefits. In my Congressional District alone, 68,550 retired workers,  12,772 disabled workers, and 5,239 widowers or parents receive critical  Social Security benefits. An additional 25,000 receive Supplemental  Security Income…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…must be  cosponsored by all of the impacted Members.\n\nUnfortunately, the bill has not satisfied the committee's requirement  for consideration. In fact, only one-quarter of the 68 designated  communities meet the Committee's requirements, and we have heard from  at least one affected Member who is, unfortunately, opposed.\n\nTherefore, until the majority…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693901/single-unique-zip-codes-for-certain-communities"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…ACC II States would require 35 percent of new  car sales to be a mix of electric or plug-in hybrid, yet the national  average is at about 10 percent. That requirement jumps to 68 percent by  2030 and 100 percent by 2035 for the ZEV mandate States. For most  States, this is simply not realistic today.\n\nWe need all the stakeholders at the table--labor,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…population of people collecting Social  Security benefits and a reduced staff.\n\nTo put this in perspective, in 2010, not that long ago, the size of  the Social Security workforce was 68,000, 18,000 more than what the  Trump administration is targeting for today, and the number of  beneficiaries in 2010 was 54 million Americans as opposed to 73 million  Americans…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…cost. We  don't have a new, comprehensive analysis. The preanalysis, the  projection, was that the average cost would go up not 5 percent or 10  percent or 15 percent but about 68 percent. That is because the premium  goes up, the tax credits come down, and costs become massively more  expensive--now maybe a lot more because the average across the country…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…this.\n\nThe enhanced premium tax credits don't lower the cost of healthcare,  but they are a bandaid on a broken bone.\n\nBy the way, we can prove this.\n\nIn 2014, taxpayers covered 68 percent of an ObamaCare exchange  enrollee's premiums. By 2020, 60 percent had become 80 percent, meaning  that is how much the taxpayer was subsidizing. From 2021 to 2025--the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, pursuant to the order of the House of January  21, 2026, I call up the concurrent resolution (H. Con. Res. 68) to  direct the removal of United States Armed Forces from Venezuela that  have not been authorized by Congress, and ask for its immediate  consideration in the House.\n\nThe Clerk…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the Banking Committee, in leading a policy-driven effort to  put America's financial leadership first. S. 1582, as written by Bill  Hagerty, does exactly that.\n\nMr. Speaker, 68 Senators voted for this bill in the United States  Senate. A cloture-proof margin is only 60, but here 68 Senators came  together, including 18 Democrats. They vigorously debated…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…exchange, was ignoring fraud.\n\nGAO also analyzed enrollment data in 2023 and 2024 for data       anomalies. It found more than 29,000 Social Security numbers       in 2023 and nearly 68,000 in 2024 that were used to receive       more than one year's worth of insurance coverage with       subsidies in a single year--meaning the same Social Security       number…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Muslim Brotherhood, which was founded 100  years ago to promote a return to core Islamic values.\n\nThey said that the FMF controlled 139 places of worship in France and  a further 68 affiliated--in all, around 7 percent of the total. The  organization ran some 280 associations.\n\nMr. Speaker, 7 out of 10 French voters would back a ban on the  Islamic veil…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…-0.056             -5.494             -19.149 Revised Allocation:--------     Budget Authority..................................              1.163             33.805              68.792     Outlays...........................................             14.055             67.631     110.305-------- Environment and Public Works:--------     Budget Authority..................................…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694525/budgetary-revisions"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…TRANSPORTING HAZARDOUS MATERIALS.\n\n(a) Definitions.--In this section:\n\n(1) Cylinder.--The term ``cylinder'' means any cylinder       specified under any of sections 178.36 through 178.68 of       title 49, Code of Federal Regulations (or successor       regulations).\n\n(2) Foreign manufacturer of cylinders; fmoc.--The term       ``foreign manufacturer of cylinders''…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…for an independent  audit of the State's spending following several fraud scandals. In one  case, scammers in Brooklyn used two adult daycare facilities to steal-- get this--$68 million in taxpayer money from the State's Medicaid home  care program. A State comptroller's office also revealed that the State  provided more than $500 million in Medicaid…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE.  68, S. 260.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691281/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST.  Con. Res. 68 in the House if called up by the  chair of the Committee on Foreign Affairs or his designee; that the  concurrent resolution be considered as read; and that the previous  question…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699281/making-in-order-at-any-time-consideration-of-h-con-res-to-direct-the-removal-of-united-states-armed-forces-from-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I am proud to stand before  Chairman Hill and support the GENIUS Act. It actually garnered 68  bipartisan votes in the Senate. I appreciate those Senators. They  demonstrated an awareness of the needs of a modern financial sector  here in the United States. I congratulate…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693845/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Instead, they understand intuitively that  strong alliances make America more secure--more secure.\n\nThe Reagan National Defense Survey, conducted late last year, found  that 68 percent of Americans hold a favorable view of the transatlantic  alliance--68 percent--and 76 percent support article 5 and a U.S.  military response in the event of an attack…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…over and say this is about  rooting out fraud. No, it is not. It is about giving permanent tax cuts  to the oligarchs. In fact, the top 20 percent of income earners will  get 68 percent of the benefits in their bill.\n\nMake no mistake that people will die as a result of these cuts.  Families will suffer. Many will go broke thanks to medical bills, while…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for  example, that came together last year to defeat our political  establishment and pass Proposition 36 to make crime illegal again in  California by an overwhelming margin, 68 percent of the vote, in that  election.\n\nSo I do believe that there is a coalition of people who care about  California, who want to reform our State, and who want to restore…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…productivity. The incentives within the tax code, regulatory  code to invest in things so you can raise wages.\n\nRemember after 2017, one of the datasets we had, I think it was 68  percent of all the corporate tax cuts that enraged the left went to  workers' wages.\n\nIt turns out that the way you make our brothers and sisters whole  from the years of inflation…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]