[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…requirements like passports and birth  certificates.\n\nBy the way, 21 million Americans cannot readily access these  documents. We shouldn't be risking the disenfranchisement of 69 million  American women who have changed their names from what is printed on  their birth certificates, most of whom made that change when they got  married, and we don't need…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…severely restrict online voter registration and  mail-in registration and eliminate voter registration drives  altogether. It would make it harder or even impossible for up to 69  million married American women who have changed their names, because  their last name doesn't match the one on their birth certificate.\n\nMeanwhile, half of Americans don't even…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…the issues  that matter, like lowering grocery costs and helping families get  ahead, they are prioritizing a bill that disenfranchises millions of  American women.\n\nRoughly 69 million women, about 25 percent of eligible voters in our  country, have IDs that do not match their birth certificates, usually  because they changed their name once they got…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…our Nation.\n\nThis bill would also disenfranchise millions of women and other  Americans through a federal takeover of state election administration.  One out of four Americans--69 million women--would have to navigate  barriers that should not be necessary to vote because they changed  their last name after marriage. Republicans claim that this new version…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…available at all-- perhaps they were lost, destroyed, or stolen--and these Americans could  be prevented from voting.\n\nWomen who change their names after getting married, and that is 69  million Americans, will not be able to use a birth certificate alone to  establish their citizenship, and they might not be able to vote.\n\nAmericans could use a passport to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…legal representation for unaccompanied children in  immigration proceedings.\n\nNo. 68, cut funding to fight the opioid epidemic in our country. It  is still an epidemic.\n\nNo. 69, threatened to block a media merger if CBS didn't change its  reporting.\n\nNo. 70, gave DOGE access to sensitive Small Business Administration  data.\n\nNo. 71, Signalgate.\n\nNo.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…documents.  Those requirements constitute a poll tax.\n\nThe reality is that one-half of Americans, more than 140 million  citizens, don't have a valid passport, and as many as 69 million women  who have taken their spouse's name do not have a birth certificate  matching their legal name. Because this legislation has a requirement  to show documents, this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…documents, as we have heard, a birth certificate or a passport, are not  always easy to come by for certain Americans.\n\nThis backward legislation would immediately disenfranchise the 69  million women who have changed their names after marriage or divorce  and do not have a matching birth certificate. There is no cure in this  bill.\n\nMillions of Americans would…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690015/safeguard-american-voter-eligibility-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…they get divorced, blah, blah, blah.\n\nHere is whom it will hurt: the more than 140 million Americans who  don't have a passport, including Republicans, by the way.\n\nAs many as 69 million women who follow the traditional practice of  changing their name after marriage do not have a birth certificate that  matches their legal name. Republicans know this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700013/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…enforcement the  accurate, comprehensive data they need to combat gang violence and to  keep our communities safe.\n\nFrom 2021 to 2024, law enforcement agencies reported more than 69,000  incidents of gang activity nationwide. Over half involved violent  crime. Yet, today, Federal gang data remains fragmented, inconsistent,  and incomplete.\n\nThat gap puts…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698650/reporting-gang-activity"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…address certain  issues related to economic development and public safety regulations  and mail delivery.\n\nFor example, Eastvale is a town in southern California that is home  to 69,000 residents. It currently shares two ZIP Codes with neighboring  jurisdictions.\n\nWithout a unique ZIP Code, Eastvale residents have reported mail  delivery issues for delivery…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…American citizens who don't have access to  your birth or citizenship certificate, Republicans wants to make it  harder--not easier, harder--for you to vote.\n\nIf you are one of the 69 million Americans who changed your name  after you got married and your certificates don't  match your current name or if you have currently moved recently and  changed addresses,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…also steered more than $63 million to an allied super       PAC, the Senate Leadership Fund.\n\nHouse Republicans' dark money group, the American Action       Network, poured $69 million into the 2024 elections. The main       dark money group affiliated with House Democrats, House       Majority Forward, gave about $61 million to influence       congressional…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…elections and would even risk being  deported.\n\nIn reality, this legislation would purge thousands of eligible voters  from the rolls. It would create significant barriers for the 69 million  women who currently are married and changed their last names so that  their birth certificates do not match their marriage certificates.  Thus, it would be harder for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…District.\n\nToday, I am standing here for the 197,569 people, including 94,806  children and 22,000 seniors, whose Medicaid is at risk of being taken  from them.\n\nI stand here for the 69,000 people in Illinois-03 who count on SNAP  benefits and could be losing them.\n\nI stand here for the 28,000 people who receive coverage under the  Affordable Care Act and may…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I rise today to congratulate the Olympus High  School Titans on winning the 5A Boys Basketball State Championship.\n\nWith a commanding 69 to 40 win over Highland High, the Titans capped  off a season defined by discipline, grit, and teamwork. This  championship reflects the hours of practice, the leadership of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690115/recognizing-the-olympus-high-school-titans"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…average of 482,000 bpd.       Since the Trans Alaska Pipeline Systems (TAPS) was created,       ANS has produced over 18.5 billion barrels of oil. In 2022,       this support 69,250 jobs in Alaska, or 16% of employment in       Alaska and accounting for $5.9 billion in wages, or 17% of       wages in Alaska. Alaska's oil and gas industry contributed…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "James Risch", "party": "Republican", "sentence": "…logistics and program support. The estimated total cost of       the new items is $3.131 billion. The estimated MDE value will       increase by $2.853 billion to a revised $3.69 billion. The       estimated non-MDE value will increase by $0.278 billion to a       revised $0.33 billion. The estimated total case value will       increase by $3.131 billion…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…assured Americans at the  Pennsylvania Ratifying Convention that the proposed Constitution would  not allow one man or even one body of men to initiate hostilities.\n\nIn Federalist 69, Alexander Hamilton stated the Constitution gave the  Presidency fewer war powers than those of the British Monarch and that  the American President would be restricted to conducting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Outlays...........................................           -153.929           -200.948            -283.022 Revised Allocation:--------     Budget Authority..................................            -95.953             69.920             232.529     Outlays...........................................            -80.780             73.714     230.787-------- Homeland Security and Governmental Affairs:--------…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694525/budgetary-revisions"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Bill Act  delivers all three.\n\nThe One Big Beautiful Bill Act makes permanent the section 199A  passthrough deduction, giving small businesses a 20 percent tax break.  For the 69,000 eligible firms in Utah, this means long-term stability  and provides them with a foundation to thrive.\n\nThe One Big Beautiful Bill Act also protects about 72,000 full-time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Oklahoma City, $5.5 million;\n\nPhiladelphia, $33 million;\n\nPortland, Oregon, $16 million;\n\nSalt Lake City, $5.3 million;\n\nSan Francisco, $120 million;\n\nSeattle, Washington, $69 million;\n\nWashington, D.C., $15 million--we know about the crime that has  happened in this city; and of course, in the ranking member's home  State of Maryland, Baltimore cut…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…our housing laws to bring our housing market into the 21st  century.\n\nAccording to the National Association of Realtors, the median annual  existing home price in 2024 was up 69 percent relative to 1995, and  that figure is adjusted for inflation. The realtors also have data  showing that the median age of a first-time home buyer is 40 years old.  This…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Schmitt). On this vote, the yeas are 69,  the nays are 27. The motion is agreed to.\n\nThe motion was agreed to.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698281/cloture-motion"}, {"senator": "John Thune", "party": "Republican", "sentence": "…increase--although way too high,  I would argue--over that same 10-year or 11-year period, is 68 percent.\n\nSo the Consumer Price Index is 39 percent. The large group employer  market went up 69 percent. So what do you think the premium cost  increase was in the individual marketplace in the ObamaCare exchange?  It went up 129 percent, and that is since 2014. If you…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Basketball team that recently earned the  gold medal while competing at the 2025 Deaflympics in Tokyo.\n\nThe team bested every other competing country, culminating in an  electrifying 69-59 victory over Ukraine in the finals.\n\nI give special recognition to one of my constituents, Patrick Danen  of De Pere, who was a key member of this team and brought the gold…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698133/congratulating-usa-mens-deaf-basketball-team"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Enhancement or Upgrade of Sensitivity of Technology           or Capability (Sec. 36(b)(5)(C), AECA)\n\n(i) Purchaser: Government of Israel.\n\n(ii) Sec. 36(b)(1), AECA Transmittal No.: 12-69; Date:       December 14, 2012; Implementing Agency: Air Force.\n\nFunding Source: Foreign Military Financing.\n\n(iii) Description: On December 14, 2012, Congress was       notified…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Nuremberg trials.\n\nShortly after returning home to Kansas following the war's end, Jim  would marry his wife Marilyn, with whom he would raise their three  children and enjoy 69 years of marriage.\n\nFollowing the passage of the GI Bill, Jim attended Kansas State  University, where he graduated with a bachelor's degree in business  administration. Jim…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…including four Navy Achievement Medals  and two Navy Commendation Medals. His duty stations include USS  O'Bannon (DD-987), USS Lexington (CVT-16), USS Dwight D. Eisenhower  (CVN-69), and various Shore Commands.\n\nHis final duty station was Naval Air Station Jacksonville, Detachment  Astor, located in the Ocala National Forest. He served as an operations…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Pierce of Helena, who went home  to be with the Lord in the early morning hours of May 24th.\n\nPeter was the very best of us--a devoted husband to his beloved Grace  for nearly 69 years, a U.S. Army veteran, a hardworking father,  grandfather, and public servant, and a man whose quiet faith was lived  out in every act of service.\n\nFrom the shipyards of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691931/special-recognition-of-the-life-of-ae-peter-pierce"}]