[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…percent), and Obama       (41 percent).\n\nSoon, Trump administration officials were feeling besieged.       Not a single week went by in which press coverage wasn't at       least 70 percent negative. And amid swirling rumors about the       Trump campaign's ties to Russia, a high profile special       counsel, Robert Mueller, was appointed to oversee…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…a license or authorization to access the U.S. satellite  market. This is especially relevant given that the combined satellite  fleets of China and Russia have grown by about 70 percent in the last  few years.\n\nBy applying the Secure and Trusted framework to the satellite  industry, we will take another crucial step toward protecting the  public from…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690258/secure-space-act-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…supportive parents to local businesses and volunteers who  maintain the fields and sponsor teams, everyone plays a role.\n\nCongratulations to the Burbank National Little League on 70  incredible seasons and over 80 league local and national championships.  Here is to many more.\n\nLet's play ball.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689732/congratulating-burbank-national-little-league"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…colleagues 10 days to work with us all  to do the right thing. Unless the right thing is done, we should not  fund the Department of Homeland Security\n\nThis measure also funds 70 percent of our Federal Government, rather  than shut it down again. I will focus on just a few areas where this is  critical. Let's start with defense, half of our total budget.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to Donald Trump instead of the voters  who elected us who expect us to be focused on them.\n\nAnother reason that Republicans are wasting time on this bill--which,  by the way, 70 percent of the American people oppose--is because they  want to distract us from what else they are trying to do. They are  working on a bill right now that would give trillions…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690931/gulf-of-america-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Bubble wrap doesn't help you, Mr. Speaker, when you get sick.  Bubble wrap doesn't help you, Mr. Speaker, if  you end up going into premature labor and have to pay an average of  $70,000 a day for a NICU stay.\n\nRather than addressing this premium cliff, House Republicans have put  forth a reckless plan that will put millions more Americans' healthcare  coverage…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…the United States Congress to enhance  Social Security benefits for all Americans.\n\nThere are 10,000 baby boomers who become eligible for Social Security  every day. More than 70 million people receive Social Security, and now  Mr. Musk and Mr. Trump are out to cut those benefits?\n\nAsk your constituents where those cuts are going to come from, Mr.  Speaker.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Gaza and to flatten and  permanently occupy the land. This was always their plan. He said it  himself.\n\nIsraeli forces have killed more than 52,000 Palestinians, and nearly  70 percent of them were women and children, babies who did not live to  see their first birthday. There are thousands more who were  dismembered, unrecognizable, burned alive, buried…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…by Republicans in their rush to provide more tax benefits for their  billionaire buddies. They forget the struggles of so many working  Americans.\n\nRepublicans have made over 70 attempts to destroy the Affordable Care  Act, which they all opposed. They peddled junk insurance policies that  would deny essential consumer protection benefits under the Affordable…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698310/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…support this effort. I will be joining the Senator this evening in  supporting this effort.\n\nMr. DURBIN.  Slotkin) are necessarily absent.\n\nThe result was announced--yeas 27, nays 70, as follows:                        [Rollcall Vote No. 454 Ex.]                                  YEAS--27       Alsobrooks      Baldwin      Blunt Rochester      Duckworth…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…antiwoman, antidemocracy, voter  suppression bill cloaked in lies about election integrity.\n\nWith this vote, House Republicans have jeopardized access to the  ballot box for nearly 70 million American women. That isn't just a  number; it is personal. It is the working mom in Sandy who can't afford  to take time off work to go get paperwork. It is the woman…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690040/voter-suppression-bill-cloaked-in-lies-about-election-integrity"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this: An estimated 200,000 to 500,000 American-made  guns are trafficked into Mexico annually. A study by the Bureau of  Alcohol, Tobacco, Firearms, and Explosives found that 70 percent of  crime guns recovered in Mexico from 2014-2018 and submitted for tracing  were from the United States.\n\nMy Stop Arming Cartels Act would prohibit future manufacture,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…going to go. The top 1 percent in income--in  the State of Connecticut from where I am from, that is people whose  income is about $1.2 million a year--they are going to get a $70,000  tax cut. For somebody who is in the lowest quintile, which is income up  to $14,000 a year, you can see on this chart they are going to get  about $130. For a middle-income…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…grants and  Federal aid to afford college. Nearly 1.5 million K-12 students depend  on title I IDEA school nutrition and other Federal supports.\n\nIn Charlotte-Mecklenburg, over 70 percent of students benefit  directly from programs administered through the Department. When the  Department is gutted, when staff are fired, grants are frozen, and  financial…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698938/protecting-education-for-children-with-disabilities"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…globally, the United States must strongly and overtly support Taiwan,  in part by pushing back on China's overt provocation toward Taiwan.\n\nAs recently as last month, China flew over 70 warplanes over the  Taiwan Strait, encroaching into Taiwanese territory and raising new  concerns about Chinese Government aggression.\n\nThe commander of the U.S. Indo-Pacific…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…same number of 18-year-olds, but the number of  people who are 65 and up has doubled.\n\nOver here, I have my 18-year-olds. Over here, I have gone from 35  million to now almost 70 million of our brothers and sisters who are 65  and up.\n\nYou have a shortage of young people in this country. Unless you deal  with that reality--but you don't want to open up…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…million across 1.7 million acres of State Responsibility  Area.\n\nAs Placer County Fire Chief, Chief Estes oversaw municipal services  across 1,000 square miles and served over 70,000 residents, protecting  $80 billion in assets.\n\nIn these capacities, he has been an outstanding force in protecting  the quality of life in our region by leading the front…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…officers  are producing historic results at our border and in our communities.\n\nIn the first 6 months of President Trump's term in office, his  administration has removed more than 70,000 convicted criminals, many  of whom are convicted of assault, sexual crimes, kidnapping, and even  homicide.\n\nYet, despite their historic work enforcing our Nation's laws,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…percent of their  value of their project over a 9-year period.\n\nThere is a time value of money. Even taking into account the time  value of money, it means the government pays for 70 percent of the cost  of a project. If we felt there was a shortage of anything else in this  society, we would never say the answer is to give a business 70 percent  of the cost…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize Junior  R. ``Skip'' Baker for an incredible 70 years of service to the Genesee  Township Volunteer Fire Department.\n\nIn 1955, Skip joined the Genesee Township Volunteer Fire Department  and has been a steady presence through…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690559/recognizing-junior-r-skip-baker"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…come  together to change lives.\n\nLisa expanded that vision even further with the creation of Victory  Park in Lincoln, Nebraska. On the VA campus, Burlington Capital  developed 70 new apartments for veterans and partnered with the VA to  deliver a new community-based outpatient clinic for Lincoln's veteran  population. Victory Park combines housing, healthcare,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Band continued to grow and  improve into 2024 after receiving a silver medal out of 12 bands in  their division. After moving to a larger division featuring bands from  50 to 70 members in 2025, the Marching Bulldogs truly stepped up; this  year's well-earned and hard-fought championship was their first in 14  years.\n\nMr. Speaker, the Big Spring Marching…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698290/congratulating-the-big-spring-high-school-marching-bulldogs"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…low-income housing tax credit.\n\nFirst of all, the low-income housing tax credit doesn't really  benefit a lot of low-income people, but in any event, the way it works,  we give 70 percent of the cost of a developer's project to him in tax  credits. That seems a strange way to solve the housing crisis in this  country for a Democrat. It is even stranger…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691140/low-income-housing-tax-credit"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…today in strong support of the bipartisan Give  Kids a Chance Act, which supports research and development of drugs for  children with cancer and other rare diseases.\n\nNearly 70 percent of rare diseases start in childhood, and most still  have no approved treatments. The Rare Pediatric Disease Priority Review  Voucher Program has been a catalyst for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…unmitigated flow of fentanyl under the Biden administration  now constitutes an emergency.\n\nLet's discuss some facts. In 2023 alone, this crisis contributed to  the deaths of 70,000 Americans--in just one year, 2023--a number that  only worsened the following year, when the amount of fentanyl that  crossed our border with Canada was actually enough to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the SAVE  America Act and its principles, that only American citizens should  vote, and that we should use voter identification when we go to vote.  Polling indicates that over 70 percent of Democrats across this  country, over 90 percent of Republicans, and well over 70 percent of  virtually every ethnicity and ethnic group in the country--Black  Americans,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…best estimate  is this fiscal year we will have borrowed $2.4 trillion, maybe $2.5  trillion. We have one model in our office that says more than $2.5  trillion. That is like $70,000, $72,000 every second of every day we  are borrowing.\n\nLet's think of a world where you are borrowing $70,000 a second, yet  the economy is actually fairly decent. What is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Potential Act ends political  interference in the permit process and unleashes America's full energy  potential.\n\nHere are the facts on LNG:\n\nIncreasing LNG exports would add over $70 billion to the U.S. economy  and create over 400,000 American jobs by 2040.\n\nAmerican LNG is more than 40 percent cleaner than Russian LNG.\n\nSince we have increased our LNG exports,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…system is currently  undergoing many reforms to improve efficiency, increase readiness, and  deliver better care. I urge my colleagues to allow for his immediate  confirmation.\n\n70, Keith  Bass, to be an Assistant Secretary of Defense; that the Senate vote on  the nomination without intervening action or debate; that the motion to  reconsider be considered…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…U.S. universities comes from just four sources,  including China and Qatar, nations that oftentimes have strategic and  ideological conflicts with U.S. interests. Despite this, 70 percent of  universities fail to comply with foreign funding reporting  requirements. Worse, universities can simply list foreign donors as  anonymous, further obscuring the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]