[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…foul,'' the damage we will have done to the relationship  between America and Canada will take years to recover from.\n\nSenator Shaheen just mentioned airplane flights are down 75 percent.  America's national anthem is booed at hockey games. We had another  person in who ships whiskey--Virginia bourbon--up to Canada. If all the  tariffs are off tomorrow, which…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…opportunity. It empowers our SNAP  recipients to lift themselves out of the cycle of poverty.\n\nUnder these Republican cuts, Maryland and our counties would take on  50 to 75 percent of the administrative costs of SNAP.\n\nThe types of expansions we made in Baltimore County and expansions  that have happened across this country will likely vanish overnight.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…continue to leave out that fact and the fact that the  overwhelming majority of those deported had no criminal records.\n\nA report from ``60 Minutes'' just last month showed that 75 percent  of those deported to CECOT had no criminal record. These were people  who in many cases had pending asylum cases or some other sort of  immigration protection. But simply…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…teeter on the edge of  collapse.\n\nMedicaid is the thin lifeline holding together that fragile system.  Cut it and people will die.\n\nAt Adventist Health Castle in Kailua, 75 percent of patients rely on  Medicaid and Medicare. They have already weathered the storm of COVID.  With new GOP-led cuts to provider fees, they may be forced to shut down  essential…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…not political. It is about  healthcare, which every single citizen, we want them to have it and  have it be affordable.\n\nPremiums are going to increase, on average, about 75 percent as the  Senator said. One in four people who have a chronic condition are going  to lose out on coverage; 3.3 million small businessowners will see  their premiums increase.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…for water restoration, watershed restoration, and more.\n\nWe have heard from the administration that firefighters were exempt  from the cuts, but here is the thing: About 75 percent of the people  who were cut had firefighting training. In fact, they may have had  different titles, but they had something called red cards, which meant  they were ready,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…have  realized--I guess they didn't understand what was happening to their  constituents when 20-some percent of farmers and ranchers are on these  kinds of policies and 75 percent of them are in red States.\n\nThe legislation that Senator Warner and Senator Wyden proposed is  simple and reasonable. We are simply saying: Let's make sure the same  tax…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…need everything. They need tourniquets. I mentioned  arms. They need to be remembered.\n\nThe Government of the United States is only about one-quarter of our  economy, but 75 percent of our economy is private. People can send  boxes. They can remember them. They can send money through Western  Union to the people of Ukraine and to help those who are living…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…incompetence of Elon  Musk and the people who are working with him.\n\nThis administration is also lying about retaining employees to help  fight fires on the ground. Around 75 percent of those who were let go  had firefighting experience, and now we are having to rehire some of  them. This is what happens when you have 21-year-old hackers named  ``Big…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…group Issue One conducted a poll on the 15th  anniversary of the Citizens United decision. Nearly 80 percent said  that unchecked spending gave rise to corruption. More than 75 percent  said that the amount of money in politics was causing them to lose  faith in democracy itself, while 77 percent said that, when we tackle  Big Money in our politics, we…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699106/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…advancements.\n\nMr. Speaker, 99 percent of all FDA-approved therapies between 2010  and 2019 were tied to NIH-funded science. Thanks to its research, heart  disease deaths dropped 75 percent over the past 40 years.\n\nIf the majority wants to have a debate about whether it is worth  curing diseases, then let's have it. I invite my colleagues to explain  to their…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690846/national-institutes-of-health"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…fact,  90 percent of all people in Connecticut who buy insurance through the  ACA marketplace receive some kind of subsidy, and their insurance  premiums will skyrocket by 75 percent if that subsidy is ended. They  need to know now, when open enrollment starts, whether those subsidies  will be there for them.\n\nAnd it will affect insurance premiums for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…world looks to to fight global health crises. This is the  beacon of American exceptionalism.\n\nOver the last 40 years, NIH has helped reduce deaths from heart  disease by 75 percent, deaths from stroke are down 75 percent, and NIH  funding has led the fight to save countless lives with groundbreaking  discoveries. NIH is the greatest credit to sustaining…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, this week we learned that 75 percent of the  men on that plane to El Salvador, the men who President Trump claimed  were the worst of the worst, were, in fact, not hardened criminals.\n\nAre we surprised that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689646/protect-due-process"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…up so many people, they literally don't have  places to put them. For the first time in our history, more than 70,000  people are in ICE detention. That is an increase of 75 percent from the  previous year. Not surprisingly, the conditions are deplorable. There  was no preplanning of how to accommodate the people that the government  was taking into…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Notwithstanding subparagraphs (A) and (B), the Federal share       of the cost for an eligible entity or multi-entity group       shall be 65 percent for an entity and 75 percent for a multi-      group entity for each fiscal year beginning with fiscal year       2028 through fiscal year 2033 if such entity or multi-entity       group entity, as the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…global leadership influence.\n\nWe also give tools and resources to our Commander in Chief to provide  for a common defense. We bend the curve on mandatory spending, which is  75 percent of the budget, 90 percent of the increase in spending, and  it is the spending that is bankrupting the United States of America.\n\nFor the next hour, the Democrats will have…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…unlawful regulatory overreach.\n\nThe implementation of the Biden administration's 2024 Coastal Plain  Oil and Gas Leasing Program Record of Decision, ROD, locked away nearly  75 percent of the Coastal Plain, also known as the 1002 Area, including  lands that are projected to have substantial resources beneath them,  from responsible oil and gas leasing--completely…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…law. It has been an honor to lead this effort, and I am humbled to have  gained cosponsors from well over a majority of the United States House  Republican Conference and 75 percent of the entire House of  Representatives.\n\nThis could not have been accomplished without dedication, teamwork,  and a true get-stuff-done attitude. Representing our constituents…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Remember,  this wealth tax is being offered on the premise that we need even more  revenue. Over the course of this Governor's tenure, California's budget  has grown by 75.7 percent.\n\nNow, you might say, well, maybe that is what other States are doing,  too. Surely, other States have increased their budget. However, they  have not increased their budget…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…includes working to get Congress to fund SRS. Kane County  is 87 percent federally owned. Garfield County is about 94 percent  federally owned, and Piute County is about 75 percent.\n\nSRS recognizes that the Federal Government has an obligation to be  part of the communities surrounded by the land it manages. Replacing  lost funding is a step toward…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697663/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…copper-nickel deposit in the entire world. It is home to one-third of  our country's copper reserves, 95 percent of our nickel reserves, 88  percent of our cobalt reserves, and 75 percent of our other platinum  group metals.\n\nPublic Land Order 7917 locked up the Duluth Complex and ended this  opportunity that we had. This PLO withdrew 225,504 acres--that is…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just a pie chart--yes, it is a pie chart--yay, we love pie  charts--for the estimates for this fiscal year. Basically, I want to  take a look at it. It is a little less than 75 percent, but it is  close. Actually, it looks like that may be. What is seen in red is  mandatory spending.\n\nWell, guess what. The blue is all I get to vote on as a Member of  Congress,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…prices for consumers, businesses, and farmers.\n\nAn analysis by the University of Southern California anticipates  retail gas prices in the State could increase by as much as 75 percent  under certain conditions. The bottom line: Fewer refineries result in  supply disruptions and higher fuel prices for Americans.\n\nThe REFINER Act seeks to produce a detailed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…standard may  come into play.\n\nTo provide some additional context, Chinese state-backed DJI  aggressively dropped its prices in 2015 and now DJI drones account for  more than 75 percent of the global drone marketplace, offering its  products in over 100 countries. While a wide range of innovative  American drone products are available, in many cases, the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…alliance than a  smart investment in preventing catastrophic war.\n\nWell, what did the American people say? How did they feel about that?\n\nIn 1989, with the Soviets on the ropes, 75 percent said that NATO  ought to be maintained beyond victory--maintained beyond victory.  Thirty years later, in 2019, an even greater majority gave the very  same response, even…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…wanted to  stay in their home community to be close to their family, to be close  to their friends.\n\nThis CMS rule will worsen this crisis. According to the Agency  itself, 75 percent of America's nursing homes will have to increase  staffing to comply with this regulation. Under the Biden  administration's rule, nursing homes now have to scramble so that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the toughest timeline of  compliance.\n\nNow, Madam Speaker, you had to pay close attention because at first I  thought my team had made an error. This rule would require a 75 percent  NOX reduction beginning with model year 2024.\n\nNow, you say: Wait, how can that be? This is 2025.\n\nWell, that is a good question, and a lot of people are asking that  question,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in-State gasoline supply.\n\nAccording to a recent study by USC Professor Michael Mische, the  effect of this is going to be an increase in gas prices in California  of up to 75 percent by April of 2026. The projections estimate a 33.6  percent increase just by April of 2025. By next year, 2026, we could  see prices rising as high as $8.43 per gallon by…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…expensive mandates  and implement backdoor fossil fuel bans.\n\nToday, in the United States, the dream of home ownership is out of  reach for far too many Americans. In fact, 75 percent of households  today cannot afford a medium-priced home.\n\nMr. Speaker, provisions of the Inflation Reduction Act to force  States to implement green energy building codes…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}]