[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…and the extraordinary abuse of power  in the hands of these agents.\n\nAnd we, of course, must see a complete overhaul of the Agency. And I  do not know how anyone can justify $75 billion extra dollars for this  Agency, making them bigger than the FBI,  when that money could still--the remaining money--go to local law  enforcement. It could go to help…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…will offer an  amendment to the rule to make in order amendment No. 47 to the Senate  amendments to H.R. 7148, which would allow for an up-or-down vote on  whether to cut the $75 billion Republicans gave ICE in their big, ugly  bill and use those funds to undo some of the big, ugly bill's  disastrous healthcare cuts.\n\nMr. Speaker, last year, Republicans…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…that is its most crucial mission because it enables  the careers to move forward in science of these young people who have  shared my fascination with science.\n\nOver the past 75 years, the NSF has stayed true to its mission to  promote the progress of science; to advance the national health,  prosperity, and welfare; and to secure the national defense.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…against  continued funding for DHS. I will not rubberstamp an agency that  enables violence, racial profiling, and terror in our neighborhoods.\n\nICE has already been handed $75 billion through the Republican's big,  ugly bill, money that was ripped away from SNAP, Medicaid, and working  families. That money is being used to militarize our cities, not…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…75th anniversary of orange county water district\n\nMr. CORREA. Mr. Speaker, I rise today to highlight the 75th  anniversary of the Municipal Water District of Orange County. For 75  years, MWDOC has been our county's water supplier.\n\nIn Orange County, they have been critical to delivering emergency  preparedness, water use efficiency, and public education.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, in my suburban Philadelphia  district, more than 75,000 people struggle with not enough food. They  struggle with hunger every single day.\n\nThat is why I voted against the cuts to SNAP, our Supplemental  Nutrition Assistance Program.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695354/fighting-nutrition-cuts"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…to care about  the rest of America.\n\nThey have destroyed so much of this country. Income inequality is at  a 60-year high. Workers' salaries are less than they have been for 75  years as a part of GDP. Somehow, this country seems to be working for  the rich and powerful; but it is not working for ordinary working-class  Americans.\n\nI say enough. It…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…incomes, somebody might say, ``Oh, well, somebody  might be able to afford $840.'' Well, not if you are a family of four  on $40,000. You are not going to afford that if you are on $75,000 of  income, and now, you are going to pay $3,368 more--or even $90,000 of  income. I got news for people: Seattle is one of the most expensive  places in the country to live,…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…They need everything. They need tourniquets. I mentioned  arms. They need to be remembered.\n\nThe Government of the United States is only about one-quarter of our  economy, but 75 percent of our economy is private. People can send  boxes. They can remember them. They can send money through Western  Union to the people of Ukraine and to help those who are…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…saw  massive demonstrations nationwide in cities big and small. In Cortez,  Colorado, a population of 9,000, 600 people showed up. In Gardiner,  Montana, a population of 800, 75 people made their voices heard. In  Daleville, Alabama, home to 5,000, 100 members of the community showed  up and spoke out.\n\nHere in Washington, D.C., as the National Guard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…about 20 cents per megawatt hour. It stayed about  the same until demand got bigger. If you get up to 50 megawatts, 60  megawatts, then it starts to spike here, and it hits $75 per megawatt  hour once it approaches 70 gigawatts of load.\n\nSo what is important here is the comparison. In 2018, these were the  prices in August for that increment of load…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…students from various science fair  networks have explored their passion for scientific research at the  world's largest pre-college science competition. Students from more  than 75 countries, regions and territories competed across 21 different  STEM disciplines. This year, Anusha competed among the top young  scientists from around the globe and was selected…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693893/recognizing-anusha-arora-for-scientific-excellence"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Armed Forces for at least 2 years       and, if discharged, received an honorable discharge; or\n\n(iii) has been employed for periods totaling at least 3       years and at least 75 percent of the time that the alien has       had a valid employment authorization, except that any period       during which the alien is not employed while having a valid…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…that we helped them to get.\n\nAnd so some of these programs--if you are just a tech guy and you  have been assigned to find things to cut and you read a line item and  you say: 75 million for what? VPNs in the mid--what is that? That is  what this is. All of these programs serve our national interests.\n\nThat said, there was nothing inevitable about this…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…Lakes and our native fish species. The total value of commercial,  recreational, and Tribal fishing in the Great Lakes is at least $5  billion. The industry supports an estimated 75,000 jobs across the  region.\n\nResearch into the Great Lakes fishery provides us with the data and  information necessary to manage fish populations, conduct habitat  maintenance,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Andre Skoinezny--Vessel Examinations. It is my  hope that my colleagues will join me in thanking the men and women of  Clearwater Coast Guard Auxiliary Flotilla 11-1 for their 75 years of  service to our community and for a job well done.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…2033.      Notwithstanding subparagraphs (A) and (B), the Federal share       of the cost for an eligible entity or multi-entity group       shall be 65 percent for an entity and 75 percent for a multi-      group entity for each fiscal year beginning with fiscal year       2028 through fiscal year 2033 if such entity or multi-entity       group entity,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the  enhanced subsidies--these are subsidies on top of subsidies--is $40  billion. Over here, the basic subsidies, the growth of the subsidies  since the pandemic, is another $75 billion. On top of the base  subsidies, they are $80 billion. This is only 7 percent of the  healthcare market.\n\nLet's take a look at that. This is so hard for people to understand.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "James Risch", "party": "Republican", "sentence": "…AN/ARN-153 Tactical Air Navigation Set (TACAN); AN/      PYQ-10(C) Simple Key Loader; M230E1 + M139 AWS Automatic Gun;       M261 Rocket Launchers; M299 missile launchers; 2.75 inch       rockets; 30mm rounds; High Explosive Warhead for airborne       2.75 rockets, inert; MK66-4 2.75 inch rocket High Explosive       warhead M151 fuze M423 motor; MK66-4…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…President's leadership in fighting waste, abuse,  fraud, and corruption. We cheered for the vision of a new Golden Age,  and Americans cheered with us.\n\nWe saw in the polls over 75 percent, nearly 80 percent, appreciated  the optimistic, yet realistic outlook for our great country. We cheered  for a child who overcame cancer, a family who suffered loss,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688654/america-is-worth-cheering-for"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 75th anniversary of St. Mary's Rotary Club, a cornerstone of  service in our community since 1950.\n\nFor 75 years, the St. Mary's Rotary Club has exemplified the Rotary  motto  of Service Above Self through countless projects supporting local  schools, awarding scholarships, and promoting…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, pursuant to House Resolution 242, I call up  the joint resolution (H.J. Res. 75) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Office of Energy Efficiency and Renewable Energy,  Department…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  birthday of Wilbert D. Payne, Jr. Mr. Payne turned 75 on July 13th.\n\nMr. Payne was born on July 13, 1950, and has devoted almost 50 years  to serving his community and country, becoming a historic figure in the  City of Opelika…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…accomplishment that reflects  their hard work, talent, and dedication.\n\nWith a squad of just 11 boys, Glenvar scored an impressive 280  points, outpacing second-place Radford High by 75 points. Of the 11  swimming events contested, the Highlanders won 5 and were runners-up in  2 others.\n\nCongratulations to team members: seniors Avery McClanahan, Alec  McIlwain,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…without hesitation.\n\nOn behalf of Pennsylvania's 1st Congressional District, I extend my  appreciation and recognition to the UASC Tryzub for their extraordinary  service of 75 years. I ask my colleagues to join me in honoring the  UASC Tryzub's 75th anniversary, which will inspire generations to come.  May their example remind us of the boundless potential…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for generations to  come.\n\nRecognizing South Tahoe Public Utility District on 75th Anniversary\n\nMr. KILEY of California. Mr. Speaker, I wish to recognize and  commemorate the 75-year anniversary of the South Tahoe Public Utility  District, a trusted steward of environmental protection and sustainable  water management in the Tahoe community.\n\nThe South…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Kill Weapon System-II       (APKWS-II) All-Up-Round (AUR) (Rotary Wing) and WGU-59A/B       APKWS-II AUR (Single Variant) are a design conversion of an       unguided Hydra 2.75-inch rocket with a laser guidance kit to       provide precision capability. As a low-cost weapon, it is       intended as an inexpensive means to destroy targets while…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…and (B)       and inserting the following:\n\n``(A) $15,415,000 for fiscal year 2025;\n\n``(B) $67,701,000 for fiscal year 2026;\n\n``(C) $70,000,000 for fiscal year 2027;\n\n``(D) $75,000,000 for fiscal year 2028; and\n\n``(E) $80,000,000 for fiscal year 2029.''; and\n\n(5) by striking paragraph (4) and inserting the following:\n\n``(4) For retired pay, including…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…(M-RFI); eighteen       (18) M299 AGM-114 Hellfire Missile Launchers; four (4)       remanufactured M299 AGM-114 Hellfire Missile Launchers;       eighteen (18) Hydra 70 (70mm) 2.75 Inch Rocket M260 Rocket       Launchers; four (4) remanufactured Hydra 70 (70mm) 2.75 Inch       Rocket M260 Rocket Launchers; nine (9) M230E1 30mm Chain Gun       M139 Area…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…and  creativity, character, and joy. They began preparation for the season  in June and competed throughout the fall in the Cavalcade of Bands--a  regional circuit of nearly 75 bands throughout Pennsylvania, New  Jersey, and Delaware.\n\nThe Marching Bulldogs were one of 16 bands in the Liberty A  Conference, continually placing near the top throughout…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698290/congratulating-the-big-spring-high-school-marching-bulldogs"}]