[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…teachers and staff have guided generations of  students and made Arvada High a cornerstone for community development  in Jefferson County.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Arvada High School on its 125th anniversary  and for its dedication to students in our community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695847/recognizing-arvada-high-school"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Restaurant and Bar--a beloved local  gathering place that stands as a quintessential example of his  commitment to revitalizing our community.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Mayor Bud Starker for his years of service and  wish him the best in all his future endeavors.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696268/recognizing-mayor-bud-starker"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, as part of the Congressional Field Hearing  on Haitian TPS Termination held in the Massachusetts 7th Congressional  District, witnesses from the community were invited to discuss the  importance of extending TPS for Haitian nationals. Therefore, I include  in the Record their…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…commitment to fairness, diverse perspectives, and mentorship has  made her not only a respected jurist, but a beloved role model in the  legal community.\n\nOn behalf of Washington's 7th Congressional District and the  countless lives she has touched, I extend my heartfelt thanks to  Justice Mary Yu. Her service has bent the arc of justice further in our  state,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…co-founding the  Adams 12 Community Action Network, dedicated to empowering students by  providing equal learning opportunities at local schools.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Representative Bird for her dedication to serving  her community. I wish Shannon and her family all the best on their next…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…legal community by serving as a guest  lecturer at law schools such as the University of Denver and helps  clients in his private practice.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Tom Downey for his awards and thank him for  his contributions to our community.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696277/recognizing-tom-downey"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…this tragedy, Evergreen has  demonstrated extraordinary resilience, uniting in support of one  another as the process of healing begins.\n\nOn behalf of the people of Colorado's 7th Congressional District, I  stand with the Evergreen community, offer my condolences to the victims  and their families, and reaffirm my commitment to ensuring every child  can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695839/recognizing-the-evergreen-high-school-shooting"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, as part of the Congressional Field Hearing  on Haitian TPS Termination held in the Massachusetts 7th Congressional  District, experts from the community were invited to discuss the  importance of extending TPS for Haitian nationals. Therefore, I include  in the Record their…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the  Global War on Terror. With the 2nd Battalion, 1st Marines, he completed  two combat deployments to Iraq during Operation Iraqi Freedom, and  later, with the 3rd Battalion, 7th Marines, he deployed twice more to  Afghanistan in support of Operation Enduring Freedom.\n\nIn one unforgettable moment of heroism, Sergeant Major Black ran  through uncleared…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…forward  to seeing what the next 50 years will bring for FRH as they continue to  provide critical housing resources for our community.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Foothills Regional Housing on their 50th  anniversary and thank them for all they do for our community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695831/recognizing-foothills-regional-housing"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, as part of the Congressional Field Hearing  on Haitian TPS Termination held in the Massachusetts 7th Congressional  District, constituents from the community were invited to discuss the  importance of extending TPS for Haitian nationals. Therefore, I include  in the Record…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…speaking with high school students and  families at a FAFSA resource fair held by my office at Bear Creek High  School in April of 2025.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Dr. Paccione for her years of service and to wish  her all the best in her future endeavors.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…of  public education through its commitment to offer concurrent enrollment,  industry-recognized credentials, and work-based learning.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate this school, staff, administration, and  board members for this accomplishment and thank them for their  commitment to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695848/recognizing-canon-city-high-school"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…well-deserved Templeton Prize, one of the  world's most prestigious awards in Religion and Science.\n\nOn behalf of the thousands of Greek Orthodox constituents who call  the Massachusetts 7th Congressional District home and the more than 300  million followers worldwide, it is an honor to host the longest serving  Archbishop of Constantinople in the Church's history…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, as part of the Congressional Field Hearing  on Haitian TPS Termination held in the Massachusetts 7th Congressional  District, members of the community were invited to discuss the  importance of extending TPS for Haitian nationals. Therefore, I include  in the Record their testimonies:…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…have fought  to keep Americans free. I would like to congratulate all the Marine  Corps members serving across America, especially those in Detachment  No. 993 in Missouri's 7th District, for their commitment to God and  country, and to serve and protect us against our enemies. They serve a  noble cause. May they ever carry the torch of liberty and…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Mexia, Texas, where he launched a second career in education. He earned  teaching and principal certifications from Tarleton State University.  Beginning in 1994, he taught 7th grade science in Mexia ISD and went on  to become principal at Mexia Intermediate and later R.Q. Sims  Intermediate School. He earned a reputation as an innovative and  passionate…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…from Siena College in 1961.  Soon after, he completed Officer Basic Training at the U.S. Army Field  Artillery School in Fort Sill, Oklahoma, and was deployed to Korea with  the 7th Infantry Division, where he helped defend the Demilitarized  Zone. After being honorably discharged as a First Lieutenant in 1963,  Jay worked for Ford Motor Company and later…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691577/recognizing-jay-post"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…memorial paying tribute to those who  defend freedom. Among the most illustrious veterans is Lt. James  Porter. After graduating from West Point in 1869, he served with the  7th Cavalry in the Reconstruction Era South under George Armstrong  Custer and distinguished himself by his courage during the mission the  eradicate the Ku Klux Klan. In 1876,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Mr. Speaker, I rise today to recognize the dedication of  the historic Mount Olive Baptist Church in Mount Olive Township, New  Jersey. On June 7th, the community will gather to celebrate the  completion of a renovation project, honoring the legacy of this  cherished place of worship. The Mount Olive Baptist Church has…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691357/mount-olive-baptist-church-dedication"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Western Indian Ocean subsided.\n\n(3) Houthi attacks against commercial vessels in the Red       Sea and Gulf of Aden since the Hamas terrorist attack against       Israel on October 7th have impacted global shipping markets.\n\n(4) There has been a surge in Somali pirate attacks,       beginning in the fall of 2023 and lasting into 2024, that has       coincided…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…emergencies. The squad has logged thousands of hours administering  emergency assistance to others exemplifying the spirit of sacrifice and  volunteerism that embody New Jersey's 7th Congressional District.\n\nI ask my colleagues today to join me in commending this exemplary  organization and congratulating them on 80 years of extraordinary  community service.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695189/recognizing-chester-first-aid-squads-80th-anniversary"}]