[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…years. That is right--10 years,  $50 million. I bet a lot of Americans would like that, but it is going  to Elon Musk. And it pays for it by threatening the healthcare of 80  million Americans, including 31 million children.\n\nThis is not what Americans signed up for when they voted. I have  heard this from constituents. I know because some of the people who--a…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…choose to support our seniors. We owe  the best care to them in their golden years.\n\nThis is the moment to show the 2 million New Jerseyans on Medicaid,  the nearly 80 million Americans on Medicaid, and every other American  across this country that we choose their well-being over the wealth and  power of those who already have plenty. Let's reject…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…amendments established  Medicare, a health insurance program for the elderly; and Medicaid, a  health insurance program for people with limited incomes.\n\nToday, nearly 80 million Americans receive healthcare through  Medicaid, which provides critical care throughout all stages of life.  It covers childbirth and nursing home care and everything in between.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…policies and, essentially, their war on cheaper, clean energy.\n\nThanks to Republicans, electricity prices are climbing more than  twice as fast as inflation, and more than 80 million Americans are  struggling to pay their utility bills. Many of these Americans are  having to make the impossible choice of either paying for housing,  medicine, and food, or keeping…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…would       force the House Energy and Commerce Committee to slash $880       billion from the Medicaid Program, an essential healthcare       program for nearly 80 million low-income Americans. Medicaid       provides coverage for one in five individuals, funds 41       percent of all national births, and is the largest payor for       long-term care…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…massive tax  breaks to their wealthy donors, to billionaires like Elon Musk, and to  huge corporations. They are willing to do that by selling out  healthcare coverage for 80 million Americans.\n\nThat is it. It is really that simple.\n\nI say to my Republican colleagues that you cannot hide from your own  party raising the alarm not to do this. You cannot hide…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…programs millions of Americans rely  on to survive, like healthcare and food assistance. Perhaps less  discussed is that it will increase your energy bills.\n\nRight now, 80 million Americans are struggling to pay their  electricity bills, and according to a recent report in The New York  Times, this bill will make it worse.\n\nThe big, ugly bill ends tax credits…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…billionaires like Elon Musk  paid for by working people, including millions of our veterans. The  Republican rip-off cuts at least $880 billion from Medicaid, the  program that 80 million Americans, including 9 million veterans, rely  on for health insurance coverage.\n\nThis extreme budget also cuts $230 billion from SNAP. Every year,  SNAP helps almost 43 million…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…who are running the show  and the agencies that have all too much influence here in the Halls of  Congress while electricity  prices are up well over 13 percent and 80 million Americans are  struggling to pay their electric bills. I say Americans deserve a whole  lot better. They deserve a whole lot better than what they are getting  from this Congress.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…so you were very right to point out the immorality of the 2017  attempt to cut the Affordable Care Act, which insured 20 million  Americans. But Medicaid covers 70 to 80 million Americans, and the new  wrinkle is that this proposal doesn't just cut healthcare for tens of  millions of Americans; estimates are that it could be 30 million  Americans that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…the Medicaid program  and by the addition of trillions of dollars to the United States debt.\n\nLet's talk for a second about Medicaid because it serves about 80  million Americans. Not all Americans have experience with it, but an  awful lot do. We are told, and the fantasy is, that the money can be  saved by identifying waste, fraud, and abuse.\n\nMake…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…for millions of Americans.\n\nSince President Trump took office, electricity prices have gone up by  13 percent nationwide and 20 percent in New Jersey, leaving over 80  million Americans struggling to pay their utility bills. Instead of  addressing the affordability crisis that they have ignored, that  President Trump has called a hoax, the Republicans'…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…climbing.\n\nRight now, thanks to the congressional Republicans' backward energy  policies, electricity prices are climbing more than twice as fast as  inflation. More than 80 million Americans are struggling to pay their  utility bills, with many having to make the impossible choice of either  paying for medicine and food or keeping their lights on. I think…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today I rise on behalf of the nearly 80  million Americans across the country who get their health insurance  through Medicaid.\n\nI rise as a physician who has cared for patients for more than 20  years, and I implore my colleagues…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688090/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in  the United States, and it is the largest source of funding for nursing  homes for seniors and people living with disabilities.\n\nThis is a lifesaving program for 80 million Americans. They count on  it every day. Yet, today, House Republicans are unnecessarily rushing  forward with a budget resolution that will impose the largest  healthcare cuts…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688050/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…single  district judge should have the power to grind the entire Nation to a  halt with one rogue ruling.\n\nWhy should a single unelected judge override the votes of 80 million  Americans? This is not how our Constitution was designed. The Founding  Fathers gave Congress the power to check the courts, and it is time we  began using it.\n\nTake Judge James…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689710/no-rogue-rulings-act-of-2025"}]