[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…cases,  for more than 2 years. Many were killed there.\n\nAccording to UNICEF, the Gaza Strip is now home to the world's  highest concentration of child amputees. More than 80 percent of  buildings in Gaza have been damaged or destroyed in the violence.\n\nThe world breathed a sigh of relief that a tenuous cease-fire was  finally reached and that all the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…fields long--without any cover. There were no trees, there  were no dunes, and the hail of gunfire and mortars kept coming.\n\nI think 90 percent died in the first wave, maybe 80 percent in the  second. They kept going--a third and a fourth wave, storming the  cliffs, taking back Europe, and saving democracy.\n\nI kept thinking, as I walked on that bleak beach,…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the larger war on clean energy that this  side of the aisle is waging that has led to hundreds of people in my  district being put off the jobsite, and a project that is 80 percent  complete is dormant right now while my constituents are desperate for  lower energy prices.\n\nDo you want to talk about national defense? This amendment would hurt  our national…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695152/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Office of Personnel Management is calculating the retiree's final  annuity and the estimated final annuity. A retiree's interim payment is  generally only 60 percent to 80 percent of the finalized net payment.  Second, this bill would allow a penalty-free withdrawal if an  individual is involuntarily separated from the federal government. In  both…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698468/introduction-of-the-thrift-savings-plan-emergency-withdrawal-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Speaker, yesterday Congressman Massie and I went to  the Department of Justice to read the unredacted Epstein files. We  spent about 2 hours there, and we learned that 70 to 80 percent of the  files are still redacted.\n\nIn fact, there were six wealthy, powerful men that the DOJ hid for no  apparent reason. When Congressman Massie and I pointed this out…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…neighborhood--strive to be wealthy. They  are doing great. The top quartile of our country the last 20 years has  made extraordinary wealth. God bless them.\n\nBut when you see that 70, 80 percent of Americans don't want Medicaid  cuts because most Americans know neighbors, family members, church  members who rely on Medicaid; they know that their grandmother in a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…cap, predatory  lenders can offer loans with triple-digit APRs that trap individuals in  cycles of debt. For instance, the Consumer Financial Protection Bureau  found that 80 percent of payday loans are rolled over or renewed within  2 weeks. This practice can subject borrowers not just to high nominal  interest rates but also to high fees that can quickly…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…nearly $1.3  billion in NIH funding that supports 12,000 jobs in our State. One of  my constituents works at an organization that is fighting autoimmune  diseases. It is 80 percent funded by NIH investments. She is worried  about the devastating impacts that these cuts would have on the  patients who rely on their work.\n\nI started my career in medical…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688502/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…whole milk increases the risk of heart disease, the leading cause of  death in this country.\n\nIn fact, the majority of Americans consume too much saturated fat.  More than 80 percent of the U.S. population exceeds the recommended  limit. This bill needlessly inserts politics into what should be a  science-based process, to the detriment of our children's…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…an       alternative, which makes them vulnerable. Section 3 of the       NGA requires that exports to NFTA must not be inconsistent       with the public interest. About 80 percent of U.S. LNG is       shipped to NFTA countries. The public interest includes       impacts to prices of natural gas and reliability. Section 3       gives DOE wide latitude…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…approximately 150 acres of Federal land in the Mount Hood National  Forest to the City of The Dalles, Oregon.\n\nThis land is vital to the City's watershed and supports roughly 80  percent of its annual water supply. Local ownership of this land will  allow the City to better manage its water resources, protect water  quality, and plan for future water infrastructure.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…the Trump administration is  trying to make it the law that Americans don't deserve clean water.\n\nAlready today, clean water protections have been defanged, leaving up  to 80 percent of our streams and 50 percent of our wetlands at risk of  pollution or destruction, but my House Republican friends have offered  this bill that further rolls back the remaining…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698038/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Affordable Care Act, you know the bill that the gentleman and a lot of  Republicans want to repeal, which mandated that greedy insurance  companies have to spend 80 percent to 85 percent of premiums on medical  care. It is called the medical loss ratio. The gentleman should look it  up. It is in the Affordable Care Act.\n\nWhen he is talking about repealing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…opportunity to fix this right now. This week, we can pass  the bill that would extend the ACA's premium tax credits for 3 years.  This extension will cut premium spikes by 80 percent, on average. It  will wipe out increases for lower income families. It will save over 5  million Americans from losing their insurance.\n\nThis is the solution. We have it…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Right now, the unemployment rate for people with intellectual,  physical, and developmental disabilities remains alarmingly high in  this country. Ashamedly, it is at 80 percent. Yes, 80 percent. This, we  know, is unacceptable.\n\nWe can close the disability employment gap, not only to advance  independence, dignity, and freedom for Americans with disabilities,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691779/thinkdifferently-about-disability-employment-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…take a look at the top earners,  they are still paying the vast majority. What happens when your top 20  percent of income-earners are paying, I think a little shy of 70, 80  percent of all Federal income taxes?\n\nInstead of an idiot standing here giving you percentages of GDP and  numbers, I thought we would do it as time. Let's use it as a calendar.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…money sent directly to  insurance companies from taxpayers.\n\nDemocrats said healthcare would be affordable, yet since the  implementation of this bad idea, premiums are up 80 percent. At the  same time, nearly 20 percent of the individual market claims are denied  by insurance companies.\n\nIn 2024, 87 percent of the revenue made by insurance companies…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…it. The numbers are absolutely staggering. Communist China  produces 60 percent of the world's rare earths and 90 percent of the  respective processing capacity, along with 80 percent of the processing  capacity for critical minerals, and the vast majority, the production,  for at least 50 more critical minerals.\n\nThe Chinese wield this authority through…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…high-quality judicial nominees on the bench to serve the  American people should be something that unites this body. In fact, in  the Biden administration, that happened. Over 80 percent of the  judicial nominees in that administration received bipartisan support on  the floor.\n\nBy contrast, this Congress, only 20 percent of the Trump nominees  have had bipartisan…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…18 percent of all the lithium in the world.  With the United States, that percentage is less than 1. As far as  refining, China is about 67 percent, some estimates up to 80 percent,  where the United States is at 2 percent.\n\nFor years now, the United States has been overly reliant on the  communists in Beijing. It is in America's best national security…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698230/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Canada, number one. Canada, in the  last year, had an additional 8,000 fentanyl-related arrests because  they finally started cracking down on it. There was an increase of 80  percent that was seized at the U.S.-Canada border because of the  actions taking place, so, yes, there were deaths going on in New York.\n\nMr. MAST. Mr. Speaker, I am going to end…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are these barriers where you have armies of lobbyists walking up  and down these hallways, and the inefficiency, that waste and fraud, is  their profit model.\n\nMr. Speaker, 80 percent of the spending growth--we are not supposed  to tell people this, but it is the math. You can't do policy unless you  are willing to tell the truth about the math. Eighty…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…that there are  many safeguards that have been put in this bill that I would encourage  them to review and that the vast majority of the funding in this bill-- more than 80 percent--is for nonimmigration and nonborder security  functions.\n\nIt includes, for example, funding for FEMA. We have just gone through  a horrific storm that has caused a lot of…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Democrats put  in place an unaffordable and fraudulent healthcare system.\n\nFor years, Democrats promised ObamaCare would lower costs. In  reality, premiums have increased nearly 80 percent since the so-called  Affordable Care Act was enacted. The average premium for family  coverage is nearly $27,000 per year.\n\nA report from the Government Accountability Office…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…semicolon at the end the       following: ``, and (II) with respect to pharmacist services       (as defined in section 1861(nnn)), the amounts paid shall be       equal to 80 percent of the lesser of (i) the actual charge       for the services or (ii) 85 percent (or 100 percent, in the       case of such services that address a public health need…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694217/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…was listed under the Endangered  Species Act as a threatened species. Almost immediately, timber  production from Federal forests in the Western United States plummeted  by 80 percent.\n\nThe economic and societal costs of timber-dependent States and their  timber-reliant counties was appalling. Demand for SNAP and Medicaid  shot up. Alcoholism and meth…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697659/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of living  as January 2021.\n\nWe have increased spending, our budget, our Federal budget, from  roughly $3.6 trillion or so in 2015 to almost $7 trillion now. That is  an 80 percent increase.\n\nDoes anybody alive think that we can sustain this? Do any of my  colleagues, Republican or Democrat, think that we can sustain this?  Does anybody alive right…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Springs. The coal-fired  power plant is approximately 300 acres in size. Across the highway is a  solar field that is approximately 1,500 acres. The coal-fired power  plant is 80 percent efficient. The solar field is approximately 20  percent efficient. The coal-fired power plant produces more than double  the energy and the electricity that the solar field…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…From  December 2016 to August 2025, 339 Aides completed the two-year  assignment. Of those, 37 percent of them continued their careers in  Congress. Additionally, nearly 80 percent of the Aides built on their  experience by finding new roles in government, transitioning  successfully to the private sector, or enrolling in college to further  their education.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…computing, and  advanced microchips. Intellectual property is also foundational for  movies, music, publishing, and much more.\n\nIntellectual property industries produce almost 80 percent of U.S.  commodity exports. Many of these industries even have trade surpluses  since the United States is the world's top intellectual property  exporter, with exports valued…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691132/world-ip-day-and-inventions-caucus"}]