[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…is racing into the future. We all know that they stole  American technology to get where they are, but now they're lapping us-- especially in batteries where they control 85 percent of the global  market.\n\nFurther, the Chinese automaker, BYD, is making electric vehicles that  cost as little as $8,000, and they are gobbling up the global market  share.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…incarcerated for 22 years, outlaw discrimination  against pregnant women in the workplace, and a Specialty License Plate  to benefit organizations that comprise the Divine Nine with 85 percent  of the proceeds from the sale of the plate benefitting the  organizations to support scholarships.\n\nCareer highlights, honors, and awards include: Having roads  designated…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Affordable Care Act, you know the bill that the gentleman and a lot of  Republicans want to repeal, which mandated that greedy insurance  companies have to spend 80 percent to 85 percent of premiums on medical  care. It is called the medical loss ratio. The gentleman should look it  up. It is in the Affordable Care Act.\n\nWhen he is talking about repealing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…shipped off to countries  many have never known.\n\nThe Trump administration would have you believe that they are  pursuing hardened criminals. Yet, according to ICE's own data, 85  percent of the people detained in Massachusetts, my home State, have no  criminal record.\n\nRogue, masked Federal agents are violating people's civil rights,  glorified bullies masquerading…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…service sites, more than  10,000 teachers in the Philadelphia region, and various food pantries  in the Lehigh Valley. However, with no justification, Musk and DOGE  laid off 85 percent of AmeriCorps' staff and unconstitutionally froze  more than $400 million.\n\nMillions of Americans are losing access to services they rely upon:  veterans receiving mental…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691309/cutting-americorps-deprives-americans"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…progress of the TAKE IT DOWN Act.\n\nThe vast majority of American people support prohibiting  nonconsensual, sexually explicit, deepfake images, with one survey  finding that 85 percent of Republicans and Democrats support this  measure. That is why I am hopeful it will pass today and be considered  favorably by the House, and that is why, last Congress,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Government. Students with disabilities in  Michigan are twice as likely to drop out of school as their peers. Only  60 percent graduate high school in 4 years, compared to 85 percent  among their other peers.\n\nRight now, we are seeing special education under direct and  deliberate attack. We have seen repeated efforts to slash education  funding, weaken…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…expensive.\n\nWhile I was there, he showed me a fuel bill he had just gotten that  said that because of the tariffs, his fuel bill was going up.\n\nBut, more important than that, 85 percent of his business comes from  exporting to Canadian customers. Most of his sales contracts in Canada  were canceled after these tariffs went into effect last month, so he…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…life-threatening blood disorders. This includes children as  young as only a few months. While we are thankful that survival rates  for many pediatric cancers have improved to over 85 percent, cancer  remains the leading cause of disease-related death among children, and  hematologic conditions continue to require complex, coordinated, and  long-term care.\n\nTo…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694928/recognizing-childhood-cancer-awareness-month"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…pay their fair share. We will not go down the path  that our Republican friends intend to go, and that is to extend the  2017 tax cut law that actually provided more than 85 percent of the  trillions of dollars of benefits of lower taxes that go to the  superwealthy and the billionaire class.\n\nWe are not going to go that direction. The superwealthy and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…that is the case, but it  isn't true.\n\nThey talk about the fact that, as costs are going up and they want  this new plan to throw $85 billion at the insurance companies, 85  percent has to be spent on healthcare. That is true.\n\nMr. Speaker, 15 percent of $500 that the insurance companies get to  put in their pockets is a whole lot less than 15 percent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…say--and there are a lot of men up in the audience  who are chuckling with me. Some people say: Well, why do you use the  feminine when you speak about this? Because women make 85 percent of  the decisions in healthcare, and we can trust her to make a decision  which is good for her family's health and which is good for her purse,  which is good for her pocketbook.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…for FEMA funding, for  our TSA agents, for our Coast Guard officers, and for our Nation's  cyber security. That is all part of this bill. In fact, I think it is  about 80, 85 percent of this bill. But first and foremost, funding the  Federal Government is Congress' most basic responsibility, and it is  also the most important. When Congress fails to do…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…can't get  the IDs. Kamala Harris said rural folks can't get IDs. It is just too  hard. That is BS. They know it is BS. The American people know it is  BS. It is exactly why 85 percent of Americans say we need to do this.\n\nLet me just say that I come from a State that is the most unique  State in the country because we have been, for years, requiring proof…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699942/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the ranking member, this is not a melodramatic term.  It is actually quite appropriate. In physics, ``dark matter'' refers to  the mysterious substance that makes up about 85 percent of the mass of  the universe, but no one really knows what it is. Similarly, all of  these guidance documents make up a great deal of the regulatory  activity in our country,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…be overstated. Montana holds nearly 30 percent of our Nation's coal  reserves. In total, coal from the Powder River Basin produced in  Montana and Wyoming makes up about 85 percent of Federal coal  production and 40 percent of overall coal production in the entire  United States.\n\nCoal is reliable and affordable, and we know we are going to need  this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…views, offering a stunning  example of the beauty that defines the State of Maine. In addition,  Cutler remains a hub of the Maine blueberry industry that produces  almost 85 percent of the world's wild blueberries.\n\nCutler's spirit and historic connection to America's freedom  continues today. Every Fourth of July, the townspeople honor the  courage,…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699424/200th-anniversary-of-the-town-of-cutler"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…thing.\n\nWhy would we give more money to the insurance companies that saddled  up with government to enrich themselves rather than help the American  people?\n\nMr. Speaker, 85 percent of all Affordable Care Act revenue insurers  received comes from the Federal taxpayers. Mr. Speaker, 85 percent of  all the revenue, I should say, that the insurers receive…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…them do it.\n\nLet Democrats go to the floor of the Senate. Let them take the floor.  Let them look at 51 Republicans sitting on the Senate floor who want to  move a bill that 85 percent of White Americans, 82 percent of Hispanic  Americans, 76 percent of Black Americans, 71 percent of Democrats, and  95 percent of Republicans believe we should pass so that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "John Thune", "party": "Republican", "sentence": "…(as defined in section 1861(nnn)), the amounts paid shall be       equal to 80 percent of the lesser of (i) the actual charge       for the services or (ii) 85 percent (or 100 percent, in the       case of such services that address a public health need       described in paragraph (2)(B) of such section) of the amount       determined under the…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694217/statements-on-introduced-bills-and-joint-resolutions"}]