[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…are a tax  on small businesses and on the middle class. Why are we putting a 10,  15, or 20 percent tariff on food that we can't even grow in the United  States?\n\nMr. Speaker, 99 percent of the coffee that we drink comes from other  countries because we can't grow it here. We are taxing ourselves 10,  15, or 20 percent to import pineapples, bananas, and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…language that is in the bill will tell you  this won't affect CBD. Every expert I have consulted has said that that  is exactly wrong; that this will, in fact, wipe out 95 to 99 percent of  the industry.\n\nMy colleague from Kentucky is exactly right. We asked our farmers to  engage in this research, and we asked them to build this industry. We  should…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…law blocked over  30,000 potential registrants in just 2 years--about 12 percent of all  voter registrations during the period. State officials acknowledged in  court that over 99 percent of affected voters were U.S. citizens.\n\nNow, even Kansas's Republican secretary of state, who championed the  bill when he was a State legislator, has warned against…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…cult. Now is their chance to  prove it.\n\nTrump is doing literally the exact opposite of what he promised to do  in his campaign. Instead of having the courage to say something, 99  percent of these guys suddenly decided they are in favor of endless  wars. The mental gymnastics that takes is nuts.\n\nMr. Speaker, if it looks like a cult, if it acts like a…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…ever turn it on, you can't avoid an  ad for a new prescription drug. They are on all the time, with great  promise, and many of them are breakthrough drugs. Did you know over 99  percent of those drugs, those new breakthrough drugs that you see on  television, were developed by America's taxpayers at the National  Institutes of Health. Sure, the drug…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Department of Defense and its many contractors from  compliance with the ESA puts our Nation's national legacy at needless  risk.\n\nTo date, as the Member from Arizona has mentioned, 99 percent of the  species listed under the ESA have been saved from disappearing forever,  making this one of the most successful pieces of legislation in  American history.\n\nActions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695233/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…whose  science usually means they show up here to testify for the fossil fuel  industry to sow doubt. But once you get beyond that tiny stable of paid  climate deniers, it is 99.9 percent. I mean, science is--that is as  close to unanimous as science gets on this, and I urge that this body  should reflect that.\n\nAnd, finally, the third, Congress should…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Kraft Heinz's grant of $170  million from the Department of Energy.\n\nThese funds were not wasteful. They would have been transformative,  reducing emissions for this plant by 99 percent.\n\nThat isn't just about energy policies. It is about protecting  community health, and it is about growing good-paying union jobs.\n\nYet this administration chose to cancel…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "Mr. MOSKOWITZ. Mr. Chair, Representative   Thomas Massie is a budget  hawk who walks around with the debt clock--which, by the way, I bought.  It is $99 on the website. Today, he talked about that if the Republican  budget passes, the budget deficit doesn't get better. It gets worse.\n\nThen Elon Musk commented, and he said: That…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688029/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Democrat voted  for it. Every Republican voted against it.\n\nDon't be confused and don't be scared by this scare tactic. If you  are a middle-class American, if you are in the 99 percent, you will not  see your taxes go up next year. There is no question about that. What  is at issue is the tax cuts for multimillionaires, billionaires, and  big corporations.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…out of unmarked vans. They tackle people. They assault  people. Frankly, other than the ICE vests or jackets they are wearing,  which, by the way, can now be purchased for $29.99 on Amazon, they look  more like gang members than Federal law enforcement agents.\n\nIf a person runs away from these masked vigilantes, they will beat  and chase that person down.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, in 99 percent of counties in the United  States, SNAP benefits don't cover the cost of a nutritious meal.\n\nThe good news is that there are exciting partnerships happening that  show…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Slotkin)  and the Senator from Vermont (Mr. Welch) are necessarily absent.\n\nThe result was announced--yeas 51, nays 45, as follows:                         [Rollcall Vote No. 99 Ex.]                                  YEAS--51       Banks      Barrasso      Blackburn      Boozman      Britt      Budd      Cassidy      Collins      Cornyn      Cotton…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688355/vote-on-mcmahon-nomination"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…super, filibuster- free highway.\n\nNow, you all may remember Robert Byrd of West Virginia. Robert Byrd  was always the fiercest defender of the filibuster. But he, along with  99 other Senators, said: We will create one exception, and that  exception will be to reduce the deficit.\n\nAnd it had these three pillars, which I will mention again. It has to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…real support to farmers.\n\nThe truth is, the listing of the bay-delta longfin under the ESA is  both scientifically and legally sound. The longfin population has  declined over 99 percent since the 1980s. Think about that. In just a  few decades, only about 1 percent of the population is left. That is  like the number of environmentalists left in the Republican…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…society as opposed to taking from  it, let alone commit violent actions against society.\n\nThe good news to report is that the number of people coming across  the border is down 99 percent. It didn't take a new law. It simply  meant enforcing the law. Those people who are enforcing the law are  actually men and women in the military, including my own son,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…drawn to the copywriting and music industry. Born into a family of  salesmen, Terry began his career in broadcast as a sales representative  for two stations in Santa Barbara--99.9 KTYD-FM and 990 KBLS-AM. As a  testament to his sales development, leadership, and organizational  skills, Terry also led the sales and marketing department at the number…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691791/recognizing-the-service-of-mr-terry-fahy-on-the-occasion-of-his-retirement"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…term in the Export Administration Regulations (15 C.F.R.       772.1).\n\nMr. Speaker, I rise today in support of Representative Kean's  Undersea Cable Control Act.\n\nOver 99 percent of the world's data that crosses the oceans travels  through the fiber-optic cables that sit on the sea floor. This bill  requires the U.S. to develop and execute a strategy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Holmes. He was a proud Missourian and a  resident of the Missouri Veterans Home, and I got a chance to meet him  this past winter.\n\nHe just left this Earth last month at the age of 99, and we want to  take the time to honor his life and legacy today.\n\nEdward was born on April 7, 1926. He joined the U.S. Navy in June of  1944,  just weeks after graduating from…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…though the UK  owns the Chagos Islands, they said: We will give it to Mauritius, and  we will pay Mauritius squillions of dollars to lease from Mauritius the  military base for 99 years.\n\nNow, I have thought about why they would do this. Real strong drugs  are the only possible explanation for the Prime Minister of the UK to  do this--to give away something…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Act of June 14,       1926 (commonly known as the ``Recreation and Public Purposes       Act'') (44 Stat. 741, chapter 578; 43 U.S.C. 869 et seq.), by       patent numbered 43-99-0012 and dated October 18, 1968, and       more particularly described as tracts D (excluding parcels       numbered 1, 2, 3, 4, and 5), G, and J, T. 1 S., R. 1 E., Salt…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…them publicly just for fun, just for revenge.  That is why we created this bill, to stop the abuse spreading like  wildfire right now on social media.\n\nIt is widely known that 99 percent of the time, the victims, most of  them girls, don't even know their faces, their bodies, their intimate  parts are being circulated around the internet in fake, compromising…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Speaker, 60 percent of the enrollees will still have access to a plan  at or below $50 a month.\n\nI represent one of the poorest congressional districts in the  country, and still, 99.7 percent of my constituents in my district, one  of the poorest congressional districts, will be unaffected by this  expiration.\n\nThis is all about subsidizing the wealthy,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…recognizes the importance of the small  businesses throughout all of our communities, and the numbers aren't  that different from State to State.\n\nIn my home State of Kansas, 99 percent of the businesses that operate  are small businesses. Whether they are small businesses on Main Street,  small mom-and-pop shops, little manufacturing operations, farming…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Ms. ERNST.  35, S. 99.", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696372/strengthening-support-for-american-manufacturing-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…multifaceted approach to immigration enforcement is working. Illegal  border crossings are down 95 percent. Daily border encounters are down  by 93 percent. Got-aways are down by 99 percent. Fentanyl flows are  down 54 percent. Mr. Speaker, there were 2,000 ICE arrests every day  recently. ICE is finally cleaning up the open-border policy of the  Biden administration.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…never should have  been here, Mr. Speaker. Over a month ago, we tried, as Republicans, to  prevent a government shutdown. We had a vote here on the House floor.  Mr. Speaker, 99 percent of Republicans voted to keep the government  open, and 99 percent of Democrats voted to shut it down.\n\nThen that bill went over to the Senate. We watched for 42 days,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…great  companies are founded and funded.\n\nIt is often said that small businesses are the engine of the American  economy, and that is an absolute truth. Small businesses make up 99  percent of U.S. employers, and they are the driving force behind the  creation of a majority of new jobs.\n\nThe entrepreneurs leading these companies are building something new,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…saying that  watching television all the time, prices are showing up all the time  for this product or that product. I don't know how many times I see  that something costs $9.99 or $19.99 or that the price of an automobile  is $26,000. But when it comes to prescription drugs, presumably there  is something very sensitive about this that they don't want…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…hard-working Americans.  This included a relentless push to regulate truckers out of business,  based on the audacious claim that its extreme emissions rules would  somehow create $99 billion in benefits for society.\n\nBut here is the reality, folks: These policies make everything more  expensive for families, they kill jobs, and they hurt our small  businesses.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}]