[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Office and is a veteran JCCIC staffer, kept  track of every detail, planning rehearsals and walkthroughs, and  executing the day. The operations team supporting JCCIC included Abby  Stahl, Randall Bethea, Elizabeth Khader, Jordan Prince, Destiny Davis,  Martha McPhee, Zachary Hassay, and Chris Brantley.\n\nAbby, a JCCIC veteran from Senator Fischer's office,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Speaker, I want to recognize the outstanding  programs provided by the village of Dobbs Ferry that benefit the senior  citizens of that community.\n\nUnder the able leadership of Abby Connett, in a new center designed  for their use, Dobbs Ferry Seniors serves hundreds of seniors annually  with a daily nutrition program at lunchtime 5 days a week and  activities…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…rise to recognize and congratulate Abigail  Ross Hopper, who is retiring from her role as president and CEO of the  Solar Energy Industries Association.\n\nFor nearly a decade, Abby has led efforts to develop, to enact, and  defend policies to support solar energy and energy storage.\n\nDuring this time, the solar industry has been massively successful.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699172/congratulating-abigail-ross-hopper"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…protect the care that women and  families depend on because healthcare isn't a privilege for the  wealthy; it is a right for everyone.\n\nI highlight a brave mom from my district, Abby Koroma, a mother of  two visually impaired daughters who depend on Medicaid. Without this  critical program, Abby would be forced to make impossible decisions:  whether she…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Subcommittee  colleagues, particularly Chairman Trent Kelly, for their outstanding  bipartisan work as well as the subcommittee staff: Phil MacNaughton,  Kyle Noyes, Kelly Goggin, and Abby Snyder.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today to recognize the outstanding  efforts made by one of my own constituents, Ms. Abby Lachman. Ms.  Lachman, who was diagnosed with Type 1 diabetes at age 6, recently  visited Washington, D.C. to advocate on behalf of herself and the  millions of Americans living…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Salem's first-ever  congressional debate title with near-perfect speaker scores. Several  other Spartans, including medalists Rebekah Steinweg, Luke Stovall,  Kody Hinnant, and Abby Jones also delivered outstanding performances.\n\nAlso competing for Salem were Charlie Bain, 12th grade, and Nesa  Garcia-Perez, 10th grade, in congressional debate, and Leah…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Wheat, a 2018  title with Coach Chuck Pound, and a shared championship in 2020.\n\nI would like to commend each of the dedicated student-athletes:  Addison Naff, Reagan Meade, Abby Kingery, Jaiden Dann, Madilyn  Winterton, Alicia Holmes, Madelyn Caron, Maggie Hoover, and Kayla  Windsor, and extended heartfelt congratulations to  Coach Renee Favaro and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…commitment to bipartisanship and his continued collaboration toward  stronger naval and projection forces.\n\nFinally, I thank Kyle Noyes, Kelly Goggin, Phil MacNaughton, and Abby  Snyder, the subcommittee staff. I also thank my personal staff, Semaj  Redd, and my fellow, Bobby Hsu.\n\nI am excited to highlight a few of the many wins for our national  defense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…Kimmitt on his confirmation as our  next Under Secretary of Commerce for International Trade. I thank him,  his wife Heather, and their four children--Kaitlyn, Kevin, Will, and  Abby--for once again answering the call to serve. I am certain that he  will make the ITA a tireless champion for the American worker.", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Post.\n\nByrne, Maria: New York Times; Cameron, Christopher: New       York Times; Capaccio, Anthony: Bloomberg News; Capdepon       Sendra, Esteban: EFE News Services; Caplan, Abby: Argus       Media; Cappelletti, Joseph: Associated Press; Capps, Kriston:       Bloomberg News; Caralle, Katelyn: DailyMail.com; Carey,       Dominic: Bloomberg News; Carey,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…WJLA-TV/NEWSCHANNEL       8; Golden, Rodrek: REUTERS RADIO & TV; Golden, Vaughn:       LASLO CONGRESSIONAL BUREAU; Goldman, Justin: NBC NEWS;       Goldrick, Michael: WRC-TV/NBC-4; Goldstein, Abby: NBC       NEWS; Golubchyk, Kostiantyn: WUSA-TV; Gomez, Henry: NBC       NEWS; Gomez, Justin: ABC NEWS; Gomez, Mario: FEDNET;       Gomez, Serafin: CBS NEWS; Goncalves de Oliveira,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]