[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…officials to use  these assets for self-enrichment at the highest levels of our  government. These bills ensure Members of Congress and many other  government officials must abide by ethics rules that we expect from  government officials, allowing the industry to innovate as it should.  Two individuals are exempted, the President and Vice President.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693837/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…restraints placed upon the operations of the Department of Homeland  Security as it must be.\n\nIt is essential that we unmask Trump's Federal immigration agents,  force them to abide by the local law enforcement standards for use of  force and use warrants.\n\nMr. HOYER. Mr. Speaker, throughout this year's appropriations  process, we have seen Donald Trump…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Noem and the President.\n\nWe are asking for the same things that the Michigan State Police or  the Nevada police have to do on every single day. We want our Federal  agents to abide by those same laws and rules because they fundamentally  lost the trust of the American people. They don't have it.\n\nSo we don't trust that the President is just going to learn…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…actions of their officers.\n\nWe are discussing reforms now in Congress, and the basic reforms that  should be made are that any Federal Agency, including ICE, should have  to abide by the standards that apply in Alabama or in Vermont to our  local law enforcement agencies, where there is training, where there is  accountability, where there are body cameras,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…States must come to  Congress before ordering a military engagement against any country.\n\nMr. Speaker, you cannot uphold the rule of law by breaking it. You  cannot protect or abide by the Constitution by assaulting it.\n\nAgain, so there is no confusion between these two positions, Nicolas  Maduro was not a legitimate President, and unauthorized military…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…is. That is not how our system works. The Supreme Court  and our judiciary decide what the law is. When a unanimous Supreme  Court rules that he is not a king and that he must abide by our basic  principles of due process, he then refuses.\n\nKilmar Abrego Garcia was deported to El Salvador, even though he had  an order on him that would prohibit him from…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…people are dragged into a very endless war by those whose  radical acts of retribution will not cease.\n\nThis is a time to pay attention, to study history a little bit, and  to abide by the Constitution of the United States.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692692/congress-must-reassert-our-constitutional-authority"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…this Nation shouldn't be deported or that  they shouldn't face the legal system that we have because the strength  of the United States is that we are a nation of laws; that we abide by  the rule of law. This agency is defying this at every step of the way,  every day, with the sanctioning of the President of the United States  saying that we are going…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the Western Hemisphere,  which have never been approved by Congress and far exceed the  President's authority.\n\nWe are a country of laws. Individuals in the streets have to abide by  our laws. The President of the United States should be abiding by our  laws.\n\nIn our laws, you convict somebody in court. You can't just go out and  kill them. What I had…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…indictment supported by an extraterritorial rendition, a fancy  term for going abroad and kidnapping the person whom we have an  indictment on.\n\nIs that a principle that we abide by in the law? Are we saying: Hey,  Canada, if you have an indictment, come to the United States of America  and grab an American citizen. We are fine with that.\n\nI say: Hell,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…leader believe that communist dictator Vladimir Putin and the Russian  regime will hold to any peace agreement? Russia never keeps its word.\n\nThe only way to force Russia to abide by such an agreement is to  include strong security guarantees for Ukraine. The world community  must do that. A peace accord must ensure Russia will remain inside its  own…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…that is  why she must step down.\n\nAnd there must be major reforms to immigration enforcement, including  a complete overhaul of this Agency. Americans want Federal agents to  abide by the same code of conduct as local law enforcement and be held  accountable when they don't. Americans want transparency. Federal  agents shouldn't be masked. They should…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to respond to some of the things he said,  because, again, I just want to affirm that he is right on the urgency  to help our police officers. He is right that States should abide by  Federal law that passes from this body. But what we have now is a  President who, in his first term, didn't ever try something like this,  which is undermining the will…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…we need to end the roving patrols. ICE does not have free  will to do as they please. This is a nation of laws, guided by the  Constitution that everyone, including ICE, must abide by. This means  Federal immigration officials must stop racial profiling and random  arrests.\n\nYou have seen the videotapes, and I have as well. In a Home Depot  parking lot,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Democrats want is exceedingly reasonable. We need to end roving  patrols. That means arrest warrants and ending racial profiling.\n\nSecond, we need real accountability, having ICE abide by the same  rules as local police do, including independent investigations of ICE.\n\nAnd, third, masks need to come off. Cameras need to stay on. Officers  need visible ID.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…have performed       at least several times more transplants than even the largest       estimates of death row prisoners can account for.\n\nIn addition, China still does not abide by global standards       of transparency in regards to organ sources, donor numbers       and organ transplant operations performed, and a previous       1984 law allowing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that is not what happens. We have turned them off. Both sides have  turned them off.\n\nI would also add, for example, for the filibuster rule in the Senate,  are we going to abide by the 60-vote threshold in the Senate as a  Congress? My colleagues on the other side of the aisle tried to change  the filibuster rule for judges and succeeded, and now,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…security services provided under the       contract are being provided only for the protection of the       Member or their residence(s);\n\n4.3.2 The personal security services abide by all Capitol       Police Board regulations, and Capitol Police policies and       procedures while in the Capitol Complex; and\n\n4.3.3 Neither the Member, any relative of…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…were worried and concerned about that the NDAA provision does.\n\nWhile Congress works to ensure in law the safety of our airspace, our  DOT and FAA leaders are committed to abide by current safety standards,  maintaining that safety at the DCA airspace.\n\nAs both have said, more work can be done, but it is a pretty good day  to be taking the steps we…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…plan on the floor, and let's  vote on it. They won't do it because they will lose. They know what it  does. It ties up ICE's ability--which, by the way, they already have to  abide by due process. There are already warrants. They know all this.  They want to confuse the issue--mostly because they believe in open  borders but also because this Trump derangement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…are constitutional processes that are incredibly important.\n\nThe Constitution doesn't allow the President of the United States to  be the sole decider. Even the President must abide by the proper limits  of Executive power.\n\nThankfully, our Constitution does more than merely hope that our  Chief Executive will remain within the confines of the Constitution;…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…for one, appreciate the  efforts of this  administration to stop that from happening without bloodshed. The  Iranian regime has proven itself to be utterly untrustworthy to abide  by any agreement it makes. That makes any negotiation with this regime  highly problematic.\n\nThere is only one solution that promises to resolve this danger  without the risk…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…information in the possession of the Committee may       only be authorized in accordance with Section 8 of S. Res.       400 of the 94th Congress, as amended.\n\n9.8. Failure to abide by Rule 9.7 shall constitute grounds       for referral to the Select Committee on Ethics pursuant to       Section 8 of S. Res. 400 of the 94th Congress, as amended.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…These updates shall be done consistent with the guidelines and best  practices developed by the National Institute of Standards and  Technology and simply require contractors to abide by the same  cybersecurity standards as Federal agencies.\n\nFederal contractors with access to government systems and data should  have the same safeguards in place as the government…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Chinese Communist leadership, almost  never abides by their agreements with the United States--and I mean  never. Big agreements, small agreements, it doesn't matter. They never  abide by their agreements. I have seen this throughout my career.\n\nIn 2003, I was actually in this meeting right there. That is  President George W. Bush and the Vice Premier of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…pollution.\n\nMadam Speaker, I say not so. That is not so. The EPA's National  Emission Standards for Hazardous Air Pollutants would still exist. All  major sources would still have to abide by their Clean Air Act Title V  permits and various other Federal and local controls and regulations.\n\nRegardless, if Congress were to pass this joint resolution, rubber  tire…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…world are you living in that you think that the power that we  granted to the District of Columbia is being executed responsibly?\n\nWe are talking about something very simple: Abide by Federal  detainers. If the Federal Government says you have arrested an illegal  immigrant who has a criminal detainer, you have to follow the law.\n\nWe didn't give the billion…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…tradition that people are treated fairly, that if they  get pulled over for speeding, they will be treated the same way.\n\nWe have the protections of our Constitution that our police abide by.  We are so fortunate in America to have the men and women who protect us  each and every day, and we must continue to protect them and stand with  them.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…major economic question. Yet Congress  has not expressly delegated the authority to impose tariffs to the  President.\n\nWe need to return to constitutional government. We used to abide by  the ancient principle of ``no taxation without representation.''\n\nOne of the first acts enacted into the law was the Tariff Act of  1789, which sought to generate revenue…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…precedents and is actually  fairly routine, where we have Federal highway funds that come with a  number of strings attached, a number of conditions. For example, States  have to abide by the 21-year-old minimum age for alcohol, various drunk  driving laws, and various vehicle weight laws, all of which are a  condition of receiving Federal highway funds.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}]