[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…everybody, across the board.\n\nSo while Republicans, those folks here in Washington, fight for  billionaires, Democrats are here fighting for you--for your healthcare,  for your ability to see a doctor, to see a doctor and get your  prescriptions without breaking the bank.\n\nIn my State of Nevada, over 110,000 Nevadans get their healthcare  coverage through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…no  one.\n\nIs this who America wants to emulate? Putin, Hitler, Hussein?\n\nThe flimsy reason offered by the President and his minions, notably  Stephen Miller, references our ability to protect America from an  Arctic region threat.\n\nWith that very thought in mind, in 1951, we signed an agreement with  Denmark that allows us to place military assets in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…mass elimination of trusted Federal programs and partners  put American businesses at a disadvantage.\n\nAll of these actions by the Trump administration are detrimental to  our ability to compete globally. I encourage my Republican colleagues  to stand up for American businesses, large and small, against the  chaotic actions of this administration.\n\nForeign…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Commission's decision to allow schools and  libraries to lend Wi-Fi hotspots was not a radical idea; it was a  responsible idea. It recognized that in the 21st century, a student's  ability to succeed should not depend on whether their parents can  afford a broadband subscription. It helped ensure that millions of  students that relied upon the Emergency Connectivity…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…wealthy. It is a tax cut for corporations  that we have seen in policies, while Americans and their most important  issues--whether it is their healthcare, whether it is their ability to  make a living--are further and further undermined.\n\nCitizens United has created a system where Presidential pardons are  pay-to-play, where environmental regulations that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Program, a program  executed by our combatant commanders, we provide unique assistance  during natural and manmade disasters when interagency support is  requested.\n\nDOD's ability to respond rapidly with extensive manpower,  transportation, and communication capabilities is critically important  in a time of crisis.\n\nWhen we assist in filling in these…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…of, including beating their  teachers in the students versus faculty basketball game.\n\nThe graduates excelled not only in the classroom but also on the  field and in their ability to persevere through challenges. Whether  they are heading into the workforce, trade school, college, or  embarking on their service at institutions like the Air Force Academy…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…immigrants navigate complex landscapes of services and programs. She  became affectionately known among family and friends as a ``community  connector''--someone with a unique ability to guide others through the  hoops and ladders of life. Her knowledge of local systems and her  natural inclination to serve positioned her as a trusted resource and  advocate,…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…internment camp, and we are in hurricane season.\n\nI don't care if you are a Democrat or Republican. I don't care what  you are. The Division of Emergency Management has the ability to spend  up to $500 million without going to the legislature for emergency  money. They are going up to $450 million.\n\nWe are about to go into hurricane season, which means…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…disapproval, this CRA vehicle, it is not simply eliminating that  provision, along with all the other provisions in the resource  management plan, it is potentially risking the ability of a future  administration, including this one, from issuing any resource  management plan that provides a similar benefit.\n\nWhat happens when a court 2 years from now, 3…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.R. 3668. This bill is  an outright assault on our Nation's environmental laws. It completely  strips States of their ability to enforce clean water laws when it  comes to pipelines.\n\nI have to say, Mr. Speaker, that I was surprised when I first saw  this provision in the bill. I thought Republicans…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…the Hill, I had the privilege of seeing up close his work in action.  The Seapower Subcommittee has a long tradition of bipartisan success,  thanks in large part to Phil's ability to rise above partisan  squabbling and work with Members and staff from both sides of the  aisle. When Phil first came to the committee, Congressman Ike Skelton,  the 14th…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…amended text that we are considering today will eliminate the  possibility that a servicemember will need to seek judicial or other  legal relief to evict a trespasser.\n\nThe ability of Congress to legislate a solution to that particular  issue is legally difficult. The text of H.R. 2334, based on my  amendment in committee, was drafted so as to avoid…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695470/servicemember-residence-protection-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…want a handout. We have got the tariff  policies that are wrecking the markets, and then we have got a bailout  that is going to Argentina that is going to further erode the ability  of our farmers to sell their product because, oh, by the way, the  Argentinian farmers are now going into the markets we are helping them  create that have been opened up…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Medicaid cut in American history. Mr. Speaker,  because Republicans were on the run, they were forced to take that  hearing down. That battle is not over.\n\nIn the absence of their ability to actually jam up hardworking  American taxpayers, and instead of focusing on things that would make a  difference in the lives of the American people, we are here on the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, a core part of American sovereignty  is the ability to determine who is able to enter our country. The sole  purpose of our immigration system is to benefit American citizens.\n\nThat is why today I introduced a bill that would…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…this floor to share good news from Pennsylvania's 15th Congressional  District. I spoke 91 days on the House floor in 2025, delivering 120  speeches. I am glad to have had the ability to communicate with my  constituents in this way and to recognize their achievements.\n\nMr. Speaker, I thank the people of the 15th Congressional District  for allowing me…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…introduced legislation  called the Alaska Native Vietnam Veterans Land Allotment Act. And it  said: Hey, if you were overseas serving in the military and you came  home and the ability to get your allotment extinguished, you shouldn't  be penalized for fighting for your country. You get the extended time  to get your allotment. So that bill passed.\n\nI was…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…transition to make Venezuela free and fair and if  you don't like taking the assets of the country and selling them to  prop up a failing economy, then limit the President's ability to do  that by denying funding for those operations. That would be lawful.\n\nThe War Powers Act, in my view, is unconstitutional because you are  not denying funding; you are…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…has remained the top concern. In fact, 98 percent of small businesses  report that healthcare costs will become unsustainable in the next 5 to  10 years, threatening their ability to survive and remain competitive.\n\nThis is not because small businesses do not want to offer healthcare  benefits. Small business owners work very hard to provide for their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…over and  over again: No mining. That is big key because my State of Arizona has  taken the brunt of this.\n\nThis CRA needs to be done away with because we have to have that  ability. The predecessor of the gentleman across the way advocated no  mining. In fact, he used a national monument, disgracefully, to  actually bring in a tin-silver mine. Yes, that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699270/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Rose", "party": "Republican", "sentence": "…includes consumer protections and enables innovators  to do what they do best. It also happens to strengthen the U.S.  dollar's reserve currency status. This will result in the ability to  make near-instant payments anywhere in the world, which is good for  consumers, companies, and Americans.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, today, I rise in support of this morning's  ruling from the Supreme Court that will greatly reform the ability of  rogue district court judges to issue nationwide injunctions.\n\nAccording to a Politico article this morning, with this ruling, the  Supreme Court said that in most cases,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693094/supporting-supreme-court-ruling-on-nationwide-injunctions"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…accomplished students in our country  and reflects a level of brilliance that is truly commendable.\n\nEarning a perfect score on the ACT is a testament to remarkable  intellectual ability, diligent preparation, and an unparalleled  commitment to academic excellence. It demonstrates not only mastery  across English, Mathematics, Reading, and Science, but also…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Inupiat continue to       reside in our communities and have access to essential       services. Without a stable economy, our communities will       suffer, along with our ability to fully engage in and sustain       our Inupiaq cultural traditions, including our vital       subsistence way of life.\n\nThe North Slope of Alaska spans an area nearly the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…list of approved flags that uphold the honor and dignity  that our military is built on.\n\nHowever, there is a glaring error. A caveat built into the list gives  commanders the ability to fly any flag they deem appropriate. Since  President Trump and Secretary Hegseth have taken office, the woke  infiltration of our military, even its highest leaders, continues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…that, in the determination of the       United States Governor, does not generally restrict the       employment of nationals of member countries of the Fund; and\n\n(4) the ability of Taiwan to receive appropriate technical       assistance and training by the Fund.\n\n(b) United States Policy.--It is the policy of the United       States not to discourage…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…occasions to discuss key issues impacting our Nation and  the CSRA. I will always appreciate Austin's flexibility, willingness to  have important conversations, and most of all his ability to tell it  like he sees it.\n\nI congratulate Austin on this well-deserved honor. I have no doubt  that he will continue to be our afternoon voice on the airways for many…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692847/congratulating-austin-rhodes"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…power  sources with the American people paying the price.\n\nThe Reliable Power Act puts an end to this by preventing Federal  rules from moving forward if they threaten the ability of the grid to  keep the lights on. This legislation ensures proper coordination  between FERC, the Federal Energy Regulatory Commission, and Federal  agencies proposing regulations…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…going to stop that.  President Trump is only 43 days in this office in his historic  Presidency, an incredible comeback victory--the comeback king, as I  call him from his ability to win this election. He won 312 electoral  votes, every one of the battleground States, and this President has not  wasted a second, a minute, an hour, or a day in office…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}]