[{"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…committee.\n\nMr. Speaker, we should trust the professionals who are legally  obligated to make prudent decisions on behalf of retirement plan  participants, not undermine their ability to make sound investment  decisions.\n\nMr. Speaker, I urge my colleagues to oppose H.R. 2988. Once again, I  thank the ranking member for his leadership.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699157/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…average, right now, a CEO makes more in a single day than a worker does  in an entire year. The concentration of wealth and power has given a  small group of superelites the ability to make all the big decisions in  this country, and they have used their power and influence to further  rig our economy and politics to benefit themselves at the expense of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…doing  it?\n\nI would say, Mr. Speaker, let the security professionals decide what  to publish and when. That is their job, not ours. Ours is to legislate.  They have the ability to make decisions now. Let them make these  decisions.\n\nI ask my colleagues to let the Secretary, again, make the decisions  and publish the information they deem safe and correct.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…It is a tax cut for corporations  that we have seen in policies, while Americans and their most important  issues--whether it is their healthcare, whether it is their ability to  make a living--are further and further undermined.\n\nCitizens United has created a system where Presidential pardons are  pay-to-play, where environmental regulations that keep…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…yearbook course allowing students to  design, write, and produce the school's yearbook, building  collaboration and pride in their work. Colleagues praise her  exceptional ability to make every student feel seen and valued.\n\nBoth Christine and Melanie were named New Jersey Exemplary Educators  in 2025, an honor reserved for educators who demonstrate true…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…she deserves better  than what she is receiving from House Republican extremists. She  deserves the opportunity to be heard. She deserves due process. She  deserves the ability to make her case, not to be prosecuted by  pettifoggers playing lawyer on the floor of the House of  Representatives. Google that if you don't know what it means.\n\nThe so-called…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…homes and that this Congress is  not depriving any eligible citizens of their right to vote.\n\nRepublicans have refused this amendment. Republicans are refusing  your ability to go and make it easy for citizens to register to vote in  this country. Republicans can now vote to pass this amendment.\n\nMs. JOHNSON of Texas. Mr. Speaker, I have a motion to recommit…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690011/safeguard-american-voter-eligibility-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…not a serious  legislative effort to enhance public safety; it is a blatant political  maneuver to override the local authority of Washington, D.C., and  restrict judges' ability to make individualized sentencing decisions  for young adults. It is a bill that uses the nearly 700,000 residents  of D.C., who pay more federal taxes per capita than any state,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695721/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…colleague on the other side of the aisle--I  have been there. I have had to make choices. Let's do the right thing  and make sure that every woman has the full breadth of the ability to  make the choices that she needs to make.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…all the power to make this country move in the right  direction when Democrats controlled all of Congress and the White House  following the 2020 elections. They had the ability to make those  changes, but they took the country in the wrong direction.\n\nThat is why the country, at the ballot box, made the changes that  they made. They took the House out…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…multiple uses, the more likely resource development       opportunities will be unavailable on Doyon (and other non-      federal) lands in the vicinity, impeding Doyon's ability to       make economically productive use of its lands as Congress       intended when it settled aboriginal land claims in Alaska.       The management decisions made in the 2024…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the world who use our airline  system have a safe and secure flight when they board a plane in the  United States. The silliness of where we are today is impeding our  ability to make that true.\n\nI don't know when a shutdown makes sense, but the consequences of  this one, in lieu of a short-term, clean CR for a few more weeks to  complete our appropriations…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…were  still receiving these subsidies.\n\nOriginally, when we talk about ObamaCare, it was just for folks who  were very low-income and were uninsured and didn't have the ability to  make any payments toward covering their own insurance.\n\nWhat ObamaCare does is it says if a person is 100 percent or 150  percent of poverty level, all that is required is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…whether it be the Western District of Virginia, the Northern  District of West Virginia, one of the districts in California, or  anywhere else in the country, should have the ability to make  nationwide decisions as a district court judge.\n\nThis bill would prevent forum shopping and somewhat restore checks  and balances to our judicial system in the country…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…from whale baleen, walrus tusks, crafted  by Alaska Native artists.\n\nThis is some of the most beautiful art in America. It is deeply  ingrained in Alaska's culture, the ability to make this art. It also  provides important economic opportunity for our artists in many of  these remote villages, artists who rely on the ability to sell these  works to Alaskans…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…schools to clearly  communicate what accommodations and protections pregnant and parenting  students are entitled to. That includes excused absences for medical  needs, the ability to make up missed work, and protection from  discrimination and retaliation.\n\nMore specifically, this bill requires information to be emailed to  students at least once each academic…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…is quickly moving to corner the market on critical  minerals and exploit Africa's vast resources. Stronger partnerships  with African nations mean we will limit China's ability to make further  gains in the region and protect our national security interests.\n\nMadam Speaker, for example, last year the Trump administration  announced a strategic partnership…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Our independence and our  sovereignty are not commodities to be sold on the global market. We  can't and won't make everything here, but we must recover the will and  the ability to make the vital necessities of our national life. Our  country now depends on foreign imports for most of those necessities.\n\nBy a nearly 2-to-1 ratio, more Americans now work…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Rose", "party": "Republican", "sentence": "…consumer protections and enables innovators  to do what they do best. It also happens to strengthen the U.S.  dollar's reserve currency status. This will result in the ability to  make near-instant payments anywhere in the world, which is good for  consumers, companies, and Americans.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}]