[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…right here: In 10 or 15  years, there  are going to be regions of the country where you can't get a mortgage.\n\nWhy is that? Because in those regions of the country you won't be  able to get home insurance. And if you can't get home insurance on your  property, if it has become uninsurable, no mortgage.\n\nSo what he is really saying here is whole regions of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…will come under huge pressure to say:  Who did that? Whose weapon was it?\n\nThere is a lot of very detailed knowledge that we have had in the  past in our national labs to be able to go in there and do what is  called nuclear forensics and find out whether that was a bomb from X,  Y, or Z. That capacity has been under duress for a long time. It seems…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…promote their drugs because it increases their profit margins.\n\nBig Pharma thinks if they hit you hard enough and often enough with  ads on television, not only will you be able to pronounce but spell  Xarelto, but you will also tell your doctor: That is my favorite blood  thinner. I have seen that ad over and over again.\n\nDon't take my word for it.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Republicans green- lighted dozens of amendments containing controversial poison pills that  may very well make their way into the bill. I hope that my Republican  colleagues are able to demonstrate some restraint this week and vote  down these bad policies. We cannot afford to politicize our national  defense.\n\nA good NDAA, like a good budget, is one that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…district, Mr. Speaker. They say: ``I am not on Medicare.''  I say: ``That is right. Maybe you are not, but your grandmother is,  your elderly aunt is, and the doctor you see is able to see you because  of the reimbursement they are getting from a Medicare patient.''\n\nWith these cuts, we are hearing from community clinics. We are  hearing from hospitals.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…of the  American people.\n\nYou would rather see them--thank God for the people who are standing  up on your side. They deserve the Profile  in Courage award because they are able to stand up to a President who  would rather see 15 million people lose insurance and another 20  million see their prices double. Thank the Republicans on that side for  profiles…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698786/breaking-the-gridlock-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…that represent the foundation of the village of Port Chester  today.\n\nLed by president Jordan Allen, the society has maintained the  historic Bush-Lyon Homestead and has been able to follow through with a  host of different items for this building that was built in 1760,  involving the community and activities at that site: celebration of  historic dates,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the day, everything from regular checkups and  lifesaving prescriptions to hospital visits and long-term care is under  threat--not for the wealthiest. They are going to be able to handle it.  Maybe not even for people in some of the big cities, but for people out  there in rural right now, they are barely holding on as it is.\n\nAnd this is on top of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…businesses are the backbone of our economy. They should be and are a  bipartisan priority, and this bill is a step in the right direction.\n\nWith the understanding that we will be able to deal with the other  bills that are scheduled to come before us even after a short recess, I  urge a ``yes'' vote on H.R. 1190, and I yield back the balance of my  time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…required by the SAVE Act to prove his citizenship. But for a last- minute emergency court order, Mr. Wilson, an American citizen, a  veteran, and a patriot, would not have been able to vote this past  election.\n\nIf the SAVE Act becomes law, Americans nationwide will face the same  bureaucratic nightmare that Mr. Wilson faced in Arizona. The SAVE Act  will…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…and our seniors. They  are our neighbors.\n\nMany people in this Chamber know that a union may have helped them  achieve the dream that they have of serving, as well as being able to  take care of their families. Many of us are recipients indirectly or  directly because of unions.\n\nCollective bargaining isn't a privilege, Mr. Speaker, that can just  be…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697997/protect-americas-workforce-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…do. Too many Black  people do. Too many people in our communities are disproportionately  impacted by this public health crisis.\n\nEven when we find bipartisan agreement--I was able to find bipartisan  agreement to get a fund created in the Virginia government, a gun  violence prevention grant fund, yet the Federal funding that was  available to fund the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…technology.\n\nMr. Speaker, I thank my colleagues, Mr. Collins and Ms. Stevens, for  their work on this bill. I think we are all in agreement that small  businesses should be able to take advantage of the immense potential of  AI as well as be able to understand the risks and cybersecurity  pitfalls that may come out of it.\n\nMr. Speaker, I urge my colleagues…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700128/small-business-artificial-intelligence-advancement-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…which our country was founded  true for everyone.\n\nEnter my own family history. My great-grandfather in Alabama around  the same time had to take a literacy test in order to be able to  register to vote. In this literacy test he was asked questions like:  How many bubbles are in a bar of soap? And many other nonsensical  questions that the person giving…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…American people.                    Good and Bad News for Social Security\n\nMr. SUBRAMANYAM. Madam Speaker, we had some good news this week.\n\nOne of my constituents was finally able to get an in-person  appointment to receive at least an interview about her Social Security  benefits. You would think that we would be delighted that appointment  is going…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…veto message states, my bill does not authorize  any additional Federal funding. It simply modifies the repayment terms  for small rural communities in my district so they are able to afford  their 35 percent cost share of the project that they are statutorily  obligated to repay.\n\nAfter the project broke ground, inflation took place. Costs doubled  under…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…C-SPAN, all 14 of you--we have a situation  where ObamaCare expanded the Medicaid population, and it expanded it  massively to a population that is much bigger and much more able- bodied, i.e., healthier.\n\nNow, you would think is that good or bad? I have my problems with it  facially, but even if you were going to do it, would you then say, as  it does,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fact that the United States, for the  industrialized countries, is like number 12?\n\nLet's call it the credit stack, the ability to sell a 10-year bond.  Why are other countries able to sell a 10-year bond cheaper than the  biggest economy in the world, the country with the reserve currency?  Does anyone pay attention to this? People say, ``Oh, David, that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "…60  percent, while the U.S. population has only grown about 6 percent  according to the Foundation for Government Accountability.\n\nFollowing ObamaCare's Medicaid expansion, able-bodied adults now make  up its largest subgroup according to FGA. Democrats claim these able- bodied adults are working, but these claims are derived from self- reported data…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690831/medicaid"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…their own rent and put food on their own table, much less providing  themselves with music, plant, and pet therapy.\n\nI know many taxpaying American families who would love to be able to  provide their children with one-on-one academic tutoring but simply  cannot afford it.\n\nThis all begs the question: Why are we investing in illegal families  while stripping…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…chance to  level the playing field and help more people take part in building  America's next generation of businesses.\n\nI am proud that during the committee process, we were able to make  thoughtful revisions to address concerns raised by the ranking member.\n\nI thank Chairman Hill for advancing this bill, as well as my  colleague, the chairwoman of the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…undermine the future of rare disease drug  development.\n\nLowering the bar will deter investment in first-in-class therapies by  reducing the certainty that companies will be able to benefit from the  exclusivity protections Congress intended. Lowering the bar will create  regulatory uncertainty, leading to litigation, market instability, and  hesitation…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I rise this evening to say to the American  people: Well, Congress is back.\n\nCongress is back because we were finally able to do our job after 43  days of our colleagues on the other side of the aisle, our Democrat  colleagues, parading around the country, acting like they were fighting  for you…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…to do that. It is 10 after 3 at  this point, and I am not sure when the distinguished majority leader  will schedule that, but Members should be advised that unless we are  able to get a unanimous consent request and give the President his  choice for Chairman of the Joint Chiefs, those are items that can still  be the order of the day, and perhaps…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…that very same equipment, airports are forced to utilize  alternative and less reliable funding mechanisms. If you can use AIP  funds to purchase the equipment, you should be able to use those same  funding mechanisms to acquire the necessary facilities to house and  protect the equipment.\n\nI thank Mr. Wied for his leadership on this commonsense piece…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695010/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…cleaners, fans and blowers,  dehumidifiers, commercial clothes washers, and conventional cooktops.  Who in the hell do these people think they are? We are Americans. We  ought to be able to choose whatever we want to, yet they tell us what  we can have and what we can't have. I am not sure what country you  think you live in or what it should be, but it shouldn't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…President and Alejandro Mayorkas as the Secretary  of Homeland Security. Now it turns out, somehow magically, without that  being signed into law, magically President Trump is able to stop the  flow at the border.\n\nDo you think that is an accident?\n\nMr. ROY. Correct. A day. We had as many as 15,000 in a day, okay, and  now we are getting far fewer than…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Trump. Promises made, promises kept.\n\nMs. FOXX.\n\nMr. Speaker, my Democratic colleagues continue to rail against  commonsense community engagement requirements, which require able- bodied adults without an exemption to spend 20 hours per week working,  volunteering, enrolling in school, or participating in a work  development program.\n\nLet's be perfectly…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…grandstand on the deportation of a wife-beating El  Salvadorian, MS-13 gang member and chant ``Bring him home,'' I have  good news for you. He is home, and he will never be able to call  America home.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690313/abrego-garcia"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…protect themselves and others.\n\nAt a time when violent crime continues to plague our Nation, we must  support our active and retired law enforcement officers and ensure they  are able to protect themselves and to protect others no matter where  they are in the United States.\n\nThis legislation is supported by the Association of State Criminal  Investigative…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}]