[{"senator": "Al Green", "party": "Democrat", "sentence": "…We could  fight it and use that language. We can't use ``racism.'' By the way, I  would support saying ``anti-Semitism.'' I would. I do support saying  it. We have to be able to say ``racism,'' too.\n\nThat is what is happening now across this country, especially in  Texas, where the President of the United States--specificities--had the  Justice Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…if you are going to  take life, liberty, or property from a person. A person has to have due  process. If you are going to take a person and lock them up, they have  to be able to say, Hey, you have the wrong guy. They ought to be able  to say it to someone other than the arresting person. They ought to be  able to say it to someone who has authority…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…commitment to the rule of law. All of that puts us in this incredible  position to lead.\n\nI believe, 30 years from now or so, we are going to be in a place  where we are able to say, not just to the American people but to the  world, that we are at net zero from a carbon point of view and that we  were able to get there through American technology and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…President suggested nationalizing elections. That suggestion is  unconstitutional; it is illegal; and if acted upon, it would be grounds  for impeachment. The Senate should be able to say that clearly without  diversion, without delay, and without changing the subject.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…an urgent call from Barbara, who begged us not to back down from  this fight.\n\nLaura from Brick, who called and urged Democrats not to back down  from this fight and was able to say how concerned she was for just  regular citizens to be able to make things easier for everyone  impacted. She was asking how can she help. She was asking how can she  help…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…news in 1998.\n\nBill's legacy extends far beyond the newsroom. It lives in his  warmth, wit, and unwavering dedication to our community. In fact, Bill  is known for not being able to say no to any charitable cause where he  can make a difference.\n\nHe has been a familiar voice emceeing, speaking, or judging countless  local fundraisers and events for charitable…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688600/recognizing-bill-jartz-the-voice-of-lambeau-field"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska  Native artists and then bring them home to a State that has a ban on  ivory, which is not sensible--again, walrus ivory, not African elephant  ivory--we want to be able to say at the Federal level that we should be  able to do this.\n\nSo that is what my ARTIST Act does. It prohibits States from banning  the importation, sale, or possession of Alaskan…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…votes be 10 minutes in length.\n\nMr. THUNE. Mr. President, this has been a very long road--quite  literally, the longest shutdown in history. I am very, very happy to be  able to say that we are coming to the end.\n\nBefore we close today, I want to take the time to say thank you to my  staff, who have worked around the clock tirelessly now for the past…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696667/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…make taxes competitive, we  will actually grow our U.S. tax revenue. That is not adding deficit.  When you see people actually grasp that concept, it is fascinating to  be able to say, of course, I would rather people be paying taxes in the  U.S. as opposed to a foreign nation. Now, the foreign country doesn't  love that when we do it.\n\nIf we put things…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "John Thune", "party": "Republican", "sentence": "…programs and Agencies.\n\nIt has been a long road to get here, with the process most notably  interrupted by the Democrats' 43-day shutdown in the fall. But I am  proud to be able to say that the Senate has passed 11 full-year  appropriations bills.\n\nWhen I became leader, I made it very clear that I wanted a return to  regular order consideration of appropriations…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…prayed  for the Nation. My simple request of them again this year is to do it  again. This Nation could use some prayer. This Nation could use a  generation rising up to be able to say: No one is going to stop us from  praying.\n\nIt is the most simple request that we have--to not go to government  but to go to God and say: We need your help. We need your…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…is a third party, and it is  a private party. They don't necessarily collect the data between you  and Walmart, what did you buy while you were at Walmart. They will be  able to say, hey, Walmart is a credible place, you really were there,  you really did spend $100 at Walmart. They don't necessarily know what  you bought there. They might be able to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…important piece that literally every single Republican  cleared. No struggle with this bill at all. And then my Democrat  colleagues came today, of all weeks and this day, to be able to say  they were going to block it.\n\nSo my challenge is to my Democratic colleagues, I don't know what the  fight and struggle is on this, and I don't know why this is difficult…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…committee with a  vote of 24 to 4.\n\nThat is overwhelming bipartisan support. There is just not  controversy about this nominee. But now suddenly to be able to have a  game, to be able to say we want to be able to stall this out and maybe  block this person until after Easter, so we don't have a Chairman of  the Joint Chiefs of Staff is frustrating for people…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the added advantage of actually, as a matter of  scoring by the Congressional Budget Office, reducing premiums--reducing  premiums--something their plan will never ever be able to say.\n\nThis is the average reduction in premiums across the country State by  State. Like I said, it is too far away for you to see. In my State of  South Dakota, it will reduce…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}]