[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…rings a bit hollow.\n\nThen, we have an appropriations bill that continues this trend toward  privatizing VA services and blocks women who are veterans from being  able to get abortion services at the VA in most cases. Republicans are  trying to restrict the freedoms of the people who are willing to fight  and die for our freedoms. Republicans are unbelievable.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that some,  for purely political and ideological reasons, would want to withdraw  from the UN Population Fund, even though it is prohibited by its own  bylaws from supporting abortion.\n\nThe key point I want to make is that applying an ideological litmus  test to these organizations and withdrawing from them without any  consultation or debate will further…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…mean, come on. Get real.\n\nJust to make sure that we all know that they aren't serious,  Republicans included a poison pill which brings us closer and closer to  a nationwide abortion ban. They are going after abortion even in States  where it is legal.\n\nI mean, who the hell asked for this? This is like a plot of ``The  Handmaid's Tale.''\n\nDespite Republicans'…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…allowing extremism and propaganda to proliferate  across the internet and media landscape.\n\nThe bill continues House Republicans' attacks on the right of women  to seek an abortion and the rights of minorities to be protected from  discrimination, while destroying the Department's efforts to build a  more inclusive, effective, and modern military.\n\nMoreover,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…workers  at risk. This has been the centerpiece of Republican attempts to repeal  the Affordable Care Act for decades.\n\nIt doesn't work.\n\nThe plan also creates a backdoor ban on abortion and reproductive  healthcare.\n\nRepublicans have shown they have no agenda to address healthcare  affordability and access. As Americans stare down notices that their  healthcare…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…accessible  healthcare for all.\n\nThis bill does nothing to accomplish that goal. Worse than that, it  pushes people toward less coverage at a higher cost and opens a  backdoor abortion ban that marches us a step closer to a national one.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698396/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Tragically, in 2022, one-half  century of reproductive freedom was stripped away when the conservative  majority on the Court overturned Roe.\n\nSince then, we have seen extreme abortion bans enacted across the  country, including in North Carolina. Today, Republicans at all levels  of government are waging an all-out war on Americans' access to care,  pushing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699244/womens-health"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…take a bus 3\\1/2\\ hours from their college  campus into the city. That is because that was the only place they  could access either maternity care, OB/GYN care, or access abortion  care. We have not funded healthcare in rural communities across the  country. We have gutted programs that provide actual support for  pregnant people.\n\nThis is a joke. This…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…students to carry a  pregnancy to term.\n\nIt provides no information about rights and accommodations for  students who may find themselves in a medical situation that requires  an abortion. Now, repeating the idea that comprehensive information  must be provided does not make it true.\n\nTitle IX entitles the students to the information, but this bill only  requires…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.R. 12, the Women's Health  Protection Act, to restore the rights of women to an abortion  nationwide and undo extremist abortion bans in States across the  country.\n\nMr. Speaker, since the Supreme Court's Dobbs decision, 13 States have  imposed complete abortion…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Planned Parenthood wasn't enough.  The radicals got their pitchforks and added a provision to effectively  ban every insurance premium on every ACA exchange for covering  abortion.\n\nThis is catastrophic and even increases the anti-choice provisions in  the bill by a dramatic amount. It will mean that nearly one in seven  Americans who has been insured…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…own body, especially a Black or Brown woman. So he came to this  floor and put forward an amendment with a simple, cruel aim to ban as  many people as he could from getting abortion care.\n\nWith that robotic precision, this institution has rubber-stamped this  amendment in budget after budget.\n\nThe Hyde Amendment denies abortion care to patients who receive…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693925/access-to-abortion-care"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…it never  occurred to me to turn to a victim after a hurricane in Louisiana and  tell them to stay on their cousin's couch and no Federal aid until  their State changes its abortion laws.\n\nNow is not the time to take hostage fire victims or hurricane victims  in an effort to try to force a State government to take an action that  this or that Member of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…can and often do share  women's private medical information without their consent. It means  they can and often do provide false and misleading medical information  about abortion, contraception, and other reproductive health services  for women.\n\nIn California, my home State, our attorney general was compelled to  issue a consumer alert warning the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699226/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, in their incessant drive to impose a  national ban on all forms of abortion, Republicans continue to block  relief for millions of Americans who are struggling with soaring  ObamaCare health insurance premiums. Now, today, they offer this bill  to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…the start of this Congress, I reintroduced  legislation to recognize January 22, the anniversary of Roe v. Wade, as  the Day of Tears to memorialize the unborn victims of abortion.\n\nSince the Dobbs decision, the fight to protect the unborn is far from  over, given the issue of abortion was handed down to the States.  Therefore, abortions are still occurring…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…politician do that? I mention these powerful  people who seem to have a stranglehold on the Democratic Party. Who is  for having men participate in women's sports? Who is for an abortion at  8\\1/2\\ months? Who is for men in the women's locker room? The same  group is for them all.\n\nIt is the same group that is against having children raised in a  nuclear family.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…legislation also furthers President Trump's goals of removing  waste and abuse from our government by codifying his executive orders  to end funding for ridiculous DEI and pro-abortion VA policies.\n\nAdditionally, this legislation ensures that programs to fight veteran  homelessness are fully funded. It also supports the Veterans Crisis  Line and other VA…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…promoting  accountability when those students' rights are violated.\n\nIt is troubling that some of my colleagues on the other side of the  aisle are so dug in on their pro-abortion stances and agenda that they  would oppose providing pregnant students with information on their  rights and resources available to them to continue their education and  have…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…according to a 2025 article  by the Kaiser Family Foundation, 12 States, including my own State of  New Jersey, absolutely require all plans on the ACA marketplace to  cover abortion on demand. We permit abortion until birth in my State,  as do many others. That is all covered by ObamaCare.\n\nThe House has passed my bill, the No Taxpayer Funding for Abortion…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…lifetime. For nearly 50 years, Roe v. Wade took power away from the  people and handed it to unelected judges, but Dobbs finally made it  right.\n\nThe Court didn't outlaw abortion, as my friends on the left tried to  claim. What it did was restore the fundamental truth that States and  the citizens who live in them have a right to decide how we protect…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692891/dobbs-v-jackson-anniversary"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…reintroducing one of those efforts. The SAVE Moms and  Babies Act would protect vulnerable women and their preborn children  from the real dangers of chemical abortions.\n\nThe chemical abortion regimen is falsely advertised to be safer than  Tylenol. Tragically, many women have learned otherwise. Nearly 11  percent experience serious or life-threatening complications…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…against supporting the supply chain production, against  deterring the Chinese Communist Party and foreign adversaries, and  voting to prevent taxpayer dollars from funding abortion travel.\n\nMr. Chair, for their sake, for our sake, for the sake of our great  Nation, I urge my colleagues on both sides of the aisle to support this  bill, to deliver on our…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…to strip TANF funding from these centers was never about  fiscal responsibility. It was a targeted, ideological attack on  organizations that provide a real alternative to abortion.\n\nDemocrats say choice, choice, choice over and over, but they try to  deny women the choice to choose life.\n\nH.R. 6945 codifies the operations of TANF to ensure this funding…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Chair, I thank Representative  Norman for his amendment.\n\nMr. Chair, my constituents do not send their hard-earned tax dollars  to Washington so that they can be funneled to abortion providers or  hospitals that mutilate children, yet that is exactly what many of  these earmarks do.\n\nA vote for this amendment will remove $3 million for Seattle  Children's…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…reintroducing one of those efforts. The SAVE Moms and  Babies Act would protect vulnerable women and their preborn children  from the real dangers of chemical abortions.\n\nThe chemical abortion regimen is falsely advertised to be safer than  Tylenol. Tragically, many women have learned otherwise. Nearly 11  percent experience serious or life-threatening complications…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699389/rounds-mr-wicker-mr-lankford-mr-mcconnell-ms-lummis"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…National Day of Remembrance for Aborted Children is focused on  helping to humanize our aborted brothers and sisters and deepening the  commitment to ending the injustice of abortion and providing healing to  those who have experienced an abortion.\n\nI honor the Colorado Springs Diocese and other faith-based  organizations in the Pikes Peak region such…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…don't believe that to be too radical, Mr. Speaker, and I don't  believe the American people do either. In fact, for years, many of my  Democratic colleagues acknowledged that abortion is a serious and  difficult decision and supported efforts to ensure women were not  forced into it by a lack of resources or support. They joined in  passing legislation…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…be critical of  immigration or can't be critical of weighing in on what we teach young  children about sexual activity, that those people, for whatever reason,  in favor of abortion till birth--which is so grotesque that the people  I deal with back home don't even believe the Democrats are for that  because it is so preposterous, but they are. I am afraid…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…boys. After starting a new  relationship, she found herself pregnant with me. Money was tight. She  had little support. And she soon found herself being pressured to have  an abortion.\n\nOver the years, I have reflected on just how tough and courageous  that decision must have been for her. I always try to think about what  it would have been like to have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]