[{"senator": "Brad Schneider", "party": "Democrat", "sentence": "Mr. SCHNEIDER. Mr. Speaker, last week, the bipartisan House Abraham  Accords Caucus was privileged to host Rabbi Yehoram Ulman and Ahmed al- Ahmed, of Sydney, Australia, and survivors of the terrorist attack at  Bondi Beach last month.\n\nWhen a…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…economic  growth, and sustainable development. It also led to valuable strides in  our mutual partnership including the announcement of Kazakhstan's  intent to join the Abraham accords and commitments to regional partners  on critical mineral investment.\n\nOver the years, the C5+1 format has evolved into an important  platform for advancing dialogue,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Middle East and North Africa. In April, Trump's special       envoy to theMidiile East, Steve Witkoff, named Libya as among       six nations that could potentially join the Abraham Accords,       a series of agreements through which the United Arab       Emirates, Bahrain, Sudan and Morocco established diplomatic       ties with Israel in late 2020 and early…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…is going to help stabilize the region in the Middle East and it is  going to help our ally, Israel, it is going to help our other allies  who are participating in the Abraham Accords. I want to applaud  President Trump for what he is doing.\n\nHowever, to see how the people in the Middle East and others around  the world who are there have respect for…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…exclusive approval or licensure of orphan drugs. Sec. 7. Program for pediatric studies of drugs. Sec. 8. Organ Procurement and Transplantation Network. Sec. 9. Establishment of Abraham Accords Office within Food and Drug                Administration. Sec. 10. Increasing transparency in generic drug applications. Sec. 11. Medicare Improvement Fund.       SEC.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…will support American  manufacturing.\n\nOur two nations worked closely together during President Trump's  first term to bring peace to the Middle East through the historic  Abraham Accords. Now, with President Trump's leadership back in the  White House, I am encouraged to see this partnership grow even stronger  with this investment.\n\nPresident Trump promised…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Israel, but they sought something larger. They wanted  to prevent a seismic shift in the region from taking place. I am, of  course, referring to the early success of the Abraham Accords,  negotiated by the first Trump administration, and the long-term goal of  a Saudi-Israel peace and normalization agreement.\n\nIran and its terrorist proxy groups, like…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Arabia and Israel to  talk about Saudi Arabia recognizing the Jewish State under certain  conditions. Before the attack of October 7, we were very close to  expanding the Abraham Accords to include a deal between Saudi Arabia  and Israel that, basically, would end the Arab-Israeli conflict--an  amazing moment in history.\n\nOctober 7 comes along: a vicious,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the operation of the OPTN.\n\nThis bill also helps secure our medical product supply chain by  requiring the FDA to establish an office in a country that has signed  the Abraham Accords.\n\nI am grateful to Representatives Harshbarger and Vargas for their  work to facilitate operations between the FDA and regulatory  authorities and innovators in Abraham…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…did that. People at the State Department said that we  shouldn't do it because it leads to dislocation. No, it led to the  Embassy being in Jerusalem, and it led to the Abraham Accords.\n\nWe know that last week the President was advised not to bomb Iran,  that it would lead to World War III. No, it has led to a cease-fire and  the ability to have the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…to its highest level  in 15 years. Morale is high. Deterrence is back.\n\nPresident Trump successfully crippled Iran's nuclear program. He  strengthened the success of the Abraham Accords. He secured the release  of the hostages in Gaza. He ended wars around the world not once, not  twice, but eight times. President Trump is the President of peace, and…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "James Risch", "party": "Republican", "sentence": "…in the Global Coalition to Defeat ISIS, and is working  against Iran and its terror proxies. The debate would mention that the  UAE was the first Arab state to join the Abraham Accords when it  normalized relations with Israel in 2020. The discussion would be about  how these proposed sales will support the national security objectives  of the United…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692354/motion-to-discharge-sj-res-54"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…speech, for having  our workers actually show up to work, for hiring people based on merit,  for opening new power plants, for living in peace, for the signing of  the Abraham Accords, and for returning manufacturing to America.\n\nNot a single person stood. That is kind of the most incredible thing,  that there was a willful decision to sacrifice any…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]