[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…their emergency authorities  to put some sensible sideboards on Donald Trump's tariff madness.\n\nIn the district right next to mine in Napa County, the Trump  administration abruptly canceled a $50 million wildfire prevention  grant just 4 months after one of the deadliest wildfires in California  history. That has been the story throughout the West. Critical…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…VASP and read aloud a  letter that I am circulating to my colleagues for a signature to the  Secretary, and it begins with:\n\n``Dear Secretary Collins: On April 3, 2025, you abruptly announced  the closure of the Veterans Affairs Servicing Purchase program (VASP),  leaving tens of thousands of veterans at risk of foreclosure. These  actions were taken…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…today to stand up for the community  of Crystal Lake, Illinois, which, along with over 100 communities  nationwide, just had a $5.6 million student mental health program  abruptly canceled by the Trump administration.\n\nThis funding, which passed with support of both Republicans and  Democrats under the Bipartisan Safer Communities Act, was created in…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692131/crystal-lake-mental-health-program"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…and career training.\n\nThis is why I joined several of my Michigan colleagues in a letter to  the Trump administration, demanding that they reverse this reckless  decision to abruptly shut down Job Corps centers across the Nation.\n\nThis action is yet another example of the cruel actions taken to  dismantle programs for our families. Many of them depend…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…part of his tariff war, he imposed a 10 percent tax on  energy imported from Canada, hitting Midwestern States with higher gas  prices.\n\nIn April, the Trump administration abruptly fired the entire staff  overseeing the low-income Home Energy Assistance Program, which helps  working families afford their utility bills. Weeks later, the White  House proposed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…lifesaving programs had been effectively shut down.\n\nBy March 2, when I was pushed out:\n\nNearly all of the contracts needed for our life-saving work       had been terminated--abruptly shuttering clinics,       interrupting supply chains, and cutting patients off from       treatment for deadly diseases, like tuberculosis, risking a       rise in new, potentially…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the immediate  restoration of hundreds of millions of dollars that are affecting  nearly 40 States in public safety grant funding that the Department of  Justice chose to abruptly terminate. Some of that canceled funding went  to law enforcement training; support and other critical resources; and,  more specifically, to addressing the health, safety,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…to receive an already overdue classified briefing from administration  officials. However, moments before the briefing was scheduled to begin,  you and the administration abruptly, without explanation, canceled it,  leaving Members of Congress and the American people in the dark.\n\nThere are now reports of a leaked classified battle damage assessment…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…sailed into Narragansett Bay in       early 1772, seeking to enforce trade laws that the American       colonists were increasingly flouting. The British ship began       to abruptly board colonial vessels off the coast of Rhode       Island and seize their cargo, such as barrels of smuggled       rum. Accusations soon proliferated that the Gaspee's crew…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…specific role, they were swept up in  the widespread firings, both within the VA and across government, of  all probationary employees. They were one of many veterans fired  abruptly, without cause, without reason.\n\nIn another case, a veteran with 8 years of Active Duty service in the  Air Force was fired from the VA in Michigan after receiving an  ``outstanding''…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…These people are not loyal to  any party or President. They are career civil servants devoted to  serving Americans and answering to the Constitution. And they are being  abruptly and illegally fired from critical positions across the  government.\n\nToday, I will share the stories of four Federal employees with ties  to Illinois who have been terminated…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…months, DOGE, the department of  government evisceration, promoted related lies.\n\nUndermining the delivery of checks and quality service, the Trump  regime, through DOGE, abruptly fired thousands of Social Security  workers, and it continues to enact erratic policy changes. This comes  on top of years of Republican opposition to adequately staffing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…now, working families are watching their access to basic  support services shrink before their eyes. Head Start has seen five of  their regional offices across the country abruptly closed. Medicaid  could face over $800 billion in cuts over the next 10 years. These  lifelines that working families depend on for affordable support  services are rapidly…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699004/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…weeks ago, Omar Huerta Cisneros, a legal resident of the United  States, a green card holder, was going for a walk in the South Side of  Chicago when masked immigrant agents abruptly pulled him into a red car  and drove away. Mr. Huerta Cisneros was detained and disappeared by the  Trump administration simply for walking down the street as a Hispanic…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…sector by  increasing their construction costs with tariffs on critical trading  partners, creating unstable market conditions through careless policy,  in my opinion, and abruptly firing the government workers and domestic  manufacturers who depend on it. This weakens our manufacturing sector  and  hinders our ability to bring good jobs back to the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690161/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…DOGE came in and  tore up most of our foreign assistance organizations.\n\nYes, an individual pled guilty today to a $12,000 bribe. No, that is  not the reason to shut down abruptly and end the process that has gone  on since 1980, by which this organization--which has long enjoyed  bipartisan support--makes grants at a very modest level to dozens of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699438/consolidated-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…history. It was one of the most free, advanced, prosperous, and open  countries in the Middle East just a few decades ago. Then, came the  revolution of 1979, when the progress abruptly ended with the takeover  by the theocratic despots who introduced a reign of terror that has  gone on now for decades.\n\nTwice before, Iranians were on the verge of overthrowing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…foreign adversaries and reorder the entire global mineral market,  positioning the United States at the center and driving our rivals to  the margins.\n\nWhen President Biden abruptly closed off 225,000 acres of Federal  land in the Duluth Complex for mineral development, he threw a future  of American abundance, security, and global leadership into chaos.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, on Thursday afternoon, Democrats abruptly  ended extensive bipartisan work on the GENIUS Act and filibustered the  Senate's attempt to move this bill. Democrats, I should say, who had  voted for the bill in committee,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}]