[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…positioned to lead the transition of our energy  economy in this world than the United States of America. We are the  wealthiest country in the world. We have the biggest and most abundant  supply of fossil fuels and nonfossil fuels. We are less corrupt than  almost any country on the face of the planet, and especially less  corrupt than economies that are dominated…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…within their $6 or $8 or $12 budget.\n\nFinally, people are going to pay hundreds of dollars more per year in  electricity because this bill throttles the cheapest and most abundant  form of energy in wind and solar. And this is where you have got to  stay with me for a moment.\n\nI am very passionate about climate action. I think it is a planetary  emergency.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…help streamline the  non-Federal hydropower licensing process with my colleague from Idaho,  Representative Fulcher.\n\nThis bill will support the proper permitting of clean, abundant, and  affordable energy by allowing Congress, Tribes, resource agencies, and  ratepayers to better track the status of the relicensing process for  new and existing hydropower…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…Now, we all know access to food is a human right. It is that simple.  And we are all fortunate enough to live in the United States of  America, a nation that is rich; it is abundant. A nation that is rich  in agricultural tradition can be abundant in harvest.\n\nNow, in a nation blessed with such abundance, allowing our fellow  Americans to go hungry is,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…colleague from Georgia has the same experience I have in  Colorado, which is to notice that every year it seems like healthcare  actually becomes more scarce in America--less abundant--even though we  are spending all that money. And don't even ask me about mental  healthcare, which our families desperately need in the United States of  America now. And…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…many times they have to construct new ones.\n\nThis is a report--by the way, this is just a report--which I think is  so critical to assessing our plans here to have cheap, abundant,  reliable energy for the United States and the American people.\n\nMadam Speaker, I yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker, on that I demand the yeas…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…courts, they fought it all the way to  the Supreme Court to keep hungry families from receiving food.\n\nAmerica produces the highest quality, safest, most affordable, and  most abundant food, fiber, and medicine anywhere in the world. To that  end, this bill provides many welcome investments.\n\nIt fully funds SNAP and WIC, replenishes the SNAP and WIC contingency…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…the energy sector is roll out  more low-cost, clean energy, not hinder it.\n\nWe have a real shot at meaningful reforms that will cut red tape and  accelerate the build-out of abundant, affordable energy. We can build  more power lines for a more connected and nimble grid, and we can  secure our supply chain of critical grid infrastructure, as well.\n\nThis…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…rather to remind the House that,  right now, in real life, the Trump bogus attack on wind power, for no  good reason, is destroying good American jobs and cutting off an  abundant supply of new energy, which our economy and American  electricity ratepayers desperately need.\n\nFor example, a couple of weeks ago, for the second time, the  administration…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…breeding grounds. They stop along the shores  of our Great Lakes flyway before continuing their journey to Canada and  beyond. They don't have to pay any tariffs.\n\nBirding in our abundant freshwater kingdom draws environmental  stewards from around the globe. Nationwide, 95 million birders generate  over $90 billion annually for our economy.\n\nThe biggest week…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…soon became a bustling lumber center with two sawmills. The  fertile soil produced productive farms of crops and livestock, and  pristine lakes, ponds, and streams supported abundant wildlife. When  the general died in 1805, he was laid to rest with honors in the  village cemetery.\n\nOriginally called Orangetown, after the river that powered the  sawmills,…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…an increased reliance on energy imports.\n\nInstead of new taxes and regulations designed to stifle production,  we should be supporting innovation to maximize the use of our abundant  and affordable oil and gas reserves.\n\nOur energy producers utilize the latest and the greatest technology,  enabling more energy production with the best environmental  stewardship.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Representative  Begich. This resolution overturns the Biden administration's actions to  prevent the great people of Alaska from accessing and responsibly  developing their abundant oil and gas resources on the North Slope.\n\nYet again, these actions were just another part of the Democrat and  President Biden's anywhere but America, any worker but American…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "John Thune", "party": "Republican", "sentence": "…tried to close a  significant portion of it, but when President Trump signs this  resolution and repeals these restrictions, we will once again be able  to leverage these abundant natural resources for the benefit of the  American people.\n\nRegulations have consequences. Democrats may believe there is nothing  that couldn't be improved by a little government…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…adversaries have a choke hold on worldwide mineral  supply chains. Alaska, our 49th State, has rich deposits of 49 out of  the 50 minerals on the critical minerals list.\n\nWith such abundant resources in our own backyard, it should be  appalling to  every American that the United States relies 100 percent on imports for  12 of the 50 critical minerals on the critical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…has  to go through multiple layers of Federal processes.\n\nLastly, the GEO Act addresses the time that it takes to permit  geothermal energy projects. Geothermal energy is abundant in Utah. We  are leading out in a lot of ways on developing new geothermal  resources. Yet, the time it takes to get the permit to build a  geothermal plant is prohibiting…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…driving energy prices out of reach for working families  and driving those working families out of California.\n\nIn 1980, 40 refineries served the California market, producing  abundant gasoline at easily affordable prices. Mr. Latta said 14  refineries were left. His numbers are old. We are now down to  nine refineries, and two more of those, Phillips in…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…support of  H.R. 1949, the Unlocking our Domestic LNG Potential Act, led by my  friend and fellow Texan, Representative Pfluger.\n\nFor years, America has been blessed with abundant natural gas. In  Texas, we have been at the heart of it all. We are the world's number  one producer of oil and natural gas and the top exporter of LNG. That  didn't happen…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…great-grandchildren honor and love her  deeply as she remains faithful to God.\n\nI congratulate Sylvia on reaching this remarkable milestone. May God  continue to pour out His abundant blessings upon her and her family. It  is my honor to serve her in the United States House of Representatives.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…mandate from Washington, House  Republicans are focused on limiting the authority of the Federal  Government, making it easier to build affordable homes and taking  advantage of abundant natural gas reserves beneath our Nation.\n\nImportantly, H.R. 4758 builds on the important work of the Working  Families Tax Cut law by officially putting an end to these egregious…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the  administration's views on this legislation and its commitment to fiscal  responsibility. President Trump's record demonstrates a commitment to  prioritizing unleashing abundant water supplies across the West.\n\nMr. WESTERMAN.  Boebert), the lead sponsor of this legislation.\n\nMr. WESTERMAN. Mr. Speaker, I respect the administration's views on  this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698703/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…will vote on  legislation to improve our domestic energy market and to support  President Trump's agenda on U.S. energy dominance.\n\nIn my home State of Pennsylvania, we have abundant natural gas  reserves. We can utilize this resource that is under the feet of my  constituents to provide tremendous economic benefit to our country and  support the energy…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…can get it to the President's desk so we  can create certainty, so we can start building more processing and  manufacturing here in our country, and so we can utilize these abundant  resources that we have.\n\nMr. Speaker, I have no further requests for speakers.\n\nMr. Speaker, in closing, I will reiterate the fundamental fact of  this debate. In the 21st…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a vital role in preserving  safety, quality, and a standard of excellence for the American grain  industry.\n\nIf we want America to maintain its status as the safest, most  abundant grain supply in the world, reauthorization of this act before  several of its key provisions expire at the end of September is  absolutely essential.\n\nOriginally passed in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…places like Alaska. Additionally, the area  includes incredible oil and gas resources that help to contribute to  America's energy dominance. Further, this region contains abundant  timberlands and substantial sand and gravel material resources that are  essential for roads, airstrips, and other infrastructure. Local access  to these materials allows…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}]