[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…off  our streets, but none of the 614 people arrested during Operation  Midway Blitz has been charged or convicted of murder or rape.\n\nThree, self-dealing. Secretary Noem has abused her power for personal  benefit. She steered a Federal contract to a new firm run by a friend,  her friend. Her propaganda campaign to recruit ICE agents cost  taxpayers $200…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…say to just care about the price of eggs. Care about  the price of healthcare. What is more important than that? American  values are more important. These rich, greedy men abused American  values. They abused what is sacred about this country. They abused what  built this country.\n\nMr. KHANNA. Mr. Speaker, it is time. They are going to have a  reckoning.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696898/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…fact that so many people in power don't want them released  says there is something there that smells.\n\nWhat smells is the fact that children, girls, were raped and sexually  abused. The people who did it don't want it revealed to the American  public.\n\nWe need to be open and transparent. If there are perverts among the  leadership, they need to be exposed,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694814/release-epstein-files"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…people.\n\nIt is being managed, Mr. Speaker, in this GOP tax scam, this  disgusting abomination, this one big, ugly bill. The management of  taxpayer money is being misused and abused to hurt everyday Americans  in order to reward billionaires with massive tax breaks.\n\nThat is a dereliction of duty, the mismanagement of public money. It  is an abuse of the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…could ever be seen as a       ``hostile act,'' what you are doing is not only right, it is       necessary. This is not a partisan issue. It is a human issue.\n\nJeffrey Epstein abused hundreds of women. The United States       Government itself held evidence that he had sexually abused       40 children. Some of us are those children. Any other       American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…for Global Media and  its grantees, and other independent entities.\n\nCritically, this bill includes new transparency and oversight  requirements to close loopholes that were abused by the Trump  administration and to help ensure these funds are used as Congress  intended.\n\nAll told, these five bills we passed reject President Trump's and  House Republicans'…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to change the rules  and allow a reconciliation bill to increase the deficit in the first 10  years. That was the end of pillar one, and the reconciliation process  has been abused in the same way ever since--for the 2001 Bush tax cuts,  the 2003 Bust tax cuts, and the 2017 Trump cuts.\n\nBut pillar two and pillar three were still standing. That is, until…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…cases through approved legal  pathways, seeking a better life for themselves and their families. In  response, we sent them to another country without any due process to be  abused and tortured, and we are paying that government $6 million to do  so.\n\nThese are not deportations, but they are government-enforced  disappearances. They are illegal. They…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690512/trump-immigration-policies"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…office, the President has issued unlawful orders, directed unlawful  deployments, and has unlawfully misused Congressionally appropriated  funds. President Trump has chronically abused his executive authority  as Commander in Chief, and I do not believe that Members of Congress  can divorce our consideration of this NDAA from the context of his  actions in…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Jeffries,      House of Representatives.\n\nTo Speaker Johnson and Leader Jeffries: In 2014, a       Washington, DC resident (name withheld to protect the       victim's privacy) abused his wife with a TASER, repeatedly       shocking her in the face and head. While she was still       suffering the effects of the TASER, he repeatedly hit her in       the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of clemency, commutation, or pardon for  Ghislaine Maxwell.\n\nMr. RASKIN.  Leger Fernandez).\n\nMs. LEGER FERNANDEZ. Mr. Speaker, there were thousands of girls and  young women abused, trafficked, and used by Epstein and the elite and  the powerful who believed they could get away with it.\n\nEpstein told the young victims that he controlled the banks and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…unchecked greed of  multinational corporations but it is immigrants.\n\nIn their 100 days in office, the Trump administration and Noem, the  Secretary of Homeland Security, have abused the power of the Department  of Homeland Security to pursue a campaign of persecution, of mass  incarceration, and of deportation.\n\nDay after day, they have disregarded the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690501/trump-immigration-policies"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Ms. ANSARI. Mr. Speaker, the walls are closing in on Donald Trump and  his rich and powerful friends who either abused or raped children or  who were enabling and complicit in these heinous crimes for decades.\n\nThis vote today matters, but here is the truth: Donald Trump could  direct the Department…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696811/epstein-files-transparency-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…partner called the police. When the police arrived, they actually  found that the immigrant, the person here on a student visa, was not  the abuser but actually probably had been abused. They decided not to  proceed with this. However, because there is a police report, even one  that falsely accused this immigrant, that immigrant was put into  deportation…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…termination of  Federal grants to support court-appointed special advocates, known as  CASA programs.\n\nCASA programs cultivate trained and appointed volunteers who advocate  for abused and neglected children in the courtroom and beyond.\n\nThe children they serve often need to be removed from unsafe homes  and placed in foster care. At a time when they need…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…and not continuing endless wars that  spend trillions of dollars and thousands of American lives. We need to  bring the power back to Congress to ensure that it is not being abused  by anyone within the executive authority, regardless of who is in the  actual seat.\n\nThis is very simple, Mr. Chairman. We have abdicated and abdicated to  where the Article…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…legally. Instead of  rewarding their efforts, they watched for 4 years as a President and an  administration that were asleep at the wheel allowed our immigration  laws to be abused and taken advantage of month after month as millions  jumped the line by coming here illegally. I am so glad that America  overwhelmingly rejected that nonsense.\n\nToday, our…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…continue to allow a broken visa system to have extended family  members be brought into the United States expansively and purposefully.  The H-1B program has been exploited and abused now for years and must  be abolished or massively reformed.\n\nWe obviously still have a very badly broken border that is only  currently being held in check by a President and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…President's party to stand up and resist unconstitutional usurpations  of power. Until that happens, the dangerous precedent of unlimited war- making power will continue to be abused by Presidents of both parties.\n\nI recommend a ``yes'' vote on this resolution.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…dire need of  support. These organizations serve the most vulnerable in our society:  battered spouses, rape survivors, and children, even toddlers who have  been sexually abused and exploited.\n\nAs elected officials, it is our duty to ensure these victims receive  the support, care, and, equally important, the justice they deserve.\n\nTragically, over…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the Donbas remains out of Putin's grasp and Russian forces, already  struggling to take territory, face the ``fortress belt'' of the  region's remaining cities.\n\nPutin has abused his country's manpower advantage by employing a  strategy of attrition with devastating consequences. Russian forces  have suffered 1.2 million casualties in 4 years, and one-third…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…done--ending  eight wars, making the world a safer place not only for Americans but  for so many.\n\nAcross the government, President Trump has also rooted out woke  programs that abused taxpayer dollars under the previous  administration. And we saw a lot of corruption in our institutions.  With these programs, the Biden administration pushed a radical anti-…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…Democratic-sponsored bill that  excoriates the Maduro regime which ``has refused to respect the  overwhelming choice of  the people of Venezuela and subsequently arrested and abused thousands  of innocent citizens of Venezuela, including children, for peaceful  political participation.''\n\nMr. Speaker, consider H. Res. 1471 of the 118th Congress, another…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…populations, for women, children, infants.  Yet, you hear almost protests from the left. Here is a $2.5 billion  fraud in Medicaid in Arizona, where they exploited Tribal members,  abused them, recruited them from our Tribal communities, put them in  sober living homes, and bled the system for money. It took years  because in a system that has the incentive…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Joe Biden.\n\nIt is impossible. Mr. Speaker, it is impossible to see that as  genuine. What I see is a group more focused on scoring political points  and drama than protecting abused children.\n\nMr. Speaker, the record is clear. Under Republicans, far more  information has been released in the last 6 months than was done during  all 4 years of the previous…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that, Mr. Speaker, then the business of  the House grinds to a halt.\n\nThe only times in which I haven't done that are when the form of a  rule, the mechanism of a rule, is abused for some purpose that actually  impacts policy.\n\nThat is what we had in this particular rule. At the end of it, which  was a normal rule for most purposes, but at the very…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…developed anymore, even after Congress had  already said this was the case.\n\nI think what we are doing today is we are exercising our Article I  power where an administration abused it and tried to make rules. The  Government Accountability Office said this bill or this rule is subject  to the Congressional Review Act, so here we are, to right the wrong.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…read a story yesterday that because of tariff policy--by  the way, I support the President using tariff policy to isolate China,  restructure our worldwide trade that is being abused by friend and foe,  but I just read a story yesterday that they are planning on how to bail  out farmers from tariffs.\n\nRemember, 7 years ago, we had to spend $25 billion to…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…child protection, for substance abuse and mental health  treatment, for correction, and for protecting and serving the women who  have been raped and the children who have been abused. He has cut that  funding.\n\nI have spoken to the women who are administering those programs and  who have called me in tears because the children they serve will not be  receiving…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…when it comes to land management. We need to take  back the authority we gave Presidents because they are not using it in  the way Congress intended it to be used. It is being abused, and we  need to end that abuse by exercising our legislative powers.\n\nMs. MALOY. I don't know what the current timeline is, but I know it  has taken years when it should take…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}]