[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…constitutional rights of residents, the  courts, due process, and every check and balance that protects us from  fascist authoritarians.\n\nNo one has been spared from their abusive authoritarian assault, not  United States citizens, children with cancer, not pregnant women, not  fathers with legal residency, not organ donors, not student activists,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690501/trump-immigration-policies"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…adults experiencing abuse or  unhealthy dating situations. The Hotline also runs love is respect, a  program dedicated to engaging, educating and empowering young people  facing abusive or unhealthy relationships.\n\nI also wish to recognize the dedicated advocates who staff the  National Domestic Violence Hotline and its programs. Their work  requires extraordinary…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Alex Padilla could end up here, by  dint of his brilliance and his integrity and his compassion. And all of  that is at risk. All of that is at risk right now if we let the abusive  handling of this good man and so many other good men and women around  the country--if we let this go without our firmest opposition, without  our strongest pushback, without…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Republican State legislators to ignore the will of their voters and  effectively elect representatives through extreme and unabashedly  partisan gerrymandering. This flagrantly abusive redistricting occurred  in States like Texas, representing a top-down campaign directed by  President Trump to eradicate as many congressional districts as  possible that…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…officers fired for misconduct were       subsequently hired by another law enforcement agency.       Weakening the Act would mean turning a blind eye to the       recycling of abusive officers. Databases to keep track of       officer misconduct help law enforcement agencies avoid       unknowingly hiring an officer with documented behavioral       problems.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…forget that healthcare is a matter of life and  death, and the proposed Medicaid cuts are a death sentence for people  like Jessica, who lives in my district.\n\nJessica fled an abusive relationship when she was 25. Then she found  out she was pregnant. Only through Medicaid, Jessica was able to access  prenatal care.\n\nThen, late in her pregnancy, her doctor…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691495/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…most extensions of consumer credit.\n\nThe MLA was enacted on a bipartisan basis in 2006 to rein in payday  and other unscrupulous lenders that targeted American troops with  abusive and predatory loans. Unfortunately, the MLA does not protect  veterans or Gold Star families from these exploitative practices.  Servicemembers and  their families should…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the aisle are very much aware of how he is  encroaching upon the separation of powers, the judiciary, how he is  threatening the Supreme Court, and threatening judges with abusive,  vituperative language. When you are threatening one judge, you are  threatening them all. Let's not kid ourselves. He is doing it.\n\nI am going to share this with you. I…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…betrayal of the rule of law that is the foundation of our  Nation. It should shock America's conscience, and I believe it has, as  it has shocked mine. These kinds of brazen, abusive, lawless tactics do  not represent our Nation. Americans will have a hard time--and they  should--recognizing our great Nation in what they are seeing hour after  hour, day…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that Johnson has that ICE people should be able to wear  masks--police officers don't wear masks all across the country. And if  anyone needs to be identified, it is these abusive thugs who are in the  Border Patrol, who are in ICE.\n\nIf Republicans can't come to the table on these very sensible  changes, then the violence we see happening around the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…against the Trump administration.\n\nIn 2025, roughly a third the federal judiciary has been flooded with  threats, with data showing that these threats spike each time Trump  uses abusive rhetoric against judges.\n\nOn May 2, 2025, Reuters reported that U.S. Supreme Court Justice  Ketanji Brown Jackson addressed President Donald Trump's attacks on the  judiciary.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Maine, Kasey and her children rely on Medicaid  and SNAP to live their lives. The resources and stability provided by  Medicaid and SNAP allowed Kasey to leave her emotionally abusive  husband and support her children.\n\nKasey's 7-year-old son has ADHD and is on the autism spectrum and  relies heavily on individualized support through Medicaid. If Medicaid…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…most desperate migrant  workers and actually facilitating human trafficking.\n\nThe administration's answer? Make it harder to investigate them; make  it harder to kick these abusive recruiters out of the H-2A system; and,  against their own promises, let the trafficking continue.\n\nLet's be clear again. The H-2A program is one of the largest sources  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…calls, text messages, and other communications  from rival mortgage loan officers. They may even give you misleading or  deceptive information.\n\nH.R. 2808 would curtail this abusive practice, limiting trigger lead  notifications to a financial firm that a consumer already has a  relationship with, like their current mortgage lender. If the consumer  opts…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…or any judicial position in this  government.\n\nMr. Bove is the perfect example of the type of person Donald Trump  wants on the bench: political, aggressive, unprofessional, abusive, and  ready and willing to put the Trump agenda over the rule of law. We all  know what Donald Trump wants from judges: complete obeisance of  whatever he wants, regardless…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…exactly that. This bill modernizes Federal criminal law by clearly  criminalizing the coercion or enticement of a minor to engage in self- harm, animal crushing, or other abusive or degrading conduct.\n\nThis legislation closes dangerous gaps in current law and sends an  unmistakable message: Compelling a child to destroy themselves or to  harm others…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…in Executive Order       14062 dated January 26, 2022, and enumerated under section       934 of title 10 (article 134 of the Uniform Code of Military       Justice);\n\n``(3) abusive sexual contact and aggravated sexual contact,       as described in sections 920(c) and 920(d) of title 10       (articles 120(c) and 120(d) of the Uniform Code of Military…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…intentionally compels a minor to--\n\n``(A) engage in self-harm, including suicide or attempted       suicide;\n\n``(B) commit animal crushing (as defined in section 48);\n\n``(C) engage in abusive or degrading nonsexual conduct       (whether or not physical injury results) for which any person       can be charged with a criminal offense; or\n\n``(D) engage in sexually…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…for the  sake of scoring political points.\n\nHouse Republicans are committed to ensuring our programs help the  most vulnerable Americans, slashing wasteful, fraudulent, and abusive  spending, and preventing American families from seeing a $2,200 tax  increase next January. That is what this is all about, and that is what  77 million Americans endorsed…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…they bring up this very subject regularly at my county  meetings.\n\nThere are many reasons for the high cost of prescription drugs. It  could be the lack of competition and abusive practices. It could be  opaque and powerful drug middlemen that we call pharmacy benefit  managers and a lack of transparency on prices.\n\nBy the way, I just mentioned PBMs.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…statistics tell the story. Just looking at the number  of reports of child  sex abuse material online the last year for which we have full data,  the number of images, sexually abusive images online surged to 104  million. Think about that--104 million reported sexually abusive  images. That is up from merely 450,000 as early as 2004. In the space  of 20…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Think  about what my colleagues on the other side are saying today.\n\nThey are saying that American minorities are not capable of showing  an ID to vote. It is an insult. It is abusive. In reality, 76 percent  of Black Americans support voter ID in poll after poll, and 82 percent  of Latino Americans support voter ID in poll after poll.\n\nWhat the left is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…that it is signed into law, is prevent child abuse. That is  what is going on in this country by allowing this. It is going to make  it a felony for anybody to continue this abusive genital mutilation in  this country on minors, on children. It is abhorrent what is being  allowed right now in this country.\n\nA felony, I think, is what is going to be able…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Trump's full legislative agenda. This  Republican majority will not stop fighting until the President's agenda  is in place. That means rooting out wasteful, fraudulent, and abusive  spending. That means responsibly stewarding the American tax dollar and  putting those dollars in places that they can see a return. That means  investing in our national…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to codify effectively what  President Trump is doing: to stop the abuse of parole, to stop the  abuse of asylum, to stop the abuse of catch and release, to stop all of  the abusive ways in which an exploited border can undermine our  security and endanger us.\n\nWe cannot rely on the administration to do it. Congress needs to act.  Congress needs to codify…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Privacy  Protection Act.\n\nThis has been a long journey leading up to today's vote, and I thank  Representative Torres for his unyielding desire to put a stop to the  scourge of abusive mortgage trigger leads.\n\nMr. Speaker, H.R. 2808, the Homebuyers Privacy Protection Act will  literally impact each and every consumer that applies for a mortgage in  this…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…quietly channels billions of Federal dollars into care  for illegal immigration through State Medicaid programs. States like  California and New York are actually the most abusive of this law.  These sanctuary States choose to allow illegal immigrants to receive  State Medicaid programs and then send the bill to Washington, D.C., for  all taxpayers…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…while  strengthening the safety net for those who are the most vulnerable  Americans and our Nation's agriculture community at the same time. It  cuts wasteful, fraudulent, and abusive spending and gets able-bodied  adults back on the ladder of opportunity while giving them a fair shot  at the American Dream.\n\nI am pleased with all we have been able to accomplish…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and others? They are openly and knowingly doing it. Why  wouldn't we fix that?\n\nWhy wouldn't we apply eligibility rules and work requirements,  combined with lowering that abusive Federal match rate subsidizing blue  States to game the system when they are using Federal borrowed money to  prop up their weak State budget? Why wouldn't we fix that?\n\nI…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…permanent fees that illegal immigrants must pay for their  applications so American taxpayers aren't saddled with covering these  costs.\n\nIt protects family farmers.\n\nIt ends abusive financing practices in Medicaid by freezing provider  taxes and prohibiting new provider taxes.\n\nIt reins in the Consumer Financial Protection Bureau, and it rolls  back harmful…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}]