[{"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…traffickers is  both ineffective and unwise, as drug trafficking is fundamentally a law  enforcement matter, not a military one.\n\nThis is yet another instance of Donald Trump wildly abusing our  military, trying to blur the lines between our servicemembers and law  enforcement. We saw it when he sent the National Guard to intimidate  peaceful protesters in Los…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…yet Epstein       was not. Instead, he was shielded by a nonprosecution       agreement that blatantly violated the rights of children, and       he was set free to continue abusing women in this country for       another 9 years before his death.\n\nOur government conspired with him and, in doing so, failed       to protect hundreds of girls who would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Trump that his name appears in the Epstein files.\n\nBut, to be clear, just because a name is listed in the Epstein files  doesn't mean that that person was a collaborator in abusing young  women. There may be lots of names in that file related to just casual  acquaintances or people met on trips. Who knows? But some of those  names in that file may well…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…falling apart here and he was getting urgent calls from  the then-Speaker Kevin McCarthy, when he was hearing from others, he  was going on to tweet against Mike Pence for not abusing the authority  of the Vice President of the United States--by the way, it is not even  authority. It is a ceremonial function to certify the election.\n\nIt was Donald Trump,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…President Trump, Deputy Chief of Staff Miller, and Secretary of  Homeland Security Noem have gone too far, letting their hatred of  immigrants overwhelm them to the point of abusing innocent Americans.\n\nTheir actions pose a threat to all of us. They have disregarded the  rights of citizens and noncitizens alike.\n\nIn just the last few months, DHS has accused…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…friend from Connecticut for  yielding.\n\nDonald Trump is breaking promises left and right to American workers.  His latest target is Revolution Wind. His stop work order is abusing  the definition of national security and hurting hundreds of union  workers in my home State of Rhode Island ready to finish this project  that is 80 percent complete.\n\nWe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695136/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Immigration Due Process\n\nMs. BARRAGAN. Mr. Speaker, as the economy is tanking, costs are going  up, not down. Today, we face a new threat and danger: The Trump  government is abusing its power. The Trump government ignores court  orders, ignores the Constitution, and then lies to try to justify its  actions.\n\nLet's talk about Kilmer Abrego Garcia, a Maryland…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…President doing everything he can to build  unquestioned power over our military and a Republican Party that  refuses to challenge him.\n\nAt a time when the Trump administration is abusing its power,  destroying our standing in the world, deploying troops against our own  people, the annual Defense authorization bill offers an important  opportunity. It is an…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…unmitigated danger to give tax breaks to  Big Oil.\n\nThis Republican bill gives billions more to Immigration and Customs  Enforcement (ICE) when their unidentified, masked agents are abusing  their power with dangerous sweeps that violate due process and create  human and economic destruction. These indiscriminate raids do not make  our communities safer--and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…proceeded to not redact the names of victims, as the law  required. Let us not forget what this entire Epstein scandal is about.  It is about powerful, wealthy men grooming, abusing, and raping young  women and men. That is what it is about.\n\nI cannot understand for the life of me why the Republican leadership  just objected for us to seek enforcement…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…you what Republicans apparently don't care about:  Accountability for predators.\n\nI offered an amendment to disinter Dr. Robert McCormick Browne, a man  accused of sexually abusing dozens of students in Hawaii, from the  National Memorial Cemetery of the Pacific. A predator like that does  not deserve to rest amongst heroes. The Republicans said no.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…warn  of pending major life-threatening events, events like hurricanes and  infectious diseases? Who will want to work for the American people  after this latest attack? Stop abusing us.''\n\nMr. Speaker, I challenge you to explain these cuts to Donna.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691729/federal-employees"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…previous  Democrat and Republican Presidents worked to lower tariffs and to open  up markets. I have voted for many of those trade agreements. But this  President, I believe, is abusing this authority. He calls it an  emergency. He is using the trade wars to supposedly force countries to  do things like changing their border policies.\n\nI believe it is time…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…farms--that they spent a century there, they are next in line to  take it over--drying up. That is what these tariffs are about.\n\nThen, finally, this President cannot keep abusing his power like  this. There is a reason, when you look at the numbers, who supports  this resolution: United Steelworkers, International Association of  Machinists, North…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…the National Guard to our cities  and terrorized hardworking immigrants who are following the rules, all  without warning, charges, or due process.\n\nThis administration is abusing its power to trample on the  Constitution and our civil rights. Federal agents have shot two of my  constituents, one fatally. In the other, when they brought about  charges,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…so that no student feels forced to choose between her  education and her child.\n\nLast week, I also introduced the SAFE KIDS Act to prevent foreign  adversarial nations from abusing the American surrogacy industry to  obtain U.S. citizenship for their children and traffic infants abroad.  Most of the developed world has already banned international commercial…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and ensure due process and that rights are protected? Yes.  Should we? Yes.\n\nI want to remind people these are not American citizens. These are  guests in our home who are abusing that invitation--or noninvitation to  the extent that they were legally here--invitation to the extent they  overstayed a visa, invitation to the extent they were abusing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Communist Party's track record of interference and  aggression toward the American financial system is a serious and  growing threat. The CCP has a well-documented history of abusing  international financial norms, jeopardizing both our national and  economic security in the process.\n\nFrom manipulating currency and distorting markets to propping up  state-owned…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the United States. We know that the previous  administration let in millions of people into the United States,  wrongfully and illegally under parole and asylum, blatantly abusing the  law to put people in the United States that have no basis for being  here, many of whom carried out dangerous acts against American people,  killed American citizens,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…most important of which is to get help to  people who have drug issues and need treatment.\n\nThat was a big part of the initiative, is that people who have repeat  arrests for abusing drugs can be offered treatment as an alternative to  incarceration.\n\nThe Governor is refusing to fund the treatment programs that are  needed.  He is all too willing to continue…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…President Trump has already declared an economic emergency to justify  imposing these tariffs on Mexico and Canada, but my bill with Senator  Kaine would prevent him from abusing long-established national security  authorities to follow through on further tariff threats against our  allies and FTA partners.\n\nThe U.S. Constitution in the Commerce Clause,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…affect all Americans, and Americans should  be the ones who select their leaders.\n\nThis SAVE America Act puts in place safeguards, Mr. Speaker, to  prevent noncitizens from abusing our democratic process. United States  citizens should be the people choosing our elected leaders, not illegal  immigrants.\n\nI am not a drinker. Everybody knows that. But…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700006/veterans-accessibility-advisory-committee-act-of-2025"}]