[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…innovations we could have made but for these cuts.\n\nI want to end by saying that I am pretty sure these firings and cuts  to science and research aren't about waste, fraud, and abuse or  government efficiency. If they were and if this administration actually  cared about efficiency, they would know that funding to science,  technology, and innovation doubles…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…middle-income families. The waste  is the garbage coming out of people's mouths who don't care about  seniors and say things like it is just a complicated Ponzi scheme. It  is abuse by the Federal Government, abuse of people who worked hard  their entire lives to support themselves and paid into a system that  promised to one day support them.\n\nOur seniors…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…any type of action, going back to 1996. Think licenses, permits,  leases, loan agreements, drug approvals. There would be no limit.\n\nNow, we have been safe from this kind of abuse until now because the  Senate has a process in place for the Government Accountability Office  to help the Senate Parliamentarian determine privilege for the purposes  of the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…get to play a game of ``choose your own tax rate.'' I repeat: They can  play a game of ``choose your own tax rate.''\n\nThe Trump policy encourages these giants to set up and abuse  partnerships--layer after layer of redtape solely for the purpose of  dodging taxes. It has nothing to do with creating jobs or launching new  product lines or areas of investment;…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…quickly escalate into a conflict  that  could destabilize the Western Hemisphere and would put the lives of  American troops on the line.\n\nI rise because as we see this President abuse the fundamental trust  and purpose of our powerful military both abroad and here at home in  our own cities, it is imperative that we push back against his  relentless lawlessness.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…support of the American people, this kind of anti- democratic conduct.\n\nI will close simply by saying this: This has to change. Peaceful  Americans cannot have this kind of abuse rained down on them for the  next 3\\1/2\\ years. It has to end now.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692429/alex-padilla"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…the information regarding the  criminal activities of Jeffrey Epstein and all who enabled, all who  knew and did nothing, and all who participated in some of the worst  sexual abuse and trafficking crimes our country has experienced.\n\nThis will expose the rich, the powerful, and the self-entitled who  were involved in these crimes and who did it for the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696954/release-of-epstein-files"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…serious about  eliminating waste, you wouldn't have fired the inspectors general of  these Agencies, who are the watchdogs. They have records of eliminating  waste, fraud, and abuse.\n\nExhibit A is Michael Missal, the inspector general of the VA, hired  and appointed first by President Obama. He served under President Trump  for 4 years and then under President…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…names Kilmar Abrego Garcia and Andry  Hernandez Romero. We have spoken of students taken off streets, court  orders cast aside, and a supermax prison that now holds victims of  abuse.\n\nThese are not isolated incidents. They are evidence of a pattern, a  government operating outside the law, outside the Constitution, outside  the decision of a Supreme Court…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…result  of unchecked power and a complete lack of accountability.\n\nLast night, I offered commonsense amendments to impose basic  constitutional guardrails: accountability for abuse, due process  protections, and civil recourse when rights are violated. Republicans  refused to even consider them.\n\nWithout these amendments, this bill gives DHS and ICE free…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699309/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…if their job actually depends on tips.  That is why the law says workers must regularly earn tips before an  employer can pay a subminimum wage.\n\nThat rule exists to prevent abuse. H.R. 2312, the so-called Tipped  Employee Protection Act, tears down that protection. Under this bill,  an employer could say that you earned a tip once this week, so every…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698970/tipped-employee-protection-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…at the highest levels of power, including in  the White House, have generated hundreds of billions of dollars in  personal profit.\n\nWe need legislation that stops financial abuse, not encourages it,  especially during a time when the SEC has dropped enforcement actions  against major crypto firms and undermined investor safety.\n\nAcross our country,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693786/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…better than the doctors do. We know better than the medical  associations do, and we know better than all of the States do.\n\nMadam Speaker, I think that would be an absurd abuse of our power  and, as the gentleman from Texas (Mr. Roy) has been saying, a very  questionable deployment of Federal power, given the fact that the  United States Congress…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…independence from the administration.\n\nTurning to the specifics, the bill lacks adequate reporting  mechanisms to identify who is making the submissions, leaving it  vulnerable to abuse and unable to differentiate between a small  business, trade organization, or law firm. The bill focuses on the  costs of regulations, not the benefits, which greatly outweigh…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…power to vilify them.\n\nThe United States was built by people who came to this country to  seek a better life for themselves and their families. This thoughtless  decision is an abuse of power and just one more example of how the  Trump administration is scapegoating immigrants.\n\nToday, during Immigrant Heritage Month, I am, once again, calling on  USCIS…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…approximately 11 percent from the year prior.\n\nThe Senior Security Act is designed to reinforce and enhance our  safeguards protecting senior investors from financial fraud and abuse.\n\nH.R. 1469 creates the senior investor task force within the  Securities and Exchange Commission which is tasked with reporting on  industry trends and challenges impacting…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Mr. HARRIS of Maryland. Mr. Speaker, this week, the Energy and  Commerce Committee finally attacked fraud, waste, and abuse in the  Medicaid system.\n\nI think every American knows that when government runs a program,  there is fraud, waste, and abuse, and that is exactly what the  Committee dealt…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691335/eliminating-fraud-waste-and-abuse-in-medicaid"}, {"senator": "John Rose", "party": "Republican", "sentence": "…President  Biden, our borders are finally under control. After 4 years of deficit  spending, we are grateful to have a Chief Executive who is willing to  cut waste, fraud, and abuse on behalf of the American taxpayer. Indeed,  what we have witnessed over the last 100 days is a real master class in  the art of following through.\n\nIf elected again, President…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "French Hill", "party": "Republican", "sentence": "…insurance funds       of the Federal Housing Agency;\n\n``(4) oversight by the Department of grantees and       subgrantees for purposes of preventing waste, fraud, and       abuse;\n\n``(5) the progress made by the Federal Government in ending       the affordable housing and homelessness crises;\n\n``(6) the capacity of the Department to deliver on its…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Congressional District being family farms, this demonstrates how close  to home this issue hits my district.\n\nWith the devastatingly high rate of mental health challenges and  substance abuse issues across our country, where a person lives  shouldn't dictate their ability to access critical healthcare services.\n\nTragically, Ohio's Second Congressional District has…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…legislation called the PAUSE Act to pause  immigration and to pause it until we get our hands around all of the  problems that are currently plaguing our immigration system: the abuse  of birthright citizenship, to have profit-centered ways to create  American citizens, by people coming here, coming across the Rio Grande,  having children, making citizens…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…any contract in excess of $1  million, reducing the amount that was previously required to be  reported from $4 million to $1 million.\n\nAs we look to prevent waste, fraud, and abuse, this legislation has  increased transparency requirements to ensure maximum accountability to  the American people.\n\nAgain, I thank Mr. Thanedar for his work on this important…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…support in both the 117th and 118th Congresses. I look  forward to seeing the Senate take swift action on this bill, which  supports President Trump's agenda to root out fraud and abuse.\n\nMr. Speaker, I urge my colleagues to support H.R. 1804, and I reserve  the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support  this…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the mind-boggling discretionary  waste that we will be slashing in foreign funding:\n\n$158 million from the Lebanon peacekeeping mission which has been  fraught with waste and abuse as evidenced by its abject failure to  contain Hezbollah;\n\n$3 million for an Iraqi Sesame Street;\n\n$833,000 for services for transgender people, sex workers, and their  clients…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…specialist position the purpose of       which is the integrated primary prevention of harmful       behavior, including suicide, sexual assault, harassment,       domestic abuse, and child abuse.\n\n``(5) Any special agent position of the Coast Guard       Investigative Service.\n\n``(6) The following positions at the Coast Guard Academy:\n\n``(A) Any civilian…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…people this way: It is not like on TV in  the crime shows.\n\nWhen the victim is an 8-year-old child or a 7-year-old child, and  when what happened to them was some form of sexual abuse, the odds are  about 90-10 that the offender is somebody that the child knew and  trusted.\n\nIt is rare that it is a stranger offense with little kids. That is  because that…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…take a firm stand against totalitarian regimes.\n\nThe CCP asserts its control over the Uyghur people through threats,  intimidation, confinement, and physical and emotional abuse. Failing to  confront China empowers gross human rights abuses and allows for the  spread of such atrocities to be determined by the CCP.\n\nOur legislation will ensure that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…public affairs, multimedia production, space and missile  operations, communications, and emergency medical care. His extensive  professional training included the Substance Abuse Program Prevention  Course, Digital Multimedia Course, Instructor Training Course, Public  Affairs Course, Combat Lifesaver Course, NBC Defense Course, Joint  Tactical Ground…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…are sick and tired of this  wasteful spending.\n\nWith Republicans in control of the House, Senate, and White House, we  have a real opportunity to cut through the waste, fraud, abuse, and  falsehoods in Washington.\n\nReconciliation provides us with a chance to address Washington's  spending problem.\n\nUnder the new Trump administration, we can cut spending,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, today, 20 of my colleagues and I will  introduce legislation to stop the abuse of universal injunctions that  we are seeing all across the country--all of this to stop the Trump  agenda.\n\nUniversal injunctions violate the words of the Constitution that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689309/statements-on-introduced-bills-and-joint-resolutions"}]