[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…am writing to       share my deep concern about the potential loss of the health       insurance exchange and the premium tax credits.\n\nFor business owners like me, the ACA marketplace (the       exchange) is often the only way to get affordable health       coverage. The tax credits are not just a small help--they are       essential. Without them,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…and thus cut families who need the assistance to  cover insurance to get the coverage they deserve. The result will be  that Medicaid is stripped away. Coverage in the ACA marketplace will  become more unaffordable, and premiums for even employer-based  insurance will go up. But that is what happens when you take dollars  out of the system. In fact,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…undermining the Affordable Care Act and  raising costs.\n\nAnd this just isn't happening in my State. As I know, three-quarters  of the people who get their health coverage on this ACA Marketplace  live in States that President Trump won. We know the stakes, and we  must come together to solve this affordability crisis. And I will note  that the amount of money…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Instead, many will be forced to go without health insurance, which  raises the costs for everyone.\n\nVery bluntly, these rates will not just impact people enrolled in the  ACA marketplace. If Republicans have their way, the entire healthcare  system will feel the effects, and every individual trying to receive  care, regardless of what kind of insurance…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…majority claims to champion.\n\nAs she told me, Rachel's business depends on the tax credits. Her tea  shop is not an exception. It is the norm. Nearly half of all adults  with ACA marketplace coverage are small business owners, small business  employees, or self-employed. In many cases, the Affordable Care Act and  the enhanced premium tax credits have given…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…coverage  easier and more affordable. We lowered premiums by an average of $800  per person.\n\nIn over 4 years, nearly 12 million more Americans signed up for  insurance in the ACA marketplace, bringing the total up to nearly 24  million in 2025.\n\nTaken together, Democratic policies brought the uninsured rate to a  record low.\n\nMr. Speaker, I don't know if we…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…see an even bigger price hike than  those who are in private insurance, especially if they are one of the  half million Michiganders who get their coverage through the ACA  marketplace or ObamaCare. Open season is this November 1. They are  going to start to feel that pain immediately. We are hearing stories of  people who are going to get a 79-percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Republicans to join the Democrats for that to happen. It  has to be bipartisan.\n\nAs a result of the enhanced premium tax credits, the number of  Americans covered in the ACA marketplace plans has increased from 11  million in the year 2020 to 24 million this year, including my waitress  friend at Lou Mitchell's.\n\nIn Florida, the number of residents with…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…inaction allowed these tax credits to expire  on December 31 because they don't care about regular people.\n\nThe consequences were immediate. For many families in Arizona, ACA  marketplace premiums have already more than doubled as a result of  Republican negligence. That means parents are skipping doctors'  appointments for their babies, seniors are reconsidering…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…ACA is not a       political talking point, it is the wall between a bearable,       if difficult, life and complete financial and medical ruin. I       relied on the ACA's Marketplace for my health coverage, the       only way I could secure a policy that didn't deny me for my       age, that capped my out-of-pocket costs, and that allowed me…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…adults, and workers in every CBC district could afford quality  healthcare.\n\nIn our districts, we have heard from countless constituents who  receive their healthcare on the ACA marketplace who are now worried  about the cost of their healthcare going up.\n\nOne of my constituents, Lilah Wilson, a small business owner who  depends on the ACA marketplace said:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…15,000 people in my district will lose their healthcare  altogether because of Republicans' refusal to extend the tax credits.  Small businesses make up 48 percent of the ACA marketplace consumers.\n\nI have heard colleagues on both sides of the aisle talk about how it  is the small business owners who are the economic engines that make  this America work.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…affordable for you because  otherwise you won't be able to buy insurance through the ACA. In fact,  90 percent of all people in Connecticut who buy insurance through the  ACA marketplace receive some kind of subsidy, and their insurance  premiums will skyrocket by 75 percent if that subsidy is ended. They  need to know now, when open enrollment starts,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…impact it has on American people, let  us not forget how people get drug treatment. It is from the Medicaid  program that has already been cut by a trillion dollars and the ACA  marketplace health plans.\n\nThe Republicans' failure to act is literally going to kill people  across this country. They let deadlines pass, premiums rise, and  coverage disappear.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…there is no plan in sight to replace it and to help families afford  health insurance. Allowing these tax credits to expire is going to harm  the record enrollment in the ACA Marketplace that so many people have  worked so hard to achieve, and this past year there has been record  enrollment in the ACA.\n\nNow, what does it mean for Americans if we allow…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…fraud,  waste, and abuse.\n\nMr. Speaker, I recently had a constituent write to me, outlining her  and her husband's experience, demonstrating systematic fraud within the  ACA marketplace. Her husband has been repeatedly enrolled in an ACA  plan without consent since November 2023 in a scheme where brokers and  agents are fraudulently enrolling individuals…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…government-run  healthcare programs.\n\nJust last week, the Congressional Budget Office found that the One  Big Beautiful Bill Act removes 2.1 billion ineligible individuals from  the ACA marketplace coverage, with 1.2 million of those being  unauthorized immigrants or noncitizens.\n\nCBO also found that 5.3 million able-bodied, unemployed adults  covered by Medicaid…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…their political will accomplished.\n\nRepublicans already voted to deliver lower premiums for patients by  passing H.R. 1, which targeted waste, fraud, and abuse across the ACA  marketplace. Democrats unanimously opposed this bill, showing once  again they are not serious about solving affordability problems for  everyday Americans, just like they are not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…health insurance companies, all while they are receiving record  profits.\n\nThis incentivizes bad actors to manipulate individuals to sign up for  coverage through the ACA marketplace, oftentimes without people even  realizing that they had been enrolled.\n\nThis is government waste, fraud, and abuse at its worst, and I am  proud the House Republicans…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…into the pockets of Americans and will help lower the cost  of healthcare as well as childcare.\n\nThanks to the Working Families Tax Cut Act, all Bronze and  Catastrophic ACA Marketplace plans are now considered high-deductible  plans, allowing more people to contribute to health savings accounts.\n\nHealth savings accounts can now be used to pay for direct…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…bad, Mr. Speaker, that, according to a 2025 article  by the Kaiser Family Foundation, 12 States, including my own State of  New Jersey, absolutely require all plans on the ACA marketplace to  cover abortion on demand. We permit abortion until birth in my State,  as do many others. That is all covered by ObamaCare.\n\nThe House has passed my bill, the No Taxpayer…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]