[{"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, 1 week ago today, Republicans allowed the  ACA premium tax credits to expire after telling us there was no money  to do so.\n\nHealthcare premiums have soared, and millions of Americans will lose  their healthcare coverage because…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698585/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Beautiful Bill, the ``Big Blatant  Betrayal'' that failed to extend those healthcare subsidies--and insist  that whatever bill that is passed be obeyed by the President.\n\nThe ACA premium tax credits have protected millions of Americans from  those higher healthcare costs, and they have reduced the numbers of  Americans without health insurance coverage.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…your  back. They have no choice. They have to stay open, and they have to  cover their costs.\n\nTo make matters worse, my Republican colleagues refuse to extend the  ACA enhanced premium tax credits. And 112,000 people in Connecticut  rely on these credits to lower their monthly premiums. They are a  lifesaver. They are a lifeline to health insurance…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "Mr. SCHNEIDER. Mr. Speaker, I rise today to strongly and proudly  support Leader Jeffries' discharge petition to extend the ACA premium  subsidies.\n\nJust 8 days ago, President Trump and the Republican Congress let the  ACA subsidies expire. Consequently, rather than working on their new  year's resolution,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698793/breaking-the-gridlock-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…their health care.  Which is why I am today with my colleagues. So we can lift up these  voices as we work to help bring them relief and pass legislation to  extend those ACA premium tax credits.\n\nMr. Speaker, I rise today to stand in the gap for my constituent  Wesley and his family from Milwaukee. Like millions of Americans,  Wesley and his family…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump and for Republicans when it  comes to our Nation's healthcare crisis. On Thursday, the Senate will  vote on the Democrats' bill for a clean, 3-year extension of the ACA  premium tax credits.\n\nThe question Republicans face this week is very simple: Will they  support our bill and lower people's premiums or will they block our  bill and send premiums…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Across the country, we are already seeing hospitals, nursing homes,  and clinics that serve our communities closing their doors, and now  Republicans' refusal to extend ACA premium tax credits is driving up  costs and pushing coverage out of reach for many in our communities.\n\nThe CBC and House Democrats stood united for more than 40 days to  prevent…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…course, is healthcare. It is now January 5, 2026. For tens of millions  of people, the reality of sky-high premiums has now been locked in,  thanks to Republicans who let the ACA premium tax credits expire last  year. Millions more no longer have healthcare at all. Many others have  switched to lower quality plans and can no longer see the doctors they…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…conviction.\n\nTrump said he would improve the Affordable Care Act, yet he just  signed a bill into law that cuts over $1 trillion from healthcare and  will cause an average ACA premium increase of over $1,200 for people in  our district.\n\nAmidst the chaos, the inaction, and the harm that is being caused in  communities nationwide, Democrats will continue…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694040/trump-administration-chaos"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Connecticut,  health insurance rates for 2026 have increased by nearly 18 percent,  the largest increase in the last 6 years. Without the subsidies,  consumers with ACA coverage will see premium increases in the range of  75 percent.\n\nI have visited with hospitals, community health centers, physicians,  and many more who have raised their deep concerns…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…day, is just going to--as we have seen  already--is going to increase healthcare costs for everybody.\n\nWe know that at the end of last year, as the expiration of the ACA  enhanced premium tax credits approached, Democrats in Congress worked  hard to try to extend them. We put forward a strong, compromised  proposal to extend the credits and keep health…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…petition in the House got the  necessary 218 signatures to move forward.\n\nIt shows that the demand by the American people for Congress--the  House and the Senate--to extend the ACA premium tax credits is  undeniable. Yet Republican leaders inside the House and the Senate are  making it clear that they are opposed and will be responsible for  healthcare costs…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Mr. Neal for the time.\n\nMr. Speaker, time is up. The ACA tax credits are expiring December  31.\n\nThe ACA premium tax credits have provided healthcare access for 15  years to over 20 million people who were previously uninsured. The ACA  has saved lives, but time is up. America can't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698372/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…providers provide treatment, but then  they have to charge that off to somebody, and it tends to get charged  off to people who have health insurance.\n\nSo the combined effect of ACA premium support going away and a whole  lot of free care that has to be paid for by somebody causes insurance  rates to increase. This is happening in Virginia, and it is happening…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…take action to lower the cost of  healthcare. In a few hours, I will come to the floor to seek unanimous  passage of legislation passed by the House last week to extend ACA  premium tax credits for 3 years.\n\nSenate Democrats unanimously supported extending these credits last  year. Some Republicans even joined us. But Leader Thune led the way to  block…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…businesses from being  financially ruined by catastrophic health claims.\n\nIt stabilizes premiums responsibly. We responsibly fund cost-sharing  reduction payments, lowering ACA premium costs for all in the  marketplace by 11 percent. This policy alone results in an average  premium savings of $900 nationally, while reducing Federal spending,  saving taxpayers…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698401/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…from taxpayers. The rest of this right here is getting  subsidized.\n\nI will show a chart in a moment where 41 percent of this population  that is being subsidized in the ACA had no premium at all. You as a  taxpayers bought their healthcare. Is that really what the Democrats  promised us? Does anyone remember President Obama saying that  healthcare premiums…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}]