[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…have excelled across a wide range of fields, whether through  giving back with the Captains Outreach, winning gold at the track-and- field championships, or demonstrating academic excellence. They truly  have been an impressive graduating class.\n\nThis class has left its mark on Loudoun County High School. I look  forward to seeing all that the graduates…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…authoritarian regime taking hold of  this country, are the attacks on our universities. We see this in  Hungary and elsewhere. When rulers start to attack the independence,  the academic freedom of our universities, it is a sure sign of a  democracy in trouble. When a President tries to dictate by withholding  Federal funds--the lifeblood of research universities--and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…this country, not only in my district,  who are getting hurt thanks to Republican cuts. The funding freeze is  not just killing the crops at Common Ground, but it is killing academic  futures, new ideas for education, and opportunities for young people in  this country. This is what Republicans are trying to do by distracting  us with their censures.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688499/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…competitive grant program to  support the conservation and recovery of these species. This grant  program will provide vital funding to local organizations, government  entities and academic institutions to develop and implement science- based, coordinated conservation strategies that protect Hawaii's native  species. This includes efforts to prevent the spread…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…saying he  is about impeachment and other things? Freedom of expression and the  rule of law are under attack. Government has been weaponized against  the free press, against academic and judicial independence, against  anyone who might disagree with Donald Trump.\n\nDonald Trump doesn't want to be President of a democratic republic.  He has said he wants…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…their structure that can do this.\n\nThis is a completely unreasonable expectation of universities, and  that is because the real goal of the legislation is to completely sever  academic relations with institutions in China.\n\nEnding study abroad programs, student exchanges, and every research  agreement will do nothing to make America safer. In fact, the only…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Congress-Bundestag Youth Exchange (CBYX) Program.\n\nLaunched in 1983, CBYX selects high achieving youth from both Germany  and the United States to live in each other's country for one academic  year. During their year abroad, students will foster meaningful  relationships between America and Germany, while giving participants  new perspectives on peoples and cultures…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693200/recognizing-emiko-mukai"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…stands as the first       intercollegiate Greek-letter fraternity established for       African American men, committed to developing leaders,       promoting brotherhood and academic excellence, and providing       service and advocacy for communities nationwide; and\n\nWhereas, the mission of the fraternity is to stimulate the       ambition of its members…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, I rise today to recognize  and commend an outstanding Mississippian, Mr. Casey D. Younger, Sr.,  for his exemplary academic achievements, athletic excellence,  professional success, and recent induction into the Millsaps College  Athletics Hall of Fame.\n\nA native of Vicksburg, Mississippi, Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…research, and service mission. It has  conferred more than 9,000 degrees in social work and nonprofit  management and leadership while strengthening the University of  Georgia's academic excellence by preparing culturally responsive  practitioners and scholars to be leaders in addressing social problems  and promoting social justice, locally and globally,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Defiance College.\n\nWhereas, Defiance College, founded in 1850 as Defiance Female  Seminary, has served as a beacon of higher education for 175 years,  fostering a tradition of academic excellence, service, and leadership;  and\n\nWhereas, the institution has remained steadfast in its commitment to  scholarship, social responsibility, and inclusion, evolving…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…every single day. With two decades in  the profession and 7 years serving Lodi students, Melanie's lessons  encourage critical thinking and creativity.\n\nShe also pioneered an academic yearbook course allowing students to  design, write, and produce the school's yearbook, building  collaboration and pride in their work. Colleagues praise her  exceptional…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…SNAP benefits in school have higher graduation rates.  Access to healthy foods helps develop memory, social skills, and  emotional stability. All of these are critical to academic success.\n\nA quality education is the key to opportunity. It empowers our SNAP  recipients to lift themselves out of the cycle of poverty.\n\nUnder these Republican cuts, Maryland…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…is why I am proud to cosponsor the ANCHOR Act, which directs the  National Science Foundation to develop a plan to upgrade cybersecurity  and communications across the U.S. academic research fleet, including  the Sharp. This is because a secure country relies on secure labs, even  the ones at sea.\n\nProtecting the Sharp and our entire academic research…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…stands ready to support this effort, and over 83,000 veterans in the  northwest quadrant of Ohio deserve the convenience of access to the  State of Ohio's medical center and academic center at Toledo.\n\nIn Toledo, to level funding in this account will not allow us to grow  and fully support the needs of all of our veterans.\n\nMr. Chair, I urge my colleagues…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Kennedy, Jr., has  also voiced support for returning whole milk to school cafeterias. He  recognizes its value as a nutrient-rich option that supports child  development and academic success.\n\nMilk provides 13 essential nutrients, including calcium, vitamin D,  and potassium. These nutrients support bone health, immune function,  and long-term well-being.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…remarkable students for achieving a  national distinction in international education.\n\nUGA now ranks second in the Nation for the prestigious Boren Awards,  a testament to its academic excellence in global engagement.\n\nThese awards help support students who are studying languages and  cultures critical to national security and U.S. interests. In 2025,  seven…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…students who were, on average, at a fourth or fifth  grade reading level when they came to my classroom, but I had a  tremendous experience. My students achieved significant academic gains  as part of my classes. I chaired the English Department while I was  there. I even started an award-winning speech and debate program that  provided opportunities to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…acquire  critical American research and intellectual property. We have seen a  troubling pattern of intellectual property theft, economic espionage,  and illicit influence over academic institutions. These efforts are not  just limited to the economic realm. They are a matter of national  security.\n\nThe United States Research Protection Act updates and clarifies…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…The dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten our national security, compromise our  geopolitical interests, and erode our academic freedom.\n\nAmerican schools are not for sale, and they are for education, not  espionage. We cannot allow our students, the future of our great  Nation, to be corrupted by…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…for her nomination.\n\nMs. Taibleson is highly qualified. She will be serving on the Seventh  Circuit. Her resume speaks for itself. She attended top schools and  demonstrated academic excellence. She clerked for two Supreme Court  Justices--Justice Scalia and now-Justice Kavanaugh when he was on the  DC Circuit.\n\nShe has extensive experience in both private…", "date": "2025-10-27", "source_url": "https://justfacts.votesmart.org/public-statement/1696407/nomination-of-rebecca-l-taibleson"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…many, it was someone who believed in us before we believed in  ourselves. Teachers inspire curiosity, nurture dreams, and help  students persevere through challenges, both academic and personal.  Their work is vital, and their influence extends beyond the classroom.\n\nThis year, Pennsylvania has special reason to celebrate. Ashlie  Crosson, an English…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690925/recognizing-ahslie-crosson-during-national-teacher-appreciation-week"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Speaker, today we recognize the achievements of  several students from my district who accepted their appointment to the  service academies.\n\nThese students demonstrate not just academic achievement but also  strong devotion to our country. Young students like these will become  our Nation's leaders in the future.\n\nIt was my honor to call these students this…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689824/congratulating-floridas-eighth-districts-student-accomplishments"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…initially conveyed to the school by  the Bureau of Land Management back in 1968. At that time, the  university requested land on the Fort Douglas Military Reservation for  academic and research use, a request approved and granted by the BLM.  Since then, the university has built a nationally recognized research  park housing over 50 companies and employing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698134/university-of-utah-research-park-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…important are the contributions of Turkish Americans to our  society. Turkish Americans enrich our communities through their  entrepreneurial spirit, cultural traditions, academic and scientific  achievements, and civic engagement. Their success reflects the shared  values of opportunity and perseverance that define both our nations.\n\nMr. Speaker, as…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…children.\n\nHe graduated first in his class from Notre Dame Law School, where he  received the law school's highest honor, awarded to the student with  the most distinguished academic record.\n\nHe then clerked for Judge Paul Kelly of the U.S. Court of Appeals for  the Tenth Circuit.\n\nIn 2009, Josh joined the very well respected law firm Pierce Atwood  in…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…students with the tools they need to succeed in their personal and  professional lives. Hanford Christian School pushes students in and out  of the classroom to reach their academic potential, through a  challenging curriculum, Christ-centered teaching, and hands-on learning  experiences.\n\nThe students, faculty, and families at Hanford Christian are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698331/recognizing-hanford-christian-school"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…necessary safeguard: If a  school chooses to host a CCP-funded Confucius program, then it should  not receive Federal taxpayer dollars. It is as simple as that. This  bill upholds academic integrity, protects parents' rights over their  child's schooling, counters communist propaganda, and strengthens our  national security.\n\nThe CCP is playing the long game:…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697527/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…creativity and determination for success are truly inspiring. I  know both Ishan and Rikhin have bright futures ahead. I wish them  continued success as they pursue their academic and professional goals.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699627/recognizing-congressional-app-challenge-winners-for-indianas-third-district"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…addressed cybersecurity vulnerabilities (including       vulnerabilities the exploitation of which could lead to       surveillance conducted by adversaries) identified by academic       and independent researchers, multistakeholder standards and       technical organizations, industry experts, and Federal       agencies, including in relevant reports…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}]