[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…amazing teachers  to thank for that.\n\nWe need to make sure our teachers are being paid what they are worth,  have the support they need in the classroom, and have access to all the  resources they need to do their jobs.\n\nHappy National Teacher Appreciation Day to all the teachers out  there.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690753/national-teacher-appreciation-day"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…for Nonprofit Organizations; and a Center on Human  Trafficking Research and Outreach, each of which has worked to address  practices and policies which affect equal access to resources,  international human and civil rights, and the well-being of all  populations. It was the first school in Georgia to offer bachelor's,  doctorate, and part-time master's…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…science to find cures to our most challenging diseases.  They make sure that our veterans receive the benefits that they so  richly deserve and that our seniors have access to resources that they  set aside for the future.\n\nOur civil servants do so much to boost our quality of life, and do  you know what? This administration doesn't care. For the first…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…announcing at the height of the government shutdown  in October that it would fire nearly all of the staff responsible for  ensuring that students with disabilities have access to resources and  support services.\n\nCan you imagine? It is not just reckless, it is not just illegal. It  is heartless, and it is disgusting.\n\nPiled onto continuing cuts and threats…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698935/protecting-education-for-children-with-disabilities"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…oversight, and helping close regulatory blind  spots that have allowed unauthorized facilities to operate undetected.  We hope this will ensure local communities have the access and the  resources necessary when a biological threat emerges.\n\nToo often, local officials are asking: Who do we call? Who has the  authority? Who has the expertise? Our legislation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…the office to host webinars and outreach  events.\n\nWith clear lines of communication and the outreach that will come  from the office, small businesses will be able to access resources that  should be readily available to them.\n\nI will, once again, thank Ms. Goodlander, Mr. Wied, and Mr. Golden  for their bipartisan efforts on behalf of America's rural…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697282/office-of-rural-affairs-enhancement-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…and bad  policy.\n\nMadam Speaker, I stand ready to work with all of my colleagues to  ensure that children and survivors in northwest Indiana and across our  Nation have access to resources and trusted advocates they need to lead  their best lives.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690872/supporting-casa"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…system would face a $2.4 billion shortfall; and we would lose  $2,000 in spending for each student. Our most vulnerable students with  special needs would be unable to access the resources they need to  succeed, and low-income students would go hungry.\n\nEducation has always been a great equalizer and an engine for  socioeconomic mobility. Without the Department…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689187/gutting-the-department-of-education"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to that era when a  powerful nation would station its gunships off the coast of another  nation in order to compel them to do what we wanted to enable us to  have access to their resources, to force them to enable our  corporations to take over their economy. It is a deeply powerfully  resented strategy for nations to say: Hey, that militarily powerful…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…are entitled to and that cases of neglect and  abuse were duly prosecuted.\n\nWith the Department of Education fragmented, teachers and  administrators won't be able to access the resources they need; parents  will be unable to get the proper support; and the  students will be the ones who pay the price.\n\nWhat is clear is that the Department of Education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…vital role in promoting  small business participation; however, over the years the SBA's  outdated and inefficient IT systems have made it harder for  entrepreneurs to access the resources they need.\n\nAfter repeated unsuccessful attempts to develop and deploy a platform  that would be a one-stop-shop for contracting certifications, the  committee requested…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697272/sba-it-modernization-reporting-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…gynecologic cancer care  coordinators to assist veterans in navigating all of these aspects of  their treatment. These trained professionals help ensure that patients  can access resources available to them and that their providers are  always updated on the patients' latest health updates.\n\nVeterans deserve compassionate, well-coordinated care when dealing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695419/women-veterans-cancer-care-coordination-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…hiring needs of such businesses;\n\n``(X) providing information to career and technical       education programs about how students and graduates of such       programs can access resources and services of small business       development centers to start and expand a small business       concern; and\n\n``(Y) as appropriate, connecting small businesses with…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…lobby.\n\nWhen the Powder River Basin turns off, so does America.\n\nEnergy security is national security. The Biden administration's RMPA  undermines both. By restricting access to our own resources, it pushes  America toward greater dependence on foreign nations, including our  adversaries.\n\nI applaud Congressman Downing of Montana for introducing this joint…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…expand and ensure better  access to these lifesaving drugs.\n\nI lost my 16-year-old cousin to a drug overdose. It is incredibly  important to me that we are not limiting access to these resources.\n\nBy adjusting current regulations and language, we are protecting our  children, our families, and our communities. I encourage my colleagues  on both sides of the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691881/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…NPR-A and required five lease sales  to be held in the area over the next 10 years.\n\nTo ensure our energy independence, we must unleash American energy  and ensure access to our own resources here at home. This legislation  is an important step in doing just that.\n\nI thank Representative Begich and Senator Sullivan for their work to  bring S.J. Res. 80…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…identified that China could exploit Taiwan's  financial system by raising tariffs, short-selling stocks, and freezing  bank transfers. Joining the IMF would allow Taiwan to access resources  that promote financial resilience and deter China's economic coercion.\n\nIt has been the longstanding U.S. policy toward Taiwan to support its  membership in international…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…pretty serious, but we have to ask, who are these 10 million people?  Are they elderly grandmothers? Are they disabled citizens? Are they  children? people who have no access to other resources? In fact, they  are not. And I have no doubt that my colleagues will argue that they  are in the coming months. In the coming months, ahead of the midterm  elections,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…entrepreneurial spirit. Yet,  many roadblocks make entrepreneurship unnecessarily difficult.\n\nThese individuals don't lack talent, but they lack access. That is  access to capital, access to resources, and the support needed to turn  their ideas into successful businesses.\n\nThe Entrepreneurs with Disabilities Reporting Act ensures that we  take a hard look at the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691757/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…intelligence  and data centers are coming online, our need for affordable, reliable  energy is only growing. It makes no sense for the Federal Government to  restrict access to the very resources needed to power our economy.\n\nIn North Dakota, BLM manages 58,000 acres of surface land and about  4.1 million acres of subsurface minerals. Federal minerals are…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…entrepreneurs with a       disability;\n\n(5) any deficiencies in the resources and support described       under paragraph (2);\n\n(6) a description of the use of, and access to, resources       of the Administration by entrepreneurs with a disability; and\n\n(7) any recommendations for legislative actions that are       necessary to address the challenges…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691756/entrepreneurs-with-disabilities-reporting-act-of-2025"}]