[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and thereby endorsed and placed the Presidential seal of approval on  their actions and their direction and goal of seeking to overturn the  will of the people. So it was no accident that these pardons were one  of President Trump's very first acts in office. It was an unmistakable  signal that his administration would be obsessed with suppressing votes…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…saying they cannot afford this. They are  already behind on their utility bills, and more and more households  have had their electricity shut off by utilities.\n\nThis is not an accident. This is a choice by Trump and Republicans.  Clean energy, like wind and solar paired with battery storage, is the  cheapest power we can build. If we build more of it, we…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today to honor the life and  memory of Nihaal Grandhi, a brother, son, and student from Loudon  County who tragically passed away in an accident over the weekend.\n\nAt just 19 years old, Nihaal was a proud graduate of Rock Ridge High  School and a freshman at Indiana University's Kelley School of  Business. He was known…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691338/in-memory-of-nihaal-grandhi"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…struck a building in New York. By the time I made  it to the meeting, it turned out there was a second plane that had done  the same.\n\nMadam President, 9/11 was clearly no accident. It was a terrorist  act. As a result of that terrorist act, we made decisions as a nation  on a bipartisan basis. One of the most bipartisan decisions we made was  what to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…without an  extension of the enhanced premium tax credit.\n\nWe know that there is a healthcare crisis looming in this country. We  know that every American is one illness or accident away from economic  devastation. That is the point of health insurance, to make sure that  when they need care, they can access it without going bankrupt.\n\nWhile the healthcare…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, in 2 weeks, 22 million Americans will see their  health insurance premiums skyrocket, not by accident, but because  Republicans refuse to extend ACA tax credits that keep care affordable.\n\nAfter 15 years, this is the Republican healthcare plan: higher costs,  weaker coverage,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698371/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…to shut down, you would have to drive 100 miles  each way to get to another hospital. He talked about the emergency  surgery that they had performed once when there was an accident near  where his hospital was located. If they hadn't had the hospital there  and been able to provide the emergency treatment that they provided,  those people would have…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Police Brutality, and the Prince Jones, Jr.  Foundation.\n\nThis collaboration, this coalition of law enforcement leaders and  community justice advocates, doesn't happen by accident. It is because  this legislation is sound policy, balanced, and needed.\n\nModern less-than-lethal devices like the latest taser systems fully  integrate with body-worn cameras,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700042/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…collapse is not a show  of strength. It is an abdication of leadership that increases the risk  of miscalculation of arms races and, ultimately, nuclear use by design  or by accident.\n\nVerification will be at the heart of any future arms control effort,  and this is where America's scientific enterprise plays a critical  role. Our national laboratories…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…sixties, seventies, eighties, nineties,  and beyond.\n\nTo push to eliminate DEI policies is a dangerous step backward in  this ongoing fight for justice and equality. It is no accident that  this movement to undermine DEI coincides with the resurgence of racism  and hatred, and this rhetoric and these policies are un-American.\n\nThese policies also coincide…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…bills in every single category, and so I am just going to take the  risk. I am going to go without health insurance and hope that I don't  get into a car crash or into a major accident.\n\nPresident Trump literally campaigned on lowering your costs. That was  what this election was about. He said he was going to put more money in  your pocket. Can anyone name…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…less.\n\nI had the opportunity to interview George recently about       his experience with medical debt and how it has impacted his       life. Having suffered an industrial accident, and even though       his employer was responsible for his injuries and he carried       health insurance, he still accumulated $20,000 in medical       debt.\n\nGeorge grew…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…secured their second-straight Division  III national championship. These student-athletes reflect the best of  St. Louis.\n\nWhat they achieved this season didn't happen by accident. It came  from years of work, a culture of accountability, and a shared belief  that success in the classroom and success in competition strengthen  each other.\n\nSt. Louis…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698090/recognizing-washington-university-womens-soccer-team"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump kept making fun of the word ``affordability.'' Does he have to go  shop for groceries and not be able to buy the things his family needs?  When your car is damaged in an accident and you don't have money for  the deductible and you don't have a car, does he understand that?\n\nDonald Trump is in his bubble, and he kept making fun of the word  ``affordability.''…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…today. They have one message for us: Pass the  ROTOR Act.\n\nThe ROTOR Act addresses the glaring holes in aviation safety around  DCA that allowed this completely preventable accident to happen. It  does so by requiring military and civilian aircraft in busy airspace to  broadcast and receive real-time traffic information.\n\nHaving been more than a year…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700113/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…complications, not telling you  what you can do, not do, but a risk-based product that says: Hi, I am a  healthy 24-year-old. I would like to just know that, if I am in a bad  accident or if I get cancer, that I will be able to have care. I will  pay $100 a month for that risk assessment, and the insurance companies  can figure all that out, or $200 a month,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…insight into these  issues.\n\nThroughout the years, I have worked on several pieces of legislation  that addressed safety gaps following unimaginable tragedies. Every  aviation accident typically has multiple contributing factors. Too  often, I have seen Congress act prematurely and in a way that fails to  address multilayered causes of accidents in a comprehensive…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the city's historic role in       aviation; and\n\nWhereas many Federal, State, and local officials have       cooperated to respond to the emergency, investigate the       accident, and provide assistance to families devastated by       the loss of loved ones: Now, therefore, be it\n\nResolved, That the House of Representatives--\n\n(1) expresses condolences…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…uncovered will help bring some closure to those grieving and help  ensure that a tragedy like this never happens again.\n\nMr. Speaker, as we honor the 67 lives cut short by this accident, I  also thank the countless first responders who rushed to the scene to  first try to rescue and then recover those aboard Flight 5342 and PAT  25. Thanks to their tireless…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to remember Matthew Juniper, a  former member of the Wellston Police Department, who tragically passed  away on August 30, 2025, due to an off-duty accident.\n\nThroughout his life, Matthew demonstrated a deep commitment to his  community, serving as a police officer, a former deputy sheriff, and a  volunteer firefighter.\n\nMatthew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…shutdowns and, in many instances, even Kansans told me: Shut her down.  It doesn't matter. It doesn't matter to me.\n\nI have never found the value in a government shutdown. That accident  that I just mentioned forced Congress and our Nation to reckon with an  issue that has plagued us for decades: Why have we not effectively  modernized our airspace system?…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…and the Army helicopter collided  over the Potomac River.\n\nShortly after 9 p.m., I received a call with the news that a flight  from home--from Kansas--was involved in an accident in our Nation's  Capital. I made my way to Reagan National Airport that night. The banks  of the Potomac River were illuminated with lights from emergency  responders who…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise in reluctant opposition to the  ROTOR Act.\n\nThis bill is a well-intentioned response to the horrific airline  accident last year at DCA. In the months since the accident, it has  become clear that the accident would have been prevented had the  helicopter that was involved in the collision…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700112/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…a continuing resolution. That is right. This  bill spends less taxpayer money than if we passed another CR or  continuing resolution to fund these Agencies. That is not an accident.  That is what we can accomplish when we make appropriations a priority,  when we put in the work, make tough choices, and put it up for a vote.\n\nAppropriations is one of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…professionals. These  brave men and women are often the first line of defense in moments of  crisis, responding to emergencies with speed, skill, and selflessness.\n\nWhether it is an accident on a rural road or a medical emergency in a  busy town center, EMS professionals are there to ensure that help  arrives when it is needed most.\n\nThese individuals provide…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…on trains in Charlotte, North Carolina,  where a young woman from Ukraine was butchered by someone who had been  in and out of jail, arrested 14 times.\n\nIt is not just an accident. It is not just one random DA or judge or,  oh, George Soros funded one election. It is a coordinated effort to put  DAs and judges and other law enforcement officials into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…can ever ease the pain of such a  devastating loss, but we stand with them. We stand with every one of  these folks in mourning and in the pursuit of answers in this tragic  accident.\n\nThis tragedy demands a full and thorough investigation to ensure that  no family endures this kind of heartbreak again. The safety of our  skies and the trust of the American…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…very worse. We  are number one in gas prices. We are number one, or near it, in the  cost of electricity and the cost of water.\n\nThese things don't happen just randomly or by accident. They are the  result of failed policy choices. If this redistricting sham moves  forward, then the eyes of the Nation will be on California. I think it  will be important…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in years, opioid overdose deaths have declined,  dropping from over 83,000 in 2023 to under 55,000 by the most recent  data.\n\nThose are good numbers. They did not happen by accident. It happened  because we took bold action to secure our borders, to prioritize  treatments, and invest in recovery programs that work.\n\nWe can help continue this trajectory…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691872/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, I rise today to recognize my  constituent Ashlyn Gwynn, who was recently involved in a near-death car  accident.\n\nAshlyn was recruited to play soccer at Cal State Fullerton. This past  September, on her way to another sporting event, she and her teammate  Lauren were struck by a truck.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699245/recognizing-ashlyn-gwynn"}]