[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…well-informed,  competitive capital markets. Maybe that satisfies some short-term,  partisan political purpose, but it ain't patriotic and certainly ain't  capitalism. All this will accomplish is to drive long-term investors  out of U.S. equity markets.\n\nFor the retirement savings of our police officers, teachers, and  firefighters, and for the preservation of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…waivers is a climate setback  of massive proportions that will delay much-needed actions to abate  climate chaos. By expanding the scope of the Congressional Review Act  to accomplish this, the Senate has created a new process to undermine  the ability of States to innovate and invites politicization and  corruption of routine administrative actions.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692393/vote-explanation"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…cutting programs,'' Kurt Barwis, CEO       of Bristol Hospital, said. ``It's starting to look critically       and strategically at ``How do I retool these programs to       accomplish the same thing but at a lower cost?' ''\n\nBarwis said he's established partnerships with larger       hospital systems, like UConn Health and Hartford HealthCare,       and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…championship and led the football team  all the way to the State championship game.\n\nThey left their mark on Kettle Run, and I look forward to watching  all that they will accomplish in the future.\n\nI congratulate the class of 2025 of Kettle Run High School.                Recognizing Liberty High School Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and Secretary Collins. And there  are plans to fire 83,000 employees, and we haven't seen those plans.  All the Secretary has told us is that it is his goal and he will  accomplish that goal. He denied us that basic information.\n\nSo I have said I am opposing this nomination until we are given the  information and disclosure we need to do our jobs. The…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…started some time ago. They immediately started the plot to bring this  chore for the fossil fuel funders through the Senate floor and break  the filibuster in order to accomplish their goal.\n\nSo give me a break.\n\nI see my friend Senator Cassidy from Louisiana  waiting to speak.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Congressional App  Challenge. I am certain she will continue to show the same dedication  and strength of character in all her future endeavors. I am excited to  see all she will accomplish.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698677/recognizing-amy-zhang"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…address very briefly this morning is one of those issues.\n\nThere was a time when the Senate Judiciary Committee was so equally  and evenly divided that people thought we would accomplish nothing, but  there came an issue where there was a consensus among Democrats and  Republicans, and it is one that every parent and grandparent--I think  every individual--will…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…people who help with safety inspections and  repairs? But that is just what DOGE did. I can't imagine any American  thinks that is efficiency.\n\nThe only thing that is going to accomplish, of course, is making  flying less safe. It is going to lead to delays and mixups at airports.\n\nAnd not even the 9/11 families who lost loved ones or were hurt as  they rushed…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…under the Biden administration. They were  particularly high in the partial Trump administration before COVID. It  wasn't a COVID thing. Trump's policy is to yell loudly and accomplish  nothing when it comes to dealing with our trade deficits with China.\n\nTrump talks about other countries eating our lunch. Under his first  administration, China ate our…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…get us into an endless  war? We have thousands of troops on our largest aircraft carrier in the  Caribbean but zero--zero--explanation for what Donald Trump is trying  to accomplish.\n\nAmericans do not want to get our troops ensnared in another endless  war, and the risk for war will only get worse the more a belligerent  Donald Trump acts off the coast…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…rule.\n\nSo it is unfortunate that the colleagues in charge of the legislative  process have so corrupted it yesterday and today, not even trying to  actually enact the law to accomplish what they want but instead saying:  Let's use an expedited process that doesn't go through committee, where  there is very limited debate, where there are no amendments allowed,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…sending the message that we will not  tolerate the next step beyond its incursions.\n\nI support H.R. 1716 to protect global security and democracy, and I  support doing more to accomplish this goal.\n\nMr. Speaker, I, again, urge my colleagues to support this bill, and I  yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and pleading that this Congress would find it in  our hearts to stand up for them and not stand up for billionaires,  which is what this one big, ugly bill is designed to accomplish.\n\nSarah writes to us from Michigan's Fourth Congressional District:  ``My daughter has a heart condition, and the fact that she is on  Medicaid is the only way that we can…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…their own leaks  and wasted methane, drives innovation, and creates a lot of jobs. The  whole idea is to get them to do the right thing. We even give them  money in order to accomplish that with their equipment, and it is  working. This idea that it is harmful is just nonsense.\n\nMr. Speaker, I have a lot of respect for the gentleman from Texas,  and he…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM of California. Mr. Speaker, history has shown that  government shutdowns accomplish nothing.\n\nThe last major shutdown cost our economy $11 billion, delayed wages  for Federal workers, and disrupted businesses that hardworking  Americans rely on.\n\nThis isn't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695824/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…overdue  investments to support the farmers, ranchers, and agricultural  producers of the Big First and all of rural America. I am very proud of  all that we were able to accomplish.\n\nHowever, Mr. Speaker, I have been gravely disappointed in how some of  my Democrat colleagues have continued to blatantly lie about our  legislation throughout this process.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…so much for the  time. I appreciate it.\n\nMr. Speaker, it is a new year and with every new year, I like to  reflect on where am I going. What am I doing? What do I want to  accomplish this year? What did I accomplish the year before? That is a  great time to do it with America. Where are we?\n\nIt reminds me, Mr. Speaker, at the Constitutional Convention…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…defense to offense, the entire squad played with unity and  determination.\n\nThis moment is more than a victory. It is a legacy, and it speaks to  what young women in sports can accomplish when they believe in each  other, never give up, and have a level playing field.\n\nMr. Speaker, I congratulate Coach Elizabeth Maus, the players, and  the entire Davenport…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…something done that far ahead of schedule.  It is usually the last minute.\n\nThat matters because that was a reality. That is what we knew was  coming, and we worked hard to accomplish a lot of really key important  progrowth elements: no tax on tips or overtime, an increased child tax  credit, tax relief for seniors, an increased standard deduction  targeted…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "John Thune", "party": "Republican", "sentence": "…right. This  bill spends less taxpayer money than if we passed another CR or  continuing resolution to fund these Agencies. That is not an accident.  That is what we can accomplish when we make appropriations a priority,  when we put in the work, make tough choices, and put it up for a vote.\n\nAppropriations is one of our core responsibilities, but it…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…influence from within  their borders.\n\nThe LAF has an active mission and expectation from the United States  and others to fully disarm Hezbollah, and they are working to  accomplish that every day.\n\nEliminating military funding from the LAF now will only serve to  further embolden Hezbollah and allow them to regroup. This cannot  happen with Hezbollah…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…commercial application of advanced tools, technologies,       and methods for advanced production and use of low-emissions       cement, concrete, and asphalt in order to accomplish the       following:\n\n``(1) Increase the technological and economic       competitiveness of industry and production in the United       States.\n\n``(2) Expand and increase…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…commended for what he did.\n\nMy fellow Senators, vote no on this resolution. This is nothing more  than a slap in the face to the President of the United States. It  cannot accomplish something that does not exist.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…state of shipbuilding in the United States is nothing we would  hope to have. It is broken. This program maybe represents the pinnacle  of its brokenness. The ship doesn't accomplish what it was designed  for. I am encouraged when I speak to the chairman to know that it is  being put to use elsewhere, but it is not accomplishing the mission  that the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…their accompanying ranking members, Representative Steny  Hoyer and Lois Frankel, for their professionalism and engagement in the  process. This work demonstrates what we can accomplish through  collaboration and respect.\n\nI also particularly thank my good friend and working partner, the  distinguished ranking member of the full committee, Ms. DeLauro, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…people have to eat and  they have to have a safe and clean place to live. This is what this is  about. This is what our struggle is over, and this is what we are going  to accomplish as a committee.\n\nMr. Speaker, I encourage a ``yes'' vote on H.R. 3109, and I yield  back the balance of my time.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Field team  championship, I sincerely congratulate the athletes and coaches that  have made this accomplishment possible, and I look forward to seeing  what these students accomplish next.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691919/congratulating-the-manheim-township-unified-track-and-field-team-champions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Stand up  and lead for this country.\n\nIf we do it, then the American people will send us back here in a  bigger majority.\n\nIf we do it, then President Trump will be able to accomplish even  more in the next 2 years than in these 2 years.\n\nIf we act now, then we can actually save this country.\n\nIf we act now, then we can secure the border.\n\nIf we act now,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Rose", "party": "Republican", "sentence": "…immigrant encounters at our southern border compared to the same month  last year under Joe Biden.\n\nIt is noteworthy, Mr. Speaker, that the only thing the President  needed to accomplish this was leadership. We heard the last  administration claim time and time again that Congress would need to  pass legislation to secure the border. We heard a blank check…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}]