[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…District and  on democratic principles.\n\nWe know that D.C. has more residents than two States. D.C. pays more  Federal taxes than 26 States. D.C.'s government is accountable to the  people who live here. Local leadership should be empowered to solve  problems without Congress constantly interfering.\n\nI have said many times if Donald Trump wants to run…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696980/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…us.\n\nMr. Speaker, this is not a game. Diplomacy is not a game. War is not  a game. There are rules in war. When people violate rules in war, they  have to be held accountable. When people violate rules in our cities,  they have to be held accountable.\n\nThe people who are in these positions--law enforcement officers,  police officers, and the President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…people in a free and fair election does not care about solving the  problems that his constituents--the American people--face? If the  President didn't think he was accountable to the people's will when he  lost the election in 2020, why should we expect him to care about the  priorities they want him to address after an election?\n\nDemocracy, of course,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…officers'' off the force (see page 173 of the Report by       the Police Reform Commission). And it would override the       decisions of local officials who are accountable to the       people who live in the District.\n\nCongress should respect the District's authority to govern       itself, especially on matters of public safety. Allowing       these…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…State; and  D.C., as a whole, contributes more Federal taxes than 12 States. There  are over 700,000 active residents here who deserve a voice.\n\nD.C.'s government is accountable to the people who live here, and  local leaders should and are empowered to solve local problems without  Congress interfering.\n\nMr. Speaker, I have said this many times: If Donald…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…am proud to join him. We want to help our fellow citizens  participate in our elections because only their participation will  ensure that the government is truly accountable to the people it  represents. And as the ranking member of the Appropriations  Subcommittee that handles election funding, I hope my colleagues will  join me in restoring funding…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…that they are struggling to afford prescription  medications, we can't turn around and tell them that they are wrong. We  need to listen to them and hold Big Pharma accountable.\n\nWhen people tell us that they see government as overly bureaucratic  and complex, we can't dismiss that experience and say that it is all  fine. We need to ensure that taxpayer…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…television screens every evening.\n\nIn my view, Citizens United undermined what it means to be a country  of the people, by the people, for the people, and, above all,  accountable to the people. Unfortunately, for far too long, this  Chamber has failed to do what needs to be done to renew the faith of  the American people in our democracy. We cannot accept…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699238/restoring-election-integrity"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…authoritarian structure,  the authoritarian believes that the people are accountable to the  authoritarian, and in a democracy, the leader believes that the leader  is accountable to the people. That is the difference.\n\nSo if you are in a situation where you have an authoritarian for the  President, first thing they do is try to erode the checks and balances…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Speaker, the purpose of the War Powers Act  was to prevent secret wars from happening after Vietnam. The reason why  we have this is so that the administration is accountable to the  people. No war should be declared and no war should be prosecuted in  the name of the American people without their consent.\n\nIf the President wishes to go to war, he must…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698451/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…McBath, Mr. Cohen, and others.\n\nThis is very simple, Mr. Speaker: If you believe in liberty, you vote  ``yes'' on H.R. 2159. If you believe the government should be  accountable to the people, you vote ``yes'' on H.R. 2159. If you  believe that Americans deserve to know the laws that can put them  behind bars, you vote ``yes'' on H.R. 2159. It is bipartisan,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…believed that human liberty is not a Western idea and not an  American idea; it is a universal truth.\n\nA sovereign Iran built by its people, powered by its people, and  accountable to its people would be a force for stability, not chaos. It  would be a force for prosperity, not destruction. It would be a force  for hope, not despair.\n\nThe stories of the Iranian…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…opportunity for the country to highlight the righteous fight for  transparency. Shining a consistent light on the work of our government  is essential to making it accountable to ``We the People.''", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…The American people deserve a government that works for them, not  against them, a government that values every dollar that it spends, a  government that for once is accountable to the people who actually fund  it. That is what DOGE is delivering, and that is why I proudly support  this effort for transparency and making sure that every dollar sent to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "John James", "party": "Republican", "sentence": "…in America will have to post their real prices online  in plain English where everyone else can see them. If they don't hold  the prices, we fine them and hold them accountable to the people. Fines  will actually mean something.\n\nMr. Speaker, insurance companies will have to give you a straight  answer online, on the phone, or in the paper about exactly…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…leaders. Instead, he understands what       too many people in Washington forget: The most effective       solutions come from those closest to the problem and most       accountable to the people. It's with this understanding that       he listened first, acted decisively, and never left our       community's side.\n\nHe spoke to leaders at every level public…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}]