[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Republicans have unleashed on Coloradans and on Americans  writ large, but, no, we are here to debate this very carefully  constructed press release that ultimately will accomplish nothing if it  is ever signed into law.\n\nMadam Speaker, I am voting ``no,'' and I urge my colleagues to do the  same.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…harmful  additives. From keeping track of food recalls to rigorously inspecting  processing facilities to protecting infant formula to banning toxic  dyes, the FDA cannot accomplish its missions if we slash its resources.\n\nGiven many recent food recalls, and particularly with contaminated  foods and medical products that are imported, there is a need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…cutting programs,'' Kurt Barwis, CEO       of Bristol Hospital, said. ``It's starting to look critically       and strategically at ``How do I retool these programs to       accomplish the same thing but at a lower cost?' ''\n\nBarwis said he's established partnerships with larger       hospital systems, like UConn Health and Hartford HealthCare,       and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…said it particularly well, and others on the committee, when  saying that they want the information necessary to make solid  decisions. If we adopt my amendment, that will accomplish that  objective.\n\nMr. Speaker, I urge my colleagues to vote against the previous  question and for the Hoyer amendment.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Mr. MERKLEY. I would yield for a question.\n\nMr. MERKLEY. Thank you, Senator. I not only agree, but I so admire  what you accomplished. It is so frustrating. Why can't we accomplish  that again?\n\nI know one of our Members worked hard with my colleague across the  aisle to do a bill that may have been a slimmer version, and President  Trump--then-Candidate…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have accomplished a reduction in  crime, the same could have been done by simply providing more  resources, more cops on the streets with the equipment that they need  to accomplish the same thing.\n\nWe are not talking about securing our borders. We are not talking  about nullification of Federal law. We are talking about overreach and  possible overuse,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…address very briefly this morning is one of those issues.\n\nThere was a time when the Senate Judiciary Committee was so equally  and evenly divided that people thought we would accomplish nothing, but  there came an issue where there was a consensus among Democrats and  Republicans, and it is one that every parent and grandparent--I think  every individual--will…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and pleading that this Congress would find it in  our hearts to stand up for them and not stand up for billionaires,  which is what this one big, ugly bill is designed to accomplish.\n\nSarah writes to us from Michigan's Fourth Congressional District:  ``My daughter has a heart condition, and the fact that she is on  Medicaid is the only way that we can…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Congressional App  Challenge. I am certain she will continue to show the same dedication  and strength of character in all her future endeavors. I am excited to  see all she will accomplish.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698677/recognizing-amy-zhang"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…waivers is a climate setback  of massive proportions that will delay much-needed actions to abate  climate chaos. By expanding the scope of the Congressional Review Act  to accomplish this, the Senate has created a new process to undermine  the ability of States to innovate and invites politicization and  corruption of routine administrative actions.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692393/vote-explanation"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…side, but  he never does anything to get them done. He never lifts a finger or a  phone. And the American people see that he talks a good game but never  does anything to accomplish what he wants to do when it comes to  lowering their costs. And the situation of the American people only  gets worse.\n\nTo Donald Trump: Your posturing, your throwing out…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…under the Biden administration. They were  particularly high in the partial Trump administration before COVID. It  wasn't a COVID thing. Trump's policy is to yell loudly and accomplish  nothing when it comes to dealing with our trade deficits with China.\n\nTrump talks about other countries eating our lunch. Under his first  administration, China ate our…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…get us into an endless  war? We have thousands of troops on our largest aircraft carrier in the  Caribbean but zero--zero--explanation for what Donald Trump is trying  to accomplish.\n\nAmericans do not want to get our troops ensnared in another endless  war, and the risk for war will only get worse the more a belligerent  Donald Trump acts off the coast…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…well-informed,  competitive capital markets. Maybe that satisfies some short-term,  partisan political purpose, but it ain't patriotic and certainly ain't  capitalism. All this will accomplish is to drive long-term investors  out of U.S. equity markets.\n\nFor the retirement savings of our police officers, teachers, and  firefighters, and for the preservation of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…forever. The fuel is free  forever. That is a big deal. That is long-term price stability.\n\nWhat would our bill do? I am very proud of a lot of the things that  it would accomplish.\n\nNumber one: It would rescind the tax hike on low-cost, clean energy,  and it would restore tax credits for clean energy such as those in the  Inflation Reduction Act.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…can't say that I will be rooting for her team in the Patriot League  this year. Yet, our entire Hudson Valley is rooting for her, and we  cannot wait to see all that she will accomplish.                         recognizing elder jim childs\n\nMr. RYAN. Mr. Speaker, I rise today to honor Elder Jim Childs, a  pillar of our Kingston community, for his decades…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…only  costs a little bit to have two or three extra people on each job. It  only costs a little bit to add another regulation that does not make  sense and that does not accomplish anything.\n\nThese businesses are dying because, one regulation at a time, for no  reason other than to create jobs for some bureaucracy, we continue to  have those.\n\nMr. Speaker,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688532/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…so much for the  time. I appreciate it.\n\nMr. Speaker, it is a new year and with every new year, I like to  reflect on where am I going. What am I doing? What do I want to  accomplish this year? What did I accomplish the year before? That is a  great time to do it with America. Where are we?\n\nIt reminds me, Mr. Speaker, at the Constitutional Convention…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…congratulate each player and coach that  made their success possible. The Barons have earned their place as  state champions, and I look forward to seeing what these players  accomplish next.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692807/congratulating-the-manheim-central-high-school-boys-volleyball-state-champions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…something done that far ahead of schedule.  It is usually the last minute.\n\nThat matters because that was a reality. That is what we knew was  coming, and we worked hard to accomplish a lot of really key important  progrowth elements: no tax on tips or overtime, an increased child tax  credit, tax relief for seniors, an increased standard deduction  targeted…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…state of shipbuilding in the United States is nothing we would  hope to have. It is broken. This program maybe represents the pinnacle  of its brokenness. The ship doesn't accomplish what it was designed  for. I am encouraged when I speak to the chairman to know that it is  being put to use elsewhere, but it is not accomplishing the mission  that the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…influence from within  their borders.\n\nThe LAF has an active mission and expectation from the United States  and others to fully disarm Hezbollah, and they are working to  accomplish that every day.\n\nEliminating military funding from the LAF now will only serve to  further embolden Hezbollah and allow them to regroup. This cannot  happen with Hezbollah…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…commercial application of advanced tools, technologies,       and methods for advanced production and use of low-emissions       cement, concrete, and asphalt in order to accomplish the       following:\n\n``(1) Increase the technological and economic       competitiveness of industry and production in the United       States.\n\n``(2) Expand and increase…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Parliamentary Intern in the Houses of the Oireachtas, Ireland, and  clerk in the Iowa House of Representatives, Nicole remains successful  in bringing people together to accomplish great things.\n\nMost importantly, Nicole is a friend to us all, not least of all my  kids, who will always remember her scavenger hunts during their Junior  Congresswoman…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…but now that the shutdown is over, Democrats have an  opportunity to reconsider and do the right thing.\n\nPresident Trump has already given us some great ideas about how to  accomplish this and made the point, which I think is an important one,  that rather than send the money to insurance companies that have, by  the way, done very, very well and made…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…winning the AI race means we have to work hand  in glove with our allies to ensure that these technologies are not  acquired by the PRC, and we know the stakes if we don't accomplish that  job.\n\nIn the same way that China has captured the supply chain for the  production of processing critical minerals, they have designs to  capture the manufacturing…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…people have to eat and  they have to have a safe and clean place to live. This is what this is  about. This is what our struggle is over, and this is what we are going  to accomplish as a committee.\n\nMr. Speaker, I encourage a ``yes'' vote on H.R. 3109, and I yield  back the balance of my time.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…behalf of the United States House of Representatives, I  join Pride Industries in celebrating 60 years of service, and I look  forward to seeing all that they will continue to accomplish in the  years to come.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Stand up  and lead for this country.\n\nIf we do it, then the American people will send us back here in a  bigger majority.\n\nIf we do it, then President Trump will be able to accomplish even  more in the next 2 years than in these 2 years.\n\nIf we act now, then we can actually save this country.\n\nIf we act now, then we can secure the border.\n\nIf we act now,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Ten team standing.\n\nI congratulate Guy Gadowsky, head coach of the Nittany Lions men's  hockey team, as well as all of the talented athletes who have worked so  hard to accomplish this victory and the Penn State fans and students  who packed the Pegula Ice Arena for every game.\n\nNow I look forward to watching the Nittany Lions continue their  success…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}]