[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…Christianity, the world's second largest Christian  denomination with 300 million Orthodox Christians living across the  globe, including many in Rhode Island. He is an accomplished scholar, a  devoted environmentalist, advocate for peace, and a leader who commands  great respect around the world.\n\nOver the past three decades, Ecumenical Patriarch Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695453/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…W. Robinson Secondary School, who swam, played  violin, and created and delivered more than 800 cards for seniors in  local retirement homes.\n\nI congratulate these very accomplished young individuals on their  Congressional Award gold medals, and I thank them for their service.              Celebrating Gainesville High School Baseball Team\n\nMr. SUBRAMANYAM.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Congratulating Lightridge High School Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, congratulations to the 463 students at  Lightridge's High School class of 2025, a group that has accomplished  so much.\n\nOver the last 4 years, as Lightning, they have struck us all with  their amazing theater performances and band performances. They have won  regional titles and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…had left the comfort of  our homes or checked our emails or even had a cup of coffee, Sergeant  Dollinger, Officer Knam, Officer Foltz, and firefighter-paramedic  Bosler accomplished an incredible feat of bravery and heroism,  reminding us how important they are for the safety and security of our  communities.\n\nMr. Speaker, I, again, extend my sincere…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697308/champions-of-the-week-north-canton-first-responders"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…opportunities to run for the D.C. Council.\n\nMr. Speaker, I was a mayor of my city for 8 years before I came to  Congress, and I love local government. A lot can get done and  accomplished. Yet, let's not sit here in Congress and pretend to be a  super city council, imposing our pet policies on residents who reject  this agenda.\n\nNow, the bill before us right…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: As Mayor and       Chief Executive Officer of the District of Columbia, I am       proud of the work we have accomplished to invest in our       people, strengthen our neighborhoods, and drive down crime.       Building on this progress, my Administration established the       Safe and Beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…dear  friend and one of my favorite colleagues--if that is okay and germane  to say--for his collaboration on this bill. We are both midwesterners.  He is an incredibly accomplished academic, veteran, and businessman  from an important part of our Nation. I have had the sincere privilege  of collaborating on legislation with the gentleman since we were…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Honnold Foundation,  which partners with marginalized communities to expand equitable solar  access around the world.\n\nNevada's Third District is honored to have such an accomplished  athlete with a passion for outdoor recreation and making the world a  better place. We are all looking forward to seeing what Alex will  accomplish next.\n\nI congratulate…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699610/recognizing-alex-honnold"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…actually wrote this after reading through your  poems a second time.\n\nYou inspired me, so here is the Senate page poem dedicated to you  all.\n\nOne hundred Senators--confident, accomplished, successful\n\nElected leaders projecting excellence in times so       stressful.\n\nThey may seem like giants and you may feel a bit small.\n\nBut, dear God, don't buy it--don't…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…rise to recognize the outstanding  achievements and historic tenure of Maryland's outgoing United States  Attorney, Erek Lawrence Barron. He is an experienced lawyer, an  accomplished legislator, and a champion of civil rights, and his time  as U.S. Attorney has left the people of Maryland safer and more secure  in their communities, with greater confidence…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…will help enhance and deploy technology to improve  permitting processes all across the Federal Government. Perhaps more  importantly, the bill is an example of what can be accomplished with a  bipartisan approach to problem solving and good-faith negotiations.\n\nThe Fiscal Responsibility Act directed the Biden administration to  study the possibility of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697678/epermit-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: As Mayor and       Chief Executive Officer of the District of Columbia, I am       proud of the work we have accomplished to invest in our       people, strengthen our neighborhoods, and drive down crime.       Building on this progress, my Administration established the       Safe and Beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…anyone remember the last time a Republican  President misled the Nation about WMDs, using vague evidence to drag us  into a war in the Middle East? He stood under a mission accomplished  banner, and then we were at war for nearly a decade, and it cost  trillions of dollars and thousands of lives.\n\nI guess the 2025 version of a mission accomplished banner…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: As Mayor and       Chief Executive Officer of the District of Columbia, I am       proud of the work we have accomplished to invest in our       people, strengthen our neighborhoods, and drive down crime.       Building on this progress, my Administration established the       Safe and Beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…She has a part-time job at a nearby bank. She does charity work  delivering flowers to seniors. She loves horseback riding and has  competed as a Special Olympian. She accomplished all this thanks to her  bravery, optimism, and generosity, but she may not have even gotten  that chance without Medicaid.\n\nAnd then there is Cheri from Lebanon. Like other…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…any sport for their school.\n\nAs the fourth seed in a season full of upsets, I know this was a  hard-fought victory. They should all be so proud of everything they  have accomplished this year. They have certainly made their families,  community, and the entire Seventh District proud.                          Congratulating Ron Mergen\n\nMrs. FISCHBACH.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…their four kids during this  incredibly difficult time. I thank and ask all of my colleagues on both  sides of the aisle to join us in honoring the great work that Doug  accomplished over the years.\n\nMay we preserve his legacy. May we be more like him, and may he rest  in peace.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698741/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…snoozing for a few seconds here or  there, we don't want to be too hard on them since it was an all- nighter, and we are not in college anymore.\n\nIt is significant what we have accomplished. The Energy and Commerce  Committee just finished up, and the House Ways and Means Committee  earlier. We have got 11 or so committees that have contributed to the  one…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…NSF Interagency Research Act,  will support U.S. competitiveness in emerging technologies and key  economic sectors while leveraging taxpayer dollars, enabling more to be  accomplished with fewer resources.\n\nMr. Speaker, I appreciate the good work of my colleagues,  Representatives Stevens and Baird. I urge my colleagues to support this  bill, and I yield…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Latino Chamber of Commerce of Pueblo Dinner  Dance Awardees for 2025. Over the past 47 years, the Latino Chamber of  Commerce of Pueblo has grown into a well-respected and accomplished  organization that continues to support and strengthen small businesses  in the Pueblo community.\n\nI congratulate this year's awardees: Caitlin Alcon, for the Victor  Navarro…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700094/congratulating-the-latino-chamber-of-commerce-of-pueblo-dinner-dance-awardees"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…we are not doing it.\n\nInstead, at least publicly, the Trump administration is focused on  acquisition, on ownership, even though every one of our strategic goals  can be accomplished with Greenland as our partner, rather than a  possession.\n\nI would hope that the Trump administration realizes that the United  States' taking control of Greenland, especially…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…agreed they are qualified and ready  to serve. President Trump was elected in a landslide, and the American  people expect and deserve our support in getting his agenda  accomplished.\n\nPresident Trump and his administration are working incredibly hard to  bring back the U.S. policy of peace through strength and to ensure our  military is a respected…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…through 2028.\n\nWe worked to make the adoption tax credit partially refundable up to  $5,000--indexed for inflation--beginning in 2025.\n\nOne of the most unique things that we accomplished were the Invest  America accounts, the Trump Accounts. These investment accounts  demonstrate to American youth the power of capitalism and compounding  interest. There…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…recovered.\n\nCpl Ivanoff returned home a hero. He finished his education at  Harrisburg Catholic High School and began his civilian career at the  Post Office. He became an accomplished amateur golfer, earning the 1968  Harrisburg Championship, and still golfs at 100 years young.\n\nMr. Speaker, on behalf of the Citizens of the 10th Congressional  District…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Mr. GIMENEZ. Mr. Speaker, I rise today to congratulate Melissa  Tapanes on being named President of the Builders Association of South  Florida.\n\nMs. Tapanes is an accomplished attorney who specializes in complex  legislative and quasi-judicial matters. She has demonstrated a strong  commitment to public service, holding leadership roles with the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690947/congratulating-melissa-tapanes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…remained true to its values across  generations. Let this occasion be a time of reflection and renewed  purpose. The City of Port Richey stands as a testament to what can be  accomplished through community spirit, hard work, and enduring hope.\n\nAgain, I am proud to honor the City of Port Richey on its 100th  Anniversary, and I ask my colleagues to join me…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…chaos and that somehow our country is not secure. Quite  the opposite is true. Quite frankly, President Trump  should be commended for what he and his administration have  accomplished in a matter of weeks and months that most of us thought  would take years.\n\nOur borders are secure. They are more secure now than they have ever  been. It wasn't that long…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…stunt than it does that they actually  wanted to have that resolution moved along because if they had not  objected, it would have gone on its way, and they would have  accomplished what they wanted to do.\n\nI don't see their real desire to have the resolution passed. I see it  more, like I said, as a political stunt, and it certainly is actually a…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…need to look at the results that this President,  President Trump, and where the House Republican leadership has taken  this country over the last year.\n\nTogether, we have accomplished real results. It starts with tax  relief for American families with the working families tax cut. Mr.  Speaker, do I need to remind you, it is only the largest tax cut in…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…devoted  man of faith, he attends the Stonebriar Community Church in Frisco,  where he has led Bible study classes for over 33 years. I am proud of  the work Corbett has accomplished, and I wish him continued success for  many years to come.\n\nIt is an honor to bestow Corbett with the Patriot Award for his  exceptional service to the people of North Texas.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}]