[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of every citizen who shares that vision across our country,  who believes in the words carved above the Supreme Court, I and others  will continue to press for accountability, for transparency, for  justice. May it be so that we reconsider and 100 Senators team up  together to say ``hell, yes'' on those core principles we cherish as  Americans.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…isolated lapse. It  reflects a much broader policy of aggressiveness and unaccountable  enforcement with little transparency and no due process.\n\nWe must demand accountability, transparency, and protection of civil  rights to ensure enforcement respects due process and human dignity.  The American people are seeing the reality of this enforcement: fear,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Prince William County, Fairfax County, and  counties all across the country, officials are working tirelessly to  ensure our elections are safe and secure. That is accountability,  transparency, and democracy in action.\n\nI congratulate Prince William and Fairfax Counties on their awards,  and I look forward to working with them and fighting false allegations…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…procedures that reflect  modern realities. That is exactly what H.R. 5349 delivers.\n\nPassing this legislation is a statement that we believe in a tax  system where accountability, transparency, and due process matter, not  just for the wealthy or well-connected, but for all Americans.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I strongly oppose this bill, which repeals the police  accountability and transparency law that the District of Columbia  enacted in 2023.\n\nLast year, violent crime in D.C. was down 35 percent, reaching an  over 30-year low. This year, violent crime…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Congress steer the United  States through the global financial crisis. Mr. Dodaro's work with  Congress and Presidential administrations helped shape the Digital  Accountability and Transparency Act of 2014, the Federal IT  Acquisitions Reform Act of 2014, the Fraud Reduction and Data Analytics  Act of 2015, and countless legislation that moved through…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…want everyone here to  continue fighting like hell to stand up for those who cannot stand up  for themselves, to defend the rights of every American, and bring  accountability and transparency to power.\n\nEsophageal cancer is the fastest increasing cancer among American  men. It is also one of the deadliest. This bill would direct the GAO to  report on…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…due process, protect the rights of  individuals, and ensure that judicial decisions are grounded in a  complete and reliable record. Their work is foundational to  accountability, transparency, and public confidence in our courts.\n\nCourt Reporting and Captioning Week highlights both the technical  skills required in this profession and its importance to…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…officers are entrusted with extraordinary authority to protect  public safety. The vast majority of officers exercise it honorably and  bravely. However, there must be accountability and transparency for  instances in which officers violate their oath of office.\n\nH.R. 2096 would repeal provisions of a 2023 D.C. law that made it  easier for the police department…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…beyond this making her case. The people of the Virgin  Islands, I am confident, will continue to stand behind her.\n\nWe will never be lectured on issues related to accountability,  transparency, principle, and ethics from this group of extreme House  Republicans who continue to visit a national nightmare on the American  people, bending the knee to a wannabe…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…committee report recommended that we enact the FACT Act to shine  a light on companies connected to foreign adversarial governments like  the CCP and to ensure greater accountability and transparency in our  critical communications networks.\n\nOur bill passed the House unanimously by voice vote in the last  Congress, but it didn't quite get over the finish line.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Treasury Department to simply track, verify, and cross-check payments.  That is what the DOGE in Spending Act will do.\n\nMr. Speaker, the American people deserve accountability and  transparency. I urge all my colleagues to join me, and I am saving a  cosponsorship for each of them.\n\nMr. Speaker, let's deliver results. Let's go get them.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692480/accountability-and-transparency-in-government"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…and thorough investigation to ensure that  no family endures this kind of heartbreak again. The safety of our  skies and the trust of the American people depend on accountability,  transparency, and action.\n\nMr. Speaker, let us honor the memory of those we lost by ensuring  that such a catastrophe never happens again. I urge my colleagues to  support H.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…conducting a thorough review of the  Federal Government's investigation into Epstein. Our work goes far  beyond the legislation before us today. We are committed to  accountability, transparency, and justice for the American people and  for the survivors of these appalling crimes.\n\nTo date, the Oversight Committee has released more than 65,000 pages  of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…this evening's vote; and Mike  Gentile.\n\nThere is more work to do. The next 2 weeks will require us to listen  to each other, to work hard, and to hammer out more accountability and  transparency for the Department of Homeland Security to help make sure  that we meet this moment.\n\nBut at the end of the day, as someone who is proud to be an  appropriator…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…This is a precedent that  we cannot afford to set, regardless of who is in the White House or who  is in the crosshairs.\n\nMr. Speaker, the CFPB operated without accountability or  transparency. It has undermined consumer protections, stifled  innovation, and eroded public trust.\n\nI encourage my colleagues to support this resolution and reassert the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…and that providers that are  receiving those funds are capable of getting the job done.\n\nThat is exactly what the Rural Broadband Protection Act does. It puts  accountability and transparency in the grant review process by  requiring the Federal Communications Commission to vet applicants for  broadband funding based on experience, capability, and performance.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690152/rural-broadband-protection-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…post-traumatic stress disorder, sexual                assault, or traumatic brain injury. Sec. 518. Participation in CATCH a Serial Offender program. Sec. 519. Accountability and transparency relating to allegations of                misconduct against senior leaders. Sec. 520. Confidential reporting of sexual harassment. Sec. 521. Report on policy…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]