[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…has  launched an incredible program to address mental health and addiction  among its residents.\n\nStarting in 2020, Joliet noticed that mental and behavioral health  calls accounted for a growing percentage of the 9-1-1 calls. The fire  department was spending less time putting out fires--and more time  responding to people in mental health crisis. Some…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Vermont is 1 of 34 States whose major trading partner is  Canada.\n\nFor Vermont, Canada has been our largest export market and the  largest source of imports. Trade with Canada accounted for 35 percent  of our State exports and 67 percent of Vermont's imports and 56 percent  of its total trade.\n\nWe have small businesses now that are really struggling to keep…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…disparity in last year's cycle.\n\nOverall, dark money groups boosting Democrats put up about       $1.2 billion to influence 2024 elections, while groups       boosting Republicans accounted for about $664 million.                           The Presidential Contest\n\nThe presidential election attracted more super PAC       spending--totaling around $2 billion--than…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…States. Every year, more than 2,500 young lives  are lost to gun violence. For children under the age of 13, these  deaths most often occur inside the home. In 2021, firearms accounted  for nearly 19 percent of all childhood deaths--a staggering 50 percent  increase since 2019.\n\nDisturbingly, three out of every four children under the age of 10  live in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693800/introduction-of-the-gun-safety-incentive-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…demonstrated record of and plans       to be in compliance with federal labor and employment laws;       and demonstrating that the Eligible Entities have       sufficiently accounted for current and future weather- and       climate-related risks to new infrastructure projects.       Finally, the BEAD NOFO clarifies some technical aspects of       the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…rescue personnel at       each impacted Coast Guard facility.\n\n(4) The number of search and rescue personnel at each       impacted Coast Guard facility beginning in 2021 and accounted       for annually thereafter.\n\n(5) A description of active and past first responder       cooperative agreements made between each impacted Coast Guard       facility and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Police  notified Congress that multiple Federal law enforcement agencies were  in the process of replacing their service weapons. The replacement of  these service weapons accounted for the destruction of approximately  20,000 firearms, costing the taxpayers roughly $8 million.\n\nNot only would this legislation cause agencies and the taxpayers to  avoid…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…are still occurring across the country, and the  rapid rise in access to the chemical abortion drug, mifepristone, is  deeply alarming.\n\nIt is estimated that mifepristone accounted for 63 percent of the  abortions in 2023, resulting in approximately 642,700 unborn babies  losing their lives that year.\n\nWomen and girls have been misled into believing…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…actually in perspective. Take the year 1982-- right in the thick of the Reagan buildup that won the Cold War. In  fiscal 1982, sustaining U.S. military operations in Europe accounted  for less than 6.5 percent of defense outlays.\n\nNow, remember: Winning World War II meant surging defense spending to  37 percent of our GDP. But at the climax of the Cold…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…high-grade rare earths       deposits. Moreover, Madagascar, Mozambique, and Tanzania       cumulatively hold graphite reserves on par with China's, even       though China accounted for 77 percent of global graphite       output in 2023. According to internal calculations, AGOA       beneficiary countries also hold 70 percent of the       world's manganese,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…district for Arkansas National Guard  enlistments in fiscal year 2025.\n\nOur district led the State in Army National Guard recruitment,  contributing 314 new soldiers, and accounted for 47 percent of all Air  National Guard recruits statewide. In total, the Second District  produced 351 enlistments in 2025, surpassing any other congressional  district…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…owe it to our communities, our constituents, the families, and to  the victims. Cartels are quite literally killing Americans for ten  cents. Among teens, fentanyl poisoning accounted for an average of 22  deaths per week in 2022.\n\nFentanyl is the number one cause of death among adults 18 to 49, more  than cancer, heart disease, and car accidents. This…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…the  will of the consumer and the will of the government.\n\nOnly 2.3 percent of new vehicle registrations in West Virginia last  year were electric vehicles. Nationwide, EVs accounted for only 10.2  percent of new vehicle registrations. The plain truth is, electric  vehicles are not popular. Even in New York, one of the States that has  adopted the California…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…response and  coordination between police, fire, medical professionals, and good  Samaritans, the loss of life would undoubtedly be higher. Within 24  hours, every life had been accounted for, despite the mass destruction.  Heroic stories of rescues and make-shift tourniquets in the field have  flooded our news sources, giving our entire Commonwealth a renewed…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Accountability Act, to correct this gross misuse of emergency spending.\n\nMy bill will ensure that every taxpayer dollar spent on emergency  spending is fully paid back and accounted for over the following 5  years once the bill passes. Additionally, my bill would restore  integrity to the term ``emergency spending'' by requiring committees to  justify…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Apparently, they like how they do  their economy. They like their energy production.\n\nI would just like to point out, Statistical Review of World Energy  reports that coal accounted for 58 percent of China's energy. Oil was  at 20 percent, and natural gas was at 10 percent. Some of my colleagues  struggle with math. I will just add that up for them.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…increase government supervision of nonbank payment apps like Venmo and  PayPal by expanding the CFPB's authority. But these types of apps are  already regulated, and they accounted for just 1 percent of the CFPB's  consumer complaints in 2023. Why add another layer of bureaucracy?\n\nApparently, Democrats can't help but see innovation as an opportunity…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}]