[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…everybody else.\n\nWhat Democrats want is exceedingly reasonable. We need to end roving  patrols. That means arrest warrants and ending racial profiling.\n\nSecond, we need real accountability, having ICE abide by the same  rules as local police do, including independent investigations of ICE.\n\nAnd, third, masks need to come off. Cameras need to stay on. Officers…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…environmental laws whenever it claims national security.\n\nIn Hawaii, where trust around military land use is damaged, quite  frankly, and lease negotiations are ongoing, accountability is not  optional. A back-door taking of our lands is 100 percent unacceptable.\n\nAllowing this amendment to pass would set a dangerous precedent, undo  decades of progress,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…responsibility and authority to the local community that  has to live with the consequences of the damage that has been done.  There has to be a partnership. There has to be accountability.\n\nBut where FEMA's role is going to be better on this is on oversight  to make sure that there is the proper use of taxpayer, FEMA-authorized  money. But it is not going…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…clear, but then again, they  have never been vetted. They have never had to go through a Senate  process. They are a special group status that has no responsibility or  accountability and have been given unfettered access to everyone's  personal data and information.\n\nI would hope that one Republican--perhaps you, Mr. Speaker--will  stand up and speak…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…officers are entrusted with extraordinary authority to protect  public safety. The vast majority of officers exercise it honorably and  bravely. However, there must be accountability and transparency for  instances in which officers violate their oath of office.\n\nH.R. 2096 would repeal provisions of a 2023 D.C. law that made it  easier for the police…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…brains are still developing. Treating them as adults is shameful.\n\nWe can all agree that children should be treated differently by our  courts. That matters when it comes to accountability and  rehabilitation. Here is what the research shows.\n\nYouth charged as adults are more likely to reoffend than youth that  go through the juvenile courts. That is not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…and nonprofit organizations are all institutions that enforce our laws  and that hold those in power accountable. This is his methodical way of  undermining all forms of accountability in this government.\n\nMore recently, his attack on our Constitution has escalated. Before  he even came into office in January, President Trump had completely  submitted…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…that  will help families who are struggling to get by, real progress to  reject some of the sabotage Trump has done to our economy and our  standing in the world, and real accountability that will help stop  Trump and Vought from stealing from our States.\n\nTake a look at the Labor-H bill. Last year, Trump did everything he  could to sabotage lifesaving…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Mr. Speaker, there are a lot of reforms that people  have proposed to overturn the damage done by Citizens United. I  introduced legislation, the Campaign and Election Accountability Act.  One of the things that Citizens United did was make it easier for  foreign nationals to funnel money into U.S. elections.\n\nThe Federal Election Campaign Act currently…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Americans is hardly a  Ponzi scheme, nor is it a scam. The real scam  is to tell the American people that you need $2 trillion and assign  that to a billionaire who has no accountability, did not have to go  through Senate approval, is not a government employee, and isn't even a  volunteer. Yet, he is placing his will on a Republican-led Congress in  both…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…third issue people raised with me is they wanted to  fight government corruption. People are tired of feeling like the rules  are different for those at the top. They want accountability that  actually means something. They want ethics laws to apply to everyone,  no matter their title or their party. They are seeing that this  corruption is raising their…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…been  extremely challenging for SBA to cut existing regulatory programs to  offset the cost of the Paycheck Protection Program. Moreover, many of  the lending rules ensure accountability and fair access. Cutting them  to free up funds for PPP would have compromised the integrity of the  program.\n\nMoreover, these funds needed to be disbursed quickly. Imposing…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…outdated law,  which gives the President enormous, unchecked powers to deploy the  military to quell domestic rebellion.\n\nNow, the lack of defining terms, the absence of real accountability,  and the vagueness of that statute are the reasons we now need reform.\n\nLimits were imposed, but the limits are filled with loopholes,  practical gaps that fail to check…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…conditions intrinsic to a job.  That could leave construction workers, factory workers, farmworkers,  and others in high-risk professions with fewer protections and less  accountability when something goes wrong.\n\nThe administration's rollbacks go well beyond the general duty  clause. Millions of home healthcare workers could be paid below minimum  wage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…was an election system that  no longer depends primarily on voters but rather on outside entities  whose sole purpose is to spend unlimited money, often without public  accountability, to influence who holds power and how that power is  used.\n\nSince Citizens United, we have watched a parallel political system  take shape, one dominated by super-PACs…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…financed by fines and penalties paid for by  those convicted of Federal crimes. It is not taxpayer dollars. That  structure reflects that simple, but powerful, idea that accountability  should serve justice.\n\nToday, however, that promise is under strain. According to the Office  for Victims of Crime, the Crime Victims Fund ended fiscal year 2024  with…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698844/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…small businesses, strengthens our economy, protects Social  Security, restores American energy leadership, supports our men and  women in uniform, and brings much-needed accountability to Washington.\n\nWe have taken the lead in the House. Now it is time for the Senate to  do the same. When they return to Washington, the Senators should take  up the House…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…barriers, and protection of entrenched  interests. When government pours taxpayer dollars into a system that  restricts competition, prices rise, efficiency collapses, and  accountability disappears.\n\nThrough it all, the one group that was systematically excluded from  decisionmaking is the patients themselves. That is the fundamental flaw  of this current…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…any       other recommendations for improving taxpayer response rates.\n\nMr. Speaker, by voting for unified Republican control of government,  the American people chose accountability and a return to common sense.  There is no better example of bad government than the IRS.\n\nEvery year, taxpayers receive notices from the IRS proposing to  adjust their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Americans moved from welfare  to work and independence.\n\nDemocrats today have abandoned that model. They want permanent  government dependency. They will oppose any form of accountability, and  they will vilify anyone who dares to suggest that opportunity should  come with responsibility. Republicans are standing up for what works  and what is right.\n\nWe…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…why I rise today in support of the Coercion and Sexual Abuse  Free Environment Act introduced by my colleague and friend, Chairman    Andy Biggs.\n\nThis bill will ensure accountability for anyone who intentionally  compels a minor to engage in self-harm or other degrading acts. As  child abuse continues in this country and takes many forms, prosecutors…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…ensure VA clinicians always have  the right tools at the right time to provide high-quality care.\n\nThis system will offer better tracking, better forecasting, and  better accountability. We are not reinventing the wheel. We are simply  asking the VA to adopt the same kinds of tools  and best practices that are already being used in the private sector…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…While President Trump works to end this abuse of taxpayer dollars,  Congress should do everything possible to support his efforts.\n\nThis week, I am introducing the Fraud Accountability Act, which would  amend the Immigration and Nationality Act to explicitly make clear that  fraud is a deportable offense. If you come to our country to steal from  the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…nearly 80 percent since the so-called  Affordable Care Act was enacted. The average premium for family  coverage is nearly $27,000 per year.\n\nA report from the Government Accountability Office confirms what  Republicans have said for years. There is significant fraud associated  with COVID-era enhanced premium tax credits established by the trifecta  of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…States Code (commonly referred to as the ``Privacy       Act''), and the privacy regulations promulgated under section       264(c) of the Health Insurance Portability and Accountability       Act (42 U.S.C. 1320d-2 note).\n\n(g) Rule of Construction.--For purposes of the availability       requirement under subsection (b), with respect to a Coast       Guard…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…establishes clear roles for the SEC and CFTC, which  prevents agencies from overreach and confusion. It provides consumer  protections through greater transparency and accountability in the  marketplace. It fosters innovation by providing a pathway for digital  asset firms to operate legally and with confidence, encouraging digital  asset innovation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693773/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Mobilizing and Enhancing       Georgia's Options for Building Accountability, Resilience,       and Independence Act'' or the ``MEGOBARI Act''.       SEC. 2. DEFINITIONS.\n\nIn this Act:\n\n(1) Appropriate congressional committees.--The term       ``appropriate…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…alien cases that will overwhelm our legal system for years. The  nonprofit industry they supercharged is still bloated, and the American  people are still waiting for real accountability.\n\nNow is the time to fix what they broke. We must defund corrupt NGOs,  restore vetting and enforcement, and put the American people first  again. We owe it to our citizens.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…severe       financial instability in the economy. The bill would require       the Federal Deposit Insurance Corporation (FDIC), the Federal       Reserve, the Government Accountability Office (GAO), and the       Office of the Comptroller of the Currency (OCC) to submit       information about bank supervision, regulation, management,       and recommendations…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…with the CCP or CCP-linked  organizations. This is just what we know about.\n\nInstitutions have accepted billions in anonymous foreign funds  without any transparency or accountability. There was even a recent  study from the Institute for the Global Study of Anti-Semitism and  Policy showing how this has infiltrated K-12 classrooms as well as  funding…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]