[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…principled, nonpartisan public servant. He has been recognized by  numerous organizations, including the American Society for Public  Administration, the Association of Government Accountants, and the  National Academy of Public Administration. Earlier this year, he was  inducted into the Government Hall of Fame for his lasting impact on  accountability, fiscal…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…offerings that are exempt from  SEC registration.\n\nWhen going public, companies tend to hire underwriters, like  investment banks, and other professionals, like attorneys and  accountants, to help prepare the IPO. Underwriters serving as  intermediaries between companies and prospective investors typically  receive a set percentage of the IPO price as compensation…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693906/middle-market-ipo-cost-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…on Homeland Security as a result of GAO reports and recommendations.\n\nMr. Dodaro's accolades are known far and wide. He recently received  the Association of Government Accountants' (AGA) Lifetime Achievement  Award for a Legacy of Service, was inducted into Government Executive's  Government Hall of Fame, and received the AGA Chapters Award for  Extraordinary…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…other professions which  were excluded by the Department of Education: physician assistants,  physical therapists, audiologists, speech-language pathologists,  architects, accountants, advanced degree educators, social workers,  dental hygienists, and occupational therapists.\n\nThis proposal by the Department of Education is madness, and Congress  should…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…on H.R. 2965, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas.  Van Duyne).\n\nMs. VAN DUYNE. Mr. Speaker, every day, small business owners serve as  their own accountants, legal counsel, and managers while still handling  the day-to-day operations of their enterprises. That means they work  extra hours or they hire extra assistance just to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…subject and adding accounting education programs as an allowable use of  K through 12 Federal grant funding. I want to thank Senator Rosen for  coleading this bill with me.\n\nAccountants play a key role in today's economy. They serve as trusted  advisers for companies large and small, assist in measuring business  performance, help individuals and businesses…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(``IPOs''). In carrying out such study, the Comptroller       General shall--\n\n(1) consider the direct and indirect costs of an IPO,       including--\n\n(A) fees of accountants, underwriters, and any other       outside advisors with respect to the IPO;\n\n(B) compliance with Federal and State securities laws at       the time of the IPO; and\n\n(C)…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…subject and adding accounting education programs as an allowable use of  K through 12 Federal grant funding. I want to thank Senator Rosen for  coleading this bill with me.\n\nAccountants play a key role in today's economy. They serve as trusted  advisers for companies large and small, assist in measuring business  performance, help individuals and businesses…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}]