[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the floor and used this term a little while ago, a  colleague from New Hampshire. She said: In an authoritarian structure,  the authoritarian believes that the people are accountable to the  authoritarian, and in a democracy, the leader believes that the leader  is accountable to the people. That is the difference.\n\nSo if you are in a situation where…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…tell us that they are struggling to afford prescription  medications, we can't turn around and tell them that they are wrong. We  need to listen to them and hold Big Pharma accountable.\n\nWhen people tell us that they see government as overly bureaucratic  and complex, we can't dismiss that experience and say that it is all  fine. We need to ensure that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…the people and the rule of law, and put the  Constitution ahead of their own ambition. And it depends on every  American being involved and holding their elected leaders accountable.\n\nIf we do that, if all of us do that, I know that our democracy can  remain strong. We can get through this.\n\nThis year, we celebrate 250 years of American democracy. What…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, we all know the public deserves full  transparency when it comes to holding police accountable for  misconduct. Instead, States and cities all across our country have  started adopting new laws to charge the public hundreds of dollars in  fees to view or access police…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…rhetoric that we have allowed to seep into our  politics and into our communities.\n\nIt will take our entire community coming together. We must hold  ourselves and each other accountable. It is the only way forward, and  it is how we honor the legacy of Melissa and Mark.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692854/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…even when we disagree.  Yet, let this not become a moment to silence debate or silence dissent  or silence the truth or those of conscience who work to hold our  leaders accountable and right the wrongs of an unjust world. That is  how history will remember us: those who stood, those who spoke, and  those who fought to protect our democracy and bend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695522/violence-nor-silence-is-the-answer"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…want to do everything that we can to stop it.\n\nBut what is at stake here is the Constitution and the constitutional  provision that the people who are elected and directly accountable--the  House of Representatives and the Members of the U.S. Senate--who have  to make that decision where we know, when it is made to go to war,  there will be people like…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…collaboration.\n\nTogether, they help expand access to capital for businesses central  to our national security, expand the reach of the SBA's Office of Rural  Affairs, hold fraudsters accountable for exploiting the pandemic relief  programs, and modernize the SBA's IT infrastructure.\n\nThese bills are quite simply common sense and would meaningfully  improve SBA services…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…over the country.  They asked me: What will you do as President Trump continues his  unconstitutional activities? Well, Madam Speaker, I rise today to hold  this President accountable.\n\nThe fact of the matter is, the President has committed crime after  crime. I am not concerned about whether this is the right time or if  there are enough votes from my…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the  long-term success and economic mobility of veterans. With that comes a  responsibility to ensure that the programs we approve for GI Bill  funding are high quality and accountable and lead to meaningful  employment.\n\nH.R. 1458, while well intentioned, opens the door for a surge in non- degree-granting, for-profit providers seeking to enroll veterans…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…any State; and  D.C., as a whole, contributes more Federal taxes than 12 States. There  are over 700,000 active residents here who deserve a voice.\n\nD.C.'s government is accountable to the people who live here, and  local leaders should and are empowered to solve local problems without  Congress interfering.\n\nMr. Speaker, I have said this many times:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…every family deserves  to feel safe and respected, knowing that their government is there to  protect their rights and uphold the law. We intend to hold this  administration accountable when they don't, every single time.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…experiment. Canceling more than $20 million  in congressionally authorized funds is both illegal and  unconstitutional, and we must hold DOGE and Secretary Chavez-DeRemer  accountable.\n\nCongress established the Women's Bureau 2 months before women  officially gained the right to vote, 105 years ago this year. Instead  of celebrating its achievements and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…immigration enforcement, including  a complete overhaul of this Agency. Americans want Federal agents to  abide by the same code of conduct as local law enforcement and be held  accountable when they don't. Americans want transparency. Federal  agents shouldn't be masked. They should be required to use body  cameras. But that is just the tip of the iceberg.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican affordability crisis. Every time Americans open their power  bill or see their lights flicker, Republicans are responsible. I think  the American people will hold them accountable.\n\nMadam Speaker, I urge my colleagues to vote ``no'' on this bill, and  I yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker, I rise in opposition to the amendment.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I thank the previous speakers for their  kind words and assistance on this bill. I also will address the Fair  and Accountable IRS Reviews Act.\n\nFor decades, Federal laws required that before the IRS can impose  penalties on a taxpayer, an agent must first receive written approval  from that agent's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…stand.\n\nArctic Frost marked the worst weaponization of government in American  history--worse than Watergate--and I am determined to make certain that  Jack Smith is held accountable and that no American citizen--no one-- ever is going to face the weaponization of the U.S. Government against  them.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Blumenthal and I have  reintroduced the bipartisan Kids Online Safety Act, or KOSA, as we know  it. This is crucial legislation. This is the legislation that will hold  Big Tech accountable and make certain that parents and kids have the  tools, the safeguards, and the transparency they need for young people  to be protected in the virtual space.\n\nAmong its…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Pioneer Well PFAS Treatment Project to help  ensure safe and reliable water for families and businesses. These are  practical, locally requested projects that are transparent,  accountable, and focused on results.\n\nMr. Speaker, this conference agreement reflects a responsible use of  taxpayer dollars while strengthening public safety, water security, and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…referenced in the released       materials, with no redactions permitted under subsection       (b)(1).\n\nMr. JORDAN.  4405.\n\nMr. Speaker, we all support holding bad guys accountable, and we are  all going to vote for this resolution, but I think a little perspective  is important.\n\nDemocrats have spent 6 months talking about Epstein, even though they…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…undermine our security and poison our  communities.\n\nThis action made clear that the United States is serious about  defending our national interests and holding criminals accountable, not  through rhetoric but through results.\n\nI express my deep gratitude to the law enforcement officers,  servicemembers, and intelligence professionals who carried out…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…H.R. 3425, as amended, strengthens oversight of the  Federal Protective Service's contract guard program and ensures  protective security officers are properly trained and accountable.  Additionally, and importantly, this legislation modernizes critical  systems to make Federal buildings safer for employees and the public.\n\nMr. Speaker, I urge support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…textbook example and demonstration of peace  through strength. The message to the entire world is clear: If you  poison and kill the American people, you are going to be held  accountable.\n\nArresting Maduro also advances America's national security. Maduro's  allies and enablers are united in their commitment to undermine our  Nation: China, Russia, Iran,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…to promote the dignity and security of human life in       accordance with the Universal Declaration of Human Rights,       adopted on December 10, 1948; and\n\n(4) to hold accountable persons implicated, including       members of the Chinese Communist Party, in forced organ       harvesting and trafficking in persons for purposes of the       removal…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…his administration and what he is doing to  Make America Great Again.\n\nThe actions taken by Delegate Plaskett reflect poorly on the House,  and this body needs to hold her accountable.\n\nMr. Speaker, I urge all of my colleagues to vote to adopt this  resolution to show the American people that those who colluded with Mr.  Epstein, including Members of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…ones. All Americans would say this  cannot stand.\n\nThe United States must remain steadfast in its commitment to securing  the release of these hostages and holding Hamas accountable for these  atrocities. Under President Trump's leadership, that is exactly what  our country is doing because of President Trump's support for the State  of Israel and his…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…shelter and recover. In the days  following the storm, law enforcement officers from every department  provided extra security for tornado survivors, holding ruthless looters  accountable, setting up posts at disaster recovery centers and securing  temporary housing locations with extra patrols.\n\nThe local first responders have gone above and beyond the call…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…is why we need the DETERRENT Act. It closes these loopholes and  has more strict reporting requirements for foreign funding and  contracts. It also will hold institutions accountable by imposing  fines, such as the loss of student aid funding for schools that  continually fail to comply.\n\nThis bipartisan bill is a commonsense solution to an irrefutable…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…fraudulent funds in its COVID-era programs.\n\nThis level of fraud undermines the integrity of the SBA. It is  essential that we track these criminal fraudsters down and hold them  accountable for their actions.\n\nTwo of these SBA COVID-era programs, the Restaurant Revitalization  Fund and the Shuttered Venue Operators Grant, directed financial  assistance toward…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…the IRS and solely focus  on outcomes for the taxpayer.\n\nWith this improvement, American families will benefit from fewer  headaches when dealing with the IRS and a more accountable government.\n\nThis bill itself is a recommendation from the National Taxpayer  Advocate Purple Book and has been a recommended policy change for quite  a few years.\n\nMr.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}]