[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Act, offered by my friend and  Financial Services Committee chair, French Hill. This bill is the first  step in what I hope will be an effort to reform the definition of  ``accredited investor.'' This bill moves us to add to that definition  by noting that certain experience, licenses, and education can, indeed,  make one an accredited investor.\n\nAt the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…sustainable forest  management practices that reduce wildfire risk.\n\nSpecifically, the ``Forest Legacy Management Flexibility Act'' would  allow States to choose to designate accredited, nonprofit land trusts  to hold conservation easements purchased with federal funding under the  U.S. Forest Service's Forest Legacy Program. Current law requires that  only…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…issues and in his time launched a series of initiatives  to help start conversations worldwide. Among these initiatives were a  variety of trips with political leaders and accredited scientists  discussing issues such as water pollution in the Black Sea, for which  he went on to receive Norway's Sophie prize in 2002.\n\nMichigan's 13th Congressional District…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695458/welcoming-the-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…eighties, and years  of use has led to a rise in unplanned outages. PJM has capacity  accreditation of coal plants at just 83 percent. The Colstrip Coal Mine  in Montana is accredited at only 54 percent. That means it is  effectively unavailable nearly one-half of the time that it is needed.\n\nAs noted by the North American Electric Reliability Corporation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…connect with  others from his hometown. Additionally, he volunteered with the  Vietnamese Red Cross, leading him to assist refugees in the ongoing war  after becoming an accredited doctor.\n\nOn April 29, 1975, shortly after graduating from medical school, Dr.  Vo fled by Navy Ship to escape communist rule, and on May 15, he  arrived at the Guam Orote…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…knowledge of  those risks.\n\nCurrently, companies, or the brokers they hire, can only solicit  these ``investment opportunities'' to individuals who have been deemed  to be accredited investors. This definition is currently based on a  person's income and net worth, meaning only those making a certain  amount of money or possessing a big enough bank account…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3394) to amend the Securities Act of 1933 to codify certain  qualifications of individuals as accredited investors for purposes of  the securities laws, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…and the       revision of rules required under this section:\n\n(1) Angel investor group.--The term ``angel investor       group'' means any group that--\n\n(A) is composed of accredited investors interested in       investing personal capital in early-stage companies;\n\n(B) holds regular meetings and has defined processes and       procedures for making investment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…8 years. In 1986,  Judge Knecht was elected to the Illinois Fourth District Appellate  Court. Currently, he is the longest serving judge in Illinois court  history and an accredited leader within the Illinois law community. He  is a member of the Illinois State and McLean County Bar Associations,  the American Judicature Society, the Illinois Judges'…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694150/congratulating-judge-jim-knecht-on-50-years-of-service"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Dr. Norman Geisler and Dr. Ross Rhoads, Southern  Evangelical Seminary is widely recognized as one of the top 10  evangelical Christian seminaries in the country, offering accredited  programs rooted in a classical philosophy of education.\n\nRecently, SES has further enhanced its national standing as one of  the premier evangelical seminaries in America…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…legislation includes clear protections to ensure  the program operates efficiently and that veterans' benefits are used  responsibly as well. Programs like this one must be accredited,  approved by the VA, and provide regular and substantive interaction  between instructors and students.\n\nThe VETS Opportunity Act is about modernizing our VA benefits and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699510/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "Mr. LaLOTA. Mr. Speaker, one in ten American adults lives with a  disability, yet there are only about 16,000 accredited service dogs  nationwide. These dogs provide more than assistance--they offer  independence, dignity, and healing for children, adults, and especially  our veterans carrying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695913/recognizing-september-as-national-service-dog-month"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Reg D of the SEC is what you  do that under. Those are the rules of the SEC to privately raise money  to help somebody start a business.\n\nIn that effort, you have to be an accredited investor in order to  invest. What if you invented the technology that is doing the business,  but you did  not have a million-dollar net worth and a $250,000 income? Mr.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Act, a bill I lead  with Congressman Cleo Fields, Congresswoman Sarah McBride, and  Congressman Mike Lawler.\n\nThe Equal Opportunity for All Investors Act would expand the  accredited investor definition to include individuals that are  certified through an exam written by the SEC and administered by FINRA.  Accredited investors are individuals that are…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697827/increasing-investor-opportunities-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…protocols for wireless devices and other equipment, such as       the 3GPP and the Institute of Electrical and Electronics       Engineers; and\n\n(3) any standards-setting body accredited by the American       National Standards Institute or Alliance for       Telecommunications Industry Solutions.\n\n(c) Briefing.--Not later than 60 days after the date of the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…investor protections, including the       impact of--\n\n(i) general capital raising restrictions; and\n\n(ii) capital raising restrictions related to individuals       who are not accredited investors.\n\n(2) Report.--Not later than 1 year after the date of the       enactment of this section, and annually for 5 years       thereafter, each of the Federal financial…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…or by affidavit.\n\n``(3) Appearance before board.--A person who requests a       review under this section may appear before the board in       person or by counsel or an accredited representative of an       organization recognized by the Secretary of Veterans Affairs       under chapter 59 of title 38.\n\n``(4) Notification.--A former member of the Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…circuit judge. In 1986,  Judge Knecht was elected to the Illinois Fourth District Appellate  Court. He is currently the longest serving judge in Illinois court  history and an accredited leader within our Illinois legal community.\n\nOutside of the courtroom, Judge Knecht is heavily involved in  communities across Illinois and with his alma maters. He serves…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "French Hill", "party": "Republican", "sentence": "…investors and founders start new  companies and raise funds through regulation D private placements.\n\nI witnessed firsthand on an annual basis routinely how the current  accredited investor definition impaired talented, knowledgeable  innovators from fully participating up front in their business  formation dream.\n\nThis bill, with my good friend from…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692774/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…provides children in Natrona County with  a solid foundation. The center's certified teachers and therapists help  provide a plan tailored to every child and their needs. Its accredited  preschool prepares kids ages three through five for kindergarten.\n\nFor children who need extra assistance, there is the CDC+ program. In  addition to providing speech, occupational,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Waters for their support. I also thank my co-lead on this bill,  Congressman Cleo Fields, for all of his work.\n\nThe Equal Opportunity for All Investors Act would expand the  accredited investor definition to include individuals that are  certified through an exam written by the SEC and administered by FINRA.\n\nAccredited investors are individuals that are…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693887/equal-opportunity-for-all-investors-act-of-2025"}]