[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…Republicans alike have relied on the intelligence community to keep the  country safe. Every President, whether they liked what they were  hearing or not, has depended on accurate, independent analysis to make  decisions that affect millions of lives.\n\nThat is what makes this current moment so alarming. We are  dismantling trust in institutions that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…money. And if you were spending $100,000 a week for the rest of your  life, you wouldn't get near the net worth of Elon Musk.\n\nMr. BOOKER. Yes. Yes.\n\nMr. BOOKER. That is accurate.\n\nIt is stunning that they know that they can't do this, so they are  going to use some budget trickery to mask the truth. Math doesn't lie.  Numbers don't lie. You may be…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…amendment would have made it  absolutely clear that nothing in this bill could be used to censor the  press or authorize retaliation against news organizations for using  accurate names. This administration may have no regard for the  Constitution, but Congress must.\n\nMr. Speaker, I urge my colleagues to remember this and to vote  against this bill.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690943/gulf-of-america-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…dedicated thousands of  hours to serving low-income families through the Ferguson Road  Initiative's Volunteer Income Tax Assistance (VITA) Program. His  unwavering commitment to accurate, free tax preparation has made him a  cornerstone of this vital effort--and a source of immense pride for our  district.\n\nAs both a tax preparer and site coordinator at two…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…is better and more vibrant  because of their contributions and the contributions of millions of  African Americans. No telling of American history is neither complete  nor accurate without acknowledging them. The lesson of this museum is  that all Americans share a past and a future. By staying true to our  principles, righting injustice, and encouraging…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…unfair or deceptive advertising about abortion services and services  that crisis pregnancy centers do and do not offer.\n\nAlso, pregnant students deserve access to medically accurate,  comprehensive planning resources and a full range of reproductive  healthcare options. Yet, the Pregnant Students' Rights Act only  requires colleges to provide information…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…our great Nation.\n\nI strongly believe that we should have a Navy and Marine Corps that  look like our country, where our midshipmen receive an education that  teaches the accurate and full history of this Nation, where the stories  of women and people of color aren't skipped over because they are  inconvenient.\n\nThis is all critical to our national…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…bipartisan  Gang Activity Reporting Act with the gentlewoman from Iowa (Mrs.  Hinson), my fellow appropriator.\n\nThis legislation has an urgent purpose: to give law enforcement the  accurate, comprehensive data they need to combat gang violence and to  keep our communities safe.\n\nFrom 2021 to 2024, law enforcement agencies reported more than 69,000  incidents…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698650/reporting-gang-activity"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…improve grain grading technologies through flexibilities to pursue  modernization. Using new technologies to improve grain grading is an  opportunity to make the process more accurate, efficient, and  consistent.\n\nAdditionally, the bill reauthorizes key USDA authorities for the  grain inspection and grading system and clarifies existing law.\n\nReauthorizing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…recognition of the  National Court Reporters Association's 2026 Court Reporting and  Captioning Week, observed each February to honor the dedicated  professionals who preserve accurate and impartial records of court  proceedings across our Nation.\n\nCourt reporters and captioners are essential to the fair  administration of justice. By creating precise and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…would have offered the motion with an important amendment  to this bill.\n\nMy amendment would make clear that institutions of higher education  will also provide medically accurate and comprehensive information and  resources about all reproductive healthcare services, including  contraception and abortion rights.\n\nThe biased, anti-choice effort underpinning…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that Secretary Hegseth gave  a spoken directive to kill all the occupants of the first alleged drug  boat struck by U.S. forces. If the reports in the Washington Post are  accurate, this may expose those involved to legal consequences.\n\nWhat we need right now more than anything else is the truth, the  facts, which is precisely what Secretary Hegseth…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697173/secretary-hegseth"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…most vulnerable  periods in their lives.\n\nDemocrats offered commonsense amendments that would have required  facilities receiving these Federal funds to provide medically accurate  information. That should not be too much to ask. Republicans rejected  those amendments.\n\nThe American people deserve to know exactly what that means:  Republicans are knowingly…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699215/funding-crisis-pregnancy-centers"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…leveraging its growing economic strength  to do so.\n\nTo address concerns raised by China's conduct in this regard,  American policymakers, including Members of Congress, need accurate  data about the potential risks posed. This includes information about  trade, both legal and illegal investments, demographics, subsidies for  domestic industries, and demand…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Jeff Hurd.\n\nThis legislation, as he described, would extend the Bureau of  Reclamation's Snow Water Supply Forecasting Program through 2031,  ensuring that communities have accurate water supply forecasting.\n\nThis program plays a critical role in advancing new technologies,  expanding snow monitoring areas, and improving the accuracy of water  supply…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697626/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Positioning System (GPS) (using either Selective Availability       AntiSpoofing Module (SAASM) or M-code) guidance capability       that converts unguided free-fall bombs into accurate, adverse       weather ``smart'' munitions. The KMU-559 tail kit is paired       with a MK 83 class warhead to build a GBU-32 JDAM. The JDAM       weapon can be delivered…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…models due to the increased  liability.\n\nThis is not some hypothetical. Unless we make this change, State and  local police departments will have to settle for weaker, less-accurate  taser models due to this misclassification.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…process, Congress will receive a  clear picture of how Federal regulations affect different types of  businesses nationwide. This will help ensure that Congress is acting on  accurate, real-world information.\n\nSome of my colleagues on the other side of the aisle may argue that  the hotline improperly focuses on burdensome regulations rather than  collecting…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…around $70 billion of  spending.\n\nMedicare, 2025 outlays increased by $77 billion, 8 percent. CBO was  projecting only $51 billion. From this scale of accounting, it is  pretty accurate, but you have to understand that we are looking at an  environment right now where we expect Medicare spending to double, to  go from $1 trillion to $2 trillion over the next…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Biden's overspending inevitably was causing inflation; it  was to blame for the rise in the cost of goods. Anybody remember  Bidenomics? Anybody remember Biden inflation? It was accurate because  it was based on debt, and debt causes inflation. When the Federal  Reserves buys the debt and monetizes the debt, that recreates  inflation.\n\nBut the same thing is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Asheville became a lifeline  for our mountain communities. Their around-the-clock coverage reunited  families, connected neighbors with life-saving resources, and delivered  accurate, timely updates when our region faced one of its darkest  hours.\n\nWestern North Carolina is stronger today because of the courage and  dedication of these broadcasters. Their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695854/recognizing-iheartradio-asheville"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the data, masks staffing shortages, complicates funding  decisions, and hinders emergency preparedness.\n\nCorrecting outdated classifications is important because without an  accurate count of the number of EMTs, paramedics, and other emergency  service providers, it creates a challenge to adequately meet the health  and safety needs of our communities.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693039/supporting-our-first-responders"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…publish an implementation plan that       includes--\n\n(A) a timeline for completion of system replacement or       corrective actions; and\n\n(B) procedures to ensure timely and accurate communication       to building tenants regarding contract security personnel       shortages or absences or security coverage gaps.\n\n(b) Report to Congress.--Not later than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…United States Geological  Survey to establish a program that examines the short- and long-term  causes of sinkholes. This research would provide the government with  more accurate data on the costs incurred from these hazards.\n\nThe program would also create maps of areas most at risk of  sinkholes, analyze the areas with the greatest risk of experiencing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…strengthen their local identities, and streamline their  operations.\n\nA unique ZIP Code is more than a number. It is a lifeline. It  supports infrastructure planning by providing accurate data for  economic development. It reduces mail inconsistencies, ensuring that  packages and letters arrive where they are intended.\n\nSeniors and veterans have suffered vital…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…your body, whether this be the Oura ring, whether the  WHOOP, the Apple Watch, the things you can wear, the data from it using  the latest AI packages is statistically more accurate than a human. Why  wouldn't you legalize that to help people keep healthy?\n\nWell, it turns out when you tell a medical professional that, they  get a little cranky at you…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…work. Once again, we work in a  math-free zone.\n\nLet's have a little more fun with reality, change in population by  age. Now, this board is controversial, but the math is accurate. I will  see if I can try to describe this in a way where we can all absorb it.  In 2004, we had, functionally, 77 million that were 18 or younger. We  estimate, in 2035,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…executive actions last week to address misleading prescription drug  advertisements.\n\nThis action will direct the Secretary of Health and Human Services to  ensure that full and accurate information is available on the risks  associated with prescription drugs. It works to prohibit pharmaceutical  companies from promoting drug usage over lifestyle changes.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…on potential biological  threats.\n\nWe must do everything we can to ensure that the tools we rely on  remain as advanced and effective as possible, providing us with fast,  accurate, and reliable data. Unfortunately, DHS has faced continuous  challenges in acquiring capabilities to replace BioWatch.\n\nWhile DHS has the authority to utilize the Department…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…it down completely. You need to shut the Gemini system down  completely.\n\nThe American public deserves to know that, with these AI models, the  information is going to be accurate. It is going to be transparent. It  is going to be fair, and it is not going to be a tool that is going to  be used to fabricate and to smear conservatives.\n\nIn the meantime,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}]