[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…this latest  round, the Trump administration was preparing to disappear a man who  came here legally and had no record, except a traffic violation.  Another was a young man accused of being a gang member because of a  photo with a toy water gun. That is the level of so-called evidence  that gets you locked away in a foreign torture prison under President…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Justice has subsequently launched investigations into officials  involved in prior probes against Donald John Trump, in some cases  against individuals specifically named and accused in flagrantly  improper executive orders.\n\nFurthermore, he has made direct and unambiguous public statements  threatening media outlets, current and  former officeholders,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…understand that my Republican colleagues are going to need  some time to gather the facts, but we already have a statement from the  Department of Homeland Security that has accused Senator Padilla of  being ``disrespectful,'' as if that is a rationalization for violence.\n\nWatch the video. Even if you believe that he was ``disrespectful''-- and, given…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692557/alex-padilla"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…pretrial release decisions       are based on assessments of true risk, rather than wealth. It       would impose mandatory pretrial jailing of people who are       simply accused of certain offenses, a change that is flatly       unconstitutional. Its requirement of cash bail for other       offenses would have a devastating impact on       low-income…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…ethnic group with the aim of destroying that nation or  group.''\n\nThat is exactly what we are seeing in Gaza right now by the Israeli  Government under Benjamin Netanyahu, an accused war criminal by the  International Criminal Court.\n\nThis war isn't a targeted response against Hamas, guilty of the  October 7 attacks and decades of violence. This is a wholesale…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…hours, brushing aside his  explanation, trying to get him to confess to killing Denise.\n\nUltimately, after Aaron wouldn't confess to something he didn't do,  the detectives accused both Aaron and Denise of faking and lying about  the whole thing. The detectives even went as far as putting out a  formal statement, calling the whole thing a hoax and that,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689139/recognizing-seaside-police-department-chief-nick-borges"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…terrorized. Her community  is still shaken.\n\nThis was how a teacher in our community was victimized, and it didn't  stop there.\n\nJuan Espinoza Martinez, also from my district, was accused of serious  conspiracy to commit crimes that never happened. ICE made them up and  publicly smeared his name. Those charges were dropped as well because  they were false.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…regarding this heinous  crime.\n\nThese steps are vital to address the forcible harvesting of organs, a  grave violation of human rights and bodily autonomy. The PRC has been  accused of forcibly harvesting organs from victims who range from  prisoners of conscience, including religious and spiritual adherents,  to ethnic minorities. Shining a spotlight…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…``Commanders,'' as they are often  referred to, recently published a letter urging Jewish diaspora voices  to speak out in favor of ending the violence in Gaza.\n\nThey wrote: ``Accused of weakening Israel or betraying their  connection to the Jewish state, they are told that those who live  abroad or do not serve in the IDF must keep silent. We categorically…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Whereas, the first police report, provided to NBC4 Washington by a  source and confirmed by a second source familiar with the  investigation, said that the 27-year-old woman accused her significant  other for over a year of having grabbed her, shoved her, and pushed her  out of the door, and also said that the woman involved showed the  officer ``bruises…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…in our country.''\n\nWeeks later, a conservative YouTuber named Nick Shirley       posted a video in which he recorded Minneapolis Somali-run       child care businesses and accused them of fraud, claiming       they got public funding but did not serve children.\n\nAfterward, Minnesota investigators visited 10 businesses he       identified and found that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…discharge  petition, including refusing to seat Adelita Grijalva for over 40 days  and threatening House Republicans who signed on.\n\nSeveral of my Republican colleagues have accused us who support  justice here of having Trump derangement syndrome. They suffer from  something much worse, which is pedophile protection syndrome.\n\nMr. Speaker, I ask my colleagues…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696816/epstein-files-transparency-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…yesterday, to answer the question. I have been waiting here. The  American people want to know why a President of the United States would  pardon two drug dealers. They are not just accused. They are convicted  and in jail. They were, but not anymore. They are free men now.\n\nI have been waiting for an answer. I am not playing jokes. This is  very serious. I am…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…attempt to fire more than 40 officers involved in criminal       conduct such as drunk driving, harassment, property damage,       theft, and stalking. Every officer credibly accused of       domestic violence remained on the force, including one       officer who admitted to punching his wife so hard in the face       that he fractured her eye socket,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…He has  arrested a judge and a mayor. He has threatened to arrest a sitting  Governor. He has taken to the floor and handcuffed and detained a  United States Senator. He has accused and caused to be indicted a  United States Congresswoman for having the temerity to do her job by  being at an ICE facility to conduct oversight.\n\nHe has also violated the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…should be investigated? I will name them right  here:\n\nLeon Black: You don't even have to see past the redactions to see  that this man needs to be investigated.\n\nJes Staley: Accused of terrible things. It is right there in the  files. Why is he not being investigated?\n\nLeslie Wexner: Why did the FBI list him as a co-conspirator in their  own documents…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700177/justice-for-epstein-victims"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…documenting a disposition decision on an       investigation by the Coast Guard Investigative Service or       other law enforcement entity investigating a Coast Guard       member accused of an offense against chapter 47 of title 10.\n\n``(b) Record Retention Period.--Work product documents and       the case action summary described in subsection (c) shall be…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…would  say that is the least we could be doing.\n\nThe legislation rightly identifies those responsible, including  members of the Chinese Communist Party, who have been credibly accused  by human rights organizations and U.N. experts of orchestrating  systematic, state-run organ harvesting, primarily targeting prisoners  of conscience from religious and ethnic…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…shape, or form impact the President's authority in terms of determining  who was furloughed, who gets included in a reduction in force. It was  silent. Even though they falsely accused my bill of giving the  President greater authority, it didn't.\n\nI came to the floor again today to pass an amended bill with  furloughed workers--by the way, a bill that is…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…incredibly offensive to our dedicated National Guard members who went  there and have successfully managed to keep the peace.\n\nAs to my colleague from Maryland who has now accused us of defamation  with this cause, whereas California's leadership has prioritized  protecting illegal immigrants and violent individuals over United  States citizens, that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…prosecutors--prosecutors with a mission to put  President Trump in prison when he was a private citizen while he was  between his two terms in office. J.P. Cooney and Molly Gaston  reportedly accused the whistleblower disclosures of violating grand  jury secrecy rules when I obtained 197 of Jack Smith's subpoenas--wide- ranging subpoenas--that violated the privacy of a…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…authoritarian, and calling on the people to push back.\n\nIllinois Governor JB Pritzker claimed ICE is turning the country into  Nazi Germany.\n\nNew York Governor Kathy Hochul accused ICE of ``terrorizing people.''\n\nPennsylvania Governor Josh Shapiro claimed ICE officers ``make our  neighborhoods less safe.''\n\nMinnesota Lieutenant Governor Peggy Flanagan…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Somalia's Minister of Foreign  Affairs running a healthcare company in Toledo, OH, who has a business  partner that works for a Somali money transfer service which has been  accused of financing Islamic terrorism.\n\nYou can't make this up. It goes on and on. So here is more. For  months, a new publication in the State of Maine known as the Maine Wire…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…fat cat insurance companies.\n\nI would also note that much of what the gentleman has been referring  to, the deflection is like a magic trick. You can say words, just like  he accused me of saying many words, but the facts outweigh the  deflection, which is that it took much of 2025 to rid ourselves of the  sleepy Joe, America last, Biden economic hangover,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Whereas the first police report provided to NBC4 Washington by a  source and confirmed by a second source familiar with the investigation  said that the 27-year-old woman accused her significant other for over  a year of having grabbed her, shoved her, and pushed her out the door,  and also said that the woman involved showed the officer bruises on…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…three Americans who should be with us here  today.\n\nIn mid-October, a semi-truck driver in California, in the United  States illegally, with an immigration detainer notice, was accused of  being intoxicated when he slammed into multiple vehicles, killing three  people and injuring several more.\n\nSadly, incidents like this are becoming far too common, and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Robby Starbuck. He is a Tennessean, and he is a conservative  leader in our State.\n\nIn one instance, Google's large language model, Gemma, falsely  claimed that Starbuck was accused of child rape and that I publicly  defended him. Google's AI models have also falsely accused him of being  a former adult film star, of facing criminal drug charges, and…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}]