[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…this amendment has  done--and it is in law from last year; now we are making it permanent  and expanding it--is basically if you are an organization that checks  for factual accuracy, we don't want to do business with you, which is  just a remarkable statement in terms of how we approach this. I think  we should want people to check facts.\n\nFor example,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…communities have accurate water supply forecasting.\n\nThis program plays a critical role in advancing new technologies,  expanding snow monitoring areas, and improving the accuracy of water  supply forecasts.\n\nThis work is extremely vital to supporting Western communities facing  growing challenges of climate change, persistent drought, and growing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697626/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…that have been shared to support this claim. This  claim reportedly came from DOGE, which immediately sets off alarm bells  given the well-documented issues with privacy and accuracy since its  inception.\n\nIt is also troublesome that Republicans are blindly relying on the  SBA Administrator's word. At our committee hearing the day before  yesterday, all…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Security. This is  something that has been normal practice, using very precise identifiers  to make sure that waste, fraud, and abuse do not occur.\n\nBy the way, Social Security's accuracy is 99.7 percent. That has been  verified by outside audits and by the Social Security trustees. Yet,  despite that track record, what they are going to tell Social Security…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…seeking to erase  our history and the people who lived it to fit a whitewashed and  largely fictitious narrative.\n\nThe White House says that the panels were removed to ``ensure  accuracy, honesty, and alignment with shared national values'' and  claims that the panels were aimed at ``demeaning our brave Founding  Fathers.''\n\nThis White House doesn't want Americans…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…professionals who already understand this  complex and deeply consequential area of the law.\n\nHiring experienced veteran law judges will help speed the appeals  process, improve the accuracy of decisions, and reduce unnecessary  appeals to the U.S. Court of Appeals for Veteran Claims.\n\nAccording to the Department of Veterans Affairs, there are  approximately 200,000…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…government facilities and screening visitors for  prohibited items. As part of these efforts, FPS investigators have  covertly tested security at Federal buildings to ensure the accuracy of  these systems and have developed a tracking system to ensure guards are  qualified and posts are staffed adequately.\n\nDespite these efforts, however, guards failed to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…up math. Mr. Speaker, can you  believe that?\n\nThey attack the CBO. They attack the Joint Committee on Taxation,  this and that. I am going to walk us through parts of the accuracy and  what we call the variance report done by the Congressional Budget  Office and try to demonstrate--yes, there are mistakes. They are  actually more accurate than most…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…automation that allows Federal agencies responsible for       environmental reviews or authorizations to expedite routine       tasks and workflows, and improve transparency and accuracy of       project timeline estimates, which in turn can help project       sponsors better plan for application preparation and project       delivery milestones;\n\n(8) taking…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…founder and co-chair of the DOGE Caucus, I am proud to support the  Ending Improper Payments to Deceased People Act. It is a commonsense,  bipartisan effort to strengthen the accuracy of the Death Master File,  improve data sharing across Federal agencies, and ensure that benefits  programs have the timely, reliable information they need to verify  eligibility,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…operations,       productivity, or customer service; and\n\n``(10) how to determine whether an artificial intelligence       tool adequately fills a need and is worth adopting.\n\n``(c) Accuracy and Maintenance.--\n\n``(1) In general.--To the extent practicable, the       Administrator shall ensure that the information contained in       the educational resources and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…(1) the following:\n\n``(2) an analysis of any and all existing deficiencies in       the technology evaluation process and recommendations to       advance the efficiency, accuracy, and consistency of grain       grading and minimize costs imposed on the Federal Government       and the grain export industry; and''.       SEC. 10. FUNDING.\n\nSection 19…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…response to some of the comments of my colleague from Maryland, I  wasn't here in 2004 during the debates that he cited over the original  LEOSA. I have no reason to doubt the accuracy of what he said, but I  would say this: It is now 20 years later, and I think that history has  shown us that many of the concerns presented in 2004 were not, in fact,  realized…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…(GMLRS) and Army Tactical Missile System       (ATACMS). Utilizing the MLRS FOM, the HIMARS can engage       targets between 15 and 300 kilometers with GPS-aided       precision accuracy.\n\n2. The GMLRS M31A2 Unitary (GMLRS-U) is the Army's primary       munition for units fielding the M142 HIMARS and M270A1 MLRS       launchers. The M31 Unitary is a solid…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…paid invoices we  didn't know we paid because there was no tracking mechanism.\n\nIf only, Mr. Speaker, there was a bill to require the Department of  the Treasury to ensure accuracy and eligibility in Federal spending.\n\nWait, there is. I just filed it, Mr. Speaker. It is the Delivering On  Government Efficiency in Spending Act, DOGE in Spending Act.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692480/accountability-and-transparency-in-government"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…military  use.\n\nH.R. 5131 solves that problem by extending these withdrawals for 25  more years and making necessary technical corrections to land  descriptions to ensure accuracy and proper management.\n\nIn Alaska alone, this bill protects more than 850,000 acres of world- class training terrain used by the 11th Airborne Division, the Army's  only Arctic-designated…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697634/public-lands-military-readiness-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…defeating breast cancer.\n\nA regular mammogram is the best way to find breast cancer early. As  screening and treatment have improved, we have also learned more about  the accuracy of mammogram tests. However, if you have what is called  dense breast tissue, it can make it harder for the radiologist reading  the mammogram to see the breast cancer. So…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…radio broadcaster.\n\nDoug's service as a reporter and news director for KWBE in Beatrice  has spanned a remarkable seven different station ownerships. During  that time, his accuracy and professionalism earned the trust of his  listeners and the respect of his colleagues.\n\nDoug's list of accolades features more than 100 awards from the  United Press International…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "James Risch", "party": "Republican", "sentence": "…variants and the Army Tactical Missile System. Utilizing the       MLRS FOM, the HIMARS can engage targets between 15 and 300       kilometers with GPS-aided precision accuracy.\n\n2. The highest level of classification of defense articles,       components, and services included in this potential sale is       SECRET.\n\n3. If a technologically advanced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…reconciliation from tax forms filed for tax year 2023.       We assessed the reliability of all data sets by performing       electronic tests to determine the completeness and accuracy       of key fields. We also reviewed agency documentation and       interviewed knowledgeable agency officials about the       reliability of the data. Overall, we found…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…H.R. 2225 fixes this. It allows funds to exclude expenses related to  BDCs from their AFFE calculation, while still disclosing their  investment in BDCs. This improves both accuracy and transparency. This  is a smart and bipartisan solution that removes an intended barrier to  capital formation without reducing investor protections.\n\nMr. Speaker, I urge…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…to accommodate large voluntary       standardized and integrated data sets on agricultural,       environmental, supply chain, and economic information with       variable accuracy and scale.\n\n(3) Promote collaboration, open community-based       development, and data and information sharing between Federal       agencies, National Laboratories, institutions…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}]