[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…is better and more vibrant  because of their contributions and the contributions of millions of  African Americans. No telling of American history is neither complete  nor accurate without acknowledging them. The lesson of this museum is  that all Americans share a past and a future. By staying true to our  principles, righting injustice, and encouraging…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…our great Nation.\n\nI strongly believe that we should have a Navy and Marine Corps that  look like our country, where our midshipmen receive an education that  teaches the accurate and full history of this Nation, where the stories  of women and people of color aren't skipped over because they are  inconvenient.\n\nThis is all critical to our national…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…would have offered the motion with an important amendment  to this bill.\n\nMy amendment would make clear that institutions of higher education  will also provide medically accurate and comprehensive information and  resources about all reproductive healthcare services, including  contraception and abortion rights.\n\nThe biased, anti-choice effort underpinning…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…recognition of the  National Court Reporters Association's 2026 Court Reporting and  Captioning Week, observed each February to honor the dedicated  professionals who preserve accurate and impartial records of court  proceedings across our Nation.\n\nCourt reporters and captioners are essential to the fair  administration of justice. By creating precise and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…needed to build successful and  dignified lives after service.\n\nTo ensure veterans receive the support they deserve, the Department  of Veterans Affairs must provide timely and accurate data on program  outcomes. Veterans should not have to endure excessive wait times  before accessing their critical services. This requires the VA to  report on employment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695446/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…money. And if you were spending $100,000 a week for the rest of your  life, you wouldn't get near the net worth of Elon Musk.\n\nMr. BOOKER. Yes. Yes.\n\nMr. BOOKER. That is accurate.\n\nIt is stunning that they know that they can't do this, so they are  going to use some budget trickery to mask the truth. Math doesn't lie.  Numbers don't lie. You may be…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the  United States and no longer accept attestation?\n\nEach of us must submit records to the FEC, attesting under penalty of  perjury that our campaign committee reports are accurate. Do  Republicans now want to provide the American people greater  transparency around political spending because if they do, I have a  bill they can support, the Freedom to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…algae shut down beaches, contaminated  shellfish, and put about 40 Oregonians in the hospital with a paralytic  shellfish poisoning. States, hospitals, and families deserve accurate  information about what they are exposed to and what they consume. This  should not be a luxury. This is a public service and expectation that  we should be able to rely on,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that Secretary Hegseth gave  a spoken directive to kill all the occupants of the first alleged drug  boat struck by U.S. forces. If the reports in the Washington Post are  accurate, this may expose those involved to legal consequences.\n\nWhat we need right now more than anything else is the truth, the  facts, which is precisely what Secretary Hegseth…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697173/secretary-hegseth"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…amendment would have made it  absolutely clear that nothing in this bill could be used to censor the  press or authorize retaliation against news organizations for using  accurate names. This administration may have no regard for the  Constitution, but Congress must.\n\nMr. Speaker, I urge my colleagues to remember this and to vote  against this bill.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690943/gulf-of-america-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…dedicated thousands of  hours to serving low-income families through the Ferguson Road  Initiative's Volunteer Income Tax Assistance (VITA) Program. His  unwavering commitment to accurate, free tax preparation has made him a  cornerstone of this vital effort--and a source of immense pride for our  district.\n\nAs both a tax preparer and site coordinator at two…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Jeff Hurd.\n\nThis legislation, as he described, would extend the Bureau of  Reclamation's Snow Water Supply Forecasting Program through 2031,  ensuring that communities have accurate water supply forecasting.\n\nThis program plays a critical role in advancing new technologies,  expanding snow monitoring areas, and improving the accuracy of water  supply…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697626/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…bipartisan  Gang Activity Reporting Act with the gentlewoman from Iowa (Mrs.  Hinson), my fellow appropriator.\n\nThis legislation has an urgent purpose: to give law enforcement the  accurate, comprehensive data they need to combat gang violence and to  keep our communities safe.\n\nFrom 2021 to 2024, law enforcement agencies reported more than 69,000  incidents…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698650/reporting-gang-activity"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Kong,  Tibet, Burma and, as I mentioned, Iran, NED provides vital resources  for those advocating for freedom. This amendment would halt efforts to  provide citizens with accurate information, exposing corruption and  brutality of some of these regimes and kneecapping protesters who are  pleading for freedom.\n\nIf we withdraw our support and abandon…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699042/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…leveraging its growing economic strength  to do so.\n\nTo address concerns raised by China's conduct in this regard,  American policymakers, including Members of Congress, need accurate  data about the potential risks posed. This includes information about  trade, both legal and illegal investments, demographics, subsidies for  domestic industries, and demand…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Positioning System (GPS) (using either Selective Availability       AntiSpoofing Module (SAASM) or M-code) guidance capability       that converts unguided free-fall bombs into accurate, adverse       weather ``smart'' munitions. The KMU-559 tail kit is paired       with a MK 83 class warhead to build a GBU-32 JDAM. The JDAM       weapon can be delivered…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…will also require DOI to identify and approve mining projects       which can be expeditiously permitted and made operational as       well as continue prioritization of accurate national mapping       of hardrock mineral resources.\n\nThe provisions of H.R. 4090 all represent necessary actions       to securing domestic mineral supply chains. Congress…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…process, Congress will receive a  clear picture of how Federal regulations affect different types of  businesses nationwide. This will help ensure that Congress is acting on  accurate, real-world information.\n\nSome of my colleagues on the other side of the aisle may argue that  the hotline improperly focuses on burdensome regulations rather than  collecting…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…on the floor. Whatever happens, don't get  caught, right?\n\nMr. Speaker, I am going to try three things tonight. I will upset a  number of folks. I am sorry. My math will be accurate because we have  spent the last couple of days double-checking it.\n\nI am going to try to do something a little insane. I am going to walk  folks through the Social Security…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…other       cameras and lights, shall not be directed at the witness.       Such requests shall be ruled on by the Subcommittee Members       present at the hearing.\n\n12. An accurate stenographic record shall be kept of the       testimony of all witnesses in executive and public hearings.       The record of a witness's own testimony, whether in public…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…on potential biological  threats.\n\nWe must do everything we can to ensure that the tools we rely on  remain as advanced and effective as possible, providing us with fast,  accurate, and reliable data. Unfortunately, DHS has faced continuous  challenges in acquiring capabilities to replace BioWatch.\n\nWhile DHS has the authority to utilize the Department…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…public       website of the Food and Drug Administration--\n\n(A) educational materials about the Tissue Reference Group;       and\n\n(B) best practices for obtaining a timely, accurate       recommendation regarding human cell and tissue products from       the Tissue Reference Group.\n\n(2) Public information.--Not later than 1 year after the       date of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…economy. They serve as trusted  advisers for companies large and small, assist in measuring business  performance, help individuals and businesses file their taxes in an  accurate and timely manner, assist government entities with their  finances, and even investigate instances of financial fraud. Yet the  United States is facing a shortage of accountants…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Under the Constitution, Congress has the power to regulate commerce  with foreign nations and impose tariffs. It is Congress' duty to review  whether what he is doing is accurate or not. Even though it is our  review, this is another area where Republicans don't want to have the  debate on this floor. They are hiding behind these things they stick…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…watch this video because the  junior Senator from California stated that himself. It has been shown  to not a partisan but a bipartisan group of individuals who do have the  accurate oversight and clearances to watch it.\n\nNow, what is this really about? Politics? Maybe.\n\nDuring the junior Senator's time on the House Intelligence Committee,  then-President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698424/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fast. Are we out of our minds?\n\nThat technology is not in the code yet. We have not legalized saying,  I can let AI, even though they claim the statistics of it would be more  accurate than humans out walking the site. We can do things  dramatically faster.\n\nThere was a great article. I think it may have been in The Economist  or the Financial Times a couple…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…around $70 billion of  spending.\n\nMedicare, 2025 outlays increased by $77 billion, 8 percent. CBO was  projecting only $51 billion. From this scale of accounting, it is  pretty accurate, but you have to understand that we are looking at an  environment right now where we expect Medicare spending to double, to  go from $1 trillion to $2 trillion over the next…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…suppression, I would call it the loon  wing of the party, the loon wing of the Democratic Party or you might  call it the Bolshevik wing of the Democratic Party.\n\nI think a more accurate description is to call it the socialist wing  of the Democratic Party. I think that is fair. I am not saying that all  of my Democratic friends are socialists, but there is…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…work. Once again, we work in a  math-free zone.\n\nLet's have a little more fun with reality, change in population by  age. Now, this board is controversial, but the math is accurate. I will  see if I can try to describe this in a way where we can all absorb it.  In 2004, we had, functionally, 77 million that were 18 or younger. We  estimate, in 2035,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…compile evidence, automate Federal  Government data sharing, and generate notice letters to veterans. These  improvements are common sense and would lead to more efficient and  accurate decisions on benefit claims.\n\nThis bill would require the VA to detail how it would provide these  improvements to other benefit programs in the Veterans Benefits  Administration.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}]