[{"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to acknowledge the celebration of  the Reverend Troy DeCohen, senior pastor of the Mount Vernon Heights  Congregational Church, in this year completing his 25th year of  pastoral leadership.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Franklin Roosevelt put  the program together? Why? It is simple: So they can cut taxes for the  rich.\n\nThis is a heist. If JD Vance had any intellectual honesty, he would  acknowledge he was wrong when he said ``40 percent of the people who  are calling are actually committing fraud,'' but I am not holding my  breath.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689776/social-security"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…future. Surely we did not build a new nation conceived in  liberty only for its Capitol to one day be stormed by a mob at the  behest of a President because he refused to acknowledge the basic right  of every American to vote him out of office, to be free to disagree  with him and reject him.\n\nWhen the Declaration of Independence was signed, John Adams…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, first, I want to acknowledge my colleagues  from Minnesota Senator Smith and Senator Klobuchar.\n\nYou have conveyed to us the deep pain and anguish that you feel and  that every Minnesotan feels about…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…weighing that cost.\n\nThe President has threatened the possibility of additional strikes in  Venezuela if Venezuela does not ``behave.'' And by ``behave,'' I think  we have to acknowledge that the behavior the President expects is for  that country to share access to its oil wealth with American oil  companies. Many of those companies are dubious about investing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…The Congressional Award is the highest award for youth legislated and  presented by the United States Congress  to young people. It is a noncompetitive program designed to acknowledge  young people for their initiative, achievement, and service.\n\nOver 8.1 million hours of service have been contributed to  communities across the country as part of the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698224/congressional-award-program-reauthorization-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…course, I particularly want to commend Subcommittee Chair  Bilirakis and Ranking Member Schakowsky for their years of hard work on  this legislation.\n\nFinally, I need to acknowledge, Mr. Speaker, the contribution of my  late colleague and dear friend from New Jersey, Congressman Bill  Pascrell. He was a tireless advocate and leader on improving the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…even astronauts. We all come together, and we--Congress--decide how  to fund America's budget, not the guy in the White House. Now, before I  wrap up, I would like to again acknowledge my colleagues across the  Capitol who came to the table with us to do the hard work of hammering  these bills out.\n\nGetting these funding bills written and passed is not…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Caribbean American Heritage  Month Commemorative Committee to ensure continued recognition and  celebration of this important month.\n\nIt is essential that Congress continues to acknowledge the invaluable  contributions of Caribbean Americans to our nation's history and their  role in shaping our future.\n\nMr. Speaker, I urge my colleagues to join me in honoring…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the constitutional rules of the  game.\n\nTo me, it is a matter of great regret and melancholy that somehow it  has become politicized to the point where people can't even acknowledge  what they were saying at the time. We had Republican leaders who were  describing it as terrorism and saying it was absolutely inexcusable and  indefensible. Now, all of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…other Members across this country.\n\nIt is the attacks that we see on such things that hits a little bit  differently during Black History Month because it is a failure to  acknowledge the history. It is a failure to acknowledge a group of  people who persevered through the worst of circumstances in this  Nation, a group of people who literally emerged…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "Mr. SORENSEN. Mr. Speaker, I rise today to acknowledge one of the  most cherished organizations in my district and the efforts to continue  their storied mission of serving with the greatest care and love. As we  know, September…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694928/recognizing-childhood-cancer-awareness-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and these communities are trying to  restore themselves.\n\nThere is a greatness to these communities. There is an industrial  muscle and a patriotism that is important to acknowledge and not to  say: Well, we are done with them.\n\nNo. We need to focus on these regions just as we do in Appalachia and  with the other kinds of instrumentalities that exist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…importantly, reauthorizing  AGOA sends a very strong message that, even though the President's  rhetoric toward many African countries has been a distraction, we in  Congress do acknowledge the very important role that the continent of  Africa plays.\n\nTo be clear, AGOA is not just a priority for the Congressional Black  Caucus, although it is. It has been a…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of my pen as a lawmaker, using the power of       my platform, using the power of convening, which is what       brings us here today.\n\nI also do want to take a moment to acknowledge the       indefatigable efforts of my staff that I call the A team who       make great personal sacrifices and labor in love on behalf of       the Massachusetts Seventh…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Week. On Sunday, we kicked off Read Across America Day,  marking the start of National Reading Month.\n\nEach March, teachers, students, parents, librarians, and more all  acknowledge the importance of literacy and reading for all Americans.\n\nFor more than 20 years, Read Across America has been a nationwide  tradition, held annually on March 2 in honor…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688379/recognizing-read-across-america"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…taxation, the criminal code, and  the election of city council members who create essential ordinances,  including those that dictate voting rights.\n\nIt is also important to acknowledge that many local elections are  decided by razor-thin margins, underscoring their significance and the  importance of active participation.\n\nI find it unimaginable that the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…respects, the Grand       Staircase RMP affirms the Proclamations' directives and       implements measures to protect the GSENM. The Grand Staircase       RMP provisions that acknowledge GSENM and specify its       boundaries simply reflect the legal status of the land as       established by the President under the Antiquities Act. Some       directives…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…provisions that fall       within the jurisdiction of the Committee on Agriculture and       appreciate your willingness to forgo further consideration of       the bill. I acknowledge that the Committee on Agriculture       will not formally consider H.R. 2492 and agree that the       inaction of your Committee with respect to the bill does not…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the sake of regulations, and the American  people are left to pay higher prices and have fewer choices.\n\nAt the end of the day, Mr. Speaker, my colleagues simply refuse to  acknowledge the natural dynamics of the marketplace. When left to their  own devices, the American people will seek out the most efficient model  of an appliance that they can afford.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…asserted, then why would a Federal court provide such an  order?\n\nWe went after waste, fraud, and abuse through our rescissions  package, and once again, Democrats refused to acknowledge that that  premise ever existed.\n\nMr. Speaker, we are cutting out waste, fraud, and abuse. We are  becoming fiscally responsible. We are putting the American family first…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…that blends adventure, education, and conservation.            Honoring Mrs. Wilkes' Dining Room in Savannah, Georgia\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to acknowledge a  true southern institution, Mrs. Wilkes' Dining Room in Savannah,  Georgia, which was recently highlighted on Southern Living's bucket  list.\n\nIn the Hostess City of the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…times.\n\nI thank President Trump for this initiative.             Recognizing Efforts to Restore Gettysburg Monuments\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to acknowledge  the efforts of the Gettysburg National Military Park to restore several  monuments. These restoration efforts follow the vandalism of historic  monuments at Gettysburg.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…no God. Marxism is  wrong.\n\nThis Congress made a stand those many years ago, and we should do it  again. We are different. We are distinct. We are exceptional because we  acknowledge that right there, our motto.\n\nIt doesn't say in government we trust. It says: ``In God We Trust,''  and we better remember that. He has blessed us with this grand  experiment…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…was torturing and driving fear into the hearts of  the people in Aurora, Colorado, in the apartment complexes that my  colleagues on the other side of the aisle refuse to acknowledge. These  are all the same people who are being allowed to vote, the same people  that we were elected in November to remove from the country.\n\nThe President of the United…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "John Carter", "party": "Republican", "sentence": "…at this  point to vote against it.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. CARTER of Texas. Mr. Chair, I yield myself the balance of my  time.\n\nMr. Chair, I acknowledge and ask my colleagues to support the fiscal  year 2026 Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act.\n\nThis legislation provides critical…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Mr. Speaker, I rise today to acknowledge and thank John  McIntyre (Mac) Tolar for dedicating over three decades of service to  our Nation's military, state, local, and federal governments, including  the past thirteen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Mr. Speaker, I rise today to acknowledge a special  anniversary in Alabama's 4th Congressional District. One hundred years  ago, on September 12, 1925, Wilson Dam began commercial operations. As  a part of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695404/recognizing-wilson-dam-on-its-100th-anniversary"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…WESTERMAN. Mr. Speaker, this bill will more appropriately reflect  the varied and unique history of the timeless landmarks in Salem,  Massachusetts.\n\nI thank my friend and acknowledge Representative Moulton for his work  on this bill.\n\nMr. Speaker, I thank my friend and acknowledge Representative Moulton  for his work on this bill, and I urge its adoption.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691015/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…had been saying all along. Marines  who served in Vietnam were 30 percent more likely to die from this  disease than those who served elsewhere.\n\nStill, the VA refuses to acknowledge this as a service-connected  condition. Mr. Speaker, that is unacceptable.\n\nWe have seen this pattern before with Agent Orange, the blue water  Navy, and now, again, with…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}]