[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the constitutional rules of the  game.\n\nTo me, it is a matter of great regret and melancholy that somehow it  has become politicized to the point where people can't even acknowledge  what they were saying at the time. We had Republican leaders who were  describing it as terrorism and saying it was absolutely inexcusable and  indefensible. Now, all of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…use. While these devices can cause serious bodily harm when       used on adults, they pose an even greater risk to children.       Even manufacturers of these devices acknowledge that       deploying them on young people increases the risk of death or       severe injury. It is therefore dangerous to expand access to       these devices before creating…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…prosecution  in the history of the Department of Justice. Over 1,000 individuals  were convicted and prosecuted for their activity that day.\n\nThe fact that this nominee couldn't acknowledge what happened that  day and denounce the violence perpetrated against law enforcement is  troubling. If you can't stand up for the men and women who keep us safe  at this…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…devastating       consequences this decision will have on our communities.       Rather than terrorizing an already vulnerable mass of people,       the Trump administration should acknowledge the incredible       contributions these individuals have made and create a path       to citizenship for the hardworking and beloved TPS holders in       our nation.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…working families, we could have an  intellectually honest conversation about what this budget and Trump's  tariffs do. Yet, we can't because that would force the other side to  acknowledge the truth.\n\nThe truth is that this budget was written by the rich, for the rich,  to help the rich get richer. That is what this is: a massive transfer  of wealth from those…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…weighing that cost.\n\nThe President has threatened the possibility of additional strikes in  Venezuela if Venezuela does not ``behave.'' And by ``behave,'' I think  we have to acknowledge that the behavior the President expects is for  that country to share access to its oil wealth with American oil  companies. Many of those companies are dubious about investing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…even astronauts. We all come together, and we--Congress--decide how  to fund America's budget, not the guy in the White House. Now, before I  wrap up, I would like to again acknowledge my colleagues across the  Capitol who came to the table with us to do the hard work of hammering  these bills out.\n\nGetting these funding bills written and passed is not…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…relationship with, like their current mortgage lender. If the consumer  opts in, and you can opt in, then you can have everybody call you.\n\nNow, I want to take a moment to acknowledge the good work of our  former colleague Representative Lacy Clay who helped pave the path by  first introducing a bill to curb abusive trigger leads clear back in  2020.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Caribbean American Heritage  Month Commemorative Committee to ensure continued recognition and  celebration of this important month.\n\nIt is essential that Congress continues to acknowledge the invaluable  contributions of Caribbean Americans to our nation's history and their  role in shaping our future.\n\nMr. Speaker, I urge my colleagues to join me in honoring…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of fighting for his  return, Itay's family learned that he was also murdered that terrible  day.\n\nThis is the depths of Hamas' cruelty. For months, they refused to  even acknowledge that Omer and Itay had been murdered. They kept these  families in anguish, in the dark. What a horrible feeling to wonder if  your child is alive or dead. Hamas knowing…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to back off. Racism has to be fought. It has  to be dealt with because it, too, exists in this country.\n\nWe cannot pretend that racism doesn't exist. If we are going to  acknowledge invidious discrimination, we have to acknowledge it in all  of its forms, and I would hope that CNN would get a better  understanding of what it is doing by managing racism…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…militaries. This special  relationship has not only strengthened defense readiness but also  developed personal connections that enrich both our communities.\n\nI would also like to acknowledge the role of our partners in Guam,  who have joined this trilateral cooperation in recent years. Their  collaboration strengthens the regional fabric of security and  partnership.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Civil Rights Act of 1964, investigating thousands of allegations of  discrimination each year which deny African Americans, in particular,  of an opportunity.\n\nMr. Speaker, I acknowledge and dedicate this poem to our great  leader, the President of the United States, in honor of Maya Angelou,  whose birthday was April 4. I dedicate to them a message from…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…other Members across this country.\n\nIt is the attacks that we see on such things that hits a little bit  differently during Black History Month because it is a failure to  acknowledge the history. It is a failure to acknowledge a group of  people who persevered through the worst of circumstances in this  Nation, a group of people who literally emerged…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. FIGURES. Mr. Speaker, I rise today to acknowledge that September  is Sickle Cell Awareness Month. It is a time to recognize the  challenges faced by those living with this debilitating genetic  disease.\n\nThis disease is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695786/sickle-cell-awareness-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to the family of Corey Comperatore.\n\nEach and every time the President recognized one of these individuals  in the gallery, there was a premeditated refusal to stand and  acknowledge them.\n\nWe know that my colleagues on the other side of the aisle know how to  do it. During President Biden's State of the Union Addresses, which, by  the way, his last…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…the national  press. When their families were honored by President Trump in his  address to Congress last year, many Democrats refused to even applaud.\n\nIf the left does acknowledge their existence at all, it is only to  accuse us of weaponizing their deaths, but their deaths are not a  weapon; they are a fact, a bitter and unshakable reality, a stubborn…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…provisions that fall       within the jurisdiction of the Committee on Agriculture and       appreciate your willingness to forgo further consideration of       the bill. I acknowledge that the Committee on Agriculture       will not formally consider H.R. 2492 and agree that the       inaction of your Committee with respect to the bill does not…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…most important asset is its remarkable and steadfast  employees, whose work is essential to keeping its operations running  efficiently and effectively. The employees we acknowledge today are  distinguished by their hard work, dedication, and professionalism in  support of House Members, their staff, and constituents, as well as for  their daily contributions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, I am grateful for the time you have  granted me to acknowledge a stunning accomplishment by one of our high  school athletes in Utah's Third District, Jane Hedengren.\n\nJane runs track for Timpview High School in Provo, Utah. In an…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692882/congratulating-jane-hedengren"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Speaker, I rise today to honor my parents, Albert  and Sarah Stutzman.\n\nThey are celebrating their 50th anniversary this Saturday, one day  after Valentine's Day. I just want to acknowledge them in all that they  have done for me and for my siblings.\n\nThey have really been an example of what hard work and what faith can  do in a great country like America.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700043/happy-50th-anniversary-albert-and-sarah-stutzman"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…TILLIS. Mr. President, I will get to the primary reason that I  asked for time on the floor today. I did want to say that, if it was  within the rules and I would be able to acknowledge people in the  Gallery who happen to be my great staff who have done extraordinary  casework for years and years, and they are visiting here--if it was  within the rules…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and it is  unfortunate that we have to do a CRA on an  endangered species listing, but that is what happens when  administrations make bad decisions.\n\nMr. Speaker, first, I acknowledge and agree with my friends from  across the aisle. Mark Twain was correct. The more I learn about water,  the further west you go, the more it is for fighting. We can agree…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…provisions that fall       within the jurisdiction of the Committee on Agriculture and       appreciate your willingness to forgo further consideration of       the bill. I acknowledge that the Committee on Agriculture       will not formally consider H.R. 3937 and agree that the       inaction of your Committee with respect to the bill does not…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…was torturing and driving fear into the hearts of  the people in Aurora, Colorado, in the apartment complexes that my  colleagues on the other side of the aisle refuse to acknowledge. These  are all the same people who are being allowed to vote, the same people  that we were elected in November to remove from the country.\n\nThe President of the United…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…LeTourneau, Nancy Rariden, Greg Wade, Diane Byrd and stepdaughter  Kellie Grief. He is also survived by 12 grandchildren and 20 great- grandchildren.\n\nIt is my great privilege to acknowledge Mr. Wade's patriotic pride  and celebrate his military service today before the United States House  of Representatives.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…provisions that fall       within the jurisdiction of the Committee on Armed Services       and appreciate your willingness to forgo further       consideration of the bill. I acknowledge that the Committee       on Armed Services will not seek an additional referral on the       bill and agree that the inaction of your Committee with       respect to the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…in my district in northwest Florida.  Florida serves as one of the most veteran-friendly States in the entire  country.\n\nMr. Speaker, it is with great sorrow today that I acknowledge the  passing and honor the memory of one of those great heroes, Captain  Allen Colby Brady of Pensacola and his outstanding service to the  United States.\n\nCaptain Brady…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…taxation, the criminal code, and  the election of city council members who create essential ordinances,  including those that dictate voting rights.\n\nIt is also important to acknowledge that many local elections are  decided by razor-thin margins, underscoring their significance and the  importance of active participation.\n\nI find it unimaginable that the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…and will continue to do  so, but that does not give license to millions of foreign nationals to  violate those same laws.\n\nThat is the simple truth the Democrats refuse to acknowledge.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}]