[{"senator": "Donald Norcross", "party": "Democrat", "sentence": "…the intelligence,  surveillance, and reconnaissance aircraft; and tactical munitions.\n\nThis bill also includes the subcommittee's multiyear effort to manage  the largest acquisition program in the history of the Department of  Defense. Yes, that is the F-35 Joint Strike Fighter program. This year,  the bill extends by 5 years the annual Government Accountability…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…member of the House Armed Services Committee.\n\nMr. Speaker, I rise in support of the FY26 National Defense  Authorization Act. Importantly, the bill reforms the outdated  acquisition process at the Department of Defense. It provides a pay  raise for our servicemembers, supports our allies in Europe, including  Ukraine, and takes other steps to strengthen…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…working tirelessly to ensure our Sailors and Marines had the  necessary authorities, weapon systems, and capabilities; and leading  efforts to secure the most significant acquisition reforms in a  generation. Phil exemplifies the qualities of the best professional  staff members--bipartisan, collaborative, deeply knowledgeable,  politically astute on…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…IPO.\n\nThis bill will eliminate this regulatory hurdle by ensuring EGCs only  need to provide 2 years, not 3, of audited financials across the board,  whether for an IPO, an acquisition, or a follow-on offering.\n\nThis bipartisan legislation will further reduce the burden on EGCs  trying to raise capital, cutting red tape and burdensome regulations to  help…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693856/greenlighting-growth-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…restricts deadly force; bans neck restraints; limits       high-speed police pursuits in a dense city where bystanders       are most likely to be hurt; and regulates the acquisition of       military-grade weapons. These reforms were enacted because       these dangerous tactics have repeatedly killed District       residents, disproportionately Black…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…technology the federal government can help provide. Our partnership has  expanded training for ``front line'' firefighters and advanced rescue  capabilities through the acquisition of cutting-edge thermal imaging  technologies to better locate victims in low-visibility environments.  As we look ahead, I remain committed to working with Metro Fire to…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…campaigns for  property tax levy approval; securing approval of multiple bond issues  for capital improvements on two hospital campuses; supporting the  Hospital Hill property acquisition efforts and urban renewal  attainment; securing numerous Affordable Care Act grants; securing the  hospital's selection with MO HealthNet; working alongside dozens of  stakeholders…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…throughout that process and worked with the Senate. I thought  we had a very good bicameral, bipartisan agreement this year.\n\nThe chairman is right. The highlight of this bill is acquisition  reform, something that our committee has worked on for quite some time.  For the last 2 years, in particular, we have been really focused on how  to get this right, and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of the ASCEND Act. The bill would  codify the successful Commercial Satellite Data Acquisition pilot  program.\n\nThe data acquired from the pilot project was shown to complement  Earth observations from NASA's fleet of satellites and instruments.  NASA has continued…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700116/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Connor Young, Amira       Zaidi, and Kristina Zuccarelli.\n\nThe Capitol venues team was led by Grant Scherling from the Office of  the House Chief Administrative Officer, whose acquisition and use of  detailed Capitol complex maps, schematics, and diagrams were essential  to the planning effort. The east front team of Michael Delaune and  Brian Hublar coordinated…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…fair  debate, a fair discussion, and we produced what I think was an  excellent product.\n\nIt is worth remembering what is in that base bill. The single biggest  thing is acquisition reform, which is every little bit as important as  it is boring to talk about. It is hard to dive into the details of who  is making this decision, the other decision.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…racial bias and de-escalation tactics, the creation of public       databases of sustained officer misconduct cases, and the       prohibition of the possession or acquisition of military       weapons by law enforcement agencies.\n\nHistorically criminal justice laws and policies have been       determined by local jurisdiction based on their specific…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…in 2005 after  serving many years on the NOVA Parks Board. During his tenure as  Executive Director, Mr. Gilbert remained steadfastly dedicated to  public service in land acquisition, conservation, and management.\n\nUnder Mr. Gilbert's visionary leadership, NOVA Parks completed 22  major land-acquisition transactions totaling over 1,800 acres of  parkland,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…will be devastating to the academic achievement of kids  and students across the country. Republicans want to have it both ways.  They want to eliminate title III English acquisition grants for English  language learners. While the rest of the world is pushing to have their  children and their students master and be proficient in more than one  language…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694834/fy-2026-education-cuts"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…inverted domestic corporation if, pursuant to a plan (or a       series of related transactions)--\n\n``(A) the entity completes after May 8, 2014, the direct or       indirect acquisition of--\n\n``(i) substantially all of the properties held directly or       indirectly by a domestic corporation, or\n\n``(ii) substantially all of the assets of, or substantially…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…agreement dating back to the 1796 Treaty with the Seven Nations of  Canada.\n\nThis historic settlement provides long-term certainty and remedies in  terms of lands, land acquisition, payment of past property taxes, and  will greatly benefit our North Country community.\n\nFor the Saint Regis Mohawk Tribe, today's action represents the  resolution of a…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…risk assessments of the 504 loan portfolio.\n\nThe 504 program is an incredibly important tool that helps small  businesses obtain long-term, fixed-rate financing like the acquisition  of fixed assets such as land, buildings, and heavy machinery.\n\nIn fiscal year 2025, the program supported $7.8 billion in loans to  small businesses nationwide. Specifically,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for our communities and, of  course, recreational opportunities for millions of visitors every year.\n\nThat is why it is so important that any decisions made regarding the  acquisition or disposition of these lands be made only after  significant and meaningful local input.\n\nThe communities most affected by our decisions must be willing  partners in any…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…earlier  this year.\n\nMr. Speaker, I rise today in strong support of this year's NDAA. I  thank Chairman Rogers and Ranking Member Smith for their leadership on  the critical acquisition reforms in this bill. I also thank my good  friend, Subcommittee on Seapower and Projection Forces Ranking Member    Joe Courtney, for his dedication to supporting our naval…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697808/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…better prepare. The National  Defense Authorization Act for Fiscal Year 2026 continues to press  needed reform to make our military more lethal and ready.\n\nAccelerating the acquisition cycle, slaying a bloated military  construction process, delivering environmental stewardship to  communities impacted by PFAS, and providing quality housing for our  servicemembers,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697789/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…18 months after the date of enactment of this Act, the Chief       Information Officer of each agency, in consultation with the       Chief Financial Officer, the Chief Acquisition Officer, the       Chief Data Officer, and General Counsel of the agency, or the       equivalent officials of the agency, shall complete a       comprehensive assessment…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Capabilities to Enable  New Discoveries Act, the ASCEND Act.\n\nThis bill builds on a model that already works. In 2017, NASA  launched the Commercial Small Satellite Data Acquisition Pilot Program  to test whether commercially available Earth observation data could  support NASA's scientific missions. The results were clear:  Participating scientists…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700117/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Mohawk Nation Council of Chiefs v. The State of       New York, et al. (89-CV-829).       SEC. 2. LANDS OWNED BY SAINT REGIS MOHAWK TRIBE WITHIN                     SETTLEMENT ACQUISITION AREAS.\n\nThe following shall be Indian Country as defined in section       1151(a) of title 18, United States Code, subject to the       terms, conditions, and limitations…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…It is an American issue, Mr. Speaker.\n\nHere is what is happening: When a Federal agency determines they have  a need for certain products or services, then that agency's acquisition  personnel will post a solicitation on the Federal Government's SAM.gov  website for a contract to fill the requirements. That solicitation lays  out what the agency wants…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…shall review the procurement       management practices of Defense and Civilian agencies to       determine whether the provisions of section 15.101-2 of the       Federal Acquisition Regulation have created any national       security risk.\n\n(b) Report.--Not later than 180 days after the enactment of       this Act, the Director shall submit a report…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688342/safe-and-smart-federal-purchasing-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…support of H.R. 3838, our  National Defense Authorization Act for fiscal year 2026. The 2026 NDAA  emphasizes ensuring the lethality of the U.S. Armed Forces by reforming  the acquisition process to deliver innovative equipment to the  warfighter at speed and scale.\n\nIt does so by accelerating the requirements process to reduce  decision timelines from 3…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695141/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…sensing data, services, distribution, and applications from a       commercial provider.\n\n(3) The Administrator of NASA established the Commercial       SmallSat Data Acquisition Pilot Program in 2019 to identify,       validate, and acquire from commercial sources data that       support the Earth science research and application goals.\n\n(4) The…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Fiscal Year 2026.\n\nAs the United States faces pacing threats from China, this NDAA  ensures the United States remains peerless by reforming and modernizing  the Pentagon's acquisition policies. This bill includes my provision  instituting a minimum assignment period of 6 years for acquisition  program executive officers, strengthening institutional memory…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695147/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Service Fellowship at the University of Texas  Institute for Advanced Technology.\n\nHis military career spanned critical roles in both combat arms  leadership and defense acquisition. At the Pentagon, he served as  Executive Officer to the Deputy for Systems Management and as Deputy  Director of Executive Communications and Control for the Secretary…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…determinations:\n\n(A) A specific determination made by any executive branch       interagency body with appropriate national security       expertise, including the Federal Acquisition Security Council       established under section 1322(a) of title 41, United States       Code.\n\n(B) A specific determination made by the Department of       Commerce pursuant…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}]