[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…getting letters like this from  their insurance companies telling them how much their premiums are  going up because of the failure of Republicans to extend the Affordable  Care Act tax credits.\n\nSusan, from Foster, Rhode Island, a marketing consultant, is seeing  her insurance go up from $600 a month to $2,100, a 250 percent  increase.\n\nSarah, a small business…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696996/extend-the-tax-credits"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…is a small  business owner from Tampa, Linda Misner. She and her husband own a  healthcare business, a wellness business, in Tampa. With the benefit of  the Affordable Care Act tax credits, they were paying about $300 per  month. Just like a lot of Florida families, they are hardworking  Americans, small business owners.\n\nAs they are too young for Medicare,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…costs and to raise energy bills. It is really time that the average  working American get a break for a change. We want to cancel the cuts  of the ACA. The Affordable Care Act tax credits are a pathway to  affordability and lifesaving care, and it appears that the Republicans  are going to refuse to reinstate those tax credits. We want to fight to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…like this from  their insurance companies telling them how much more they are going to  have to pay next year because of Republican inaction in extending the  Affordable Care Act tax credits, letters like this one received by  Susan from South Kingstown. She, her husband, and her college-aged son  are going to see an increase of $1,700 a month, $20,000…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…MENENDEZ. Mr. Speaker, I thank my friend and colleague, Ranking  Member Pallone, for yielding.\n\nMr. Speaker, House Republicans ended 2025 by failing to extend  Affordable Care Act tax credits causing healthcare costs to skyrocket  for millions of Americans.\n\nSince President Trump took office, electricity prices have gone up by  13 percent nationwide and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, shortly, I will move to table amendment  No. 3947 for the purposes of offering my amendment to extend the  Affordable Care Act tax credits for 1 year. I am doing this because my  Republican colleagues are refusing to act to stop healthcare premiums  from doubling for over 20 million Americans.\n\nI just…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696658/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Everywhere I go across New Hampshire, I hear the same thing: Money is  tight, and people are worried about their futures.\n\nThe millions of families who rely on the Affordable Care Act tax  credits for health insurance have waited long enough for Congress to do  the right thing.\n\nI urge all my colleagues to support this legislation to ensure that  hardworking…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698696/supporting-families-and-small-businesses-struggling-to-afford-health-care"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the motion to discharge previously noticed.\n\nMr. JEFFRIES. Mr. Speaker, I rise today to call up a bipartisan  motion to discharge legislation to extend the Affordable Care Act tax  credits to make sure that tens of millions of everyday Americans do not  experience dramatically increased premiums, copays, and deductibles  that will prevent them from…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698592/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to call on Speaker Johnson to immediately bring  the bipartisan 3-year extension of the Affordable Care Act tax credits  to the floor. This bill now has the support, pursuant to a discharge  petition, of a majority of House Members and should get a vote  immediately before the ACA tax…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698391/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Hunger should never  be used as a weapon.\n\nThe CR continues the Republican healthcare crisis. The Speaker has  already said he won't hold a vote to extend the Affordable Care Act tax  credits to reduce healthcare costs for Americans.\n\nNow my constituents are going to have to choose between heating their  homes, feeding their families, or taking their children…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696728/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…small business  owners will increase by an average of 114 percent.\n\nThis is going to be a massive hit on small businesses and small  business workers if the Affordable Care Act tax premiums expire. It is  going to be 10 million small businesses and small business employees in  our country that are going to see a spike that is going to be dramatic  for…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "Ms. UNDERWOOD. Mr. Speaker, I rise today in support of my bill to  extend the Affordable Care Act tax credits and to put an end to the  Republican healthcare crisis.\n\nThis Republican majority wasted all of 2025 by refusing to extend the  tax credits in time to prevent the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698810/breaking-the-gridlock-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…undermined confidence for consumers, investors, and small  businesses, many of which have cautioned that they will have to close  due to Trump's untenable tariffs which act as a tax on Americans and  their businesses.\n\nAt the same time, as families struggle, Trump has increased his  wealth by billions since taking office, which is a slap in the face…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…cutoffs and massive premium hikes will  hammer millions of us back in Florida, and it is all because  Republicans chose billionaire tax breaks over extending the Affordable  Care Act tax credits for our hardworking families.\n\nThat is all on top of the $1 trillion that Republicans slashed from  Medicaid and $500 billion from Medicare. Over 203,000 people will…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…no longer compatible choices. That is wrong. It is  within our power to prevent it.\n\nAll 214 Democrats have signed a discharge petition that will extend  the Affordable Care Act tax credits for 3 years. All we need are four  Republicans who are willing to join us in protecting our Nation's  healthcare.\n\nAllowing these tax credits to expire is, indeed,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…restore our Second Amendment  rights, ultimately securing a measure to zero out the $200 tax on  suppressors and short-barreled firearms under the draconian National  Firearms Act. This tax had been on the books since 1934, representing  both an unconstitutional and financial barrier to our Second Amendment  rights. Thankfully, starting January 1, 2026, American…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…do that. That happens, and they end up paying tax  revenue to foreign countries.\n\nLet's just say what you saw prior to 2017 when Republicans did the  Tax Cuts and Jobs Act, you had a tax rate of foreign drive and tangible  income at approximately 16 percent effective rate, but let's say in  Ireland, it was 13 percent. A company could easily set up their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…everyday Americans.\n\nMr. Speaker, I want to clarify a few things, one in particular about  the One Big Beautiful Bill Act.\n\nThe narrative that the One Big Beautiful Bill Act only gives tax cuts  to billionaires is just false. The bill cuts taxes for working-class  families who need it most. As a result of the One Big Beautiful Bill  Act, the top 1 percent…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…currently shut down. It is shut down  because we can't come to an agreement here in the Senate, with the  President, and with the House to deal with the expiring Affordable Care  Act tax credits that make it affordable.\n\nLetters are about to go out in my home State of Delaware that will  tell folks who get their health insurance through the Affordable Care…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…that they needed  to grow and hire.\n\nI will also say that there are no Fortune 500 businesses without  first starting as a small business, or a mom and pop.\n\nIf we don't act now, those tax cuts will expire, and Iowa's small  businesses will be hit with a crushing 20 percent tax hike. We cannot  let that happen.\n\nLet's extend the Tax Cuts and Jobs Act, protect…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…expand private school choice to 2 million kids and has been  included in the text of the reconciliation bill.\n\nHowever, the other one-half, the High-Quality Charter School Act, and  a tax provision contained therein, would triple the number of kids in  charter schools across the country remains missing still.\n\nI am encouraging my colleagues to ensure that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691230/universal-school-choice"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "Mr. NEHLS. Mr. Speaker, I rise today to discuss an important  provision in the big, beautiful bill.\n\nI was proud to introduce the Endowment Tax Fairness Act, which would  tax the endowment profits of private, elite universities at 21 percent,  raising an estimated--listen to me--$70 billion to $100 billion over 10  years.\n\nThe Senate gutted…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693219/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}]