[{"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I am proud to reintroduce the Justice for  Shireen Act today. I thank my House Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…think that  expanding this tax credit is going to fix the problem, let me just give  you a couple of examples from my personal life.\n\nI am covered under the Affordable Care Act today. Do you know what I  do when I go to the pharmacy? I don't file it on my health insurance. I  pay cash because the cash price is less than the copay on my health  insurance.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Federal healthcare programs. The Republicans  voted no on Social Security in 1935. They voted no on Medicare. They  voted no Medicaid. They voted no on the Affordable Care Act. Today,  they are trying to destroy the vaccine regime we have in our country.  They are withholding by the billions research on cancer, Alzheimer's,  diabetes, Parkinson's, and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.R. 2312, the Tipped Employee  Protection Act. It is actually the tipped employer protection act.\n\nToday, we are discussing one of several bills that House Republicans  claim will benefit workers but ultimately falls short of what workers  need.\n\nH.R. 2312 would redefine the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "Mr. BENNET. Mr. President, I, too, am here on the floor today to  oppose the SAVE Act.\n\nToday, Americans register to vote in a variety of ways, typically set  by each State in this country, but Federal law requires that Americans  attest to citizenship under penalty…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…communities.\n\nThat is why last year, I filed the Campaign Transparency Act and the  Stop the Super PAC-Candidate Coordination Act and supported the  Abolishing Super PACs Act. And today, as we are here during Special  Order hour, I am proud to announce that I will also be introducing the  Lobbyist Loophole Closure Act with Representatives Mullin and Williams.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699241/restoring-election-integrity"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…people get their Social Security  payments faster, renew passports, or help people access Medicare or  Medicaid.\n\nThat is why I am introducing the bipartisan FIT Procurement Act today  with my colleague Congressman Burlison. The FIT Procurement Act would  raise cost caps and allow the Federal Government to buy more innovative  tools without going through…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…petition mean that we  can't get to it until we come back from our holiday break in January,  but we don't need to wait for the discharge petition to ripen. We can  actually act today if we want to preserve the tax credits for 20  million working-class Americans that rely on them.\n\nDemocrats in this House and in the Senate have acted like adults  during…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…she  can effectively advocate for taxpayers and to advise Congress.\n\nMr. Speaker, I am pleased that the committee is marking up the  National Taxpayer Advocate Enhancement Act today to protect the  independence of the National Taxpayer Advocate, and I hope that this  bipartisan effort will extend to dealing with the threat of data  privacy that the Treasury…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689380/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I thank my colleagues for considering my important  legislation, the Great Lakes Mass Marking Program Act, today.\n\nI thank my friends, Representatives Huizenga and Walberg, for their  bipartisan support and partnership on this bill. I also thank Chairman  Westerman and Ranking Member…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…itself.\n\nAnd I understand the points made by my colleague, but I would like to  present a middle ground. Since we don't have unanimous consent for the  Major Richard Star Act today, let's agree to a vote. Let's have a time  agreement that would authorize the Senate to take a single up-or-down  vote on passage of this bill before the end of the year.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…another waste of taxpayer time and money misleading the American people  about the intentions of Senate Republicans.\n\nThe Senate should act on this measure. They should act on it today.  Rarely in life is there a second chance to do the right thing.\n\nI urge my colleagues here to do the right thing, and I certainly urge  Members of the Senate to do the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…violence that President Trump  seems to feel exists there. There was no such professional force,  locally or statewide, when the Ninth Congress passed the original  Insurrection Act.\n\nToday, in the 119th Congress, the problems that law enforcement was  designed to address simply are no longer commensurate with the dangers  it is creating now. And I will note…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Congress for consent on any of these deals. He hasn't even  hinted at it. And he will continue pursuing these corrupt foreign deals  until we, as Congress, have the gumption to act.\n\nToday, I am introducing resolutions that condemn President Trump's  violation of the foreign emoluments clause and demand the transfer to  the U.S. Government of any gifts, benefits,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…We need a clear  explanation.\n\nI am demanding a full Senators' briefing on this issue of Venezuela  and the intervention there, at once.\n\nIn the meantime, the Senate must act today to discharge this  resolution because Donald Trump seems ready to lead our troops over the  Rubicon with a blindfold over his eyes, and that is a recipe for  catastrophe.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…1534, the bill now under  consideration.\n\nMr. Speaker, I rise in support of H.R. 1534, the Innovative  Mitigation Partnerships for Asphalt and Concrete Technologies Act, or  IMPACT Act.\n\nToday, much of the world is reliant on cement and concrete produced  in China, which is home to the world's largest cement industry. It  should go without saying that…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…came together to pass the Fix Our Forests Act on an  overwhelmingly bipartisan basis. The legislation we are considering  today was included as part of the Fix Our Forests Act. Today is another  opportunity for Congress to meet the moment and pass commonsense forest  management policy.\n\nI commend Representatives Carbajal and Valadao for their bipartisan…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…of Congress, the Lumbee Fairness Act has the support of 236  Tribes across the country that have repeatedly cited the unfair  treatment of the Tribe under the 1956 Lumbee Act.\n\nToday, Congress can take a major step forward to end the unfair and  unjust treatment of the Lumbee Tribe once and for all.\n\nMr. Chair, I urge my colleagues to support this amendment,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…of Decision is a rule under the Congressional  Review Act. That opinion, printed in the Congressional Record in  September, triggered the CRA window that allows Congress to act today.\n\nCongress must act because Alaskans have spoken clearly, and they have  spoken loudly.\n\nThe North Slope Inupiat leadership, including the Arctic Slope  Regional Corporation,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…ID in Haiti.  We were sent here to do government differently, and nothing could be a  clearer test of our commitment than to pass this rescissions package.\n\nThe time to act is today. If we continue on our track, our  grandchildren will be enslaved to a debt that will dwarf our current  monstrosity.\n\nMrs. McCLAIN. Mr. Speaker, that was fear-mongering…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…great or too small that I can't  champion for North Carolinians, whether it is casting my vote for a  once-in-a-generation tax reform bill like the One Big Beautiful Bill  Act or today's ZIP Code update, it is my mission to be a voice that  responds to the needs of my constituents.\n\nI stand here today, Madam Speaker, to urge support for this package  to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…service in lifting the veil on how much fraud, abuse, and terrible  waste of taxpayer dollars is truly happening in our government  agencies.\n\nBy passing the Rescissions Act today, I join my colleagues in showing  Americans that we hear them and we know that this change must be made.  It is high time we work toward getting our fiscal house in order,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692519/rescissions-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to lose the AI race and risk the lives of American  servicemembers and a potential conflict in the Indo-Pacific.\n\nThe time to act was yesterday, but the next best time to act is  today. This fight to address outbound investment transparency has been  going on for many years, but I look forward to finally declaring  victory when President Trump signs the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…colleagues to support this. It is a  good mine. It is a good project.\n\nBy the way, it doesn't approve anything. You still have to go through  the process. So approving this act today you are not going to start the  mine tomorrow. They still have to go through the process. It is about  process, and that is what makes decisions good or bad is going through…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…noncitizens were on the voter rolls and 35 of them voted. That may  not sound consequential, but there are races that are decided by less  than that.\n\nThe votes against the SAVE Act today were nothing more than to allow  noncitizens to vote in the United States of America. I think that falls  into the category of the 80/20 position. All I know, Mr. Speaker,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690081/protecting-the-rights-of-american-citizens-to-vote"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…regulations that increase costs and  administrative burdens with limited flexibility for States.\n\nMr. Speaker, we are not here today to talk about the One Big  Beautiful Bill Act. We are here today to talk about the many provisions  that are important to the safety and security of the United States. We  are talking about a rule that includes provisions to secure…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…hearing once  again focused on protecting victims of online exploitation.\n\nOur work is far from over, which is why I look forward to passing the  Combating Online Predators Act today.\n\nMr. Speaker, the rise of sextortion against our Nation's children is  troubling. Sextortion is a form of exploitation that occurs when  someone threatens to distribute…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…from Virginia (Ms.  Foxx) for her work on this.\n\nMr. Speaker, I rise today in support of the rule and in strong  support of H.R. 1, President Trump's One Big Beautiful Bill Act.\n\nToday, Mr. Speaker, we face a watershed moment for the American  people. This Republican majority was given a clear mandate by the  American people, which is the America First…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}]