[{"senator": "Chellie Pingree", "party": "Democrat", "sentence": "Ms. PINGREE. Mr. Speaker, I rise to support the consolidated  appropriations act.\n\nFirst, I thank Ranking Member DeLauro for yielding me the time, but  also for her leadership and perseverance in this challenging time.\n\nI thank Mr. Simpson for his collaboration and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Washington, DC.\n\nDear Speaker Johnson: I write to express Grubhub's strong       support for the passage of H.R. 973, Setting Consumer       Standards for Lithium-Ion Batteries Act. Thank you for your       leadership on this important issue and for ensuring this       critical legislation will be considered by the full House of       Representatives.\n\nThis…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…blind trusts, prevent conflicts of interest,  and restore accountability where it is so desperately needed.\n\nMr. Speaker, I am proud to cosponsor the TRUST in Congress Act, and I  thank Representatives Magaziner and Roy for their leadership on this  critical bipartisan legislation. It is a long overdue, commonsense step  toward restoring integrity in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691223/stock-trading-ban-for-members-of-congress"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in support of H.R. 2444, the Promoting  Resilient Supply Chains Act. I thank my co-leads of this bill,  Representatives  John James, Robin Kelly, and Erin Houchin.\n\nThis bipartisan bill builds on the work we have done in recent years  to strengthen…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…Mr. Chairman, I rise in support of the 2026 Financial Services and  General Government and National Security, Department of State, and  Related Programs Appropriations Act.\n\nI thank Chairman Mario Diaz-Balart and Ranking Member Lois Frankel  and their team for their hard work on this bill.\n\nAmerica is at a fork in the road in our international affairs.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. Speaker, I support H.R. 3426, the Courthouse Affordability and  Space Efficiency Act of 2025, or CASE Act.\n\nI thank my colleague from, I almost want to say Louisiana because of  his familial ties to the naming of Shreveport, but my across-the-hall  neighbor in the Cannon Building, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "I rise today in strong support of this bill, the Quinault Indian  Nation Land Transfer Act, and I thank Chairman Westerman and Indian and  Insular Affairs Subcommittee Chairman Hurd for the opportunity to speak  about another bill before us today and for their thoughtful…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…disease  advocates to health benefit groups to small business associations. That  is why I recommend my colleagues to vote for the Chronic Disease  Flexible Coverage Act.\n\nAgain, I thank Congressman Buchanan, and I thank the chairman for  bringing this bill forward.\n\nMr. PANETTA. Mr. Speaker, I have no further speakers, and I yield  myself the balance…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Madam Speaker, I yield myself such time as I may consume.\n\nMadam Speaker, I rise in support of H.R. 2701, the Fallen  Servicemembers Religious Heritage Restoration Act, as amended. I thank  my good friend and colleague Representative Debbie Wasserman Schultz  for introducing this bill.\n\nMadam Speaker, oftentimes veterans who were buried overseas during…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…family, and their leading role  in shaping our country. This recognition is long overdue.\n\nIn closing, I urge my colleagues on both sides of the aisle to  support this act, and I thank you for the time and courtesy.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Speaker, I thank Representative Dingell for yielding  me time.\n\nMr. Speaker, I rise today in support of the FUTURE Networks Act, and  I thank Representatives Allen and Walberg for our joint effort in  making this a very bipartisan bill.\n\nI introduced this bill to ensure America continues our leadership and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690227/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I am proud to be a cosponsor of the  ROTOR Act. I thank the sponsor as well.\n\nOn January 29, 2025, a U.S. Army Black Hawk helicopter and American  Airlines flight 5342 collided midair outside of DCA, and 67 lives were  lost.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700113/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in strong support of my bill, the Lower  Elwha Klallam Tribe Project Lands Restoration Act.\n\nI thank Chairman Westerman and Subcommittee Chairman Hurd for their  partnership in bringing this important legislation to the floor. I am  deeply honored to serve on the House…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…supports our allies in Europe, including  Ukraine, and takes other steps to strengthen our security.\n\nI am pleased that this bill includes the Intelligence Authorization  Act. I thank, again, the chairman and ranking member. I thank Chairman  Crawford and all members and staff of the House Permanent Select  Committee on Intelligence who contributed to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Madam Chair, I rise in support of H.R. 3838,  the National Defense Authorization Act for Fiscal Year 2026, also known  as the SPEED Act. I thank Chairman Rogers and Ranking Member Smith for  their leadership in bringing this bipartisan legislation to the floor  for the 65th consecutive year.\n\nThe Intelligence and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695148/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "Ms. LEE of Florida. Mr. Speaker, I rise today in support of H.R.  6715, the Child Predators Accountability Act, and I thank my colleague  from North Carolina for his leadership in advancing this important  legislation.\n\nProtecting our Nation's children is among the most solemn  responsibilities…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698894/child-predators-accountability-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "Ms. LEE of Florida. Madam Speaker, I rise today in strong support of  H.R. 6732, the Coercion and Sexual Abuse Free Environment Act, and I  thank my colleague from Arizona (Mr. Biggs) for his leadership on this  critical issue.\n\nMadam Speaker, as technology advances, so do the tactics of predators  who seek to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…WILLIAMS of Texas. Madam Speaker, I yield myself such time as I  may consume.\n\nMadam Speaker, I rise today in strong support of my bill, H.R. 5763,  the Main Street Parity Act.\n\nI also thank the gentlewoman from California (Ms. Simon), my friend,  for joining me in co-leading this bipartisan effort.\n\nThe SBA's 504 loan program is an important tool that helps…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699166/main-street-parity-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I thank the chairman for yielding. Mr.  Speaker, I rise in support of H.R. 1949, the Unlocking our Domestic LNG  Potential Act, and I thank Representative Pfluger for his leadership on  this bill.\n\nIn January of last year, former President Joe Biden unveiled the  latest of many attacks on our domestic energy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Natural Resources,      Washington, DC.\n\nDear Mr. Chairman: This letter confirms our mutual       understanding regarding H.R. 3937, the ``Wabeno Economic       Development Act.'' Thank you for collaborating with the       Committee on Agriculture on the matters within our       jurisdiction.\n\nThe Committee on Agriculture will forego any further       consideration…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…one or more Acquired Funds that is a       business development company.\n\nMr. Speaker, I rise today in support of H.R. 2225, the Access to  Small Business Investor Capital Act. I thank Congressman Sherman and  the bipartisan cosponsors for their work on this bill.\n\nThis is a narrowly tailored fix to a longstanding problem that is  hurting business development…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Davidson for his  broad work in the capital market space and for leading us here on the  floor today.\n\nI rise to urge my colleagues to support the Expanding WKSI  Eligibility Act. I thank my co-leads, Mr. Fields, as well as Chairman  Hill and Ranking Member Waters, for their support.\n\nWe have far too many regulations in the United States, and this bill  is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Mr. KNOTT. Mr. Speaker, it is my privilege to speak in favor of H.R.  4070, the Tren de Aragua Border Security Threat Assessment Act.\n\nI thank Chairman Guest and Chairman Garbarino for their support and  leadership on the Homeland Security Committee from which this bill has  originated.\n\nBefore Congress, I had…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…conform with the       amendments made by subsection (a).\n\nMr. Speaker, I rise in strong support of H.R. 3394, the Fair  Investment Opportunities for Professional Experts Act.\n\nI thank our Financial Services Committee chairman, the gentleman from  Arkansas (Mr. Hill), for his leadership on this bipartisan legislation.\n\nFor decades, the SEC's accredited…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise in support of H.R. 1469, the Senior Security Act.  I thank my colleague, Representative Gottheimer, for his work on this  vital piece of bipartisan legislation that will strengthen protections  for senior investors. I am proud…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…housing affordability by getting government  out of the way.\n\nIncluded in this package are many commonsense, bipartisan reforms.  Among them is my Streamlining Rural Housing Act. I thank Chairman Hill  for including it in this package.\n\nToday, rural housing projects in Indiana and across the country that  rely on both HUD and USDA programs must undergo two…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Resources,      Washington, DC.\n\nDear Mr. Chairman: This letter confirms our mutual       understanding regarding H.R. 183, the ``Law Enforcement       Officer Recreation Pass Act.'' Thank you for collaborating       with the Committee on Agriculture on the matters within our       jurisdiction.\n\nThe Committee on Agriculture will forego any further       consideration…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…House Oversight and Government Reform Committee unanimously  passed last year and the House later passed as part of the fiscal year  2025 National Defense Authorization Act.\n\nI also thank the Cybersecurity, Information Technology, and  Government Innovation Subcommittee ranking member, the gentlewoman from  Ohio (Ms. Brown), for cosponsoring this legislation,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…whole milk and 2 percent milk, including flavored, to our  schools' meal programs. Dairy farmers from across the Commonwealth  championed the Whole Milk for Healthy Kids Act, and I thank them for  their support for this commonsense bill.\n\nMr. Speaker, the Pennsylvania Farm Show has grown exponentially since  it began over 100 years ago, a direct reflection…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}]