[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Americans who live in rural areas--now they are going  to have to drive miles and miles and miles, hours out of their way, to  stand in line at a local election agency.\n\nThe SAVE Act does nothing to make it easier to cast a ballot; it only  succeeds in making it harder for Americans to register to vote and to  exercise their rights.\n\nThis is not theoretical.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…who have changed their names for safety purposes, which is truly  shocking.\n\nThe SAVE Act will also have a steep financial cost to American  citizens because, yes, the SAVE Act does allow Americans to use their  passports to register to vote, but one-half of all Americans do not  have a passport, and a passport costs $130 plus additional fees. So the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…remain concerned about the continued classification of  lactose intolerance as a disability. I want to be clear that this issue  predates the Whole Milk for Healthy Kids Act, and the bill does not  create this problem.\n\nLactose intolerance of some degree affects more than 50 percent of  the population. The classification of lactose intolerance as a  disability…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697063/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…Act. This  is a bipartisan bill, supported by colleagues on both sides of the  aisle, that strengthens American diplomacy, science, and leadership in  the world.\n\nThe PARTNER Act does something very simple but very important. It  extends basic legal protections, known as privileges and immunities, to  several key international organizations that the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Committee on  Transportation and Infrastructure and the Committee on Armed Services.\n\nIt also builds on the ROTOR Act's momentum and tackles many of the  issues the ROTOR Act does not address. For instance, the ROTOR Act's  ADS-B In mandate doesn't apply to military aircraft since the FAA  Administration equipage requirements don't apply to military…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700110/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…named the PROTECT Our Kids Act. I am going to speak and shift  this conversation a little bit in the direction I think we really need  to go.\n\nThis bill, the PROTECT Our Kids Act, does absolutely nothing to  protect our kids. Just 5 days after three children and a 21-year-old  were shot and killed in a mass shooting at a birthday party in  Stockton, California,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in opposition to H.R. 22, the  Safeguard American Voter Eligibility Act, or the SAVE Act, which does  nothing to protect voting rights.\n\nHouse Republicans are advancing a bill that would disenfranchise  millions of women and other Americans through a federal takeover…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…not just get by in civilian life, they will thrive.\n\nCongress must ensure employment readiness programs truly work for  veterans, and that is exactly what the  FAST VETS Act does. I am heartened that my first bill to come to the  floor of the House advances our commitment to those who served.\n\nThe FAST VETS Act is about delivering on our promise to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…to  stop it, not just tax it. That is what my bill does. It makes clear  what the Federal court has already found: that IEEPA, the International  Emergency Economic Powers Act, does not authorize tariffs.\n\nPassing my bill would give businesses and families more certainty to  plan for the future and to keep more of their hard-earned dollars in  their…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…partnership of my colleagues  in this effort, Representative Fitzpatrick and Senators Coons and  Boozman, on the other side of the Capitol.\n\nThe Benjamin Franklin statue placement act does seek to honor  Benjamin Franklin, as mentioned, a renowned author, inventor,  statesman, and dare I offer, the most important Founding Father of our  great Nation.\n\nMr. Franklin's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…are witnessing yet another shameful  attack on the fundamental rights of millions of Americans.\n\nHouse Republicans are forcing a vote this week on the so-called SAVE  Act, a bill that does nothing to stop inflation from driving up grocery  prices, nothing to end Donald Trump's trade war that is pummeling the  stock market, and nothing to protect Americans'…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…In effect, going nuclear. The Republicans can say what they like  about this, but the fact of the matter is that the Parliamentarian  ruled that the Congressional Review Act does not permit what we are  doing.\n\nAnd she did so on the basis of advice from the Government  Accountability Office, which was given that role by the Senate, given  that role…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…forestalling future need. It utilizes the  familiar machinery of our Federal-State Government to promote the  common welfare and the economic stability of the Nation. The act does  not offer anyone, either individually or collectively, an easy life,  nor was it ever intended so to do. None of the sums of money paid out  to individuals in assistance…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…still increasing, housing isn't getting more affordable, and it is  getting harder for families to make ends meet.\n\nYet, we are voting this week on the Gulf of America Act, a bill that  does nothing to lower costs. It has been the same story week after  week. That is why I led my freshman colleagues in telling Speaker  Johnson that we are fed up and that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690692/time-to-focus-on-costs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…exercise last  year. Furthermore, the U.S. Government Accountability Office's December  2018 legal opinion concluded that the Congressional Budget and  Impoundment Control Act does not permit the withholding of funds  through their date of expiration and notes the President's  responsibility in ensuring prudent obligation of funds.''\n\nRepublicans and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "French Hill", "party": "Republican", "sentence": "…consequences for China to invade Taiwan. Full stop.\n\nThe U.S. must send a clear message that China's aggression toward  Taiwan will not and is not tolerated, and the PROTECT Taiwan Act does  just that.\n\nI thank the gentleman from Oklahoma (Mr. Lucas) for his work in  standing up for our keen allies in the Indo-Pacific, not just Taiwan  but all of our allies in…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…assistance. Now, with this bill, they are not going to have to  make that choice.\n\nThe second measure is H.R. 43, the Alaska Native Village Municipal  Lands Restoration Act. What this does is eliminate a requirement under  ANCSA, section 14(c)(3), that Alaska Native village corporations convey  land to the State of Alaska to be held in trust for future…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…delivering a course correction for our country. The American people  sent us here with a mandate, to fight back and deliver on a promise.  That is what the One Big Beautiful Bill Act does.\n\nAmericans should first know what my colleagues in opposition to this  legislation are voting for and what they are voting against.\n\nNot passing this bill means a $1,700…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…names,  their email addresses, and their donors when it comes to their own  published works. Many universities have open directories on their  websites. However, the DETERRENT Act does have a commonsense privacy  protection included.\n\nThe American public deserves transparency, and I urge critics of the  bill to ask why relationships, including those with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and the War Powers Act has no binding  authority to constrain the President's Commander in Chief powers before  U.S. forces are put into hostilities. Nothing in the act does that, nor  does the Constitution allow it.\n\nIf the President was to deploy U.S. forces again, the administration  has committed they would require, as is required by law, to send…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and reestablish  the United States as the global hub for digital innovation. To do so,  we must close the regulatory gaps with commonsense rules.\n\nMr. Speaker, the CLARITY Act does just that by leveraging the  expertise of our two market regulators, the Securities and Exchange  Commission and the Commodity Futures Trading Commission, to ensure  wraparound…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…recommendations have not yet been  released, the Chair of the NTSB, Jennifer Homendy, took the  unprecedented step of publicly stating that the National Defense  Authorization Act does not adequately address the safety concerns  surrounding the mixed airspace at DCA.\n\nAnd while the NDAA is critical to bolstering our defense  capabilities, I have major concerns…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…when mom and dad send their kids to college,  they expect them to get a good education and a return on investment,  not to be indoctrinated by our enemies.\n\nThe DETERRENT Act does a very valuable service by requiring proper  reporting and ensuring that four countries, Iran, Russia, North Korea,  and China, who actively seek to undermine our sovereignty,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…a bipartisan agreement with the  ranking member of the Senate Commerce Committee, Maria Cantwell, the  committee passed the ROTOR Act unanimously.\n\nHere is what the ROTOR Act does:\n\nNo. 1, it tightens the rules for military aircraft so air traffic  control and other pilots have a better idea of nearby planes and  helicopters.\n\nNo. 2, it requires all…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…of my colleagues voice fears of Federal overreach.  As a conservative, I believe that the less government interference in  people's lives, the better. But the SAVE America Act does not  federalize our elections. Article I, section 4 of the Constitution  makes clear that while States determine the time, place, and manner of  Federal elections, the Congress…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…from my colleagues on the left is  that they are okay with noncitizens voting.\n\nIt is essential that not only do we have the law but that we enforce  the law, and the SAVE Act does just that.\n\nThis is my good friend, Chip Roy, from the State of Texas, the author  of the bill, who I have been working with to do just that.\n\nMr. STEIL. Mr. Speaker, may…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…increasing the cost  of housing across America to help every American realize the American  Dream.\n\nRemoving that regulation is part of what the Housing for the 21st  Century Act does. It cuts red tape, and it makes a difference for  average Americans.\n\nI am very proud to have supported this piece of legislation. I do  hope that the Senate will take this…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699810/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…sextortion  effectively.\n\nCongress has a duty to protect children from online exploitation and  ensure predators are held fully accountable. The Combating Online  Predators Act does exactly that by amending the United States Criminal  Code to criminalize intentional threats to distribute child sex abuse  material.\n\nNo child should ever encounter these…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…identification,  present true voter ID. That is it, present it.\n\nWith respect to the other claims, claims about the implications for  married women, the fact is that the SAVE America Act does not, as is  alleged, disenfranchise voters but, rather, it provides a very specific  process for anyone who changes his or her name to register to vote,  including by signing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…not sensible--again, walrus ivory, not African elephant  ivory--we want to be able to say at the Federal level that we should be  able to do this.\n\nSo that is what my ARTIST Act does. It prohibits States from banning  the importation, sale, or possession of Alaskan Native handicrafts made  with walrus ivory. Environmental groups support it. By the way,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}]