[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…believe it is  the guns. We think it is mental illness.\n\nWell, I don't agree, but this is how you put together a compromise.  So we passed the Bipartisan Safer Communities Act, which included a  landmark $14 billion investment, most of it in mental health, most of  it directed toward kids' school-based mental health, but there were  also significant investments…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…direction. Again, my  colleagues just shared that, just a couple of weeks ago House  Republicans voted along party lines to pass the so-called One Big  Beautiful Bill Act, which included a provision to deregulate silencers.  Due to the dangers they pose, these devices have been highly regulated  for nearly 100 years, and this provision would make it…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691750/national-gun-violence-awareness-month"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…the funding is implemented as intended.\n\nThanks to the leadership of Senator Cardin, Senator Van Hollen, and  our entire Maryland delegation, the Baltimore BRIDGE Relief Act was  included in last year's continuing resolution and ensured Congress is  now committed to covering the full cost of replacing the bridge. The  Baltimore BRIDGE Relief Act promises…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…communities, particularly rural America, and  our climate.\n\nThe Science, Space, and Technology Committee generated substantial  momentum through the bipartisan CHIPS and Science Act, which included  research support towards agriculture productivity improvement goals.  The DOE and USDA Interagency Research Act would sustain and strengthen  this momentum in its entirety,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689015/doe-and-usda-interagency-research-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Mr. Kennedy for his bipartisan leadership on this  exciting and important topic and, frankly, an essential topic.\n\nIn the 117th Congress, we got the CHIPS and Science Act done. It  included a lot of provisions focused on improving research security.  This landmark law also included a prohibition on Federal researchers'  participation in foreign talent…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I rise in support of H.R. 842, the Nancy  Gardner Sewell Medicare Multi-Cancer Early Detection Screening Coverage  Act,  which was included in the funding package being considered by the House  today.\n\nNamed in honor of my mother who lost her battle to pancreatic cancer  in 2021, this legislation would…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…implicates  agencies outside of the Department of Commerce by duplicating the  Department of Homeland Security's information technology supply chain  security programs.\n\nThis Act was included as part of a broader NTIA Reauthorization that  was considered in  the 118th Congress. At the time, the Department of Commerce weighed in  requesting significant changes…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693613/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "John James", "party": "Republican", "sentence": "…access to  lifesaving naloxone, increasing treatment options, and bolstering  support services.\n\nI am especially pleased to see that provisions of my Road to Recovery  Act were included in this SUPPORT for Patients and Communities  Reauthorization Act of 2025. The bipartisan Road to Recovery Act  reauthorizes lifesaving resources vital to addressing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…This bill gives market participants the confidence to build, invest,  and grow right here in the United States of America.\n\nWe are proud to have the Securities Clarity Act included in this  legislation. This provision provides market certainty for innovators  and clear jurisdictional boundaries for regulators.\n\nSubsequently, elements of the Blockchain…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and restores accountability to Federal decisionmaking.\n\nI am proud that one of our top priorities this Congress, the Water  Quality Criteria Development and Transparency Act, is included in this  package. This legislation will finally bring clarity and consistency to  the Clean Water Act permitting process by requiring the EPA to publish  clear, accessible…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698029/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…recently, House  Democrats deemed 29 items total. Also included in that number is the  engrossment correction resolution they deemed in a rule for the  American Rescue Plan Act, which included section and paragraph strikes.\n\nIn contrast, Republicans in the 118th Congress deemed only two  measures. We understand that this is a tool of the majority that should…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…home by hundreds of thousands of  Active-Duty members of our military and those retired from our Armed  Services. I am grateful the Veterans Second Amendment Protection Act  was included in this package, as well as supporting language for the F- 35 sustainment center and utilities upgrade for future F-35 squadrons.  I wholeheartedly support this legislation.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692939/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, I rise today to recognize my  bill, the Care for Military Kids Act, that was included in the  appropriations package for 2026 that just passed the House.\n\nAs a proud Representative of Virginia's Second Congressional  District, home to one of the largest…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699300/advocating-for-military-families"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…crimes and  would allow States to sue the Feds. I was proud to introduce, along  with my colleague from North Carolina, Dan Bishop, the SUE for  Immigration Enforcement Act, which was included in the Laken Riley Act.  It will allow us to sue the government in the future when they fail to  secure the border, a monumental change in allowing States to defend…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…universities are entangled  with foreign adversaries, the American people deserve to know. I am  proud that my Reporting on Investments in Foreign Adversaries, or RIFA,  Act is included in this legislation. The RIFA Act ensures private  colleges and universities disclose whether they are investing their  endowments in hostile nations like China, Russia,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…an amount that a coastal tech giant might  spend in a day, but for a heartland company, that is a year's worth of  an entire payroll for multiple employees.\n\nMy ELEVATE Act, included in this package, fixes this challenge. It  reduces auditing requirements for emerging growth companies from 3  years to 2 years, cutting costs while protecting investors.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697824/increasing-investor-opportunities-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…businesses, and job-creating  projects, causing endless delays and litigation.\n\nMr. Trump's vision is clear: America is building again.\n\nMy Judicial Review Timeline Clarity Act, which is included in this  vital permitting reform package, establishes a strict 60-day window to  challenge section 404 permits once the Army Corps of Engineers grants  authorization.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…my colleague  Mike Collins' work  on this commonsense package of clean water reforms.\n\nI am grateful that my bill, H.R. 3934, the Water Quality Standards  Attainability Act, is included. My bill serves to maintain State and  local leadership in setting their water quality standards under the  Clean Water Act.\n\nLet me cite a compelling example of why this…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698043/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…arrangements create dangerous environments  for our students and faculty, they also put America's national security  at risk.\n\nI am pleased that my bill, the INSTRUCT Act, is included as one of  the DETERRENT Act's main provisions. My legislation requires that  colleges and universities disclose to American intelligence agencies  any and all financial…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689030/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…provide reasonable guardrails to prevent  the weaponization of these permitting processes.\n\nIn particular, I am proud that my bill, the Confidence in Clean Water  Permits Act, is included in the underlying legislation. My bill  provides reasonable protections for National Pollutant Discharge  Elimination System permit holders against frivolous lawsuits…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698025/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…help America build the  infrastructure we need faster and more responsibly.\n\nI am especially grateful that my bill, the Jurisdictional  Determination Backlog Reduction Act, is included as a part of this  package. Across the country, Americans depend on timely answers from  the Army Corps so they know whether their projects require Clean Water  Act permits,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698019/promoting-efficient-review-for-modern-infrastructure-today-act"}]