[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Americans can least  afford.\n\nThat is why we must defeat the previous question, so we can bring up  and pass H.R. 20, the Protecting the Right to Organize Act, the PRO  Act, to help workers organize. We know that when they organize, they  will have higher pay, better benefits, and safer workplaces.\n\nThe PRO Act will be the most significant upgrade in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698950/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 998, the Internal Revenue  Service Math and Taxpayer Help Act. This bill will help taxpayers  better understand why they have received a math error notice from the  Internal Revenue Service.\n\nCurrently, math error notices can be vague and confusing.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…not only do  more for small businesses with existing Federal contracts but also help  attract new small businesses to navigate the Federal contracting  process.\n\nThe SPUR Act will help ensure more small businesses, like those in  the San Gabriel Valley which I represent, can fairly compete for  Federal contracts.\n\nThe SPUR Act will require Federal agencies…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687943/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…get this bill to the floor. I also  thank my partners in this effort, Congressman Keith Self and Senator  John Cornyn.\n\nThe Fairness for Servicemembers and their Families Act will help  ensure that life insurance benefits for servicemembers and veterans  account for changes in the economy.\n\nThis bill will require the Department of Veterans Affairs to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…voices, for yourselves, for your daughters, for women,       and for the future of our country.\n\nFirst, we ask that you vote in favor of the Epstein       transparency act and that you help us ensure with its passing       that the identities of survivors are protected and the       identities of the perpetrators or enablers are not. Remind us       that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…just getting from the parking lot to the checkpoint to clock in  for work can take as long as 45 minutes to an hour at some airports.\n\nMy bill, the TSA Commuting Fairness Act, will help improve conditions  for these civil servants by directing TSA to conduct a feasibility  study on using mobile location data to allow employees to clock in for  work upon…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…amount on. What is worse is that the  majority of cases of elder exploitation are not reported.\n\nWe are here today to do something about it by passing my Senior  Security Act to help protect American seniors from these shameless  criminals.\n\nThis bipartisan legislation will create a senior investor task force  in the Securities and Exchange Commission…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…Speaker, I rise today in recognition of September as  Childhood Cancer Awareness Month and to highlight two bipartisan bills,  the Give Kids a Chance Act and the BRAIN Act, that will help save  lives. Cancer is a disease which affects nearly every household and  community around the country, and nowhere is it more heartbreaking than  when it affects our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the President and his family to  continue owning and issuing stablecoins. There has never been anything  like this in the history of the Presidency. Passing the GENIUS Act will  help the stablecoin market grow tenfold, over the next 3 years, to a $2  trillion market.\n\nI am going to vote no on this legislation when it comes up this week.  We prohibit…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…customer,  you are going to be paying about $939 more annually than you were 5  years ago.\n\nMadam Speaker, folks back home are really wondering: Can Congress get  its act together to help lower the cost of living and work on  solutions? I hate to report that, no, Republicans in Congress and the  Trump administration have shown no interest in doing that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…mine, whether they have been  supportive of Israel or not, are horrified at what is happening to  innocent people in Gaza.\n\nWe have an obligation to act because if we do act, we can help save  thousands of lives of Palestinians, who, as we speak, are starving.\n\nYou know, some folks take the position that the suffering and  starvation will end when Hamas…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…retailers who already       prioritize battery safety.\n\nI respectfully urge you and your colleagues to support the       Setting Consumer Standards for Lithium-Ion Batteries Act and       help move this important public safety measure forward       without delay.\n\nThank you for your leadership and attention to this urgent       issue.            Sincerely,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…opportunity for our kids. I will not stand for that.\n\nMr. Speaker, my North Star is America's children. That is why,  earlier this Congress, I introduced the IDEA Full Funding Act to help  our students with disabilities. I will continue fighting in Congress to  ensure that our children and our children's children and our children's  children's children have…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697177/ensuring-access-to-education-for-our-children-with-disabilities"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the time, and I thank Chairman Bilirakis for his partnership in this  endeavor, as well.\n\nMr. Speaker, I rise in strong support of H.R. 1479, the Hotel Fees  Transparency Act, to help families save money and to ensure that their  hard-earned vacations go as planned. I thank Representatives Kim,  Mullin, and Fry for partnering with me on this bipartisan…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…development opportunities.\n\nSmall businesses are not only the backbone of our economy, but they  also drive forward American innovation and ingenuity. The DOE and SBA  Research Act will help ensure that small business owners continue to  play a central role in the United States' leadership in these areas.\n\nI thank my colleagues for their collaboration on this…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…promote uniformity and  best practices across the country.\n\nOne way that we will be able to help provide those resources to  States is by passing the SAVE Act. The SAVE Act will help protect our  elections and ensure that only American citizens are casting ballots in  American elections.\n\nThe bill will support State and local election officials by providing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, I rise today to introduce the Accounting  STEM Pursuit Act, which would help address workforce shortages in the  accounting profession by recognizing accounting as a STEM education  subject and adding accounting education programs as an allowable…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Madam Speaker, I am proud to stand here today  in strong support of my bill, the State Planning for Reliability and  Affordability Act, to help drive down the cost of energy for Coloradans  and Americans.\n\nThis is a straightforward piece of legislation that will help  counteract shortsighted energy policies that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…question we must ask ourselves is not if we  have enough energy resources but can we produce energy at the necessary  levels to meet the growing demand? The Reliable Power Act will help us  do just that, and I urge a ``yes'' vote on H.R. 3616.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…predictability, preventing delays  and giving banks the stability they need to focus on serving their  customers and growing their businesses.\n\nThe Bank Failure Prevention Act will help community banks and  regional banks thrive in today's competitive environment, providing for  a shot clock on the review of those merger applications and providing  better…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…who puts on the  uniform deserves to be remembered with dignity and respect.\n\nI was proud to introduce the bipartisan Fallen Servicemembers  Religious Heritage Restoration Act to help ensure that hundreds of  fallen American-Jewish servicemembers are buried under military grave  markers that represent their true religion and heritage.\n\nAn estimated 600…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689753/american-jewish-servicemembers-to-be-buried-under-the-star-of-david"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…that passed unanimously in  committee, and it deserves the support of this House on both sides of  the aisle.\n\nI urge my colleagues to vote for the Tax Court Improvement Act to  help strengthen a court process that plays a vital role in protecting  our taxpayers' rights and ensuring accountability of the IRS within our  tax system.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Madam Speaker, I move to suspend the rules and  pass the bill (H.R. 5784) to amend the Small Business Act to help small  business concerns critically evaluate artificial intelligence tools,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…taxpayers deserve to know their money goes to those who  truly need it. It should not be going to criminals who are choosing to  game the system. I know the Fraud Accountability Act will help and  assist in holding these individuals to account.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I rise today to highlight just one way the  House-passed One Big Beautiful Bill Act will help more people live the  American Dream.\n\nAs the chairman of the Housing and Insurance Subcommittee, I am very  concerned about the housing crisis that America is experiencing.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…have spent their  lifetimes contributing to our Nation's economy, and House Republicans  are glad to provide them relief through this bill.\n\nThe One Big Beautiful Bill Act will also help Utahns in ways beyond  tax credits. It will help rural Utah by boosting Utah's energy sector  due to provisions slashing the bureaucratic red tape associated with  permitting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…communities. As of 2025, my home State of Michigan was short more than  141,000 homes, leaving many qualified home buyers on the sidelines.\n\nThe Housing for the 21st Century Act will help increase home  production, which to date has failed to keep pace with rising demand,  leading to more affordability challenges for all Americans.  Additionally, today's…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699804/housing-for-the-21st-century-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…manufacturers, and defense companies about the  issues most important to them.\n\nThe thing I heard from constituents is how grateful they are that the  One Big Beautiful Bill Act will help them stay in business, keep money  in their pockets, and reinvigorate our local economies.\n\nSmall business owners operating shops on our Main Streets told me how  the 199A…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…from California (Mr. Correa).\n\nEffective border security is created by overlapping deterrents,  something we always need at our borders. The Subterranean Border  Defense Act would help us address the growing threat of illicit cross- border tunnels by requiring annual reports to Congress on counter- tunneling operations, fortifying our security system…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…market rules are holding back innovation and  limiting investor access. By weighing down the engine of our economy,  they are raising costs and stifling growth.\n\nThe INVEST Act will help to address these challenges. It expands  access to capital for smaller companies by making targeted reforms to  crowdfunding rules and venture investment restrictions.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697826/increasing-investor-opportunities-act"}]