[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…federal minimum wage floor and gradually phase out the       subminimum wage for tipped workers.      H.R. 4366, Save Local Business Act\n\nThe ``Save Local Business Act'' would ensure that trillion-      dollar corporations like Amazon can use subcontracting and       outsourcing arrangements to escape accountability to their       workers. Businesses…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Democracy for All, the amendment to overturn this misguided decision. I  am proud to champion commonsense reforms like the Freedom to Vote Act  and--God--the DISCLOSE Act, which would ensure that the dark money  pouring into our elections, the cancerous resources unleashed by the  wealthiest of the wealthy--that at least they could not pour that money…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…recommit the bill back to committee. If the House rules permitted, I  would have offered this motion with an important amendment to this  bill. My amendment, Raise the Wage Act, would ensure all workers  receive a long-overdue raise. $7.25 an hour is minimum wage. That is  incredible. Mr. Speaker, 2009 was the last time we touched this. It is  unbelievable…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…medically discharged as a result of reactive airway  disease. He is on five different drugs. They help with his breathing.  It is a struggle for him to live, and this act would ensure that he  could provide for his family, even if he is no longer able to be  employed.\n\nThe stories are powerful, and they are persuasive. They depict the  scope and impact…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…quality education is a vital part of the  American Dream. The embodiment of that promise came in 1975 when  Congress passed the Individuals with Disabilities Education Act to  ensure that children with disabilities could receive a free, fair, and  equal education.\n\nThis landmark legislation changed the lives of millions of Americans.  The disabled children's…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…insurance, to make sure that  when they need care, they can access it without going bankrupt.\n\nWhile the healthcare system isn't perfect, the point of the  Affordable Care Act was to ensure more people had access to insurance  through Medicaid expansion, through employer provided healthcare, and  through the Affordable Care Act exchanges. It is called Marketplace…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…2040.\n\nAlthough this program has helped so many across our great Nation, it  has never been formally codified. Our bill, the Energy Transitions  Initiative Authorization Act, will ensure this program can continue the  technical assistance offered to remote, island and Tribal communities  that is unique and accommodating to their expertise and deep knowledge…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…staffer, and I believe that she is in the gallery today with  her mother. Dr. Hnat was tragically killed as the result of an accident  involving a retractable awning. We must act to ensure that other  American families do not suffer a similar tragedy because of problems  with retractable awnings.\n\nHowever, compliance with this bill depends on the existence…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…those  downwinders who were exposed. That fallout caused cancer and premature  deaths for thousands across the West.\n\nThat is what prompted me to introduce the PRESUME Act. It would  ensure that radiation-exposed veterans, who did war games there at the  test site, could receive their rightful benefits from the VA.\n\nFurthermore, there were 800 underground…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…officials, we should be working to expand access to the  ballot box, not restrict it. Congress should be considering H.R. 14,  the John Robert Lewis Voting Rights Advancement Act to ensure that  every American can freely and fairly vote.\n\nMr. Speaker, this is very personal to me. I am not only the  Representative of America's civil rights district, but I…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690004/safeguard-american-voter-eligibility-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…impacts on those downwind. The fallout caused  cancer and premature deaths for thousands across the Southwest. That is  why earlier this year, I introduced the PRESUME Act, which would ensure  that radiation-exposed veterans who had been exposed to this radiation  would receive their rightful benefits from the VA.\n\nIn addition, the 800 underground tests…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to urge support for my Indigenous  Diplomacy and Engagement Act to ensure that our foreign affairs fully  encompass and incorporate the independent interconnectedness of our  world's indigenous peoples.\n\nThe estimated 476 million indigenous peoples…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…by requiring an  investigation to continue even if the judge resigns or retires to avoid  accountability. This cannot and should not be a partisan issue.  Congress must act to ensure that credible allegations follow judges  beyond the robe, and that retirement or resignation is not mistaken for  resolution.\n\nI encourage all of my colleagues to support…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692556/accountability-for-judiciary-investigations"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…crisis. When disasters  strike, our communities deserve nothing less than the full support of  their federal government. The ``Transportation Emergency Relief  Extension Act'' will ensure state and local governments have adequate  time to fully utilize federal funds awarded to repair roads and  infrastructure damaged by disasters.\n\nCurrent U.S. Department…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694581/introduction-of-the-transportation-emergency-relief-extension-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…however, had devastating impacts on those downwind. The fallout caused  cancer and premature deaths for thousands across the West. That's why I  introduced the PRESUME Act which would ensure radiation-exposed  veterans receive their rightful benefits from the VA. The 800  underground tests sometimes vented out radioactive contaminants  entering the air…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…should support the GENIUS Act. It is because of unstable stablecoins  that are out there. Those products will lose ground in the marketplace  after we pass the GENIUS Act.\n\nIt will ensure that consumers are protected while reaping the  benefits of blockchain technology. The GENIUS Act will allow for  scalability to occur in the stablecoin marketplace,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…electric supply chain flow into communities  across the country, driving economic growth and creating good-paying  jobs for households.\n\nThat is why the Electric Supply Chain Act will ensure that our  Federal Government remains in a proactive posture to assess, identify,  and address any challenges to our supply chain grid for grid  components. H.R. 3638 takes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…unobligated and unused funds from the SEC's reserve fund  and HUD's Green and Resilient Retrofit Program.\n\nIt targets $1 billion for strategic use under the Defense Production  Act to ensure that America can meet its national security supply chain  requirements for the 21st century.\n\nOverall, this bill stops a huge tax increase for our working families  in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693152/one-big-beautiful-bill-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…administration have made  historic efforts to remove bad actors here illegally and make our  country safe again. Illegal  border crossings have plummeted, but Congress needs to act to ensure  the proven policies of President Trump are codified and continued for  generations to come. Our bill makes historic investments in our border  security by ensuring we…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…year. Unfortunately,  there was no required timeline for implementation, which is why I have  introduced legislation with Congressman Casten, the Mental Health in  Aviation Act, to ensure the timely implementation of section 411.\n\nWe want our pilots to be at the top of their game, and taking care of  their mental health is critical to achieving that goal.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…can all agree that our Nation's workers deserve to be  compensated fairly. H.R. 2312, the Tipped Employee Protection Act,  meaningfully updates the Fair Labor Standards Act to ensure tipped  workers can take home what they earn, and small businesses are not  micromanaged by Federal regulators.\n\nToo often, the political whims of Washington have hurt…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…modernization of our  aviation system, advance new technologies at the FAA, and train and  support air traffic controllers. We cannot--we should not--miss the  moment to act and ensure lasting change.\n\nI cannot imagine the pain each of the families of the victims has  experienced every day since January 29. This week, their loss must be  felt especially…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…tragedy.\n\nWith that, I yield to Ranking Member Cantwell.\n\nMr. CRUZ. Mr. President, I now yield to Senator Moran, who has been a  critical leader in fighting to pass the ROTOR Act and to ensure we have  accountability and that we do not repeat the tragic mistakes that led  to that horrific accident.\n\nMr. CRUZ.  269, S. 2503.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…order to register to vote.\n\nMr. Speaker, 388 noncitizens cast ballots here in our Nation's  Capital in Washington, D.C., in the most recent election.\n\nBy passing the SAVE Act we can ensure that only eligible Americans  are registering to vote.\n\nAdditionally, the SAVE Act is aligned with President Trump's recent  executive order, Preserving and Protecting…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Representative Kean's fine bill to  begin this process of protecting this critical and vulnerable  infrastructure.\n\nMr. BAUMGARTNER. Mr. Speaker, the Undersea Cable Control Act will  ensure America, not the Chinese Communist Party, is connecting the  globe with critical undersea cable infrastructure.\n\nMr. Speaker, I urge my colleagues to support this bill,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…third-party providers and protecting data privacy.\n\nMadam Speaker, I thank my colleague, Representative Scholten, for co- leading this legislation with me. The AI-WISE Act will ensure small  businesses have the information that they need to most effectively  utilize AI to bolster their entrepreneurship.\n\nMadam Speaker, I urge my colleagues to vote in…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…for participating in education, job search, and community  engagement to all count toward that work requirement.\n\nWhat we were trying to do in the One Big Beautiful Bill Act is ensure  that limited resources are protected for pregnant women, children,  seniors, and individuals with disabilities. That is the truth.\n\nWith reference to the CBO, the CBO…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…must re-enter entirely new State health  systems with new Medicaid rules, new waiver programs, new provider  networks, and long wait lists.\n\nThe Care for Military Kids Act would ensure that any dependent of an  Active-Duty servicemember - currently receiving long-term care services  through a State administered Medicaid plan, will remain eligible should…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699300/advocating-for-military-families"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…space is hard-earned, but it is not guaranteed. Our  economy, our technological future, and our national security all depend  on continued space investment.\n\nCongress must act to ensure that the United States remains the leader  in the final frontier. This is our moment. If we invest in space today,  then we will be stronger, safer, and more prosperous…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…from Louisiana and chairman of the  Senate Committee on Health, Education, Labor, and Pensions.\n\nI will continue to fight for the reauthorization of the Older  Americans Act to ensure it is available to provide this same life- affirming support for generations to come.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693849/recognizing-the-60th-anniversary-of-the-passage-of-the-older-americans-act"}]