[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…encouraged by some of the public reporting that several  of our Republican colleagues are interested in extending the ACA  enhanced premium tax credits, the time for us to act is now. The  President's own pollsters have warned that not extending these tax  credits would be a political catastrophe for the GOP.\n\nI would hope that we could all agree that addressing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Minnesotans and for me. The Nation is facing a healthcare crisis that  will raise costs and threaten access to healthcare for many Minnesotans  if Congress does not act.\n\nIf the President and congressional Republicans do not extend the  healthcare tax credits, the health insurance premiums of millions of  Americans will double next year. This premium…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696995/hr-5371"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District communities for       additional law enforcement oversight. Many of the reforms in       this bill echo provisions in the George Floyd Justice in       Policing Act, as well as President Biden's executive orders       on policing--including improving access to body-worn camera       recordings, restricting access to military-grade weapons, and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…America.\n\nAfter all of this was done, with the President being sworn in on  January 20, 2025, after all of this had taken place at a prior  election, the very first act that the President engaged in, it seems,  after he had raised his hand to be sworn in, upon lowering his hand, he  seemed to have rushed over to someplace where he had a document that…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…fights so that our children and grandchildren  don't have to.\n\nI implore this body not to take a giant step back by imposing Jim  Crow 2.0 and a poll tax through the SAVE Act or the President's  executive order.\n\nThe right to vote is sacred. We will defend it.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Chamber are doing everything they  can to roll back and repeal what is left of the Clean Water Act.\n\nAmong the many disastrous provisions in this bill, the PERMIT Act  would give President Trump the authority to declare any body of water  exempt from Clean Water Act protections. It is just a stunning betrayal  of the American people.\n\nOutside these…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698023/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Chutkan, United States District Court for the       District of Columbia, United States Courthouse, Washington,       DC.\n\nMs. NORTON. Mr. Speaker, under the D.C. Home Rule Act, the President,  with the advice and consent of the Senate--a chamber in which D.C. has  no representation--appoints judges to the local D.C. courts. The  President must make a nomination…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…LATIMER. Madam Speaker, any day now, the Supreme Court will issue  a ruling on whether the President can impose tariffs under the  International Emergency Economic Powers Act.\n\nPresident Trump's tariff policies have hurt America's small  businesses, who often cannot absorb the cost of higher duties. Now, the  economy is showing warning signs. Unemployment…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698342/president-trumps-tariff-policies"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Ivy League degrees.\n\nHouse Republicans have the chance to right those wrongs and deliver  real results for the American people by passing the One Big Beautiful  Bill Act.\n\nUnder President Trump, our economy is booming, thanks to progrowth  policies that help workers, students, and taxpayers prosper. By passing  this bill, we have a chance to seize on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693154/one-big-beautiful-bill-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…to unfold and to start.\n\nIn today's world, it is the press of a button, and it happens  instantaneously. That is why Congress went in and passed the War Powers  Act that gave the President the opportunity to defend America, and in  that act, it provided things that the President had to do. He complied  with that act exactly as it was put in place by…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…family farms making up 96  percent of all farms in my district, this is huge news for countless  farming families in southern Ohio.\n\nThrough the One Big Beautiful Bill Act, President Trump and  Republicans are investing in American manufacturing and American jobs.  I see the direct impact of this through Anduril's up-and-coming  manufacturing facility…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…check the courts, and it is time we  began using it.\n\nTake Judge James Boasberg's ruling last month halting deportations of  Venezuelan gang members under the Alien Enemies Act. President Trump  invoked a law from 1798 to protect our streets, and one judge decided  that he knows better than the Commander in Chief.\n\nMr. Speaker, it is time to take our government…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689710/no-rogue-rulings-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…recent list       submitted pursuant to subsection (b).\n\n(b) List of Persons.--\n\n(1) In general.--Not later than 180 days after the date of       the enactment of this Act, the President shall submit to the       appropriate congressional committees a list of foreign       persons who the President determines to have knowingly and       directly engaged…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…TRAFFICKING IN PERSONS FOR                     PURPOSES OF THE REMOVAL OF ORGANS.\n\n(a) List Required.--Not later than 180 days after the date       of the enactment of this Act, the President shall submit to       the appropriate committees of Congress a list of each person       that the President determines funds, sponsors, or otherwise       facilitates…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…efforts, and Republican majorities in the House and Senate have spent  the last several weeks working to rescind burdensome energy regulations  using the Congressional Review Act. President Trump has already signed  two CRA resolutions into law--one eliminating the marine archeology  rule that targeted offshore energy development and the other stopping  the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Now the House must get it done. I urge all of my colleagues to vote  in favor of this rule. Let's choose our country over comfort and get  the One Big Beautiful Bill Act to the President's desk.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, I thank Chairman Smith for yielding.\n\nMr. Speaker, I rise in strong support of the One Big Beautiful Bill  Act.\n\nPresident Trump inherited a disastrous open-border policy from the  Biden-Harris administration. There were nearly 9 million encounters at  the southern border under President Biden,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693161/one-big-beautiful-bill-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…I thank the chairman for yielding time.\n\nMr. Speaker, I am proud to rise today in support of my bill, H.R.  1531, the PROTECT Taiwan Act.\n\nUnder the Taiwan Relations Act, the President is required to notify  Congress if China poses an immediate threat to Taiwan's security. If  this notification is triggered, my bill states that it is U.S. policy  to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…cameras, the  mobile TV units that drove through rural Kentucky trying to intimidate  me from the Biden investigation, which, by the way, ended with Joe  Biden's last act as President of the United States to pardon his entire  family.\n\nI know my friends on the other side of the aisle don't like to think  about that, but that is a fact.\n\nAll DOGE is…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…them from  mineral exploration, oil and gas exploration, and energy production.\n\nThe original intent of the Presidential proclamation authority in the  Antiquities Act was for the President to be able to move quickly and  declare a national monument in an area with antiquities, or an area of  scientific interest, to hold it until Congress could make…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…officers and first responders (hereinafter known as the       ``Commission'').\n\n(2) Appointment.--Not later than 150 days after the date of       the enactment of this Act, the President shall appoint 12       members of the Commission. Such members shall be law       enforcement officers, first responders, and representatives       of organizations knowledgeable…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Mr. BARR. Mr. Speaker, with the One Big Beautiful Bill Act, President  Trump is once again keeping his promises to the American people. He  promised he would stop the largest tax increase in America history. He  promised he would make the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693212/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…might find yourself wondering why would the D.C. Council do this  to their own residents and businesses. I will tell you why: It is  because the Working Families Tax Cut Act was President Trump's bill.\n\nThe D.C. Council would rather punish their own residents, their own  people, than recognize the achievements of President Trump's  legislation. This is…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}]