[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Reserve  Components Officers Course at the U.S. Army War College, and five other  professional military schools.\n\nOutside of his military service, General Lopez has been an active  member of his community, serving on the board of directors of many  organizations, including the Pierre Claeyssens Veterans Foundation in  Santa Barbara. He has also been a member…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…been vital not  only through his medical expertise but also through his volunteer work  and engagement with Pomona's Vietnamese community.\n\nDr. Vo has been a dedicated and active member and leader of our local  Pomona community. He has served as the Board Director of both the Red  Cross of Pomona and the YMCA, and as a Board Member of Cal Poly's  National…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…bestowed the Lifetime       Achievement Call to Service Award, was honored as one of the       Top 50 influential Leaders Worldwide in Pentecostalism and he       is an active member of Kappa Alpha Psi Fraternity, Inc.\n\nNow, therefore, be it resolved that, on behalf of the       constituents of the Ninth Congressional District of Texas, I       am proud…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…tonight and working with us to bring these issues before the  American people.\n\nMr. Speaker, may I inquire as to the time remaining?\n\nMs. KAPTUR.  Stansbury), who is an active member of the Labor Caucus.\n\nI will say to anyone who is listening to us here this evening, these  Members have worked all day. They started very early this morning. You  can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…her  friends, a resident of New Rochelle, and a tremendous community leader.\n\nChris is, by profession, a lawyer with a practice in business and  commercial law. She is an active member of the New Rochelle Bar  Association as part of that commitment to the law, but Chris' work goes  well beyond that.\n\nShe served for over a decade as a councilwoman on the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699164/saluting-a-neighbor-and-friend-m-christina-selin"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…village's mayor for 8  years. He received five Combat Crosses, which are awarded to officers  who perform acts of heroism in their communities.\n\nSheriff Anderson was an active member of many local organizations, as  my colleague shared, serving as a board member of the Make-A-Wish  Foundation of the Hudson Valley and chairman of the March of Dimes.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697691/sheriff-adrian-butch-anderson-post-office-building"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…work and respect  for others. During her early years in Chicago's West Side, Mrs. Pough  found her spiritual home at United Missionary Baptist Church. She was  an active and dedicated member for over 50 years at United Missionary,  enjoying the choir and participating in various church activities.\n\nAfter attending Jones Commercial in downtown Chicago,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…public service, Councilman Hutchins has always reached  back to help others to reach their full potential.\n\nBeyond his public work, Al Hutchins is a devoted family man and  active member of his faith community. He and his wife, Alice Hutchins,  are parents to Machelle (Joyce) Hutchins, Allison (Andrea) Harrison,  and Tre Hutchins, and proud grandparents…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…greatest city  in the world. Lois also worked for the New York Telephone company and  retired after 25 years of hard work and service.\n\nAs a resident of Co-op City, she is an active member of her community  and a longtime member of the Co-op City Methodist Church. Although she  is retired, that has not slowed her down, she watches the news, keeps  up with…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698097/recognizing-lois-washingtons-100th-birthday"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…as a teenager. He carried that ethic into every aspect of his public  service career.\n\nChief Tholen has retired to Shorewood with his wife of 23 years,  Lauren. He is an active member of the Excelsior Morning Rotary and  enjoys boating, hunting, traveling, and spending time outdoors with  Lauren and their Border Collie, Ike.\n\nOn behalf of myself and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…involvement with the Women's Association of the Northwest  Indiana Symphony Society and the American Association of University  Women.\n\nOutside of the classroom, Edith is an active member of the Gary  community, holding memberships in the Red Hat Society and the Sigma  Gamma Rho Sorority, Inc. She is well known for her involvement with her  church, the First…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…rounded out his military career as a professor of aerospace  medicine at the United States Air Force School of Aerospace Medicine.\n\nIn addition to this, he now serves as an active member of his  community, as a trustee for the John Randolph Foundation, and as a  member of the city of Hopewell's planning commission.\n\nHe helped establish a permanently endowed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…McDonnell  Douglas Aircraft Company as a flight test engineer and 29 years for  Raytheon as an electronic warfare engineer and director of engineering.\n\nLopez has been an active member for his community, serving on the  board of directors at the Pierre Claeyssens Veterans Foundation in  Santa Barbara and has served with the National Academies of Science…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697744/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…sympathy to the Welu  family of Milroy following the tragic loss of Melvin in a farming  accident.\n\nMelvin was born and raised in Milroy, a third-generation farmer, a  lifelong active member of St. Michael's Catholic Church, and an amateur  historian. He loved his Milroy community, reviving the Milroy Fun Fest  and following the local sports teams closely.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694029/paying-respects-to-senator-bruce-anderson"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Gun awards and a Meritorious Service Medal with 3 oak leaf  clusters.\n\nAfter retiring from the Air Force, Lt. Col. Davison has continued to  serve his community. He is an active member of the Central Texas  Chapter of the Military Officers' Association of America since 2015 and  served as president in 2022. Lt. Col. Davison volunteers for the  Alzheimer's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…office in Avon, New York, for Officer Anthony Mazurkiewicz.\n\nOfficer Mazurkiewicz served with the Rochester Police Department for  29 years. Officer Mazurkiewicz was also an active member of the  Rochester Police Locust Club for his entire career.\n\nOfficer Mazurkiewicz was tragically shot and killed while on duty  while conducting surveillance duty. He is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697616/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…an American degree from the Future Farmers  of America. Bailey is the first Bellefonte FFA member in nearly two  decades to receive an American degree. She has been an active FFA  member since her freshman year.\n\nThe American degree is the highest FFA honor and is given to members  for their dedication to their chapter, leadership, and community  involvement.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699980/recognizing-bailey-little"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Education Foundation, Chairman of Avery County  Impact, a member of the First Baptist Church Crossnore Youth Team,  Chair of the Ingalls Precinct Republican Party, and an active member of  the Avery County Schools Improvement Team. These roles reflect his deep  commitment to education, civic engagement, faith, and the future of  Avery County's youth.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…community. Beyond his official role in  government, Casey has dedicated countless hours to various civic  organizations that make Brooksville a better place to live. He is an  active member of multiple local groups, always stepping up to help  organize community events, support charitable initiatives, and lend a  hand wherever needed. His volunteerism  has…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Cass, she serves as the shop  foreman in the paint trade department, where she leads by example and  fosters excellence among her peers. Beyond her trade, Jayden is an  active member of campus leadership. She serves as Secretary of the  Student Government Association and as Vice President of her dormitory.  roles in which she consistently promotes a…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…2007, Mr. Folks was promoted to Parks and  Recreation Director. He was appointed interim City Manager in June of  2019 and became City Manager on October 28, 2019. He is an active  member of the International City/County Management Association and the  Alabama City/County Management Association.\n\nMr. Folks has been married to his wife, Vickie, for 42 years.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688463/recognizing-the-retirement-of-steven-d-folks-sr-as-city-manager-of-anniston-alabama"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Wars Post, maintains membership in her local American Legion  Post, and has served as both Co-Director and Vice President of a local  veterans' resource center. She is an active member of her local honor  guard, where she performs live taps at services and provides honors at  football games, ceremonies, and parades, ensuring that the sacrifices  of our…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Fort Riley.\n\nJim's life of service continued well after his time in the military.  His dedication to his faith and his community showed itself in so many  ways. Jim was an active member at his local Methodist church. His  accolades also include being a founding member and the first president  of the Northeast Kansas Battle of the Bulge Organization where…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…School, serving as a Junior  Firefighter, and achieving the rank of Eagle Scout, Alan has always  demonstrated a deep commitment to public service.\n\nIn 1982, Alan became an Active Member of the Plumsteadville Volunteer  Fire Company. Just three years later, he took on leadership roles both  as Recording Secretary and First Lieutenant. Over the years, Alan's…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Photographer of the Year Award five  times. Additionally, some of Bruce's photographs have been published by  the Associated Press.\n\nAside from photography, Bruce has been an active member of the  community. He was president of the Greater Mansfield Area Chamber of  Commerce and served on the Mansfield Borough Council for over 20 years.  Bruce is also an…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Following his honorable discharge, Aaron continued his life of  service by dedicating himself to veterans and his community. While  living in Washington State, he became an active member of the Combat  Veterans Motorcycle Association, contributing countless hours to  fundraising efforts that provided construction projects for disabled  veterans, ensuring…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…fund, ensuring that future pharmacists have  the essential resources to succeed. He is also an adjunct professor at  the University of Houston College of Pharmacy and an active member of  its Mading Society of benefactors. He remains a dedicated advocate for  the advancement of pharmacy, continuously supporting the profession  through leadership and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}]