[{"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…she had breasts. That is the actual reality of bathroom bans  and even the idea of bathroom bans: harassment, discrimination, and  body exams.\n\nWe don't need servicemembers acting like vigilantes to enforce this  policy either by surveillance, profiling, or physical inspections. Our  servicewomen go through enough. We shouldn't be inviting even more  harassment.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…Consumer Financial Protection Bureau, known as CFPB,  was created for one reason: to protect everyday people from getting  ripped off, especially when tech companies start acting like banks.\n\nIf a tech company wants to be trusted with your money, it should play  by the same rules as any bank. That is what the CFPB was doing. It was  making sure the rules…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689951/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…how  does that work in terms of sports and a wide variety of different  things with women's sports or men's sports? We can have a conversation  about how to fit that in.\n\nActing like transgender people don't exist further contributes to  their dehumanization and the discrimination against them. None of these  amendments before us today are even remotely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…combat. We are the ones the Constitution charged with that most  solemn duty. And, today, we are the ones who must be the adults in the  room because Trump is, yet again, acting like a toddler throwing a  tantrum on a playground, acting as if obeying the law is optional,  acting as if the Constitution is nothing more than a yellowing piece of  paper…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…responsibility of  taking care that that law is faithfully executed. The President does  not have the power to nullify a law passed by Congress, but this  President is willfully acting like a dictator and the Litigation  Working Group is working to stop this President from acting unlawfully  and unconstitutionally.\n\nWe are seeing great success in the courts,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…going to go  after anybody to make up the numbers. The Obama administration didn't  use force against peaceful protesters. They didn't do any of that. And  so now we are acting like that is the mission, and yet, the Biden  administration and the Obama administration did deport violent people  out of the United States. Yes, they did.\n\nSo what is different…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…will be  intimidated into submission and stop standing up for our neighbors.\n\nICE agents without visible ID, without any official markings on them,  and with masks are acting more like vigilantes than agents of our  government.\n\nMr. Speaker, how can we even trust that these are government  officials? It is nothing more than kidnapping, and it needs to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Congress--both the  House and the Senate? ``Sir. Yes, sir.'' Maybe not quite, but their  silence has equaled acquiescence. Congress, under this Republican  majority, is nowhere near acting like the ``equal branch of  government'' that it is.\n\nLet's just look at the record from this past year. Congress, not just  once but twice, failed to pass a War Powers Resolution…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…Here is the thing: We can have strong border security and a fair and  humane immigration system that works for our Nation. That is not what  Donald Trump is doing. He is acting like a tyrant, and he will keep  undermining our democracy, our country, and the rule of law as long as  compliant Republicans allow him to.\n\nWill there be just four Republicans…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…which the Trump  administration is catapulting us towards an authoritarian state.\n\nWe in Congress are one of the three branches of government, yet the  President has been acting like a king since day one.\n\nSince assuming office, Donald Trump has dismantled Federal agencies  and unlawfully halted billions of dollars in congressionally  appropriated Federal…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…President wants spheres of  influence rather than stability from a rules-based order. Instead of  standing up to China and Russia, the President just wants to impress  them by acting like them, rather than being better than them.\n\nThat is what happens when we have a President that doesn't just want  his own sphere of influence, he wants his own sphere of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699363/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…mass, took control from the Natives with their superior  arms, and developed a cowboy culture at the heart of their national  ethos.\n\nOne of those countries responded by acting like an adult. Having  initiated gun buyback programs after their last tragedy, they are now  working to further tighten gun regulations.\n\nThe other one of these countries acted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698407/gun-violence-tragedies"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…didn't rise to their defense; they started making calls  to Paul Weiss clients and lawyers, using Trump's assault as a means to  poach business or partners. That is shameful, acting like ravenous  vultures, putting your profits first instead of your country's  interests or the interests of the legal profession, which pledges  before a court to stand up for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…when America alienates Europe. Russia benefits when NATO is weakened  and distracted. Every authoritarian on Earth benefits when the  President of the United States starts acting like a two-bit tyrant.\n\nI will just end on this: The world where America invades Greenland is  a horrible, horrible world. It is a world with no moral compass. It is  a world…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…financing $37 trillion and another $22 trillion, plus whatever  else we are going to stack on top of that over the next decade, you  really want the debt markets to think we are acting like adults.\n\nIn many ways, when you look at these charts and you see our interest  coverage and how fragile we are, the bond market basically may be the  greatest influence…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…being done in  foreign countries while we don't have our fiscal house in order here in  America, so how about we start there.\n\nI know the Democrats on the other side are acting like, oh, my God,  the world is going to stop spinning on its axis if this spending goes  away, so why don't we talk about some of the spending that will go  away.\n\nMr. Speaker,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Mr. MOORE of North Carolina. Mr. Speaker, digital assets are not some  future concept. They are already a key part of our financial system,  and Washington needs to start acting like it. Nearly one in three  Americans have used them in some form, and we cannot afford to let our  adversaries, especially the Chinese Communist Party, write rules for  this…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…attempt to attack  our President and undermine our national security.\n\nWe conducted a 40-minute operation to remove a drug-trafficking  narcoterrorist, and Democrats are acting like we started world war III.\n\nFor that brief, targeted action, they now insist Congress must step  in and tie the President's hands.\n\nLet's be clear about how ridiculous this…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]