[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…there were two  things that were pretty clear: one, a Congressional Review Act, a  statute in American law, that allows Congress to override a very narrow  set of Executive actions for a very narrow time period. The narrow set  of Executive actions is EPA rulemakings. And the timeframe is set by  the Congressional Review Act, but it is, at most, months.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…against its own people, to sow fear and  chaos, and to silence dissenting voices in our communities, at our  colleges, in the courts, and, in fact, even in Congress.\n\nThese actions are lawless, a complete violation of our constitutional  rights to due process, and void of common sense and compassion.\n\nKnow this, for those of you watching at home who…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…or whatever the latest overreach is  called for by President Trump?\n\nThis goes way beyond the filibuster. The Trump administration could  send an endless stream of nonrule actions to Congress, going back to  1996, including vaccine approvals, broadcast licenses, merger  approvals, and any number of government decisions that apply to  President Trump's…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to express my profound  opposition to the aggressive, cruel, and dangerous immigration  enforcement actions that are taking place in Oregon and across the  country.\n\nDuring the past few months, we have seen a dramatic increase in  agents from ICE, the Immigration and Customs Enforcement…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…months ago, they were all for getting rid of it.  Now, they say they just want to change it. But there aren't enough  walk-backs or pivots in the world to erase the truth. Their actions  have unnecessarily harmed America's disaster response ecosystem.\n\nLast week, I demanded an investigation into what role, if any, the  administration's staff cuts to local…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…retirement  plan fiduciaries may consider when making investments on behalf of  retirement plans covered by ERISA. Factors that may fall within ESG  include impact of the company's actions on climate change, working  conditions, and employee safety at the company, and its management  structure.\n\nWeighing ESG factors when making investment decisions is not only…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699157/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…let you die, so that  their billionaire bosses can get $314,000 in tax cuts. That is what  they want to do. They claim to care for working people and our economy,  but their actions show us just how terrible and in your face their  hypocrisy really is.\n\nThere are no other words for those who knowingly would put tax  benefits for the wealthiest Americans…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…policy plays a role in whether our Nation is increasing energy supply  or restricting it.\n\nIt is simple economics. When supply goes up, prices go down.  Unfortunately, recent actions by this administration have moved us in  the wrong direction.\n\nIn northwest Indiana, two major energy projects that would have  increased supply and lowered costs were canceled.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699652/when-supply-goes-up-prices-go-down"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…commensurate with the  dangers it is now creating.\n\nI reintroduced this legislation for this Congress, and I thank my  colleagues for supporting this effort.\n\nThe President's actions over the last 8 months demonstrate the need  for this urgent reform and increased congressional oversight.\n\nEarlier this week, the President suggested that he would invoke…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…administration has eliminated entire offices that are  responsible for collecting data on mental health and substance use and  helping people locate treatment services. These actions will only make  it harder for people who are seeking treatment to find care.\n\nThe Trump administration is also eliminating SAMHSA altogether  without congressional reauthorization.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Mike Quigley of Chicago, for participating this  evening.                                General Leave\n\nMs. KAPTUR. Mr. Speaker, I will go back to discussing some of the  actions the administration has taken that have undermined America's  position globally.\n\nFirst of all, the Trump administration has sided with Russia over  Ukraine, most especially…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…terminating clean-energy incentives in his so-called ``One  Big Beautiful Bill,'' canceling grants and illegally withholding funds  from state, local and tribal governments. These actions are stalling  clean-energy projects and eliminating high-wage jobs.\n\nThe Trump administration is also attacking workforce development for  clean energy. In May, the Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…period, but I share  that because we reintroduced that resolution early into the 117th  Congress. I know we don't--well, maybe we do. Maybe we don't want to  dwell on some of the actions that occurred in the early days of the  117th Congress. There was an attempt to certify the election that is  usually pretty standard. We saw that happen this term. It was,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Nothing changes title 5, governing  the civil service, the Administrative Procedure Act, and so on.\n\nOne of the reasons I am voting for cloture is for the very reason  that these actions are illegal and no new law is needed to declare  that.", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…would be inefficient, cost prohibitive, and unfair.\n\nThat is what Republicans want because Federal courts keep ruling  against Trump's unlawful and unconstitutional executive actions.  Therefore, they are trying to hamstring the courts so that Trump can't  be stopped.\n\nWe need our courts to continue to serve as a bulwark of democracy  against the Trump…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Bashar al-Assad and the torture  of his people. We are giving Syria a chance to chart a post-Assad  future. We do that while also holding the new government accountable  for its actions and giving the White House the flexibility that the  White House needs to reimpose sanctions if the President views it  necessary to do so.\n\nFinally, as was mentioned already…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697811/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "John Rose", "party": "Republican", "sentence": "…quietly inserted without transparency, without  debate, and without notice to House leadership.\n\nIt allowed a handful of United States Senators to sue taxpayers for  the rogue actions of the last administration. It enabled them to seek  $500,000, per occurrence, for having their phone data seized by the  Biden FBI.\n\nThis could have resulted in millions…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…At the       same time, industry is voluntarily doing more to continue       reducing our emissions, and those efforts are working. Thanks       to innovation and industry actions, methane emissions fell by       42 percent between 2015 and 2023 according to the EPA, even       as production increased by 51 percent to meet demand.\n\nOperators have taken…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…lands.'' BLM land use plans, referred to as ``resource       management plans'' (RMPs), establish goals and directives to       guide future land and resource management actions implemented       by BLM. Pursuant to FLPMA, BLM established procedures for the       development, revision, and amendment of RMPs.\n\nThe objective of resource management planning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…in strong support of S.J. Res. 31 to overturn the  Biden administration's ``once in, always in'' rule. This is an  egregious and burdensome rule, and it was just one of many actions  taken by the previous administration on their way out the door to  further hamstring our domestic energy producers.\n\nBy permanently classifying certain industrial facilities…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691588/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…supporting  those actors around the world by funneling weapons and financial  support. They do it through their terrorist proxy network throughout  the Middle East.\n\nThese actions directly threaten U.S. personnel and our allies in the  region. Iran-backed militias have killed and injured U.S. troops  stationed on bases in the Middle East, including…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…preseparation counseling under section 1142 of title 10,       United States Code, and veterans in the supply chain       workforce;\n\n(3) recommend specific short- and long-term actions the       Department of Transportation, the Department of Defense, the       Department of Veterans Affairs, or the Department of Labor       can take to help members of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…a Field Communications  Specialist during the grueling battles of Guadalcanal, Bougainville,  and Green Island, in which he was awarded a Unit Citation for his  meritorious actions. He later worked in aviation electronics in North  Carolina before being honorably discharged in 1945. During the conflict  in Korea, Walter was also briefly called back to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…note that Presidential action like this is hardly  unheard of or unique. For context, as of the mid-20th century, scholars  identified more than 100 military deployments or actions that lacked  express prior congressional authorization.\n\nI could go back to the beginning of the Republic, with the Barbary  pirates off the coast of North Africa, but there…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…wasted no time in getting to work to provide relief from  burdensome regulations, especially when it comes to energy.\n\nLast month, the EPA announced 31 significant deregulatory actions.  Among these are actions addressing the Biden administration's good  neighbor rule and Clean Power Plan 2.0. Both of these regulations were  designed to effectively force…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…offset its annual appropriation, CBO expects that the net       effect on discretionary spending over the 2025-2030 period       would be negligible, assuming appropriation actions       consistent with that authority.\n\nIf the SEC increased fees to offset the costs for       rulemaking as required by the bill, H.R. 3357 would increase       the cost…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…complicit in the Chinese Communist Party's genocide and oppression of  the Uyghur people.\n\nThe United States must push back on China not only in our words but  through our actions. Failing to do so enables the CCP to grow in  strength and exert its malign influence over the world. It is past time  we enforce accountability against our greatest adversary.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…ADMINISTRATION.\n\n(a) In General.--The Administrator of the Small Business       Administration, acting through the Chief Information Officer       of the Administration, shall take such actions as may be       necessary to implement the recommendations contained in the       report of the Comptroller General of the United States titled       ``IT MODERNIZATION: SBA…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…cut seatbelts, a windshield wiper, and a piece of  metal to make makeshift tourniquets to stop the bleeding of the young  boy until the ambulance arrived.\n\nWithout the swift actions of Mr. Van Orden, along with those also on  the scene, the young boy probably would have died.\n\nMay the actions of Mr. Van Orden and the folks who assisted in saving  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695712/recognizing-derrick-van-orden"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…COVID-era programs.\n\nThis level of fraud undermines the integrity of the SBA. It is  essential that we track these criminal fraudsters down and hold them  accountable for their actions.\n\nTwo of these SBA COVID-era programs, the Restaurant Revitalization  Fund and the Shuttered Venue Operators Grant, directed financial  assistance toward small businesses…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}]