[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…knees,  being thrown prostrate, and being handcuffed.\n\nHere is the thing that frustrates me the most: Is this another day  where the lead stories will be about the actions of this  administration? We have seen a week where it is violating a tradition  that has gone back before I was born where the Federal Government  activating Federal troops in a community…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I am here today as a Representative of a  community that is deeply alarmed by the actions of this administration.\n\nJust weeks ago, the Trump administration defied a unanimous--we  didn't think this was possible--but a unanimous Supreme Court order by  refusing to facilitate…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690505/trump-immigration-policies"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…gigawatts--the  equivalent of two New York Cities--of solar, storage, and wind have  been stalled because of this new review requirement.\n\nThat doesn't even include other actions from the administration. We  have seen stalled an additional 116 gigawatts of energy. If we are  counting, that is the equivalent of powering 12 New York Cities. Or, to  put it bluntly,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…U.S. Attorney for the District of  Columbia. Mr. Martin called Hale-Cusanelli an ``extraordinary man'' and  an ``extraordinary leader.''\n\nDoes that sound like the actions of an administration that cares  about protecting the Jewish community from antisemitism? Seems more  like lip service to me.\n\nBut the hypocrisy doesn't end there. President Donald Trump,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…the past 75 years and looking forward to a bright  and innovative 75 more years. Instead, we are fighting to save it from  the chaotic, reckless, and destructive actions of this administration.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…going to lower costs.\n\nWe heard a lot about Greenland and golden tickets and something about  Mars, but we didn't actually hear about lowering costs because the  actions of this administration will actually raise costs for every  American.\n\nIf you cut Medicaid, for instance, not only will you cut off care for  millions, it will raise the healthcare premiums…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688637/the-actions-of-this-administration-will-actually-raise-costs-for-every-american"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…passing the bipartisan infrastructure  law, Inflation Reduction Act, and the CHIPS and Science Act, is already  helping to turn the tide.\n\nI am concerned that actions by the Trump administration are putting  this great success at risk. The attempts to claw back these historic  investments in our manufacturing sector, unstable and erratic tariff  policies,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to President Trump or Secretary Collins.\n\nShe is supposed to be judging them, but she is beholden to them, and  she has been part and parcel of the policies and actions of this  administration that have been so dangerous and damaging to the VA in  these past months.\n\nOur veterans deserve better than a political loyalist who is going to  be rubberstamping…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…that others were not recognized, but they held on  to that faith for this Nation, and they led us to being a better place.\n\nComing from that background, several actions of this administration  strike a little bit differently. It stings a little bit more when  things happen like the rolling back of an EEOC order that has been in  place since 1962 that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Security, and when they cut Meals on  Wheels and SNAP?\n\nWe are going to make America hungry again. We are going to make  America sick again. I have a binder full of actions from this  administration that have come out of this administration in just the  last 100 days. They are terrifying. Not only are they terrifying for  Black America, but they are terrifying…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…role in whether our Nation is increasing energy supply  or restricting it.\n\nIt is simple economics. When supply goes up, prices go down.  Unfortunately, recent actions by this administration have moved us in  the wrong direction.\n\nIn northwest Indiana, two major energy projects that would have  increased supply and lowered costs were canceled. An $8…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699652/when-supply-goes-up-prices-go-down"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Quigley of Chicago, for participating this  evening.                                General Leave\n\nMs. KAPTUR. Mr. Speaker, I will go back to discussing some of the  actions the administration has taken that have undermined America's  position globally.\n\nFirst of all, the Trump administration has sided with Russia over  Ukraine, most especially by pausing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…understands that a deal is a deal.\n\nLet me explain both of these.\n\nOn the healthcare side, the reconciliation bill that was passed in  June, together with some other actions of the administration-- particularly unilateral actions of Secretary Kennedy and the President  in withdrawing healthcare funds from Virginia and unilateral actions  thrusting uncertainty…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…other official documents. Judicial orders have been blatantly ignored  and courts denied access to potentially evidentiary information.\n\n``I am concerned these actions by the administration are simply a  trial balloon to expand Presidential authority without judicial or  legislative oversight in order to detain individuals at their will or  discretion.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…emissions.  Reality is, we all know it is happening. We are all victimized by these  wild weather events.\n\nAnd there are only two explanations that explain the actions of the  administration: One is they just favor fossil fuels no matter what.  There is a lot of truth to that. The other is, there is a lack of  confidence on the administration about…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688164/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Rose", "party": "Republican", "sentence": "…without transparency, without  debate, and without notice to House leadership.\n\nIt allowed a handful of United States Senators to sue taxpayers for  the rogue actions of the last administration. It enabled them to seek  $500,000, per occurrence, for having their phone data seized by the  Biden FBI.\n\nThis could have resulted in millions of tax dollars…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}]