[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Financial Protection Bureau. Let's review the terrible things they have  done.\n\nSince 2011, they secured more than $21 billion for 205 million  consumers who were harmed by bad actors including the biggest banks.  The agency has received more than 10 million complaints from harmed  consumers, and insured financial firms responded. That is, on average,  25,000…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…particular have a higher stake in  this rule prohibiting exploitive overdraft fees.\n\nAnd the reason is--despicably, disgustingly--servicemembers are often  targeted by bad actors and financial institutions for abusive and  predatory practices like overdraft fees or that result in overdraft  fees.\n\nA Department of Defense survey revealed that 10 percent…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…something that occurred here that is more egregious  than the action that precipitated the coverup, than the coverup itself,  and that thing is the ability of all of these actors to do this and  commit any Federal crime with impunity. As a matter of fact, we could  say it is with immunity.\n\nThese actors, these participants, they all have the blessings…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Most often, it happens to  women and girls.\n\nAs AI becomes more prevalent in our everyday lives, Congress must  meet this moment. We must empower and protect victims from bad actors  who share their intimate images, real or fake, without consent and from  the most harmful developments of AI.\n\nDuring the 2023-2024 school year, 15 percent of high school…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…healthcare, short-term  disability, and life insurance.\n\nIn fact, the Federal tipped minimum wage is only $2.13 an hour.  Instead of giving workers a leg up, this bill offers bad actors an  opportunity to cut corners and shortchange their workers.\n\nMr. Speaker, for that reason, I oppose the bill and urge my  colleagues to do the same.\n\nMr. SCOTT of Virginia.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…for  mariners and passengers aboard vessels. This legislation builds upon  that work by addressing additional safety risks on vessels and  increasing the penalties for bad actors.\n\nThis bill fights oil spill pollution by bolstering vessel response  plans and ensuring timely, robust firefighting responses when vessel  incidents do occur.\n\nIt also requires…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and the  gentleman from Pennsylvania (Mr. Joyce) for their bipartisan leadership  on this bill. It is an important step in protecting our communications  networks from bad actors and foreign adversaries.\n\nMr. PALLONE. Mr. Speaker, I urge unanimous support for this bill, and  I yield back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…nearly every facet  of American life, which also makes them prime targets for attack.\n\nThis legislation will help us better protect American families and  our country from bad actors who want to carry out malicious attacks.\n\nMr. Speaker, I thank Representatives Kelly and Latta for their  bipartisan work on this legislation.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…explored yet. I think United       States companies have a big interest there. And it's not only       oil, we have other minerals.''\n\nTo address the growing presence of foreign actors, Sahad       called on the U.S. to crack down on the nations suspected of       playing destabilizing roles in Libya. While he said he was       encouraged by moves such as…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…tremendous potential to improve efficiency, optimize  networks, and revolutionize industries, it also introduces new  cybersecurity risks.\n\nForeign adversaries and malicious actors are already leveraging AI to  enhance phishing campaigns, automate malware, and exploit zero-day  vulnerabilities faster than ever before. These tools can evade  traditional…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…units  within corresponding banks.\n\nThe commonsense legislation seeks to enhance the tools at our  disposal to investigate sanctioned individuals and entities and to hold  bad actors accountable, and that is very important.\n\nThis concept is similar to, as you have heard by our ranking member,  Mr. Speaker, a keep-open letter, which is when the government…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693943/ofac-licensure-for-investigators-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…but to amass enormous wealth. He used those powers both to  control dissents and protests domestically, but he also used those  powers in order to compel other nations and actors inside the empire to  pay him tribute.\n\nPresident Trump has decided that he is going to use the powers that  we have given him to demand the same kind of tribute that Kings…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…interference.\n\nThis bill also requires the Secretary of Homeland Security to provide  Congress with a briefing on its implementation.\n\nTime and time again, we have seen bad actors attempt to exploit our  sensitive information. This measure strengthens DHS' ability to prevent  such threats and protects our national security.\n\nThis bill is a critical step…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688735/research-security-and-accountability-in-dhs-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…likely to assist in prosecution, making the District       safer. H.R. 2096 would make it harder for law enforcement       leadership in the Nation's Capital to remove bad actors who       undermine that trust.\n\nWe also oppose H.R. 884, which would repeal a 2022 law       extending voting rights in local District elections to non-      citizen residents.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…and  childcare.\n\nRepublicans rejected every one of these amendments.\n\nClearly, this bill is not about supporting pregnant women and  families. It is about shielding deceptive actors, supporting Trump's  revenge tactics, and using public funds to advance an extreme anti- abortion agenda.\n\nIf Republicans truly cared about pregnant women and families, we…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…years, the United States has faced an alarming surge in  malicious cyber activity originating from  groups aligned with the Government of the People's Republic of China.\n\nThese actors have demonstrated a level of sophistication and planning  that reflects both significant resources and a deep understanding of  the essential systems that keep our country…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…a  unanimous vote here on the floor.\n\nWe all recognize the threats we face around the globe and in  particular from China, Russia, Iran, North Korea, among many other bad  actors. Our export control laws are put in place for a reason, and it  is to protect sensitive technology from getting into the hands of bad  actors.\n\nHowever, when our laws were…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…uncover illicit networks during financial crime investigations.\n\nThe gentlewoman and I agree that while the private sector can provide  a helping hand in tracking down bad actors, it is ultimately the  government's responsibility to provide clear legal guidance and  guardrails to support their efforts.\n\nMr. HILL of Arkansas. Mr. Speaker, I include the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…modems play a key role in communications networks. They  are the entry point through which the public accesses the internet.  Thus, we make sure that they are secure.\n\nBad actors can exploit vulnerabilities in routers to infect users'  computers, access their information, or disrupt their network.\n\nNational security agencies, including the Director…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690156/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…ranking  member.\n\nH.R. 1458 would expand the way in which the GI Bill benefits can be  used by veterans, but it would not remove any of the guardrails in  place to keep out bad actors. In fact, the bill would require regular  and additional interaction between students and instructors, which  would add an additional meaningful guardrail for veteran providers.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…interagency task  force and requiring a comprehensive report on the targeting of United  States critical infrastructure by Peoples Republic of China state- sponsored cyber actors, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2659\n\nBe it enacted by the Senate…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…political participation.''\n\nMr. Speaker, consider H. Res. 1471 of the 118th Congress, another  Democratic-sponsored piece of legislation that stresses ``Venezuela,  where actors linked to the regime of Nicolas Maduro have engaged in a  sustained and synchronized campaign of disinformation to undermine the  country's 2023-2024 electoral process, invalidate…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Iran's Revolutionary Guards Corps.\n\n(2) The Government of Iran has acquired destabilizing       conventional weapons systems from the Russian Federation and       other malign actors, and is funneling weapons and financial       support to its terrorist proxies throughout the Middle East,       threatening allies and partners of the United States, such…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…United States. Congress must look to  preserve this competitive advantage and not let it leave our shores.\n\nBy passing a comprehensive market structure framework, responsible  actors will now have greater certainty and consumers greater protection  from bad actors.\n\nThis bill establishes a regulatory framework for digital assets that  aligns with our existing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693769/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…that this Senator will be on the lookout for any  destabilizing actions that threaten the peace in Bosnia. And I will  work with the Trump administration to make sure that all actors in the  region respect the Dayton Peace Accords that ended the violence and  genocide that took place in 1995.", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696528/bosnia"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…going to nullify an executive order.  It is going to attack his agenda, the America First agenda, that he was  overwhelmingly elected to enact.\n\nThese unions are not neutral actors. The word ``billionaires'' was  mentioned by my colleague from California. I am glad he mentioned the  term ``billion,'' because that is what the partisan machine government…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…commonsense requirements to protect consumers. Those  are all built on the existing requirements in the financial services  markets.\n\nSecondly, the CLARITY Act protects good actors from government  overreach. By establishing clear rules, we limit the government's  ability to subjectively enforce vague statutes. These protections are  important to those…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…the way down to $1; total transparency of  every cent. Any foreign gift, no matter how small, can influence our  democracy, and we must close any loophole that lets foreign actors  purchase access or sway our institutions.\n\nThis is not about research. This is about human intelligence  collection and business espionage. Having spent time in the  intelligence…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689034/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…public safety in the process.\n\nThis bill ensures that PHMSA has the necessary tools to conduct more  frequent inspections at foreign manufacturing facilities and to hold  bad actors accountable.\n\nI thank my friend, the chairman of the Transportation and  Infrastructure Committee, for his support in moving this bill forward.  I also thank my colleague from…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…recognizes  the rich natural resources we have in the great State of Montana right  underneath our feet.\n\nUp until recently, Biden's anti-American policies have allowed  foreign actors to dominate mineral markets, and this has stifled  domestic energy production to the detriment of Western States like  Montana.\n\nI had the opportunity to return home last week,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}]