[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…cannot do with intimate details  that it collects about each American. Government officials are not free  to use our sensitive personal data however they wish, but that may  actually be happening under the Trump regime.\n\nWhen this legislation was before the Ways and Means Committee, I  offered an amendment to address a serious and looming threat to our…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…to vote yes on my  Protect Veteran Jobs Act--a simple amendment that would reinstate every  veteran who has been fired because of Trump and Musk's betrayal.\n\nIf Republicans actually care about our veterans like they claim to on  FOX News--\n\nMs. DUCKWORTH.--then they will vote yes on this bill and help give  our veterans their jobs back. Otherwise, they…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688892/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…pharmacy benefit managers,  and achieving mental health parity by going after insurance companies  that mislead seniors in Medicare Advantage with lists of doctors that  aren't actually available. Americans have deep concerns about the state  of their healthcare, and these reforms represent a down payment on the  effort to ensure our system benefits families…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I will just say if this administration was  keeping their promises, we would actually have a President, who, when  asked if it is his responsibility to uphold the Constitution, wouldn't  say I don't know, and instead of passing laws  about renaming bodies of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690755/congratulations-to-marely-gutierrez"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…why we are here today.\n\nWhy I am here is to sound the alarm on the incredibly slippery slope  that Donald Trump has set us careening down. Even if the administration  can actually give us proof that those killed on board were all  criminals, well, then they should have been apprehended by law  enforcement and tried in the judicial system. That is how…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…President Trump, who simply does not care. He does not believe  the affordability crisis is real. In fact, he recently said:  ``Affordability is a Democrat scam.'' That is what he actually said.  The President should tell that to the hardworking families who are  facing skyrocketing prices across the board. It is a crisis, and  Republicans are simply ignoring…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. Speaker, I think we have figured out the rhythm, the prime  directive here for Republican governance these days.\n\nFirst, they slashed the services that working families actually  depend on. Then they turn around and hand the savings over to their  billionaire friends. They do it time and again. It is rinse, lather,  repeat.\n\nWhat do we have on the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…choice to do it differently, and that choice was described most  eloquently in a letter from the main drafter of the Constitution James  Madison to President Thomas Jefferson. Actually, he was not yet  President. This letter was dated April 2, 1798, and James Madison  described what were they getting at when they vested the power to  declare war with Congress.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…disenfranchisement, that is what would be created.\n\nSo I am very concerned because our national voting system does depend  on you being a U.S. citizen. This is what the ballot actually says-- here is one of my old ballots that I took a picture of. It basically  says on the outside of your ballot, return as soon as possible by  election day. This ballot contains…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…roles in absentee ballot fraud in rural North Carolina during  the 2016 and 2018 elections to help Republican congressional  candidates.\n\nLet's not even get into Donald Trump actually being recorded--it is  recorded--asking for 11,800 votes to basically change the results in  Georgia during the 2020 election.\n\nIf my Republican friends want to talk about…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Housewives'' if you have been watching what is unfolding, even  just in the last several hours.\n\nIn fact, just a couple of hours ago, Elon Musk affirmed a statement  about actually impeaching the President. I mean, who would have thought  that we would end up here because, literally, less than a week ago,  they were having a bromance in the Oval Office?…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…One interesting point is that even Chairman Hill himself inserted  language at the end of the so-called CLARITY Act that the House is  separately considering this week that actually amends the GENIUS Act.\n\nMr. Speaker, you heard me right. Rather than amend the GENIUS Act,  which our own chairman saw had problems, he put his changes at the end  of the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to  critical minerals, but when you read the bill, Mr. Speaker, the text of  the bill, there is nothing related to critical minerals. It is kind of  a sneaky little bill.\n\nActually, if we pass this bill, it is quite likely that energy bills  and electricity bills are going to go up. It is likely that this will  lead to higher costs across the entire…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…every moment of the operation. He said  on FOX News that he ``watched it live.'' He said the same to us in  person.\n\nBut then, last night, he tweeted that his admiral was actually the  one who made all the combat decisions.\n\nThis is so spineless.\n\nPete Hegseth won't hesitate for a moment to talk a big game and take  credit if he thinks it makes him…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that he is  declaring martial law? Well, he is not declaring it currently. He is  saying that he may have to, talking about martial law. He talked about  that some time ago. Actually now he is talking about the Insurrection  Act, the Insurrection Act. He is talking about the Insurrection Act. He  has spoken of martial law on other occasions long ago, a…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…happening right here in our great House.\n\nFirst and foremost, what I am most pleased about is, isn't it  refreshing that when politicians talk during election time, they  actually for a change keep the promises that they made to the public.  The President promised the idea that we would get America back on  track, secure our border, and reduce taxes…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…will continue to advocate for policies that break the stigma around  suicide and advocate for brain health awareness and suicide prevention.\n\nAs a young college student, I actually was one of the people on a  suicide hotline, so I know how tenuous it is and that people need  support and help.\n\nThis day reminds us that every life has value and every person…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…barriers not only to manufacturing components, but also to  their delivery and installation. In the real world, grid reliability  depends on whether critical equipment can actually reach the job site  and be installed on time.\n\nIf we want a serious assessment and serious recommendations, then we  cannot stop at the factory gate.\n\nMr. Chairman, I urge…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697889/electric-supply-chain-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…wrong, we are setting the stage for more of that to happen.  These words matter.\n\nWe have to tell the truth, whether it is the deaths of Pretti and  Good or whether Republicans actually control the show in the Senate.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…resource management plan in  place without it coming back to Congress, then maybe the current  administration and Secretary Burgum can write a new resource management  plan that actually makes sense, that actually takes into account  America's need for energy, and that actually listens to the people in  these States where these resources reside. While they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…that means as foreign flags  are waved by violent mobs setting fires, ransacking businesses, and  terrorizing motorists in our sanctuary cities.\n\nWhat do our immigration laws actually say? They say, clearly and  unambiguously, that any and every adult who illegally enters our  country shall be detained. Those are the exact words of the law:  ``shall be…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…just targeted toward a small 7  percent of the total population that is that narrow margin in  ObamaCare. This is touching every single person, and that is the only  way to actually lower health premium costs over time.\n\nThis bill lowers premiums through pharmacy transparency and cost- sharing reductions. This legislation improves options for workers…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Economic Committee. I was  trying to get an answer to whether the economists' projections from the  Joint Economic Committee are correct. You have to understand that there  is actually a weird little battle going on here between the Senate and  those of us in the House and those of us on Ways and Means.\n\nA number of our brothers and sisters over in the house…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…reality is that this could not have been further from the truth.\n\nPresident Trump has shown that the only thing we needed all along was  a President who was not afraid to actually enforce the law.\n\nThe facts speak for themselves. During the month of June, U.S.  Customs and Border Protection saw the lowest number of encounters ever  on our borders nationwide.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…our bill not only provides this temporary  extension, but it also includes reforms that pay for themselves. In  other words, the savings that we get through our reforms are actually  greater than the cost of the extension itself. This is according to the  Committee for a Responsible Federal Budget, which analyzed several  proposals that are out there…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…versus saying: Mr.  President, take a look at our alliance. Take a look at the most  important alliance in the history of the United States, the NATO  alliance. This could actually destabilize that, Mr. President. Mr.  President, you should know, at one point, we had 17 military  installations in Greenland, and they would be happy to have us back.  They…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the back of the room and stew when I hear people say things when it is  obvious they didn't pull their calculator out.\n\nI am going to try two things tonight, and if you are actually  interested in budgets and economics, have fun with me. If you are not,  go watch Netflix. We are going to actually try a couple concepts, where  the money is going and within…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…things we had to do in the  Senate was to confirm the President's Cabinet and various nominees. Of  course, our Democratic colleagues resisted at every turn, requiring  that we actually change some of the rules of confirmation to allow the  President to fulfill his mandate following his election and to get his  team on the field. Democrats not only were sore…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…today in support of the Haiti Economic Lift  Program Extension Act.\n\nIn my Hudson Valley district just north of New York City, we have a  vibrant Haitian community. It is actually one of the largest Haitian  diaspora communities in the country, and it has been an honor  representing these great people and working with them over these many  years.\n\nOne…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are going to have not enough noise about the facts, the numbers, the  data, the debt, those things that we can come in and sort of do our  boards, our charts, on things that actually reduce spending and  modernize.\n\nI do want to sort of start with this. We have spent time since last  summer working on pieces of legislation. The Wall Street Journal series…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}]