[{"senator": "John Larson", "party": "Democrat", "sentence": "…were called communistic, as well. How  about we have an open public hearing and debate on that and put  legislation forward not in the dark of night but when the public can  actually view what you are saying.\n\nMr. Speaker, I am here today primarily, though, to talk about Social  Security and also to enlighten, I hope, my colleagues on the other  side.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…when boots  went on the ground before. Somehow, we were lucky enough, by God's  grace, that  nothing bad happened to the men and women in the service of our Nation.  Yet they actually were injured, seven of them.\n\nThe U.S. military is being used against Venezuela without  congressional authorization, without transparency, and in ways that  appear only designed…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…know your customer rules, our illicit  finance rules, our protections of a one-to-one dollar banking.\n\nNone of that exists today. Because of the work of this legislation,  we actually have a regulatory framework that can protect consumers in  the future.\n\nI just want to thank Senator Scott and Senator Hagerty for their  extremely honest and thoughtful approach…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…Mountaintop'' speech he delivered the night before  he was assassinated, but he still went on.\n\nIn 1956, after he had just graduated--or he was still working on his  dissertation, actually working on graduating with his Ph.D.--he was  called to Montgomery to preach at a church there and lead the church.  When he got there, he was drafted to become the leader…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…broadcaster anymore. We will  fine you.\n\nHe should know better. It was not too long ago, before he was  Chairman, when Brendan Carr was singing a completely different tune. He  actually condemned perceived attempts by ``government officials to  silence political speech that they don't like.'' That is the old  Brendan Carr. He defended talk show hosts, saying:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I rise today in opposition to the  Republicans' voter suppression act.\n\nI want to give Republicans one chance to actually fulfill the  rhetoric that they are spouting to the American people, which is  actually giving people the right to vote.\n\nI appreciate efforts to ensure that our elections…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690011/safeguard-american-voter-eligibility-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…cooperation from our  Senators, who have raised a very important concern: Some people are  lactose intolerant. They can't drink milk. And the way the legislation  was written--but, actually, because of something that went back to the  Truman years--there is some suggestion that is a disability.\n\nI want to thank Senator Alsobrooks, who is here, for bringing this…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…doing this week, but the first  bill Republicans bring to the floor in 2026 is about showerheads. It is  almost impossible to believe. To make matters worse, this bill will  actually drive up monthly utility bills for American families.\n\nElectricity prices are up 13 percent across the country. Eighty  million Americans are struggling to pay their utility…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…very wealthy.\n\nOne of the things I just wanted to set up for you here is, you know,  just to note that Americans may be surprised to know that 24 percent of  Americans are actually on Medicaid today, because some Americans may  say: Well, my insurance isn't Medicaid. My insurance is through  MississippiCAN. My insurance is through ACCESSNebraska. My…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "Mr. GOMEZ. Mr. Speaker, it is about damned time that this bill is  actually going to get a vote. Here is why. The Republicans in the  summer passed their One Big Beautiful Bill Act, which I am glad they  are not trying to rebrand anymore. It cut Medicaid…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…accorded him in good faith under the Constitution of the United States  of America, he uses it to release, and to a certain extent to  exonerate, a limited extent, persons who actually assaulted the  Capitol.\n\nNow these participants in this event, they know that they have got  the President backing them up. They know that even if they commit a  Federal crime…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…restrictions under the National Firearms Act. Moreover, it  allows them to be sold at salvage value, effectively making it so that  the Federal Government and the taxpayers would actually be subsidizing  gun sales. They replaced fair market value with salvage value.\n\nMy colleagues have claimed that the bill would not really allow for  the sale of all of these…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…child.\n\nThis story is uniquely mine, but it is not just my story. Millions of  women in our country--women in this room, women all throughout America,  women that people here actually know and love--have suffered a  miscarriage or stillbirth.\n\nCongress should be making sure that women are aware of all of their  rights, not just cherry-picking the ones that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…law enforcement.\n\nWhen I talk to the law enforcement officers in not just my city but  up and down the State, they want more resources. That is why I have  multiple bills to actually fund our police departments around our  country and specifically in New Jersey to empower them on everything  from closing out murder investigations all the way to mental…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…important to note that I  said to my colleagues on the other side of the aisle that if we can get  information from the Office of Advocacy as to what small businesses are  actually submitting and the mechanics of the hotline to ensure  independence, I would be willing to work with them. Instead, the bill  is being rammed through the House to score political…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…War Powers Resolution, which is becoming common around here--and way  too common, as a matter a fact.\n\nBut I think the first thing we ought to talk about is what we are  actually doing here, from a 30,000-foot standpoint, as far as what the  resolution actually says. As usual, there is a lot of setup in here,  but there are 2\\1/2\\ lines that say what…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to walk through, big picture, what we  are accomplishing with this reconciliation bill titled the One Big  Beautiful Bill Act, and walk through some of the provisions.\n\nI actually tried my hardest back in my district to let facts rule the  day and not be governed and manipulated by a lot of rhetoric about this  particular type of work.\n\nI am going to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…the same people who are advocating saying that Kristi Noem and ICE  will demand your personal information and you will be under  surveillance, might I remind them that they actually all authorized the  reauthorization of FISA, unreformed, that violated our constitutional  rights.\n\nThis is pretty simple. If you are not an American, Mr. Speaker, then  you…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Democratic colleagues  thought that he would go: Wow, $25 million, maybe I should just turn  myself in.\n\nI would like to believe that when they put that bounty out there they  actually believed he should be removed from office.\n\nThere is an old Twitter post from President Biden that said: ``Trump  talks tough on Venezuela, but admires thugs and dictators…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…am  prepared to close, and I continue to reserve the balance of my time.\n\nI urge my colleagues to vote in favor of S.J. Res. 11. I thank my  colleagues across the aisle for actually making our point on why this  regulation that was put in place by the Biden administration is totally  unnecessary.\n\nWe made the point that it is targeted specifically for…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…LUTTRELL. Mr. Speaker, I rise today to recognize and honor an  extraordinary public servant, a trusted leader, and dear friend, my  chief of staff, Ms. Christine Lee, who is actually retiring after a  distinguished career in public service.\n\nIn this Chamber, we often speak about policy, votes, and headlines,  but behind every office, behind every Member,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and not  putting forward here in this debate, when they say $3 trillion of  additional deficits, is what you believe the growth rate will be if you  adopt policies that will actually increase economic growth. That is  putting more money into the pockets of the American people and  deregulating so that businesses can create wealth.\n\nWe assumed 2.6 percent…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…like Nature, so it is a peer-reviewed article going back  over 140 years of congressional speeches. It basically says that the  use of facts has absolutely crashed. If you actually read it, it has  crashed. We now talk about our feelings and intuition because that is  how we manipulate people.\n\nMr. Speaker, it is in Nature publication right now. Go pull…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…today in support of the Haiti Economic Lift  Program Extension Act.\n\nIn my Hudson Valley district just north of New York City, we have a  vibrant Haitian community. It is actually one of the largest Haitian  diaspora communities in the country, and it has been an honor  representing these great people and working with them over these many  years.\n\nOne…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…get done here.\n\nMr. Speaker, in my State, we dealt with this issue a number of years  ago, and it is a policy fight that is separate from what we are doing  here today. We actually ultimately decided to move our State-based  crime victim support programs into appropriated support from  our general fund and deposit all of these erratic streams from the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…illegal believes you can get  there, you are never going to leave the country. If we don't fix this  problem, we will never fix illegal immigration. In the Gang of 8 bill,  we actually fixed this problem.\n\nSo what have I learned?\n\nI have learned that I can't get a vote on an amendment that would  require State and local officials to obey the law or go to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…experience an easier and more simplified filing process.\n\nWe locked in the doubled standard deduction, and not only at the rate  that Republicans established in 2017. We actually boosted it for this  new approach. It is now considered permanent policy, meaning that  families will pay no taxes on the first $31,500 of what they make.\n\nIt will also save…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…be here with you this  morning to talk about the good news. Every day, I hear in so many  newscasts that somehow the sky is falling. Let's get to the facts about  what is actually happening in our economy and, most importantly, how  America is moving in the right direction.\n\nGas prices are down. Inflation, despite all the worry of the last  month, was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…think that is why  my colleagues fear this process of using the CRA because then it would  be up to a future Congress to go back and undo what we do in this  Congress if we actually pass a Congressional Review Act.\n\nAgain, we are here today because the Biden administration decided to  unbalance the scales and put onerous burdens on States, on our natural…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…did because we  made major adjustments for taxes that would have burdened our small  businesses and made it more expensive for them to compete against the  big companies. Actually, what we did was we kept everything that we  already had that was going to expire.\n\nNow, it is true, the big companies get some of these tax cuts too.  However, Mr. Speaker,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}]