[{"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…out, and he said: You know what, they convinced me.\n\nThey convinced me that he is a ``no.'' The reason he is a ``no,'' he  said, over the next 3 years, it is going to add almost a trillion  dollars to the debt, and that is in the best case, the most rosy  scenario. Then he said: That is a lie.\n\nThis clock that we have that has the debt, it is still going…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688029/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…tax cuts will produce over the next 10 years.\n\nThe Committee for a Responsible Federal Budget issued their report  last night and they conclude that this plan is going to add $4 trillion  to the national debt. That is even with the cuts that were part of the  Medicaid plan, which I talked about a little bit more. We have a bill,  which is going to cut…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…the war.\n\nPlease defeat this amendment.\n\nMr. SMITH of Washington. Mr. Chairman, sadly, the gentlewoman has had  a big part in it. She just voted for a budget that would add $4  trillion to the debt, so I don't know that that is a particularly  consistent position.\n\nMr. Chair, I yield 1 minute to the gentleman from Nebraska (Mr.  Bacon).\n\nMr. SMITH of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…trillion for tax cuts. That then brings us to  not my words but to Peter Navarro's words, whom I happened to meet with  on a Sunday, who said that these groups of tariffs will add $6 trillion  in revenues.\n\nWho do you think is going to pay for that? Candidly, it is going to  be the people who buy the Presiding Officer's cars at those great  dealerships in Ohio.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…control the White  House, the House, and the Senate. Yet, the Republicans were in control  to throw 15 million people off of healthcare. Republicans were in  control to add $4 trillion to the debt. The Republicans were in control  to cut Medicaid by $1 trillion. The Republicans were in control to give  ICE unlimited amounts of money with no guardrails.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are tired of being sold out, spun, and left behind.\n\nMr. McGOVERN. Mr. Speaker, the gentleman is concerned about unchecked  deficits and debt. He just voted for a bill to add $4 trillion to the  debt. Come on. Give me a break.\n\nMr. McGOVERN. Mr. Speaker, you have to love the gentleman from  Georgia when he says that he worries about the deficit and the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…true. I don't think that is  that hard for the American people to understand.\n\nMr. Speaker, as we have made clear time and time again, the big, ugly  GOP tax scam is set to add $3 trillion to the deficit, $3 trillion. To  be clear, that isn't me saying that. That is the independent,  nonpartisan Congressional Budget Office, CBO.\n\nIt isn't just CBO. Every…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…790,000 jobs over the next decade and raise household energy  bills, all while adding to air pollution and worsening our climate  crisis.\n\nAnd even after all that, it will add $4 trillion dollars to the  national debt with interest costs over the next decade, saddling future  generations with the cost of tax breaks for the wealthy.\n\nApparently, Republicans…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Here are the facts: We currently have about a $36 trillion debt, and  we are spending right now $2 trillion more every year than we take in.  The Republican budget would add $3.8 trillion to that deficit. It will  do that over 10 years.\n\nHow are they going to get those $3.8 trillion of tax breaks? Let me  just outline who those tax breaks are going to…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and educational content like Sesame Street.\n\nThese cuts are being celebrated as savings at the same time that the  majority is pushing their big, ugly bill that will add at least $3  trillion to our national debt.\n\nIt is clear this isn't about savings. It is about pushing a harmful  ideology on the U.S. and the rest of the world. I will not support it.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692398/rescissions-package"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…three concerns that they have.\n\nWhen Members talk about the deficits and the jobs creation that the  Tax Cuts and Jobs Act are supposed to have, note that this is going to  add $7 trillion to our national debt. It will blow up our deficit. In  fact, Donald Trump is responsible for roughly 40 percent of the  national debt just in the 4 years in which he was…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…they all talk a good game. They are  going to be tough on the budget. They are going to make cuts to make  sure we can balance the budget, except they don't. They add another  $3.3 trillion, basically to give tax breaks to billionaires.\n\nWho does that? Who thinks that is a good idea? I don't think I know  any billionaires. I am hard-pressed to find somebody…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…calculated the debt impact in terms of H.R. 1 because of  the massive giveaway to billionaires and the top 1 percent of this  country. They determined that the bill is going to add $3.4 trillion to  America's deficits between 2025 and 2034.\n\nThe debt service on that additional debt is an additional $718  billion. That is just pure interest. It has no value in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…waste, and abuse--something that I  have spent my entire life fighting against--we know that it is just not  true.\n\nDon't forget, they just passed a bill that is going to add $3  trillion to the deficit. They don't care about balancing the budget or  limiting waste. They want to cut services that American families depend  on so they can afford a bigger…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…$20 trillion of deficit spending, if we are lucky for it to  be that low, over the next 10 years.\n\nIf the Senate is going to send the bill back to us that is going to  add a trillion dollars more and not reform Medicaid properly and not  terminate the green new scam that the President campaigned on  terminating, then there is no way I can vote for that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…math in my head. If I had  70, 75 basis points, it is more than all those cuts.\n\nIf we went back to the interest rates we had in the early 2000s, I  think that would add another $3 trillion, $4 trillion over 10 years of  just interest. The theater around here is about telling stories. It is  emoting the emotion, but damn it, does anyone own a calculator?…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…makes our  lives easier when we can attack the scorekeeper. We can say the  scorekeeper didn't get it right, therefore, pay no attention when they  say we are trying to add $3, $4 trillion of debt.\n\nWe are better than that. There is a reason so much of the economic  press is just mocking us and making fun of us. I understand it is good  politics. You get…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…don't want to have to deal with  telling the truth of the math.\n\nLet's take a look here. We finished this fiscal year $37.2 trillion  in debt as a country. Baseline, we add $22 trillion of additional  borrowing over the next 10 years. If we were to do the tax extensions,  which we really need to protect the middle class and others by not  raising their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…growing. Interest rates go up. We are now  paying it because this year or in the next 12 months we have to  refinance $9 trillion of U.S. sovereign debt, plus probably add another  couple trillion on top of that of what we call new issuances.\n\nWe are going to take in higher tax receipts because the economy is  doing well, but it all gets consumed by the higher…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…that they created while they cite and talk about the One Big Beautiful  Bill Act. If you look at our scorekeeper here in the House, Mr.  Speaker, they said it is going to add $4 trillion to the deficit by  giving people their money back, along with cutting waste, fraud, and  abuse that we did in this bill.\n\nThey are citing the same organization that the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]