[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…workforce that provides new hiring authorities for the State Department  in order to properly manage the additional assistance. And on  oversight, we have closed loopholes and added new transparency  requirements so that Congress can better track the use of funds and  ensure that they are being spent as intended.\n\nJust last week, Secretary Rubio committed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…American seafood  to kitchen tables around the world, supporting 1.7 million fishing  jobs, a quarter of a trillion dollars in seafood industry sales, and  $117 billion in value-added impacts.\n\nAnd the list goes on and on and on.\n\nA study by the American Meteorological Society found that every  dollar invested in the National Weather Service produces $73…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…responsible tax reform, Republicans followed the same old, tired  script. They pushed through a partisan law that benefitted the  wealthiest Americans and--you guessed it--added $2 trillion to the  national debt. And like the Bush tax cuts, it left us unprepared as a  country when we faced a generational public health crisis. The COVID-19  pandemic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to the Secretary of Defense asking to rename a vessel in her  honor and in September sponsored a separate amendment to this year's  National Defense Authorization Act.\n\nOur added legislation continues our effort to properly honor Rear  Admiral Duerk. I look forward to working with colleagues, on both sides  of the aisle, to ensure Rear Admiral Duerk's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697052/request-to-name-us-vessel-after-rear-admiral-duerk"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…vote, with maybe one  exception, costs money. The one that is free is a military ID.\n\nFor our military who are overseas or not able to get home to register  in person, it is an added burden. For rural communities, it is an added  burden. For people of color, it is an added burden. For the 21 million  American citizens who don't have ready access to these…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699947/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…children.\n\nI want to remind all of them--speaking to you, Mr. Speaker--that tax  cuts are expenditures. They are the biggest spending in this bill, to  the tune of $5 trillion added to the national debt to give tax cuts to  the wealthiest people in the country at the expense of feeding our  children, healthcare for our people, and the education of our…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693157/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…already have so many. You could destroy the world 50 times over, 100  times over. And here we are building new nuclear weapons, and they're  building nuclear weapons.''\n\nHe added: ``We're all spending a lot of money that we could be  spending on other things that are actually, hopefully much more  productive.''\n\nOn this point, Mr. Speaker, President…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…citizen right here on our homeland, was deported  without giving her due process. Her lawyer was in the waiting room.  They would not let her have access to the lawyer. Then they added  insult to injury by saying she signed a waiver.\n\nWho and what mother would not say, when asked: Do you want your  children to go with you versus being with some strangers…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…right. Jesuit  principal Father C.J. Stallworth, who had served on the LHSAA executive  committee for seven years, said he would do what he could to assist St.  Augustine, but added it would be helpful to him to have Sister Madalena  of Xavier Prep also apply for admission to bolster his request.\n\nFather Grant faced resistance from other Catholic schools,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…heard, so they performed  very loudly. I am not angry with them. They performed loudly. I wanted  to make sure that the President heard my statement, and I repeated  myself and added Medicare and Social Security.\n\nMy colleagues continued, and I continued.\n\nI was evicted, and I was later on censured, censured but not  silenced. Yes, I stand today where I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…people, and that  person right now is looking up with fear that their future has a cloud  over it.\n\nAnd those small businesses, they account for two out of every three  jobs added to our economy in the last 25 years. They are our engine of  growth.\n\nSo I have heard from small businesses all across Massachusetts, all  across our country, about how they…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…year, the FTC identified that large grocery store chains  exploited the product shortages due to the pandemic by raising prices  significantly more than needed to cover their added costs, and they  have continued to increase their profits.\n\nWhat is the Republicans' response to this cost-of-living crisis  driven by corporate consolidation and power?\n\nWhy,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of this fraudulent resolution they have thrown up at  the last minute here.\n\nMr. RASKIN. There is nothing in there except for a series of  qualifying weasel words which are added to give complete, unilateral,  and subjective discretion to the Attorney General to decide what should  be in and what should be out. It starts off by saying whereas--our…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693713/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…pursuits in terms of fiscal rectitude, they are borrowing an additional  $5 trillion to pay for a tax cut for the wealthiest amongst us.\n\nMr. Speaker, $5 trillion is being added to the debt. I call attention  to that because they are taking away health insurance for poor people.  Hospitals are going to suffer. Medicare is going to be cut. The child…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…while also providing easy access to quality-of-life amenities such as  their community garden, BBQ area, and many nearby food choices and  transportation options. The Ives has added 50 units of affordable  housing to Jefferson County since its opening in June 2024, and their  peers in the affordable housing industry recognized the community  development…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694724/recognizing-the-ives"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…paragraph (2)(E) of such section (15 U.S.C.       637(m)(2)(E)) for the purposes of calculating the goals       described in paragraph (4) of section 15(g) of the such Act       (as added by subsection (a) of this Act) until the       Administrator or such a national certifying entity make a       determination with respect to the certification of such…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the  open border policies of the Biden administration.\n\nOne accusation I find particularly ironic from our friends across the  aisle has been this idea that we have somehow added redtape to Medicaid  by requiring recipients to verify their eligibility for the program two  times a year.\n\nPeople come in and out of the Medicaid Program based on that means…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…decades, when you get paid overtime, you include all of your  compensation, including if you were getting assistance for care  expenses.\n\nNow, they have named their bill and added ``childcare'' to it, and  they say this is to increase the availability of childcare. What it  actually will do is that it is going to decrease people's overtime pay.  You…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…deceased.''.\n\n(b) Improving Coordination Regarding Individuals       Incorrectly Identified as Deceased.--Section 205(r)(7) of the       Social Security Act (42 U.S.C. 405(r)(7)), as added by       section 801(a)(4) of title VIII of division FF of the       Consolidated Appropriations Act, 2021 (Public Law 116-260),       is amended by striking ``and'' at the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…legislation, and I reserve the balance of my  time.\n\nMr. SMITH of New Jersey. Mr. Speaker, I thank my good friend for  yielding.\n\nMr. Speaker, Hyde amendment protections need to be added to this  bill. Taxpayer funds should not be forced to subsidize the killing of  an unborn child by dismemberment or by baby poison pills.\n\nThe Hyde amendment was not--I will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Bombs-Increment 1 (SDB-I)\n\nThe Republic of Korea has requested to buy an additional       six hundred twenty-four (624) GBU-39/B Small Diameter Bombs       (SDB-I) that will be added to a previously implemented case       whose value was under the congressional notification       threshold. The original Foreign Military Sales (FMS) case,       valued at…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697584/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…walking through all this, did you see the  job growth numbers today? They are actually pretty good. Did you see  the punch line in the job growth numbers?\n\nThe U.S. economy added approximately 140,000 jobs; the market added  181,000. It is absolutely terrific. A dominance of the new jobs that  were created are in healthcare. The majority of spending…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the least fortunate families on average $2,400. The middle class will  likely pay higher costs of about $3,000. Tariffs are a cost. Taxes are  a cost. If you tax a good, it is added on to the cost. This is what  happens. It happens whether inflation is the tax or whether the tax is  a tariff. It adds to the cost of goods, and it will be passed on to the…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the work that they  have done to identify spending restraint and savings. Education, they  found a bunch of savings. I can go through committee by committee. Last  night, we added a lot of fees to pay for border security and stuff in  the Judiciary Committee. There are other things we could do.\n\nThe math is still going to have to be math. We are going…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…living monument to  our railroading past.\n\nNamed a National Historic Mechanical Engineering Landmark in 1984,  designated Virginia's Official State Steam Locomotive in 2017, and  added to both the Virginia Landmarks Register and the National Register  of Historic Places in 2023 and 2024, the 611's legacy endures.\n\nMr. Speaker, as we mark this milestone, let…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…back.\n\nHere is the baseline. Remember, Mr. Speaker, why is this not $22  trillion? It is because they were using a 2034 number. We caught them  playing a game there. Then they added another $6.9 trillion on top of  that, and what do you get, Mr. Speaker?\n\nHere is what you get: Functionally when we all got elected this last  November, the United States…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…part of the terrorists' exercises and training at       these military sites, the terrorists carried out drills for       gunfire combat and the use of various weapons,'' it added.\n\nThe Israeli military said ``the storage of weapons and the       activities of the Hezbollah terrorist organization at these       sites constitute a blatant violation of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…cannot afford to fall behind because the price of inaction is just too  high.\n\nThe economy of space has also grown dramatically over the last few  years. In 2022 alone, it added $132 billion to the U.S. GDP. It is  projected that, by 2040, it will be over $1 trillion, creating 350,000  private-sector jobs across multiple fields, including launch  technicians,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…individual'', ``intimate visual       depiction'', and ``minor'' have the meaning given such terms       in section 223(h) of the Communications Act of 1934 (47       U.S.C. 223), as added by section 2.\n\n(3) Covered platform.--\n\n(A) In general.--The term ``covered platform'' means a       website, online service, online application, or mobile       application--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Consultation.--In carrying out subsection (a), the       Administrator shall consult with the parties described in       section 411(d)(5) of the FAA Reauthorization Act of 2024 (as       added by this Act).\n\n(c) Justification.--If the Administrator decides not to       implement any of the recommendations described in subsection       (a), the Administrator shall…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}]