[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…reimbursable and nonreimbursable agreements. Again, the effective  utilization of the taxpayer dollar of which we here in the United  States Congress are stewards of.\n\nIn addition, I will be providing direction on a merit review process  between the two agencies, reporting and compliance with research  security requirements in carrying out collaborative activities…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…contained in this bill.\n\nThis bill rejects President Trump and Secretary Noem's attempts to  eliminate FEMA, increasing funding for the agency by over $870 million,  in addition to providing more than $26 billion for the Disaster Relief  Fund. It increases funding for TSA by $149 million and provides a pay  raise for air traffic controllers and uniformed…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…is  sent to a taxpayer about certain proposed penalties. It also clarifies  that an IRS employee's immediate supervisor is a person to whom the  employee reports.\n\nIn addition to providing clarity, this bill also raises $117 million  over the next 10 years. This bill passed the Committee on Ways and  Means with overwhelming bipartisan support.\n\nMr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697250/fair-and-accountable-irs-reviews-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Mike Lastra has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691772/recognizing-mike-lastra"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Jason Chase has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690800/recognizing-jason-chase"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Ruth Gavish has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Kay Hoffland has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…that can  supply the State and beyond.\n\nEvery action must be taken to provide North Slope-produced gas to  Alaskans for their home heating and local industry needs. In addition  to providing gas to Alaska, the Alaska LNG pipeline will be able to  export 20 million tons of LNG yearly, reaching our Asian allies in 6  days with no strategic choke points. It…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Jennifer Mankotya has made to our community in  the aftermath of Hurricane Milton. In addition to providing countless  hours of direct support to neighbors and flood victims, she helped  coordinate the collection and distribution of emergency supplies, meals  and donated…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690691/recognizing-jennifer-mankotya"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Eric Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Ashley Porter has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690135/recognizing-ashley-porter"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…their needs. Its accredited  preschool prepares kids ages three through five for kindergarten.\n\nFor children who need extra assistance, there is the CDC+ program. In  addition to providing speech, occupational, and physical therapies, the  program offers audiology services and reading coaching.\n\nThe teachers, therapists, support staff, and leadership…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Travis Smith has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…today to recognize the outstanding  contributions that Pastor Kenny Buzzie of Life Style Church has made to  our community in the aftermath of Hurricane Milton. In addition to  providing countless hours of direct support to neighbors and flood  victims, he helped coordinate the collection and distribution of  emergency supplies, meals and donated services…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690644/recognizing-pastor-kenny-buzzie"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Ronnie Hutton has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Carol Noble has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Brody Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690146/recognizing-brody-verosic"}]