[{"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "13th would take home four of the nine Emmy  awards it was nominated for and go on to collect numerous additional  accolades.", "title": "Recognizing Ms. Ava Duvernay: Art As A Catalyst for Change", "date": "2025-10-17"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Knowing that there are hundreds of  additional fallen Jewish servicemembers who deserve the same  recognition as Private Moser and Private First Class Hanf makes this  bill all the more important.", "title": "Fallen Servicemembers Religious Heritage Restoration Act", "date": null}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "This amendment, which is based on the Airship Improvement Research  for Safety and Humanitarian Innovation Projects Act, or the AIRSHIPS  Act, would support the research into additional civilian cases for  airships, often referred to as ``blimps,'' that could contribute to  national defense; provide economic, sustainable, and clean air cargo  transportation; support disaster response efforts; and provide  humanitarian aid to people in areas of need.", "title": "My Amendments to H.R. 3838", "date": null}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Regardless, millions of women would face additional  burdensome steps to register to vote.", "title": "Veterans Accessibility Advisory Committee Act of 2025", "date": "2026-02-13"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Let's say you have  something that costs $40,000 coming into the country, a tariff of 10  percent, so that is going to give you an additional $4,000.", "title": "Protecting the American Dream", "date": "2025-04-10"}, {"senator": "Al Green", "party": "Democrat", "sentence": "I am going to file  additional Articles of Impeachment this month, and these articles will  relate to not only the President but also the Vice President.", "title": "And Still I Rise: Denouncing the President's Authoritar-Ianism and Recognizing the Impeachment Warriors", "date": "2025-06-10"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "One additional but important note is this bill comes to the floor as  we await the 6-month review mandated by Donald Trump's February 4  executive order directing the Secretary of State to determine in which  international organizations the U.S.", "title": "Aligning Sec Regulations for the World Bank's International Development Association Act", "date": "2025-07-21"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "This regime change and the nation building that  will come later is going to cost us additional billions of dollars.", "title": "Providing for Consideration of H.R. Breaking the Gridlock Act", "date": "2026-01-07"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Speaker, on Friday, our National Archivist, our  National Security Advisor, and our  USAID Administrator took some time off from his work in these full-time  positions to exercise his additional powers as Secretary of State of  the United States.", "title": "Mass State Department Layoffs", "date": "2025-07-15"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Centers for Disease Control and  Prevention, the World Health Organization, UNICEF, the Gates  Foundation, and the vaccine alliance, Gavi, with additional critical  funding from the U.S.", "title": "Recognizing the Scarsdale Forum", "date": "2026-01-21"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Ford, our  largest and newest aircraft carrier, is headed to the Caribbean,  bringing additional warships and thousands of sailors and marines.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "They can't find people to  try to prove their drugs and devices, and this has created additional  red tape and hurdles that made it very difficult.", "title": "Consequences of Doge", "date": "2025-06-05"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Keeping a carrier strike group on station  longer than planned will result in additional maintenance costs, as  well as unforeseen accidents, as we just saw with the USS Harry  Truman's high operational tempo while deployed in the Middle East.", "title": "Supporting of H. Con. Res. 61 and H. Con. Res. 64", "date": "2025-12-17"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "This administration has canceled large-scale transmission projects to  help bring the additional load we need onto the transmission system,  just to make the grid more resilient in America as we suffer through  these extreme weather events.", "title": "Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, I have no additional speakers.", "title": "Securing Semiconductor Supply Chains Act of 2025", "date": "2025-04-28"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "909) to temporarily provide additional deposits into the  Crime Victims Fund, as amended.", "title": "Crime Victims Fund Stabilization Act of 2025", "date": "2026-01-12"}, {"senator": "James Risch", "party": "Republican", "sentence": "Implementation of this proposed sale will not require the       assignment of any additional U.S.", "title": "Arms Sales Notification", "date": "2026-01-28"}, {"senator": "James Lankford", "party": "Republican", "sentence": "They need additional personnel as well.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-08"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "What is  more, our Nation is 50 percent net import reliant for an additional 29  critical minerals on the list.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "We came up  with a number 2 years ago of $9.1 trillion in additional healthcare  costs.", "title": "Dismantling California's Citizens Redistricting Commission", "date": "2025-07-23"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Then, there are an  additional six that are awaiting consideration and, I hope and expect,  passage in the Senate.", "title": "Big, Beautiful Bill", "date": "2025-05-07"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "If you basically add then a number of the  President's additional priorities but don't pay for them, don't try to  find a way, then you end up at $74 trillion of borrowing in  functionally 9 budget years, 10 years.", "title": "It's the Math", "date": "2025-04-07"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "(c) Additional Requirements.--The implementation plan       required by this section shall include the actions required       to carry out the requirements listed in paragraphs (1)       through (11) of subsection (b), an identification of the       office of the Administration responsible for implementation,       and the timelines for completion of each action.", "title": "Sba It Modernization Reporting Act", "date": "2025-12-01"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "I am thrilled to say that my bill extends the successful hospital at  home program for an additional 5 years.", "title": "Hospital Inpatient Services Modernization Act", "date": "2025-12-01"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "From providing additional funding for the construction of new State  extended care facilities to increasing funds for medical and prosthetic  research, and from reducing the backlog at the Board of Veterans'  Appeals to providing burial services and benefits for veterans in rural  areas lacking a VA national cemetery, my amendments will directly  improve the quality of life for veterans throughout Colorado and  America.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "(a) In General.--The additional preventive care services       and items for chronic conditions that may be treated as       preventive care for purposes of section 223(c)(2)(C) of the       Internal Revenue Code of 1986 as set forth in IRS Notice       2019-45 shall have the same force and effect as if included       in the enactment of this Act.", "title": "Chronic Disease Flexible Coverage Act", "date": "2025-03-04"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Additionally,  the rule provides each a motion to recommit.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-freezers''; Providing for Consideration of H.R. Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "The Biden administration decided to put these  additional regulations on tire manufacturers.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''", "date": "2025-03-05"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Today, even when an undersea cable  project has already received full authorization from a Federal or State  agency, it can still be forced through an additional duplicate  permitting process with the Office of National Marine Sanctuaries.", "title": "Undersea Cable Protection Act of 2025", "date": "2026-02-11"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Carrying on with additional training, he completed Duties of a  Motor Transport (MT) Officer and Embarkation Duties in 1958.", "title": "Recognizing Colonel John Battista Airola, Usmc, Retired, with A Congressional Veteran Commendation", "date": "2025-10-17"}]