[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…Trump imposed a 10-percent tariff on pretty much the whole world. In  other words, a 10-percent tax on anything coming into the country--10  percent.\n\nHe also imposed an additional--called reciprocal tariff--on April 2  as well. And those tariffs, for example, were an additional 20 percent  on the EU or an additional--we will just say--32 percent on…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…about today in the U.S. Senate because the scope of what  Republicans are talking about here is absolutely extraordinary.\n\nAnd I want to lay out for you, you know, a few additional facts and  numbers and ask you to respond to them as you wrap up your time talking  about this particular topic.\n\nBut let me just underscore what you have laid out very well.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that the President would add to the goods. Let's say you have  something that costs $40,000 coming into the country, a tariff of 10  percent, so that is going to give you an additional $4,000. This  additional $4,000 is collected at the point of entry, and the person  importing has to pay the tariff.\n\nThis is the Trump tariff tax at this point. When that…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…require several months, which would       extend District income tax filing deadlines into fall 2026.       The adjustments will also generate millions of dollars of       additional expenses that must be paid by the District's       General Fund resources.                                  Cash Flow\n\nInvalidation of the Tax Amendment Act may lead to District…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…yield 2 minutes to the gentleman from New  Jersey (Mr. Pallone), the distinguished ranking member of the Energy  and Commerce Committee.\n\nMr. CLYBURN. Mr. Chair, I have one additional speaker.\n\nMr. CLYBURN. Mr. Chair, I yield 1 minute to the gentlewoman from New  York (Ms. Gillen).\n\nMr. CLYBURN. Mr. Chair, may I inquire as to how much time I have  remaining.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…for a licensing decision to be made. This does not preordain an  outcome. The State Department can still either return such licenses for  adjustment or modification due to additional revisions or controls  determined necessary or reject the requested license outright.  Crucially, the bill also does not alter or undermine congressional  oversight over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694831/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Congress are pushing the Federal Law Enforcement  Officer Service Weapon Purchase Act, which would flood the gun market  with even more former service weapons without any additional  precautions, zero safe storage and zero background checks. In every  State, a police officer would be able to purchase an older gun from  their department at a discounted…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691172/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…educate every  student, no matter their background or ability.\n\nUnfortunately, the Trump administration has endangered these  resources by intentionally burying them behind additional layers of red  tape and bureaucracy.\n\nThere is a lot we could be doing to improve public education. To  prepare future students, they need a well-rounded education that…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the United States of America on the       Economic and Social Council of the United Nations, with the       rank of Ambassador, and to serve concurrently and without       additional compensation as an Alternate Representative of the       United States of America to the Sessions of the General       Assembly of the United Nations.\n\n38. Calendar Number…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in support of H.R. 5100, a simple bill to  extend the Small Business Innovation Research and Small Business  Technology Transfer programs for an additional year.\n\nOver the course of its 40-year history, the SBIR and STTR have been  among the Federal Government's most effective engines for driving  innovation. By channeling a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…housing in the Trump administration's economy, the Tribe is currently  facing a housing shortage, with over 180 families listed on the Tribe's  housing wait list. Without additional land, the Tribe is unable to  build the housing needed to provide these families with homes.\n\nThe Shingle Springs Band of Miwok Indians Land Transfer Act will  address this…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697669/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…costs of Operation Southern Spear are significant and will likely run  into billions of dollars. Keeping a carrier strike group on station  longer than planned will result in additional maintenance costs, as  well as unforeseen accidents, as we just saw with the USS Harry  Truman's high operational tempo while deployed in the Middle East. It  is unfortunate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…redesignate the Salem Maritime National Historic Site  in Salem, Massachusetts, as the Salem Maritime National Historical  Park, and it would require a study into including additional sites and  resources.\n\nThe Salem Maritime National Historic Site preserves more than 600  years of our history, documenting the development of international  maritime trade…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691014/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…get up to Canada. It is  who we are. We trade with them every single day. We do $10 billion of  trade with Canada. That is whom we do business with.\n\nAnd this 10 percent additional tariff, you know who it cascades down  onto? The small businesses of Massachusetts. Ordinary citizens, they  are going to be further crushed. That is whom we partner with.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…schools across the country are developing new tools and  curricula with students to help them learn these challenging topics.\n\nI will repeat again that this is without any additional cost. This is  with funds already appropriated.\n\nI will also repeat again that this is a bipartisan piece of  legislation that will provide our young people with the skills…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…fraudulent, failed system without reforms  is not a solution. Declining to offer consumers more choice and control  over their healthcare is not a solution. Handing insurers an additional  $80 billion of taxpayer money is not a solution.\n\nBoth sides agree that the costs of healthcare are too high. We knew  that years ago when these credits were created and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699099/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…consumer disputes, mailing and postage for overdraft notices,  third-party collection expenses, technology costs, and cost of  regulatory compliance.\n\nThe reality is that these additional costs make it increasingly  difficult for banks to continue offering overdraft protection. Many  will simply choose to stop providing the service altogether. Those who  will…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…will have bills in the future that will deal  with some of the other issues. We will find that when we do this, we  probably have solved some problems, and we will discover additional  problems. Sometimes when you get an answer to a question, it raises  more questions. That is what this bill is supposed to do. It is  supposed to start us down the path.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 909) to temporarily provide additional deposits into the  Crime Victims Fund, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 909…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Chair, I yield myself such time as I may  consume.\n\nI actually made a board for what the gentleman's point was, showing,  within this reconciliation budget document, how much additional tax  cuts are there for C corporations. There is your board. I am being a  little sarcastic, but that is sort of a personality trait.\n\nThe fact of the matter is, once again,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Conference in the House and, I believe, every Republican  Member in the Senate, as well, to extend those tax cuts, drive an  economy that is working for Americans, and drive additional growth in  the economy.\n\nThat is what came out of the House, and so I was very disappointed to  see very different instructions to the Senate that I think are not  serious.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689909/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…title VI of the Research and Development, Competition, and       Innovation Act (Public Law 117-167; 42 U.S.C. 19231 et seq.).       SEC. 3. COMPLIANCE WITH CUTGO.\n\nNo additional amounts are authorized to be appropriated to       carry out this Act or the amendments made by this Act.\n\nMr. Speaker, I rise today in support of H.R. 788, the DOE and SBA…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…milk purchased from other local farms in a tanker  truck.\n\nIn 1986, Reid Ritchey oversaw an expansion of the facility, which  accommodated a new ice cream production room, additional freezer space,  and new offices. Now, as the fourth generation of Ritchey's takes over,  Reid's son, Andrew, has continued to expand the operation.\n\nOn behalf of everyone…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President  signed into law the Big Beautiful Bill to deliver permanent tax relief  to the American people to make our country safer, stronger, and more  prosperous.\n\nWe have additional bills coming down the pike. The Armed Services  Committee under Chairman Wicker recently reported the National Defense  Authorization Act of fiscal year 2026, and the Appropriations…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…on  promises to reduce costs for American families.\n\nLet's just review some of the wins in the Working Families Tax Cut  Act because taxpayers are expected to take home an additional $91  billion in refunds and keep an additional $30 billion in their  paychecks from reduced withholdings.\n\nTaxpayers are set to continue to receive support in tax years to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…settlement signed earlier this year.\n\nThe settlement would return approximately 3,500 acres of land to  reservation status and would allow the Tribe to acquire up to 14,000  additional acres from willing sellers. Additional provisions in the  settlement include waived tuition and mandatory fees for Akwesasne  Mohawk students attending State University of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…and  they chose not to.\n\nI am simply standing and saying that I believe that today this bill  needs to be passed because Washington, D.C., and the sitting courts do  need additional judges. They need competent people who would be  prepared to move forward.\n\nIf there is one President who would nominate and get this done, it  would be Donald Trump. Donald…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Council, Department of the       Treasury, and other relevant financial regulators in relation       to the failure of the insured depository institution; and\n\n``(hh) any additional relevant entities or activities that       may have contributed to the failure of the insured depository       institution, including with respect to auditing, accounting,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and FBCB2 BFT computer to       secure beyond line-of-sight communication.\n\nThe Sensitivity of Technology statement contained in the       original notification applies to additional items mentioned.\n\nThe highest level of information that may be transferred in       support of this proposed sale is classified SECRET.\n\n(vii) Date Report Delivered to Congress:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…which the Department of       Housing and Urban Development has resources sufficient to       carry out its statutory mission; and\n\n(6) ongoing activities regarding any such additional work,       as appropriate.\n\nMr. Speaker, I rise in support of H.R. 225, the HUD Transparency Act.\n\nI thank the gentlewoman from Texas, Congresswoman De La Cruz, for  sponsoring…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}]