[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…to  save health insurance for millions of Americans.\n\nIn my State of New York alone, more than 140,000 people relied on the  tax credits. These credits also supported an additional 1.7 million New  Yorkers who would probably otherwise not be able to afford health  insurance.\n\nOne constituent of mine who lives in public housing and holds a good  job…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Secretary Hegseth and the President are breaking the law.\n\nOn September 2, the U.S. military carried out its first strike,  killing 11 individuals on an alleged drug boat. Additional strikes  continued throughout the fall and winter, and to date, the U.S.  military has conducted 35 known strikes, killing at least 120 people.\n\nPresident Trump tries to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…businesses. Yet President Trump's  tariffs on steel are only serving to complicate an already fragile  supply chain that is already complicated by long lead times.\n\nThese additional costs from tariffs could also be passed on to  consumers, which is especially concerning at a time when electricity  prices are up 13 percent across the country. While I…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…our       hospital system, and, of course, our impacted colleagues and       their families.\n\nIn addition to the impact on the healthcare labor force,       there are many additional health impacts that are expected to       come because of TPS termination for Haitians. Many Haitian       TPS-holders express a fear for their lives if they were to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…benefits me personally but because conscience says  we cannot allow these injustices to go unpunished. I am driven by  conscience to say that I won't be supporting sending any additional  dollars to Israel, having already sent and voted for more than $50  billion.\n\nNobody can accuse me of not being supportive of Israel. I have  supported it, but I can't support…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…immigrants are equally at risk under the Trump administration's  cruelty-first policies.\n\nA half million Cuban immigrants are currently in the United States  under parole. An additional 110,000 Cubans entered the U.S. legally  under the CHNV humanitarian parole program, but the Trump  administration eliminated CHNV. Most Cubans are not eligible to adjust…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…protracted litigation, and helping to resolve disputes sooner rather  than later.\n\nThis bill also expands the role of special trial court judges,  allowing them to hear additional cases and act when there are issues  such as contempt, thereby helping to clear backlogs and improving the  court's overall input.\n\nIt holds Tax Court judges and special…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…defining moment for the  country but also for this body. I understand that it may take a few  moments for our Republican colleagues to watch the full video, to  gather some additional facts, to come to a conclusion. But we need our  Republican colleagues to be on the floor right now with us because this  is not simply an assault on Senator Padilla. This…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692557/alex-padilla"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…thousands of dollars in higher prices as       a result of these increased taxes. Small businesses,       manufacturers, and ranchers are struggling with higher costs,       with additional economic pain likely coming in months.\n\nThe Chamber--\n\nMeaning the U.S. Chamber.       has long supported legislative proposals to reassert       congressional prerogatives…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…for a detective dedicated to  investigating and solving unsolved violent crimes and to stop  narcotics trafficking in their community.\n\nThe police department said that the additional detective would build  trust with community members, increase patrols in hot spot areas,  enhance crime prevention, and sustain a reduction in violent crime in  narcotics-related…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…average tax change as a share of  income if the Trump tariffs are implemented, it is essentially on the  poorest 20 percent of the American population, the equivalent to an  additional 6.2 percent sales tax. For the next wealthiest quintile up,  it is a 5.5-percent increase on the sales tax. For the next, it is 5.0,  all the way up to the richest 1 percent…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…been so  gleeful is really a ``back door'' to privatize Social Security, a step  that will undermine the program that so many Americans are counting on.\n\nThis bill offers no additional protection to them or to the taxpayer.  What it does do is continue the myth that Social Security is  fraudulent, that it is not delivering the benefits that Americans have…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…this doesn't make  sense.\n\nNow the situation grows more dangerous. The USS Gerald R. Ford, our  largest and newest aircraft carrier, is headed to the Caribbean,  bringing additional warships and thousands of sailors and marines. This  is not a limited operation; this is a major military buildup. To what  end? The administration will not say. Against…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…get up to Canada. It is  who we are. We trade with them every single day. We do $10 billion of  trade with Canada. That is whom we do business with.\n\nAnd this 10 percent additional tariff, you know who it cascades down  onto? The small businesses of Massachusetts. Ordinary citizens, they  are going to be further crushed. That is whom we partner with.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…billions of dollars in transmission upgrades.\n\nFor example, in PJM, $4.3 billion in transmission costs associated  with data center growth were passed to ratepayers. An additional $7.3  billion in increased generation costs were recorded.\n\nWithout guardrails, households and small businesses are subsidizing  infrastructure where trillion-dollar companies…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…process, projects would simply be required to receive a  certificate of crossing from the relevant agency for the border- crossing segment.\n\nNothing in this legislation alters additional permitting requirements  of other statutes, like the National Environmental Policy Act or Clean  Water Act.\n\nIt is past time for Congress to assert its authority and establish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Ocean       Rail and Truck Jobs Act or the TRANSPORT Jobs Act. The       legislation was primarily referred to the Committee on       Transportation and Infrastructure, with additional referrals       to the Committee on Armed Services and the Committee on       Veterans' Affairs.\n\nThank you for agreeing to waive consideration of the bill       at the Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…spending  surged over 200 percent from $71 billion in 2019 to $268 billion last  year.\n\nAt the same time, the Biden administration's love of excessive  regulations imposed an additional 4.2 million hours of paperwork  burdens on schools pulling teachers and administrators away from what  matters most--the students.\n\nPresident Reagan said back in 1982, and…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "John Carter", "party": "Republican", "sentence": "…gentlewoman  from Colorado (Ms. Boebert).\n\nMr. CARTER of Texas. Mr. Chairman. I yield back the balance of my  time.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I do not have any additional  speakers, and I also yield back the balance of my time.\n\nMr. CARTER of Texas. Mr. Chairman, pursuant to House Resolution 530,  I offer amendments en bloc as the designee…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…top 100: Seaside Golf Course on  Sea Island Resort ranked No. 24, The Keep at McLemore Resort came in at  No. 25, and Great Waters at Reynolds Lake Oconee tied for No. 73.  Additional courses at Reynolds Lake Oconee, McLemore, and St. Simons  Island also earned national recognition.\n\nGeorgia is home to hundreds of golf courses, but our resort golf  courses…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…what has been called the largest  expansion ever of affordable housing tax credits. Our reforms to the  low-income housing tax credit are predicted to create 1.2 million  additional affordable housing units over the next decade, helping  millions more Americans access the high-quality affordable housing they  deserve. We have also passed legislation…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…that--\n\n``(i) includes the measures described in paragraph (2); and\n\n``(ii) assigns a score to each Federal agency evaluated.''.       SEC. 3. COMPLIANCE WITH CUTGO.\n\nNo additional amounts are authorized to be appropriated to       carry out this Act or the amendments made by this Act.\n\nMr. Speaker, I rise in full support of H.R. 818, the SPUR Act,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687942/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Sec. 1. Short title; etc. Sec. 2. Authorization of subpoenas before hearings to facilitate                settlements. Sec. 3. Authorization of special trial judges to hear additional cases                and address contempt. Sec. 4. Disqualification of judges and special trial judges. Sec. 5. Clarification of Tax Court jurisdiction to apply equitable…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…parties.\\22\\\n\nInterior did not submit a CRA report to Congress or the       Comptroller General on the North Dakota RMP.\\23\\ In its       response to us, Interior provided additional       information about the North Dakota RMP but did not       state a position as to whether it is a rule under CRA.\\24\\                                  DISCUSSION\n\nTo…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…multitrillion-dollar tax increase, we  made these tax provisions permanent, preventing future Congresses from  allowing that tax increase to take effect. We also provided additional  benefits to working parents by making sure that their child tax credit  wasn't cut in half.\n\nAnd, of course, the President promised no tax on tips and no tax on  overtime…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Borough,  the Inupiat Community of the Arctic Slope, the State of Alaska, and  relevant Federal Agencies. The Record of Decision selected an  alternative that made available an additional 6.8 million acres, for a  total of 18.6 million acres or 82 percent of the NPR-A's subsurface  estate, available for oil and gas leasing while ensuring lands were  made available…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…emerging growth company''       and inserting ``an issuer or any person authorized to act on       behalf of an issuer''; and\n\n(3) by adding at the end the following:\n\n``(2) Additional requirements.--\n\n``(A) In general.--The Commission may promulgate       regulations, subject to public notice and comment, to impose       such other terms, conditions, or…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…thanks to give to our selfless firefighters and  first responders in times of natural disaster. We should help them  fight these fires by passing legislation to give them additional tools.\n\nThe aerospace industry does so much for our country, from assisting  in national defense to helping in natural disasters to improving the  way we travel. As we continue…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…States has a  unified position to cement our leadership in 6G, which is so critical.\n\nThis legislation has strong bipartisan support.\n\nMr. BILIRAKIS.  Mr. Speaker, I have no additional speakers, and I  reserve the balance of my time.\n\nI commend Representative Allen, the vice chair of the Communications  and Technology Subcommittee; Representative Matsui,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass the  bill (H.R. 1045) to amend the Southwest Forest Health and Wildfire  Prevention Act of 2004 to require the establishment of an additional  Institute under that Act.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1045\n\nBe it enacted by the Senate…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}]