[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…had accompanied  them to a health appointment in the community, to step out of the room  while he received sensitive medical information. The officer refused.\n\nThis administration's reckless dehumanization of our immigrant  neighbors is horrific, and it is not just immigrants who they are  terrorizing. Tribal members in my district and across the country…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699659/horrific-ice-abuses"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…devastating then, and it  would be devastating now. Unsurprisingly, consumer sentiment is down  substantially.\n\nMuch of this economic weakness is the result of the Trump  administration's reckless, indiscriminate, and nonstrategic tariffs,  which are expected to raise costs for Americans trying to make ends  meet.\n\nTo take one example, The Washington Post reported…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…immigrant communities that are a huge reason why our city,  our State, and our country are great.\n\nFamilies across Los Angeles are living in fear because of this  administration's reckless and chaotic actions that are instilling more  fear, causing more chaos, and inflicting more harm among our most  vulnerable.\n\nThe families and individuals I have…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692962/republicans-are-putting-forward-a-resolution-that-targets-los-angeles"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…seem to understand that.\n\nYou have functioned from the very beginning of your so-called  majority, Mr. Speaker, not as a check and balance on an out-of-control  administration, but as a reckless rubber stamp for Donald Trump's  extreme agenda, and you are failing the American people.\n\nYou failed to keep your core promise. Your core promise to the  American…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…their  community.\n\nAs a Minnesotan, I am heartbroken for my State. Minnesotans have  suffered immeasurable loss following the tragedies of recent months.\n\nThe Trump administration's reckless actions and deliberate inaction  from Republicans in Congress jeopardize the operation and availability  of facilities that are the first site of care in the most…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Institutions Fund  that was dedicated to helping rural and struggling communities.\n\nInstead of debating this useless resolution, we should be working to  reverse the Trump administration's reckless economic policies that are  hurting the American people.\n\nDoes anyone want to know why Republicans are so scared of the mayor  of New York? It is because he wants…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Ms. ROSEN. Mr. President, in response to the Trump administration's  reckless decision to rescind Nevada's approval to receive its share of  Broadband, Equity, Access, and Deployment Program funding, I hereby  announce that I intend to object…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692204/nominations-objections"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…administration's so-called record to bring jobs and help grow  manufacturing in our region.\n\nThis came as quite a surprise to me. Indeed, his words were empty  because his administration's reckless tariffs and disastrous trade wars  have increased manufacturing job losses not just in our region of Ohio  but across our Nation.\n\nThe Wall Street Journal documents…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…the FY26 NDAA is strong in many ways, it also falls  short in some crucial areas. Above all, it falls short in its lack of  meaningful policy to rein in the Trump administration's reckless and  illegal actions.\n\nOut of fealty to their dear leader, Republicans have refused at every  turn to perform meaningful oversight of this administration, to push…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…while destroying the Department's efforts to build a  more inclusive, effective, and modern military.\n\nMoreover, the bill weakens the department by continuing the  administration's reckless and indiscriminate cuts to vital civilian  personnel and yielding to DOGE and Elon Musk.\n\nIn further conceding Congress' prerogative over funding the  Department…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise today to denounce the Trump  administration's reckless and illegal escalation in the Caribbean.\n\nMore than a week after the attack, we have not gotten any clarity  whatsoever on the legal authority they relied on to conduct…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695306/venezuela-ftos-and-war-powers"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "Ms. SCHRIER. Mr. Speaker, I rise to express my frustration and  outrage with the Trump administration's reckless cuts to our Forest  Service.\n\nThe workforce that takes care of our forests, harvests timber, and  makes them resilient to wildfires is treasured in my State of  Washington…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…thank Representative Kaptur for  yielding time.\n\nAcross the central and south coast of Oregon, where I represent, we  have seen the real consequences of the Trump administration's reckless  tariff policies. These aren't just bad economic choices. They have  created ripple effects that hurt working families up and down the  supply chains.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695603/devastating-harm-caused-by-trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and does nothing of substance to support and secure America's  electric supply chain.\n\nThe Electric Supply Chain Act must be examined in the broader context  of this administration's reckless workforce reductions and funding cuts  at the Department of Energy and surging electric prices across the  Nation. Already, as a result of DOGE buyouts or early retirements,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…families of northern Ohio, from Toledo Jeep  to our numerous parts suppliers and union shops across the Great Lakes  in both the United States and Canada. The Trump administration's  reckless and arbitrary tariff policy is putting their jobs and  livelihoods at risk.\n\nThese billboards just started to go up in our region. Trump's tariffs  are a tax. They…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…title of the joint resolution.\n\nMr. WESTERMAN.  Res. 140.\n\nMr. Speaker, I rise in support of this Congressional Review Act  resolution, which would overturn the Biden administration's reckless  withdrawal of more than 225,000 acres in the Superior National Forest  from mineral exploration and development.\n\nMr. Speaker, at issue is the Duluth Complex in…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…the need to provide law enforcement with the tools  necessary to stop the deadly flow of fentanyl. That is why 77 million  Americans voted to end the Biden-Harris administration's reckless  handling of the border and their disregard for the rule of law.\n\nToday's measures crack down on fentanyl, safeguard our elections, and  back the blue. It is about…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, the Biden administration's reckless  spending caused rampant inflation, burdening workers, families,  farmers, and small businesses, unless you believe the spin that  continues tonight. I don't think…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693709/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]