[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…being used to undermine our Federal  elections, because our fundamental democracy is at stake.\n\nIn Rochester Hills, MI, Republican clerk Tina Barton worked hard to  help administer and uphold a free and fair election in 2020. But for  her dedication and hard work and professionalism, 1 week after the 2020  election, Tina received an anonymous phone…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…appropriated by Congress, Republicans have given Trump the power of the  purse. But the power of the purse is Congress' power. It is our job. It  is what we were sent to administer for the people. They have abandoned  a critical check and balance.\n\nRepublicans have become the enablers of Trump's authoritarian power  grab, and you don't have to look…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…according to the Courts, provided contingency funds at a       level it has deemed sufficient, USDA would ignore those       provisions while also threatening its ability to administer       Child Nutrition Programs if it were to repurpose funds       Congress explicitly intended be used only for Child Nutrition       Programs. A much smaller transfer for…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…neither issue directives       requiring the States to address particular problems, nor       command the States' officers, or those of their political       subdivisions, to administer or enforce a federal regulatory       program . . . such commands are fundamentally incompatible       with our constitutional system of dual sovereignty.\n\nThat sure doesn't…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…system has several procedures in       place to protect against fraud, McDougal said. Her       organization and Child Development Associates are the two       nonprofits that administer subsidies to providers in San       Diego County.\n\nThe nonprofits check providers' enrollment with their       licensed capacity, review thousands of monthly attendance…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…off care for  millions, it will raise the healthcare premiums of every American, not  just the ones on Medicaid. Health costs will go up.\n\nIf you fire half the people who administer Social Security and  undermine it for our seniors, costs will go up. If you continue the  brain drain in our government and fire Federal workers who protect  consumers or…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688637/the-actions-of-this-administration-will-actually-raise-costs-for-every-american"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…K-12 students. The  provisions of this bill will have to be administered not by those five  school systems, but every school district--15,000 school districts-- will have to administer the provisions of this bill.\n\nAs written, the bill would create significant administrative burdens  to our schools and chill community investment in our children. For  example,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…benefit.\n\nThe Trump administration and their approach threatens the Social  Security Administration's ability to operate. They have already cut  over 7,000 jobs of employees who administer this program to millions of  Americans from coast to coast.\n\nIn my district alone, there was an 11 percent decrease in Social  Security field office workers. That means appointments…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…exercise its discretion, among other things. The Policy       Notice here implements the requirements of the BEAD Program       outlined in IIJA by describing how NTIA will administer the       program going forward and outlining the criteria Eligible       Entities and subgrantees seeking funding under the program       must meet. Furthermore, the Policy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…with disabilities access to a free and appropriate  public education, often through individualized education programs, or  IEPs.\n\nThose with the expertise and data to best administer the program are  already at the Department of Education, or at least they were until  Secretary McMahon fired them.\n\nA special education teacher in Beaverton, Oregon, recently…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…shutdowns in the past, including in President Donald Trump's first  term. And even under President Trump's second term, he tapped a billion  of the $6 billion to pay for staff to administer SNAP. They did it.\n\nNow they want to take down policy from a website that says that they  can justify doing this, showing the law. That is the nonsense. That is  the garbage…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…ICE if they report to the courthouse, they will never show up for their  State court proceedings. Mr. Speaker, it is impugning the ability of  the courts of the States to administer justice according to State law.\n\nJudge Dugan allegedly ushered the migrant out a side door. A week  later, FBI agents show up at her courthouse. When she pulls up to the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Security  regarding a decision they made to abruptly cut funding for the  Citizenship and Assimilation Grant Program.\n\nThe Immigration and Nationality Act established USCIS to administer  immigration benefits and citizenship programs. USCIS oversees lawful  immigration into the United States and provides services, including  determining eligibility for citizenship,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…possible without all of you.\n\nAnd now the hard work of implementation and oversight begins. We can  appropriate as much money as we want,  but we need experienced people to administer these funds. So, to that  end, while rejecting the administration's request to close USAID as an  independent Agency, this bill sustains investments in our diplomatic  workforce…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…and special training  considerations for providers.\n\nWe introduced this amendment because we need to be ready and be  proactive to make sure that when the VA is ready to administer these  therapies they actually can.\n\nWhile MDMA-assisted therapy did not receive FDA approval last summer,  approval of certain psychedelic therapies will likely come very…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692952/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…intended to have the force and effect of law, establish agency policies  of statutory, regulatory, or technical issues. Because such guidance  communicates how an agency will administer their law and its programs,  it has a significant effect on regulated entities.\n\nRegulated entities in the public should know what agency guidance  says about the laws and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of exiled Uyghurs;\n\n(5) consult with the United States Congress on policies       relevant to the XUAR and the Uyghurs;\n\n(6) coordinate with relevant Federal agencies to administer       aid to Uyghur rights advocates;\n\n(7) make efforts to establish contacts with foreign       ministries of other countries, especially in Europe, Central       Asia,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Dakota RMP as issue here. The North       Dakota RMP implements FLPMA and prescribes policy by       designating or foreclosing specific activities or land use on       BLM-administer land. As such, the North Dakota RMP meets the       third element of APA's definition of a rule. Having satisfied       all the required elements, the North Dakota RMP meets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…submitted to Congress as  required by the statute.\n\nThe issue in 2008 was an action by the Centers for Medicare and  Medicaid Services directing States on how they were to administer the  Children's Health Insurance Program. CMS did not submit its action to  Congress, calling it guidance rather than a rule. Senator Rockefeller  asked GAO to determine…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…after the date on which the report is submitted under       subsection (b), the Secretary of Agriculture, and any other       Federal official, may not finalize, implement, administer, or       enforce the proposed rule entitled ``Importation of Sheep,       Goats, and Certain Other Ruminants'' (81 Fed. Reg. 46619) and       dated July 18, 2016.\n\n(b) Study…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…judge, the       clerk or the clerk's deputies, as such, or any other employee       of the Tax Court designated in writing for the purpose by the       chief judge, may administer oaths or affirmations.\n\n``(2) Subpoena authority.--Any judge or special trial judge       may examine witnesses and require, by subpoena ordered by the       Tax Court or…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Dakota RMP as issue here. The North       Dakota RMP implements FLPMA and prescribes policy by       designating or foreclosing specific activities or land use on       BLM-administer land. As such, the North Dakota RMP meets the       third element of APA's definition of a rule. Having satisfied       all the required elements, the North Dakota RMP meets…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…for Patients and Communities Reauthorization Act  of 2025, we are reauthorizing prevention programs and recovery services  and ensuring that first responders can access and administer Naloxone.  We are ultimately restoring hope and healing by putting a stop to drug  overdose and poisoning.\n\nMr. Chair, I thank Chairman Guthrie for his work on this important…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691872/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…14, United       States Code, redesignated as section 102, and amended to read       as follows:       ``Sec. 102. Primary duties\n\n``(a) In General.--The Coast Guard shall administer laws,       promulgate and enforce regulations, and engage in operations       and activities, with due regard to the requirements of       national defense, in support of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…amounts       under this section is a State, insular area, metropolitan       city, or urban county, such eligible entity shall use such       amounts to--\n\n(A) implement and administer housing strategies and housing       plans;\n\n(B) implement and administer any plans to increase housing       choice, address disparities in housing needs, and provide…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…with the highest hydrocarbon potential, with  lease offerings of not fewer than 400,000 acres.\n\nCongress left little discretion to DOI. DOI's role was only to  establish and administer a competitive program and incorporate TCJA  requirements to instill success and economic feasibility, including  granting any easements or rights-of-way across the Coastal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…support our  fellow Americans struggling with the deadly cycle of addiction by  passing the SUPPORT Act. This legislation will ensure our brave first  responders can access and administer Narcan to save the lives of those  suffering from an overdose, as well as to continue the resources for  comprehensive opioid recovery centers to further support recovery.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…decision the Federal Government makes in managing those       lands.\n\nUnlike the Lower 48 model of indigenous representation       where tribal governments typically administer the delivery of       services such as healthcare, public safety, education, land       management, and economic development, the passage of ANCSA       created a shared…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "French Hill", "party": "Republican", "sentence": "…expire five years after OFAC begins issuing       those licenses.\n\nBased on information from OFAC, CBO expects the office       would need five employees to implement and administer the       pilot program starting in fiscal year 2026. CBO estimates the       compensation and operating expenses for those employees and       the cost of the reporting…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…intergovernmental mandate? No.\n\nContains private-sector mandate? Yes, Under Threshold.\n\nH.R. 1469 would require the Securities and Exchange       Commission (SEC) to establish and administer a task force to       identify challenges faced by senior investors, coordinate       commission activities with respect to senior investors, and       consult with state…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}]