[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…was treated with more humanity       than we have ever experienced from our own government.\n\nYou now have the chance to be on the right side of history.       Unlike past administrations, you are uniquely positioned to       tell us that our voices matter and that we have finally been       heard. Some of us live in your districts. We look to you to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…responsible for recovering more than $37 billion during his  tenure at the Veterans' Administration. He was the inspector general at  the VA under both Republican and Democratic administrations, widely  respected by both sides of the aisle. Republican colleagues have worked  with him, I have, and so have my colleagues on this side of the aisle.  He was performing…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…connections reached into the highest halls of power.\n\nWhat makes this scandal unbearable is not just Epstein's evil but the  way institutions, Republican and Democratic administrations alike,  looked away. No administration, past or present, has fully stepped up  to bring the truth to light. The very agencies charged with protecting  the vulnerable,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…saving that company money.\n\nThis is not new. The Bureau of Ocean Energy Management has had  guidelines on marine archeology since 1982, and since have been updated  during administrations from both parties to create greater consistency  and predictability for everyone involved.\n\nThese rules have stood for 40 years because they protect artifacts  and protect…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…appropriations cycles, Budget chairs have directed CBO to score  appropriations language related to the Purchase Power and Wheeling  activities of three Federal Power Marketing Administrations consistent  with a 2000 bipartisan scorekeeping agreement that CBO had recently  deviated from.\n\nBy far the most common use of section 312 authority over the past  decade…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…If we go down this road, we will politicize the very foundation of  how we steward America's public lands. We will silence communities,  ignore science, and block future administrations from protecting our  climate and our health.\n\nMr. Speaker, public lands belong to all of us. They are a shared  inheritance and our shared responsibility. I urge my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694910/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Indo-Pacific and meeting vital security and economic  challenges. It is imperative that we develop, maintain, and grow these  relationships.\n\nRecognizing this, successive administrations have committed to  deepening U.S. engagement in the region, including through trade and  investment. Most recently, the 2025 National Security Strategy asserts  that ``the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…species that call this amazing place home.\n\nI respect that there are a variety of views on how to manage our  Nation's public lands, but it won't be possible for future  administrations to incorporate feedback and comments on proposed  actions in the NPR-A if Congress approves the resolution before us  today.\n\nThe CRA, as we have said several times in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Border Protection to publicly report who is getting extra  screening and where that screening occurs in real time, which tips off  terrorists and other bad actors.\n\nUnder administrations of both parties, DHS has never regularly  published who it has considered a special interest alien. That is  because who is considered special interest changes regularly…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…U.S.-Taiwan ties, showcase our support for Taiwan, and  help counter Beijing's coercive influence around the world.\n\nU.S. policy toward Taiwan remains consistent across administrations  and guided by the Taiwan Relations Act. What has changed, though, is  Beijing's increasingly aggressive international campaign to exclude  Taiwan from the international…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…and 2014, FSOC designated four nonbank firms, but those designations  were later rescinded following legal challenges, corporate  restructuring, and policy shifts across administrations.\n\nSince its creation, Congress and administration officials have  debated whether FSOC should focus on mitigating the specific activities  that pose the greatest risk,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…witch hunt. Our civil servants are among the best  of what our Nation has to offer. They serve with no political  motivation. Many have served for years under Democratic administrations  and Republican administrations. They have one dedication: to their  fellow Americans. It is a patriotic calling that they have all  answered. They are not faceless villains.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…rely on for unfettered access to  information, educational programming for kids, cultural programming, as  well as nationwide emergency alerting. Spanning many different  Administrations, public media has received bipartisan support for the  past 50 years because Congress has continuously recognized that access  to public media is in the public's best…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…district in our country. He is using  the threat of cutting off Federal funding as a negative approach, very  much taking a tool right here to pressure the universities and  administrations to submit to his will in violation of freedom of speech  for their students.\n\nMr. Chair, instead of addressing any of these crises threatening our  students in our education…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…because, time and time again, insurers and major banks have pledged not  to finance development in the refuge. The two failed lease sales under  both the Trump and Biden administrations should have been the end to  all of this, and that is because we were supposed to raise $2 billion.  In fact, when the language was passed, they said, well, we will raise…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…courtroom.\n\nThe American people shouldn't be robbed of exercising their policy  preferences by judicial extremism, and it would apply evenly to future  Democratic and Republican administrations alike.\n\nThe policies being put forth by the Trump administration are novel,  creative, and bold. That is what the American people expected when they  voted for President…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…of  promises made, promises kept to make America safe again.\n\nAmerica wants peace through strength, and that is what President  Trump is committed to. For far too long, administrations in Washington,  D.C., have created red lines that were crossed without consequence,  agreed to deals with Iran that the regime disregarded, and concerned  themselves more…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…thrown into limbo by litigation stripping  Florida of its ability to run its program. The court's decision, which  is contrary to the position of both the Trump and Biden  administrations, has shifted permitting authority back to the Federal  Government, creating enormous disruptions to Florida's efforts to  protect wetlands and water resources and is now…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the disastrous Biden  administration's anti-American energy policies and keep the Powder  River Basin alive. Through the CRA, we will stop future anti-American  energy administrations from taking similar steps to shut down the  Powder River Basin.\n\nI thank my colleague from Wyoming for introducing this important CRA  resolution on behalf of the hardworking…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…in  plain English, you can't buy it, so you shouldn't be able to rent it  either.\n\nThe Remote Access Security Act fixes this problem by giving the  administration--all administrations--the authority and flexibility to  restrict China's cloud-based access to our most advanced AI  technologies.\n\nIn November 2025, I convened a subcommittee hearing on export…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…The bottom line is that Americans are safer today because of  President Trump's actions. Let's not return to the old, failed playbook  of treating our counterterrorist administrations solely as a law  enforcement matter. We tried that for decades, and it didn't work. It  cost hundreds of thousands of American lives.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…and injuring several more.\n\nSadly, incidents like this are becoming far too common, and we must  ask why. The answer lies in failed policies.\n\nUnder previous Democratic administrations, safety enforcement was  weakened, loopholes were opened, and fraudulent CDL issuance went  unchecked. Under the Obama administration, inspectors were directed to  issue…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…leadership to the evolving world of payment stablecoins.\n\nStablecoin legislation has been in the works for over 4 years and has  been called for by Democratic and Republican administrations. The  status quo fails to protect consumers from fraud. That is an untenable  situation in a market growing by the billions.\n\nFor too long, the United States has operated…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…for natural gas appliances. We know my colleagues  on the other side of the aisle have already tried to ban natural gas  stovetops.\n\nThis would allow future Democratic administrations to restart their  party's regulatory attack on our home appliances. I know that when the  government steps in to pick winners and losers there are manufacturers  of competing…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…to differ.\n\nThe Congressional Review Act provides the American people the  greatest possible say over the endless tide of regulations that always  stem from Democratic administrations, and it is one of the greatest  keepers of Congress' Article I authority. It is also upsetting in many  ways that the Democrats complain we are doing these individual…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…CBDC  and was willing to trade Americans' right to financial privacy for a  CCP-style surveillance tool.\n\nOur bill, the Anti-CBDC Surveillance State Act, prevents future  administrations from weaponizing this technology against the American  people while ensuring that any development of digital money reflects  our American values of privacy, individual…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…need to get back to the science, as Mr. LaMalfa stated, and it is  unfortunate that we have to do a CRA on an  endangered species listing, but that is what happens when  administrations make bad decisions.\n\nMr. Speaker, first, I acknowledge and agree with my friends from  across the aisle. Mark Twain was correct. The more I learn about water,  the further…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…when the power goes out. That is why it matters who is  at the table. When it comes to energy policy, this measure makes the  National Coal Council permanent, so future administrations can't simply  shut it down for political reasons.\n\nH.R. 3015 also reinforces President Trump's April 8, 2025, executive  order to reinvigorate America's clean coal industry…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the Chamber of Commerce, the  Business Roundtable, the National Association of Manufacturers, those  who have stood up in the past against Federal overreach by previous  administrations?\n\nExecutive branch Agencies and regulators of independent agencies post  that their reviews and approvals will depend on companies' conduct and  whether they align with…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…speak. I am so proud to rise today in support of my legislation,  H.R. 6945, the Supporting Pregnant and Parenting Women and Families  Act.\n\nFor too long, previous Democrat administrations have weaponized the  Department of Health and Human Services against pregnancy resource  centers by attempting to cut off their Temporary Assistance for Needy  Families,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}]