[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "The Trump administration needs to keep its word to deliver this food  aid."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"The Trump administration needs to tell the Saudis that there will be consequences if it happens again."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "The administration needs to step up."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "The administration needs to do what  it said it is going to do: restore funding for this aid."}, {"senator": "Robert Menendez", "party": "Democrat", "sentence": "The Trump Administration needs to redouble efforts to coordinate a truly international and strategic pressure campaign with our partners in Europe and the region."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "The Trump Administration needs to take action on #CDBG funds and stop holding states and local governments back from spending the federal funds we worked to ensure they receive.\"\n\n@SenatorBaldwin"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "The administration needs to pay the States what they are owed."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "\"This administration needs to understand that the reason that we care about civil rights and human rights all over the world is not simply because we are an altruistic nation; it is because protecting people's civil rights and human rights abroad is about protecting the security of this nation."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "The administration needs to take those  resources and produce results."}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "If the Trump administration needs new legal  authorities to conduct strikes on terrorist groups in the Middle East,  then they should seek new authorization from Congress."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "The administration needs to get a handle on this now."}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "This administration needs to answer for its unprecedented attack and  how it wiped out decades of progress for science, including decades of  progress for diversifying the STEM workforce."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "The Administration needs to proceed with great caution, consult with Congress, and be clear with the American people about its strategy.\""}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "This federal funding should be a major boost, but the Trump Administration needs to get the money out quickly."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "\"The Trump Administration needs to recognize that additional assistance is needed to help families, farmers, and fishermen survive."}, {"senator": "David Kustoff", "party": "Republican", "sentence": "As identity theft becomes more commonplace, the system at the Social  Security Administration needs to be streamlined to work better for the  victims."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "\"If you don't take part of the BDS movement, if you don't boycott Israel, we will come against you.' I think the administration needs to use our force, our voice, and our money to stop this.\"\n\nWhen asked about the threat of a nuclear Iran, Sen."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "The administration needs to reclaim that money and fire the bureaucrats who signed off on this scam.\""}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Now the administration needs more resources to finish the job."}]