[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, I rise today to call attention to a  robbery being planned by a felon.\n\nIn the first 6 months of this administration, Republicans have lost  the battle of ideas. Now set on making sure that they don't lose power,  they lie and cheat in order to steal the midterm elections.\n\nGovernor Abbott…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693660/redrawing-congressional-maps-an-attack-on-democracy"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…the U.S.\n\nIn truth, the Stop Illegal Entry Act is just another shiny object  that is supposed to divert attention from the Epstein files and the  failures of this administration. Republicans don't actually care about  reforming the immigration system. They have repeatedly rejected all  attempts to do so. They just want to campaign on telling horror stories…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Speaker, I thank the gentleman from New  Jersey for yielding the time.\n\nMr. Speaker, here we are 9 months into the Trump administration and  Republicans in Congress, despite their promises, have done nothing to  lower energy costs. In fact, costs keep going up, up, and up, and the  GOP policies are making it worse.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…split-second decisions to  monitor thousands of lives at once. The pressure is relentless, and the  margin for mistakes is zero.\n\nOn top of all of this stress, this administration and Republicans in  Congress are trying to gut their retirement security. Air traffic  controllers are mandated to retire at 56. Yet, this administration and  House Republicans…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…appropriately worried about their Social Security check because  Republicans have done nothing to complain about the executive cutting  the workers at the Social Security Administration. Republicans have  done nothing to complain about the closing of offices at Social  Security or done nothing about the idea that a person can no longer  call Social Security.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…This isn't the end of this healthcare crisis.  This is just one more step along the way to try to find some way to  overcome the terrible burden that the Trump administration and the  Republicans have placed on Americans as they go about trying to provide  healthcare coverage for themselves, for their families, and for their  communities.\n\nWe met that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…healthcare, that is a tax.\n\nRepublicans in Congress want to tax the healthcare of working people  all to just partially pay for tax cuts for the wealthy. This  administration and Republicans promised Americans three things last  year: lower costs, cutting red tape, and bringing down the deficit.\n\nLet's review what their budget will actually do: It raises…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…our democracy thrive. He has made it  worse for voters. He has fired Federal workers who combat election  misinformation and disinformation.\n\nWhy would he and his administration and Republicans in Congress who  support him want to make it easier for people to interfere with our  elections?\n\nI am at a loss. I am at a loss for an answer. What I do know is…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…touch with the needs  of the American people. Donald Trump held an extravagant Great Gatsby  party at Mar-a-Lago the night before SNAP benefits expired, while the  administration and Republicans continue to ignore the needs of working  families. That is not governing. They have abandoned their  responsibility to bring down costs and grow the economy.\n\nMr.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Republicans have refused to hold townhalls.  Many of them will not even answer the phone. At my townhall last week  in St. Petersburg, people wanted to know why the administration and  Republicans want to make it more difficult to receive Social Security  rather than strengthen Social Security.\n\nInstead of a wasteful, time-consuming, silly bill like this,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…not what the President and his  administration are delivering. Instead of working to lower healthcare  and energy costs for American families, the President, his  administration, and Republicans in Congress are choosing to drive those  costs through the roof.\n\nThey repeal energy tax credits making it harder and more expensive to  build and deliver energy…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…for me. This GRID Power Act is unnecessary. What  has been happening is that cleaner, cheaper sources of energy are  waiting to come onto the grid, and the Trump administration and  Republicans in Congress now are throwing up as many barriers as  possible because they are on the side of the polluters.\n\nYou can see, we had a coal bill. This is a gas bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…lower  electricity prices, which means American families will be able to turn  the heat on in the winter or the AC on during dangerous heat waves, but  the Trump administration and Republicans in Congress are doing  everything they can to stop clean energy that will help lower costs for  the American taxpayer.\n\nThey are rolling back programs that help…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…for it. Look at the  USDA's own guidance that they removed from their website that justifies  this.\n\nAny failure to do so right now falls squarely on the Trump  administration and Republicans. We could vote on this today, on this  bill or one that Senator Hawley has authored as well that has many  Republican colleagues that are cosponsors, to prevent…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…problems, working together in a bipartisan way, which is what I  believe we should do, but rather to try to score political points and  try to embarrass the Trump administration and Republicans.\n\nBut we have to finish that full year of funding because we do have  another short-term continuing resolution deadline that expires on  January 30. But I know…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…delivered legislation that will help  fulfill those promises. That starts with permanent tax relief for hard- working Americans.\n\nBack in 2017, during the first Trump administration, Republicans  passed the Tax Cuts and Jobs Act, legislation that cut Americans' tax  rates, doubled the child tax credit, and nearly doubled the standard  deduction. But without…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Fentanyl Act; and to repeal the Biden-era harmful  environmental regulations by passing what we call Congressional Review  Acts to undo the damage of the Biden administration.\n\nAs Republicans continue to work on behalf of the American people and  finalize the reconciliation products we are working on currently, we  are also here to recognize National…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…These hard-working Americans are the backbone of our economy  and a sign that the American dream is alive and working.\n\nSmall business is a big deal, and the Trump administration and  Republicans in Congress are working hard to deliver for American small  business owners. One of our top priorities this year is making the 2017  Tax Cuts and Jobs Act permanent.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}]