[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…was given to Congress,  to this legislative body. Let's use that power. Let's reassert our  authority. Let's say through this resolution that if the President or  the administration wants to go to war for the purpose of regime change  or any other purpose, that it must come to Congress and make the case  to us and to the American people.\n\nI urge an ``aye''…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…that appear masked and  without badges and proper identification. This bill represents an  attempt by House Republicans to enact retribution on places because  this administration wants to impose its view of law enforcement: deep  state authority not subject to judicial review.\n\nThe result of petty and punitive motives of this bill is that small  businesses…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to come here and get our  approval.\n\nThe people we represent did not send us here to be potted plants  while the White House sleepwalks us into another mess. If this  administration wants to escalate, make the case to the American people.  Get consent through their elected Representatives. Follow the  Constitution.\n\nLet me tell you what I think. I think…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…paying for aluminum cans that can't afford them,  furniture makers paying more for lumber, and family-owned tourism  businesses in my State suffering.\n\nIf the Trump administration wants to address trade disputes with  Canada--and the Prime Minister is clearly open to that--it should work  in good faith with our neighbors to strengthen the USMCA trade…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…most common crimes committed by people who have been detained  by ICE are being here without documentation and traffic offenses.\n\nNow, the President has said that his administration wants to remove  and deport people who commit crimes after they illegally enter the  country, but the gentleman's legislation moves in exactly the opposite  direction. If…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…people to be able to access their benefits, then they  say: Well, we can't trust the VA. Then they will move in the direction  of privatization, and that is where this administration wants to go.\n\nThis bill would worsen the quality of life for servicemembers and  their families while putting veterans' safety at risk.\n\nWhile our military faces massive recruitment…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Mr. President, I rise today in support of Senators  Schiff and Kaine's resolution regarding war powers.\n\nThis resolution would just say very simply that if the Trump  administration wants to be at war against a terrorist organization,  they should come to Congress, notify us, and seek our approval.\n\nCurrently, the administration is waging a secret war…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…stronger, smarter, and  healthier.\n\nThousands of scientists have been laid off. Grants approved by  Congress are being withheld. Whole labs are shutting down. Now, the  administration wants to slash funding for the NIH, the CDC, the  Department of Energy's labs, and the university partnerships that have  built the modern American economy.\n\nThey call this…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…told Time magazine that  if tariffs are at 20 percent or even 50 percent a year from now, that  would be a ``total victory.'' So, once again, no one can tell what his  administration wants or what the end game is.\n\nI believe it is hard to see how any foreign country right now would  make concessions to Donald Trump. That is because he has proven himself…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…bureaucrat. Keep it real. All the staff who help us do our jobs and  help our constituents are unelected bureaucrats, and the majority are  actually Republicans. The administration wants to cut the salaries that  allow folks to answer the phones for our constituents.\n\nCalifornia has the second highest number of Federal workers.\n\nWhy are the Republicans…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…on the brink of paying thousands  of dollars more on healthcare premiums? Donald Trump.\n\nSo, look, the matter here is simple: Donald Trump can blame the  previous administration all he wants for his own failures. He can keep  calling affordability a con job or a fake narrative or a Democratic  scam. He can keep pretending everything is going great.…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…has never met that  promise, never rising above 10 or 12 percent at best. Now, instead of  finally doing what we owe our children, our families, our communities,  this administration wants to walk away altogether.\n\nI am a proud product of our public schools. I am a proud parent of  public school students, and I believe deeply that an injury to one is…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698942/protecting-education-for-children-with-disabilities"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…rural communities, willing to help Americans as  they search for healthcare.\n\nOne place, though, that didn't get cut is ICE and Homeland Security  because this is an administration that wants his own personal militia  to go after folks who ask for the truth. These cuts also mean and  include cuts to Federal jobs. California is a State with the second…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…emotions  that just scratch the surface of what my community and our immigrant  neighbors are feeling. Why should we expect anything less? This is  exactly what this administration wants: to force immigrants into the  shadows, to break their spirit, and to disrupt our communities.\n\nWhen you come for immigrants, you come for small businesses. When you…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690510/trump-immigration-policies"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Black and Brown, as  disposable.\n\nThese workers feed America. They feed you every night. They do the  work most people can't and won't.\n\nInstead of protecting them, this administration wants to strip away  their voice and hand power to the very people who exploit them.\n\nOmar) to  discuss the tools available to OSHA to keep Americans safe at work.\n\nMrs. McIVER.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…blue States. Why? Because they have terrible  policies.\n\nThis bill is quite simple: It restores the definition that Congress  originally intended. If an administration, any future administration,  wants to change policy, rather than that coming from the bureaucrats,  it should come before Congress. Congress set the efficiency standards  in 1975, and if…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…ready munitions enterprise. The prohibitions on new program starts  under a CR effectively put high-priority service modernization efforts  literally on ice.\n\nThe administration says it wants ``flexible and efficient''  investments. Well, there is nothing flexible, efficient, resilient, or  lethal about running the national defense enterprise on a full-year…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}]