[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…attorney and often threatened with physical violence if they  don't confess.\n\nNearly half of the approximately 350 Palestinian children currently  detained by Israel are in administrative detention. Most have not been  formally charged or brought to trial. When they are charged in military  courts, they are overwhelmingly accused of throwing rocks. Rarely…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…through doors to conduct  arrests, isn't just violent and frightening, but it is  unconstitutional. Agents must obtain a judicial warrant signed by a  neutral judge, not an administrative warrant in-house, to enter private  property.\n\nYou have seen the videos--we have all seen them--where they are  trying to crash down doors by hitting them with axes. Those…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…government for their own political agendas.  The American people demand accountability. Forward movement as a nation  in these troubled times cannot happen while having these administrative  officials still in power, still in their jobs.\n\nThere are many other things we need to think through, but these are  three things that can happen right now by this administration…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…school systems, but every school district--15,000 school districts-- will have to administer the provisions of this bill.\n\nAs written, the bill would create significant administrative burdens  to our schools and chill community investment in our children. For  example, the bill would disqualify a school from receiving Federal  funds by simply accepting…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…have a  judicial warrant to arrest him. A judicial warrant is based on probable  cause, is signed by a judge, and has the force of law. What the ICE  agent had was only an administrative warrant. This type of warrant is  just simply a piece of paper that somebody types up, saying that this  person should be arrested. There is no probable cause, no nothing.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…million veterans nationwide, has been gravely weakened. Already in  Coatesville and Philadelphia, they were forced to rescind job offers to  physicians and to lay off administrative and clerical staff.\n\nThe Trump administration has jeopardized care, putting lives and  health at risk. Many of the brave men and women who serve in our Armed  Forces continue…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688623/fighting-for-our-veterans"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…litigation and  suddenly having nearly $20 billion back and, for this reason, pushed to  repeal the language. But the fact of the matter is, section 60002 only  rescinded EPA's administrative dollars and not a cent of the grant  funding.\n\nSecond, Republicans made clear that rescissions from environmental  grant programs only touched funding that had not yet…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…bill before reauthorizes annual appropriations for standard  development and maintenance, USDA's authority to collect fees for  supervision of inspections and weighing, an administrative/supervisory  cost cap and the Grain Inspection Advisory Committee. All important  components of the existing law.\n\nIt also makes key improvements, not least of all directing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…underlying bill.\n\nFor the first time in history, this bill would force States to pay  for part of SNAP benefits, and it would require States to increase  their share of administrative costs.\n\nThis is an unfunded mandate, plain and simple.\n\nLet's be clear. The costs are staggering, the consequences are  devastating, and the cruelty is deeply disturbing.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that  require USAID and other Agencies to exist and to operate the programs  as Congress has assigned to them. Nothing changes title 5, governing  the civil service, the Administrative Procedure Act, and so on.\n\nOne of the reasons I am voting for cloture is for the very reason  that these actions are illegal and no new law is needed to declare  that.", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…profoundly shaped  the lives of students, families, and educators across California.\n\nParvin Ahmadi began her career as a classroom teacher in San Jose  before taking on administrative roles in Fremont and ultimately serving  as Superintendent of the Castro Valley Unified School District for the  past decade. Her unwavering belief that ``nothing you do…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…source.\n\nThe Save Our Seas 2.0 Amendments Act reauthorizes the Marine Debris  Program so communities can keep doing this important work. It also  makes targeted, responsible administrative fixes to the Marine Debris  Foundation, so the public-private partnerships deliver results faster  and more effectively.\n\nThe Senate passed this bipartisan bill unanimously…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and timely  was really inhibited because of the centralization of the decision- making authority in FEMA in Washington or in one of the regional  locations where FEMA has administrative structures. For Vermont that,  ironically, is Puerto Rico, which is not only not close to Vermont but  doesn't have anything close to the weather in Vermont.\n\nSo the aftermath…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…2014, Mr. Varney came to Madera and was elected to serve as the  Madera County Sheriff. In 2020, the Madera County Board of Supervisors  appointed Mr. Varney as County Administrative Officer, overseeing 25  county departments and a half-billion-dollar budget.\n\nCOVID hit almost as soon as he was hired, and Mr. Varney found  himself navigating Madera…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…folks who need massive amounts of electrons, you all need to  start showing up and letting people know that you actually want  permitting reform, and you actually want an administrative and  regulatory process in which electrons are treated fairly, irrespective  of source, so you can get the power that you need. That is where we  need to go.\n\nIf you want…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…submitted by Federal Agencies.\n\nThe Senate has given GAO the authority in the CRA process in the past  to protect the legislative branch's ability to conduct oversight over  administrative rules.\n\nMy predecessor West Virginia Senator Jay Rockefeller was a leader in  2008 efforts to give GAO the ability to trigger the Congressional  Review Act procedures for…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the Environmental       Protection Agency to review its regulations and procedures       surrounding the 404 approval process. This will help       streamline and ease administrative burdens states face when       attempting to assume their own permitting program.\n\nA key feature of Section 404 permitting is the Waters of       the United States rule.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Executive Director at the International Monetary Fund       to advocate against increases in shareholding for Burma while       the country is under the control of the State Administrative       Council.\n\nUnder current law, the Administration can impose sanctions       on individuals and entities that undermine democracy and       peace. Those sanctions include…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…taxes and prohibiting new provider taxes.\n\nIt reins in the Consumer Financial Protection Bureau, and it rolls  back harmful Biden-era regulations that increase costs and  administrative burdens with limited flexibility for States.\n\nMr. Speaker, we are not here today to talk about the One Big  Beautiful Bill Act. We are here today to talk about the many…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Clauses.--Nothing in this Act shall preempt       rights or obligations under subchapter II of chapter 5 of       title 5, United States Code (commonly referred to as the       ``Administrative Procedure Act'').\n\nMr. WESTERMAN.  1001, the bill now under  consideration.\n\nMr. Speaker, I rise in support of H.R. 1001 sponsored by  Congresswoman Hageman. This bill…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…on the community spans beyond Lamar State College. Johnson  began his career as an officer in the Houston Police Department, where  he served in a variety of patrol and administrative positions before  retiring from a 20-year law enforcement career.\n\nDr. Johnson's leadership has not only transformed Lamar State College  Orange but has paved the way for…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…The Tribe seeks to place this land into trust and  is pursuing this goal legislatively, as their previous attempts to  obtain fee-to-trust approval through the Federal administrative process  have been mired in bureaucracy.\n\nThe other parcels involved in this legislation comprise approximately  80 acres of BLM land that will be transferred into trust…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…special use permits  with Forest Service, and allow implementation of a comprehensive  watershed management strategy. We would also save tens of thousands of  dollars in administrative costs for both the City and the Forest  Service.\n\nMr. Speaker, this is a narrowly tailored, community-driven proposal  that directly supports clean water, public safety,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…controlled substance is a drug, substance, or  chemical that has a high potential for abuse,  has no currently accepted medical value, and is subject to regulatory  controls and administrative civil and criminal penalties.\n\nToday, this Chamber is permanently scheduling fentanyl-related  substances as schedule I.\n\nWe owe it to our communities, our constituents,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…presented to  those who successfully lead learning in their districts, demonstrate  strength in both personal and organizational communication, show  continuous improvement in administrative knowledge and skills, and  actively participate in local community activities while maintaining a  deep understanding of regional, national, and international issues.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695857/recognizing-nathan-morris-2026-arkansas-superintendent-of-the-year"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…is the  purpose, to provide temporary shelter while transportation is being  arranged.\n\nDeportation is not a punishment and requires no criminal charges. It  is a simple administrative act. Challenging it does not invoke a right  to freely enter and stay indefinitely. You either wait here in  detention or in another country that will accept you. Those…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…making sure  we continue to have people--brave women and men--who want to step up  and do that job.\n\nOne of the other things that our Democrat colleagues want is to end  administrative warrants. A little history: Administrative warrants were  originally passed in the Immigration and Naturalization Act of 1952, so  they have been around for nearly 75 years.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Massachusetts, New Hampshire, and  Hawaii. It is clearly not what the delegation wanted. It is not what  most Alaskans wanted. And, as I explained when discussing the  administrative withdrawals in the Central Yukon plan just a few weeks  back, it violates multiple Alaska-specific statutes.\n\nI should add that this was just one plank in the Biden  administration's…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Public Works of the Senate a report containing--\n\n(A) the findings of such review; and\n\n(B) any recommendations, including any recommendations for       statutory or administrative changes or changes to ethics       policies and practices, to increase the transparency or       congressional oversight of the Mid-Atlantic River Basin       Commissions.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…development of a central bank  digital currency, or CBDC, and ensure that the United States' digital  currency policy remains in the hands of the American people and not the  administrative state.\n\nI am proud to have my legislation, the Anti-CBDC Surveillance State  Act, being considered on the House floor for a vote today.\n\nThis bill is straightforward. It…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}]