[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. MEEKS. Mr. Chair, I thank Chairwoman Wagner, Chairman French  Hill, Mr. Gottheimer, and to my dear friend and person that I respect  and admire, the Ranking Member Maxine Waters, for their leadership.\n\nMr. Chair, I am here today to say why I support this bill and why it  was important for me to be a cosponsor.\n\nI support…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697829/increasing-investor-opportunities-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…gang member gets deported.\n\nThis Federal judge got it right. In essence, he said, So what? If the  person is a gang member, they are still entitled to due process.\n\nI almost admire, to some extent, the way this President can persuade  people to believe this level of inanity--this level of inanity, not  insanity, inanity--how he is able to do this because…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't agree on very much, but we do agree there ought to  be accountability when young women are abused. That is what this is  about.\n\nMr. Speaker, first, let me say how much I admire the courage of my  Republican colleagues who are beside me here today.\n\nMr. Speaker, at the end of the day, this is not about us, and it is  not about politics. This is about…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…efforts remind us that, as a community, we benefit from  learning about and celebrating the Indigenous population that has lived  on this land for countless generations. I admire his devotion to  preservation and am grateful we have people like Mel in our district  who are dedicated to educating our communities about the great Luiseno  people.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699866/recognizing-mel-vernon-as-november-2025-constituent-of-the-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…later go on to be Governor of his State and go on  to do great things, but his heroism lay that in a time of crisis, he  stood up.\n\nI know there are veterans in this body--I admire them so much--who  have answered that call to serve our country and put their lives in  sacrifice.\n\nThere are people I admire that are heroes of mine that were  suffragettes.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…he breaks the trade  deal. The President says that he wants Canada to be the 51st State;  Canada is not about to become the 51st State.\n\nI will be quite candid with you, I admire the way the Canadians have  made it perfectly clear to the President that this won't happen.  Someone has to stand up to him.\n\nHe wants to take Greenland. He wants to make…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…at  Grace Baptist Church, a 129-year-old faith community in the center of  my district, Norwalk, Connecticut.\n\nThe church has thrived under Pastor Curtis' leadership, and I admire  him as a friend, as a mentor, and as a spiritual guide not just for his  understanding of the Scripture, but for his deep commitment to  ministry.\n\nDr. Curtis, over the course…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693739/welcoming-reverend-dr-lindsay-curtis"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…troubling patterns that we have seen  emerging in our country, patterns that echo tactics of regimes in  Hungary, North Korea, and Venezuela. These are not governments we  admire. Yet, this latest move fits that mold.\n\nThe Library of Congress is the world's largest library and a symbol  of our commitment to free thought. We have seen growing attacks…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691272/attacks-on-library-of-congress"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…permanently endowed scholarship for  Chesterfield, Hopewell, and Prince George students pursuing a medical  career.\n\nI thank Colonel Butler for his service to our Nation and admire all  he has done to improve the lives of those in our community,  Commonwealth, and country. I am honored to name him the 2025 Veteran of  the Year for Virginia's Fourth Congressional…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…went through hell.\n\nYou worked humbling, demanding jobs full-time,\n\nThen carried a full course load--every class, so much work       assigned.\n\nAnd what moved me most--what I admire in you--is that       somehow, still, you became one of the kindest Page classes I       have ever known or knew.\n\nMaybe that's the lesson you offer us today:\n\nThat despite…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…they can kind  of feel like fully productive members of our community.\n\nMr. MERKLEY. I would yield for a question.\n\nMr. MERKLEY. Thank you, Senator. I not only agree, but I so admire  what you accomplished. It is so frustrating. Why can't we accomplish  that again?\n\nI know one of our Members worked hard with my colleague across the  aisle to do a bill that…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…over $100 million for  this account. I urge a ``no'' vote on this amendment.\n\nMr. CALVERT. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CALVERT. Mr. Chair, I greatly admire the gentlewoman from  Georgia's passion for ensuring support for our overseas allies are a  wise use of taxpayers' dollars, but support for Taiwan must be part of  that equation.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…my honor today to wish the happiest of  birthdays to my dear friend and brother in Christ Richard Lockamy.\n\nI have known Richard for as long as I can remember. With age, I  admire, respect, and appreciate the man Richard is, and that admiration  is growing with every day.\n\nBriefly, Richard grew up in Benson, North Carolina, the oldest of  four. He attended…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…is  enough. Let's reopen the government.\n\nI urge my colleagues to do that today. I hope it is done in a  bipartisan way.\n\nMr. COLE.  He is my very good friend and a person I admire  greatly.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the government, 76 percent of the  Government of the United States, because of the ranking member and  because of her leadership and her hard work to find common ground. I  admire her tremendously as a person, and I appreciate her as a working  partner.\n\nWe also have working partners in the United States Senate. If we  didn't have Chairwoman Collins…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Fire  Department, and local leaders so that the flags are all up by Memorial  Day. Marie and David Troy are an  example to New Yorkers and to Americans. I truly respect and admire  them for their enthusiasm and patriotism.\n\nOn behalf of New York's 21st District, I want to thank Marie and  David Troy for being model citizens of our community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694912/recognizing-marie-and-david-troy"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…organizing gift drives for overseas troops and local  seniors. Ms. Anthony is known for her compassionate leadership and is a  role model for her peers.\n\nMr. Speaker, I greatly admire these leaders in the Second District of  Nebraska. They make our district better and our community better.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…strength of our  military to defend ourselves in the most dangerous time we have had  since World War II.\n\nSo I have the deepest respect for my friend from Connecticut, and I  admire his intentions. But until Congress and until the authors of this  proposal identify a way to offset the expense or to make it less  expensive, we should not move forward with…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…importance of having both Air Force  and Navy sixth-generation fighters: Admiral Paparo, commander of the  INDOPACOM, a man for whom I have worked for, flown with, and highly  admire; General Allvin, chief of staff of the Air Force; Admiral Kilby,  the Acting CNO; and General Caine, our Chairman of the Joint Chiefs.\n\nThese experienced and highly decorated…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…occurs, I must object and object now.\n\nMr. LEE. Mr. President, I respect and deeply appreciate my friend and  colleague the distinguished Senator from Florida. And I respect and  admire her great devotion to protecting her State, its pristine  beaches, and the many qualities that it enjoys. People from all over  the United States of America and all over the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…teach them the importance  of financial literacy. His efforts prove it is never too late or too  early to learn how to manage your finances.\n\nAs a former community banker, I admire his efforts to uplift his  community and help those around him build a stronger foundation in  finance.\n\nI look forward to seeing Keaton's continued impact in central  Arkansas…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…the people  of Hancock County, Mississippi. His leadership saved lives,  strengthened emergency response across our region, and set a standard  of service that we should all admire.\n\nMr. Speaker, I ask my colleagues to join me in thanking Hooty Adam  for his extraordinary dedication and in wishing him the very best in  his well-earned retirement.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696876/recognizing-brian-hooty-adam"}]