[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…U.S. Senate.\n\nI want to remind everyone here that once we vote in favor of this  rule, we can't go back, literally. You all know the rules. We can't go  back. The FCC may not adopt a similar rule in the future. This is an  irreversible, self-inflicted wound. So I urge my colleagues to reject  this misguided, wrong-headed resolution. It would be a disgrace…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…California can enact stricter emission  standards to protect the environment if they receive from the  Environmental Protection Agency a waiver. And States like Oregon can  adopt those standards if they so choose.\n\nSince then, California has applied for, well, about 100 waivers. They  have made vehicle emissions 99 percent cleaner than they were in…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…children, seniors, the disabled, the veterans, our  most vulnerable families--they are not bargaining chips. It is simply  wrong to treat them as bargaining chips. It is wrong to adopt a  position in which they will not even get funded in November after the  courts have said: Fund it.\n\nThere is enormous damage that is done when children are deprived of  food--to…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…committee yesterday. Mrs.  Houchin said it particularly well, and others on the committee, when  saying that they want the information necessary to make solid  decisions. If we adopt my amendment, that will accomplish that  objective.\n\nMr. Speaker, I urge my colleagues to vote against the previous  question and for the Hoyer amendment.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…like my daughter, find forever families       because Medicaid provides the financial support needed to       care for them. Without it, fewer families would be able to       adopt, leaving more children to age out of the system without       the care they desperately need.\n\nPlease support Medicaid funding and policies that ensure       individuals with…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Clause 7 proclaims that  Congress, not the President, determines how the taxpayers' dollars are  spent. I urge my colleagues to reject this rule, which would  automatically adopt the rescissions package pursuant to the June 3,  2025, special message.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Protection Agency (EPA) to reduce air pollution. Under  the Clean Air Act (CAA), California can apply for waivers to set its  own vehicle emissions standards, and other states can adopt  California's exact regulations under certain circumstances. The law  explicitly grants these states the ability to protect their citizens  from air pollution and address climate…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the Interior and the Secretary of Commerce  determine that its collection no longer poses a substantial risk to its  sustainability, providing an incentive for the industry to adopt  responsible practices.\n\nFurthermore, the Saving NEMO Act would support industries that focus  on sustainability and environmentally friendly practices, which is the  future…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Issuance of a Migratory Bird       Treaty Act Special Purpose Permit in Washington, Oregon, and       California (Barred Owl ROD or ROD). The ROD announced FWS's       decision to adopt a barred owl management strategy to improve       the survival and recovery of northern spotted owls and to       prevent declines in California spotted owls, both of which…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…and reasons in the Federal Register. B-334309, Nov.       30, 2023.\n\nThe Clean Air Act provides similar procedures for the EPA       Administrator to authorize California to adopt and enforce       emission control standards for certain nonroad engines or       vehicles. 42 U.S.C. Sec. 7543(e)(2)(A). The Administrator       must authorize California…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…investment will literally be underwater because  of sea level rise is not ideology. It is sensible for plan fiduciaries  to be permitted to consider such factors and to be able to adopt them  if they don't reduce investment returns. That is precisely what the  rule from the Biden administration permitted.\n\nPredictably, the Trump administration is walking away…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…15, so I am open to modifications of that  that could address that. But I was one of the people who said, as  written initially, I couldn't vote for unanimous consent to just adopt  it. But to consider it on this floor--yes, I can vote for it to be  considered on this floor because that is what we should be doing. We  should be bringing rules ideas to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…with better  training, better equipment, and better policies. For example, if data  reveals that a significant number of injuries occurred during traffic  stops, agencies can adopt safer tactics or deploy new technologies. If  certain regions report higher rates of firearm-related fatalities, we  can prioritize resources there.\n\nOfficer suicide rates…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…from the DOE's rule. However, this  is really a total misunderstanding of what happened.\n\nThere may have been some analysis of this 95 years, but the DOE did  not propose or adopt efficiency levels like that for the product  mentioned. In fact, for that particular product that he is mentioning,  the final rule made no changes to the existing standards.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Kitchen,  to give testimony to the City Council in Kansas City when McQueeney was  receiving less pay when working for the federal government. Kitchen  worked with Kansas City to adopt an ordinance to prohibit  discrimination against women and to stop employers from penalizing  women with less experience.\n\nWhen it was time for retirement, Alice saw it as…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Again.\n\nThe actions taken by Delegate Plaskett reflect poorly on the House,  and this body needs to hold her accountable.\n\nMr. Speaker, I urge all of my colleagues to vote to adopt this  resolution to show the American people that those who colluded with Mr.  Epstein, including Members of the House, will be held accountable, and  this resolution is the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…other religious  buildings, according to the Burma Research Institute.\n\nThe people of Burma can no longer afford for Congress to sit idly by,  and the Trump administration must adopt a unified strategy for Burma,  as both the Department of State and the Department of the Treasury have  done. It is time for the Department of Homeland Security to come to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the State to be electric vehicles by 2035. What makes  this policy even more dangerous is that 17 other States, making up 40  percent of the American auto market, are set to adopt these  regulations, including my home State of Pennsylvania.\n\nIf consumers want to purchase an EV, they should be able to, but  Californian politicians have no right to remove…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bond market: We are adults. We  are being serious. We understand we have a demographic. We have a  healthcare spending problem. We are going to take it on. We are going  to adopt technologies. We are going to adopt other ways to make our  brothers and sisters healthy. We are going to telegraph to the markets  we are stable. We are America. We are the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…subjective  fiction. It has told us that we must reject the foundational truths  that our society has held for thousands of years. This ideology has  forced institutions to adopt terms like ``birthing persons,''  ``pronouns,'' which got us into this whole mess--``they,'' ``them,''  ``it''--as if language itself must be bent to their radicalized  ideology.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Examination Schedule.--\n\n``(1) In general.--With respect to examinations of foreign       vessels to which this chapter applies, and subject to       paragraph (3), the Secretary may adopt a performance-driven       examination schedule to which such vessels are to be examined       and the frequency with which such examinations occur,       including the frequency…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…DOWNING. Madam Speaker, I rise in strong support of H.R. 5784,  the AI-WISE Act. This legislation will provide essential resources for  small businesses to support their efforts to adopt AI.\n\nSmall businesses are optimistic about the potential of AI.  Capabilities like machine learning and language processing are becoming  critical tools for businesses seeking…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…eventually, Greta Thunberg also wound up siding with the  Palestinians, who had killed the Israelis, against the Israelis. I  think it was for the same reason. She wanted to adopt a cause to feel  she had a purpose in life.\n\nWhen one particularly has kind of a spoiled life, the people you want  to help are people who are kind of opposed to the successful…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…and Budget, or OMB, to  oversee updates to the Federal Acquisition Regulation to ensure that  Federal contractors with access to Federal systems or who work with  Federal data adopt these vulnerability disclosure policies, as well.\n\nMy bill also requires the Secretary of Defense to update the Defense  Federal Acquisition Regulation Supplement to require…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that disrupts the costs that makes our society better,  happier, more efficient. If you were to do all those things without an  attempt to pay for them, without an attempt to adopt policy to  modernize the way we deliver services, in the previous 240 years, we  borrowed about $28 trillion from the public. That is from investors  around the world, from…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, Senate Standing Rule XXVI requires each  committee to adopt rules to govern the procedure of the committee and  to publish those rules in the Congressional Record not later than March  1 of the first year of each Congress. On February…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688278/us-senate-subcommittee-on-disaster-management-district-of-columbia-and-census-rules-of-procedure"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…eligible entity;\n\n``(v) ensure that the eligible entity and, if the eligible       entity is a State, local governments within the jurisdiction       of the eligible entity, adopt and use best practices and       methodologies to enhance cybersecurity, particularly identity       and access management solutions such as multi-factor       authentication,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…increase our energy supply, the Biden  administration pushed us further toward crisis with measures designed  to restrict conventional energy development and force Americans to  adopt electric cars, putting a vast new burden on our electric grid.\n\nFortunately, President Trump recognizes the precarious situation we  are facing, and he is already demonstrating…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…section 5(a)(2); and\n\n(ii) describes how, to the extent the Federal agency       determines necessary to meet relevant statutory requirements,       the Federal agency will adopt or implement the prototype       tools tested, designed, and built under section 4; and\n\n(2) not later than 180 days after the date of enactment of       this Act, begin implementing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…right to apply for a waiver. Congress decided  that. For 50 years, California has used that waiver to clean up its  air. It is not just California. Other States have chosen to adopt these  standards, too.\n\nAcross America, we can breathe cleaner air. That is why our children  can go out and play in the park and can run around. They don't have to  stay indoors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]