[{"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…former colleagues, Brad Wenstrup and Earl Blumenauer. It is common  sense mainly because, as you heard from the chairman, chronic disease  is so common.\n\nMr. Speaker, 6 in 10 adult Americans have a chronic disease, which is  the leading cause of disabilities in the United States of America. Mr.  Speaker, 90 percent of our annual health spending goes to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…control from the Natives with their superior  arms, and developed a cowboy culture at the heart of their national  ethos.\n\nOne of those countries responded by acting like an adult. Having  initiated gun buyback programs after their last tragedy, they are now  working to further tighten gun regulations.\n\nThe other one of these countries acted like a child.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698407/gun-violence-tragedies"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, just days ago, a Hawaii veteran, Sae Joon  Park, said goodbye to his family which included his elderly mother with  dementia, his two adult children, and his home.\n\nMr. Park was shot twice in combat, earning a Purple Heart for his  bravery. Yet despite his sacrifice, ICE officers gave him no choice but  to deport…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693066/addressing-immigration-inefficiencies"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Valley.\n\nThe new permanent home of Chabad Southwest Las Vegas will serve as a  hub for worship, education, and fellowship. It will house weekly prayer  services, holiday programs, adult and child education classes, Mommy &  Me programs, women's groups, after-school enrichment, and a wide  variety of cultural and social gatherings. This expansion will allow…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695341/recognizing-the-groundbreaking-of-chabad-southwest-las-vegas"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…is  not going to help those mothers of premature babies who spend, on  average, $70,000 a day in a NICU stay.\n\nVictoria Cassels, an accountant in Roanoke, worries about her adult  daughter in Richmond, who is a self-employed graphic designer with an  autoimmune disease.\n\nThis year, her monthly premium rose by $400, about three times higher  than it…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Quinnipiac  College. It was through his parents that Steve learned the importance  of giving back to his community and he took those lessons to heart,  dedicating most of his adult life to public service. In fact, his late  father, Robert, was honored with this same award in 2012, making them  the only father/son recipients its 32-year history.\n\nSteve…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…jurisdiction for Congress to legislate on local D.C. matters. However,  I will briefly discuss it.\n\nD.C. allows noncitizens to vote in local elections because it  believes that all adult residents deserve a say in their local  government. While D.C. law allows noncitizens to vote only in local  elections, 40 States and the Federal Government allowed noncitizens…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…soldiers  returning from World War II already had high school diplomas and were  ready for postsecondary education.\n\nHead Start, the Elementary and Secondary Education Act, the Adult  Education and Family Literacy Act, the Individuals with Disabilities  Education Act, and the Higher Education Act are some of our Federal  laws that work to ensure that opportunities…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…companies before the strikes but not to Congress?\n\nThe Gang of 8, not all of us--I understand 535 of us can't be briefed  on an ongoing, kinetic, risky military operation. I am an adult here. I  don't think we have a right to know--all 535 of us--but there is a  thing called the Gang of 8. They are supposed to be trusted with the  most sensitive national security…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…about whether people can get care and whether  caregivers can keep going.\n\nI have met grandparents caring for grandchildren, parents caring for  children with disabilities, and adult children caring for aging loved  ones, often with no backup and no break.\n\nThat is why the 5-year reauthorization of the Lifespan Respite Care  Program in this bill, which…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699329/consolidated-appropriations-act-2026"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…prevent child maltreatment and strengthen  families. It would eradicate the Social Services Block Grant that  provides substantial investment in childcare, child welfare, and adult  protective services. These egregious cuts alone will cost Illinois over  $72 million dollars and hurt Illinois' children, seniors, and families.\n\nI reject this bill that gifts…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the Supplemental Nutrition Program for Women,  Infants, and Children, the WIC program; no bills to improve options for  summer food programs; no bills to improve the Child and Adult Care Food  Program, and no bills to address the need for healthy meals after the  school day is over.\n\nThe majority did, however, choose to advance that big, ugly bill  which…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…of the Mount Washington Valley,  including meal delivery, transportation. social programs, exercise  classes, home repair, and even a thrift store that provides affordable  adult clothing and housewares for persons in need. With the help of  over one hundred dedicated volunteers, the Gibson Center serves 47,000  meals a year to seniors in the Mount…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691690/recognizing-the-gibson-center-for-senior-services-serving-two-million-meals"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Albany Young Marines of Albany, Georgia, who have  been named the National Young Marine Unit of the Year. The group  received this well-earned honor at the Young Marines 2025 Adult  Leader's Conference in Dallas, Texas on April 26, 2025.\n\nThe Young Marines is a nationally renowned nonprofit organization  focused on youth leadership and character development.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…a state grant\n\nRamapo Police Department                                NORTH CAROLINA\n\nRaleigh Police Department\n\nWake County Sheriff's Office\n\nNorth Carolina Department of Adult Corrections\n\nGoldsboro Police Department                                 NORTH DAKOTA\n\nNorth Dakota Highway Patrol\n\nWard County Sheriff's Department\n\nMinnehaha County Corrections…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…than $276 million  annually in economic impact and supports more than 4,000 jobs across  its region, while enrolling nearly 10,000 students each year in credit,  workforce, adult education, and dual enrollment programs.\n\nDr. Karolewics herself has been recognized nationally and statewide  for her leadership, serving on higher education boards and councils…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695474/recognizing-wallace-state-community-college-and-its-president-dr-vicki-p-karolewics"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…enacted in 1938, and we all know  things have come a long way since then when families did not use  daycare services for their little ones and elderly parents lived with  their adult children until death.\n\nThe current mandates of the Fair Labor Standards Act related to  dependent care drive up costs for businesses through unreasonable pay  calculations.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…explicit  discussions of sexual acts with children. They know this is happening.\n\nIn one case that was reported in the Wall Street Journal last month,  a chatbot emulating an adult man told a test user--this was a reporter  who was a test user for the Wall Street Journal for the story on these  chatbots. The test user identified as a 14-year-old girl.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…response would be immediate, unified, and  decisive.\n\nWe can and must act immediately to save American lives.\n\nThis is not unprecedented. Every President in my lifetime, in my  adult lifetime, has used the military to this end, to protect the  people of the United States, which is the President's first and most  important charge as President.\n\nTherefore,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…District of Columbia to engage in       vehicular pursuits of suspects, and for other purposes.\n\n(c) The bill (H.R. 5140) to lower the age at which a minor       may be tried as an adult for certain criminal offenses in the       District of Columbia to 14 years of age.\n\n(d) The bill (H.R. 5125) to amend the District of Columbia       Home Rule Act to terminate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…continues to protect the  criminals and ignore victims. The D.C. CRIMES Act puts an end to this  madness and ensures safety and security across D.C.\n\nAt 18 years old, you are given adult responsibilities, like being  able to vote or sign up for the military. At 18 years, you become  responsible for your  choices and your decisions and should be treated as such.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…savings account,  Japan, whoever is buying our debt, that we are stable, that we are  adults, and that we understand. We have a demographic problem, but we  are going to engage in adult-like technology and borrowing policy,  things to manage our debt, and minimize it.\n\nMr. Speaker, this chart is substantially unreadable, but I wanted to  actually just show…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Team awarded the WOG a $50,000.00 Hero's Award. Each year, during the  annual meeting, funds are donated throughout the Foundation's programs,  which include: Charity Care, Adult and Child Bereavement Counseling, a  camp for kids ages 6 to 17 that teaches them to manage grief and  reassures them they are not alone in their loss, Building a Children's…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…our  American economy.\n\nThat is why, together with the CTE Caucus co-chair, Congresswoman  Bonamici, I introduced two bills that increase career counseling for  students and adult learners.\n\nThe Counseling for Career Choice Act would expand K-12 career  counseling services and provide more resources focused on financial  literacy, registered apprenticeships,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695635/career-and-technical-education-caucus"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…security. We care about security for our  families from healthcare costs, and we care about security for our  Nation from the threats that are greater than at any time in my adult  life.\n\nLet's find a path toward working together to address them.", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…suspected elder financial       exploitation is currently being reported--\n\n(i) information regarding which Federal, State, and local       agencies are receiving reports, including adult protective       services, law enforcement, industry, regulators, and       professional licensing boards;\n\n(ii) information regarding what information is being       collected…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…model, Gemma, falsely  claimed that Starbuck was accused of child rape and that I publicly  defended him. Google's AI models have also falsely accused him of being  a former adult film star, of facing criminal drug charges, and of  shooting a man in Nashville in an argument over a parking spot.\n\nIn response, Google's VP claimed that ``hallucinations''…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…reality behind this is, this bill that we are discussing today is  insisting on work requirements associated with the recipients of  Medicaid.\n\nIf you are an able-bodied, working adult, you should be able to go  out and find a job. If you can't find a job, you need to go to a  training program and try to find training so that you can get a job and  ultimately…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693220/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…is not all. This legislation also delivered a historic win  for the working class with no tax on tips and no tax on overtime. Many  folks--me included--at some point in their adult lives end up working  waiting tables or in some sort of service industry. So the idea now is  that more folks working their way up the economic ladder can now enjoy  no tax…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…well as fall from grace of a once enthusiastic       recruit on a sacred national mission of accompanying Israeli       high-schoolers, military personnel, VIPs, and ordinary adult       tourists to Poland seeking a very brief exposure to a death       camp site. The heavy-laden theme is made bearable by a       genuine literary talent utilizing a relieving…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}]