[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…cuts is going to be  horrendous, and this impact is going to be everyplace in the country. I  have talked a lot about Rhode Island, but one of the ideas the  Republicans are advancing to cut Medicaid is to eliminate the Medicaid  expansion provided for under the Affordable Care Act.\n\nNow, according to the Urban Institute and the Robert Wood Johnson  Foundation,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…stewards and  priests of the environment and not proprietors of it.''\n\nIn addition to his environmental stewardship, Patriarch Bartholomew  finds common cause with Americans in advancing the causes of democracy  and peace. He assumed the Patriarchate of Constantinople during the  same year that the Soviet Union dissolved. His leadership was  instrumental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…four of them did--on  Canada, by not standing up when it comes to this assault on programs  for our seniors, like Medicaid.\n\nThis is unacceptable, and we should not be here advancing policies  that are going to force more Americans to have to choose between  filling their prescriptions and putting food on their table. Too many  Americans struggle with…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…With over 38 years of service between Active Duty and the Reserves,  Colonel Butler has devoted his military career and beyond to improving  the lives of our servicemembers, advancing medical research, and giving  back to his community.\n\nColonel Butler completed two overseas deployments, one to Okinawa and  another to Qatar. He has over 980 hours of flight…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the residents of D.C. deserve to have our       local laws respected without interference from the federal       government.\n\nI urge you and your colleagues to vote against advancing       these proposals.            Sincerely,                                                  Brian L. Schwalb,                     Attorney General for the District of Columbia.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Monroe County Legislator and Community Affairs Coordinator for New York  State Senator Jeremy Cooney, she has dedicated her career to amplifying  underrepresented voices and advancing policies that create a lasting  impact. Whether championing local initiatives or supporting statewide  policy efforts, she brings passion and dedication to every role she…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…for veterans with PTSD and  alcohol disorder, as well.\n\nThis is the first time the VA has funded research on psychedelic  compounds since the 1960s.\n\nMy fellow Psychedelics Advancing Therapies Caucus co-chair, General  Jack Bergman, and I are encouraged by the promising results so far that  we have seen in treating veterans with PTSD and other disorders.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692952/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Washington, DC.\n\nDear Speaker Johnson and Leader Jeffries: We, the       undersigned organizations, represent a diverse group of       advocates and experts dedicated to advancing civil rights       protections and institutional resources for pregnant and       parenting students. We write       to share our opposition to the Pregnant Students' Rights…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…remote sensing systems and selling the data. We must ensure that the  United States remains at the forefront of this industry, especially as  the Chinese Communist Party is advancing in the remote sensing sector.\n\nAs a 2024 report from the Center for Strategic and International  Studies plainly put it: ``Should any one country dominate the  commercial…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…career at the end of this year. Ranking Member Larsen and I had the  privilege of meeting with her in Mobile this past August, and her  dedication to building partnerships and advancing science-based  solutions is a big reason the program has been so successful in Mobile.\n\nIt could not be more fitting that, in the same year in which she  celebrates 16 years…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…justice system.\n\nI can safely say that the Federal Probation Act laid the groundwork  100 years ago for legislation like the First Step Act.\n\nToday, we are all responsible for advancing this work through the  passage of fair and effective criminal justice reforms. And I would  like to thank the Administrative Office for the Courts' Office of  Probation and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688628/100th-anniversary-passage-of-the-federal-probation-act-of-1925"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…to middle-class and  working families of this country whose essential need for educational  services and healthcare are going to be cut. They will take the hit in  terms of advancing this priority.\n\nThis is an important vote for the people of this country to be  watching. This is a gut check for every Member in this  House about where their priorities…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…honor The Pew  Charitable Trusts, an incredible organization that is focused on  improving and invigorating civic life. Founded in 1948, The Pew  Charitable Trusts has been advancing solutions to societal challenges  for 77 years, and I know that the Philadelphia community has benefited  immensely from this important work.\n\nFounder Joseph Newton Pew and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…oppressive regimes in Europe, survivors of the       Holocaust, and those seeking a haven from persecution; and\n\nWhereas, the Jewish community has been instrumental in       advancing civil rights initiatives across America, fighting       discrimination, and advocating for justice and inclusivity       for all members of society; and\n\nWhereas, despite…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…knowledge, has not  conveyed their concerns to the White House.\n\nThe Office of Advocacy is supposed to be an independent office within  the SBA, and it is responsible for advancing the views and concerns of  small businesses before Congress, the White House, Federal agencies,  the Federal courts, and State and local policymakers, but it has done  nothing…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and I don't  believe that we need to have a colloquy. We each have an opportunity  for closing comments.\n\nMr. Speaker, House Republicans are laser focused on governing and  advancing legislation that addresses pertinent issues across the  Nation. It is unfortunate that our colleagues do not agree that  protecting Americans from unnecessary rules and regulations…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…AGOA       could risk its sustainability and undermine capital       investments within the sector.\n\nSustaining a positive economic relationship with Namibia is       key to advancing minerals diplomacy, particularly given its       significant mineral wealth. The country is home to the       world's fourth-largest uranium reserves--resources that could…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Homeland Security  from procuring batteries from companies that have deep ties to the CCP  and engage in human rights abuses.\n\nH.R. 1166 helps our Nation take a step forward in advancing our  efforts to decouple from the PRC and safeguard critical supply chains  from exploitation.\n\nI am proud that this bill passed out of the Committee on Homeland  Security…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…the people of Texas'  Thirteenth Congressional District. As my first Chief of Staff, Jeff  played an instrumental role in helping me to become a better Member of  Congress, advancing the interests of Texas Thirteen, and ensuring that  my constituents received the representation they truly deserve.\n\nJeff, a native from Sacramento, California, found himself…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…nearly 37 years of  distinguished service at Deere & Company. Throughout his career, Jones  demonstrated unwavering dedication, strategic insight, and a deep  commitment to advancing the company's mission and values.\n\nCollis joined John Deere in 1989 as a financial services  representative. Throughout his career, he has held key positions in  Sales, Marketing,…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…of  Massachusetts, for leading this bipartisan effort. The bill passed the  Foreign Affairs Committee with broad, bipartisan support, and I urge my  colleagues to join in advancing it on the floor today.\n\nWe must make it unmistakably clear: Forced organ harvesting will not  be tolerated. It will not be tolerated in this world, and those who  carry it…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…impressive prelaw program, which boasts an 87 percent law school  acceptance rate.\n\nMadam Speaker, I commend Hendrix College and the Gill family for  their commitment to advancing legal education in Arkansas, and I look  forward to seeing those students thrive in law school and beyond.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…a  vital role to play in protecting liberty and human dignity.\n\nMr. Speaker, it is my honor to welcome him to Washington and to thank  him for his steadfast leadership in advancing religious freedom around  the world.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…are delivering.\n\nThis two-bill package reflects Member input, the America-first  agenda, and the collaboration across political aisles and Chambers that  serves the Nation.\n\nAdvancing full-year appropriations matters because it gives the  country certainty and direction. It allows vital agencies to plan, make  decisions, and do their jobs based on today's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…605. Credit Union Board Modernization. Sec. 606. Systemic Risk Authority Transparency.  Sec. 607. Least cost exception. Sec. 608. Failing Bank Acquisition Fairness. Sec. 609. Advancing the Mentor-Protege Program for Small Financial                Institutions. Sec. 610. American Access to Banking. Sec. 611. Promoting New Bank Formation. Sec. 612. Rural…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…difference between choosing from investments  selected by ERISA fiduciaries and choosing from investments through a  brokerage window.\n\nMr. Speaker, I think most would agree that advancing a political  agenda at the expense of retirement savings is wrong. Let's be clear:  Americans invest to secure a brighter future for themselves and their  families, not to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…support in moving this bill forward.  I also thank my colleague from Illinois (Mr. Krishnamoorthi), my co- lead on this legislation, for his partnership and commitment to  advancing this important legislation.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…must remain vigilant while also building up our defense  industrial base in order to be prepared for any scenario.\n\nAmerica must not remain idle while our adversaries are advancing  their capabilities. The Europe Subcommittee will do our part.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…executive order to rename the Gulf of Mexico as the Gulf of America.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  thank Congresswoman Greene for advancing it. I yield back the balance  of my time.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…potentially triple the number of students across the country who  receive this particular form of school choice of charter schools which  have a tremendous track record in advancing student achievement.\n\nI will give you one example. Success Academy, which was founded in  New York City, manages 57 schools, serving 22,000 inner-city children.  They are…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]