[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…everything they could desire, in respect to our foreign  relations, towards confirming their prosperity. Will it not be their  wisdom to rely for the preservation of these advantages on the Union by  which they were procured? Will they not henceforth be deaf to those  advisers, if such there are, who would sever them from their brethren  and connect them…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…everything they could desire, in respect to our foreign  relations, towards confirming their prosperity. Will it not be their  wisdom to rely for the preservation of these advantages on the Union by  which they were procured? Will they not henceforth be deaf to those  advisers, if such there are, who would sever them from their brethren  and connect them…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…2 weeks ago. Well, this rescission bill is a continuation of that  vision of families lose--particularly rural families, particularly all  Americans, who lose out on the advantages of soft power that we  exercise around the world--and billionaires win. But it is a direct  attack, as well, on the immediate process of Democrats and Republicans  working…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…including Congress. Vesting  this much power in one person, particularly this President, is  irresponsible, dangerous, and unnecessary.\n\nGiven our massive conventional military advantages over our  adversaries--think of Venezuela--there is no plausible circumstance  that could justify the use of nuclear weapons to deal with a nonnuclear  threat.\n\nRemoving…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Libya will give the United States the energy, and we       will give their states the stability of that region,'' Sahad       said. ``If Libya is stable, then there are big advantages for       Northern Africa, for Africa.''\n\nAlftise reiterated this point, arguing that, while the       Government of National Unity has so far been able to keep the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…American Apparel &  Footwear Association, and countless other business associations are  calling for AGOA's reauthorization by Congress.\n\nPut simply, this bill offers clear advantages for millions of  American workers. AGOA is essential to also protecting U.S. foreign  policy interests in Africa.\n\nAs we speak, China and other U.S. adversaries are trying…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…appropriately staffing our agencies and review boards across the  Federal Government.\n\nAdditionally, I am concerned this bill will create a fast-tracked  review procedure that advantages wealthier appellants. Taking the case  to district court is time-and resource-intensive, so only the  wealthiest appellants are likely to use the expedited review process.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691036/expedited-appeals-review-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Center for Strategic and International  Studies plainly put it: ``Should any one country dominate the  commercial remote sensing market, not only could it gain economic  advantages, but it would also control the information narrative about  the entire planet, from the environment to natural resources to human  conflict.''\n\nSo this bill provides Congress…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…colleagues, Mr. Smucker and Mr. Beyer, for their  leadership on this important legislation.\n\nAs Mr. Smith has described, these changes will better help seniors  understand the advantages and disadvantages of claiming at different  ages. I certainly know folks among my constituency who are faced with  this confusion. This bill addresses that.\n\nI want to quote…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697233/claiming-age-clarity-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…legislating. I can tell  you that we are standing with the lawyers who are litigating. We are  fighting to protect and pursue opportunities that give Black Americans  the same advantages that White Americans have enjoyed since our  Nation's founding.\n\nOur history is made stronger and more vibrant. Just when Black  Americans think that we are equal, we are…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "John Thune", "party": "Republican", "sentence": "…proud that, despite some hiccups  along the way, we have returned the lead to the committees and have now  considered 11 of the 12 individual bills on the Senate floor.\n\nThe advantages of a Member-driven process are myriad. First and  foremost, it empowers Senators of both parties to make their voices and  the voices of their constituents heard, and it…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…acquisitions upon us, will not lightly hazard  the giving us provocation; when we may choose peace or war, as our  interest, guided by justice, shall counsel.\n\n``Why forgo the advantages of so peculiar a situation? Why quit our  own to stand upon foreign ground? Why, by interweaving our destiny with  that of any part of Europe, entangle our peace and prosperity…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…missile defense,  satellite communications, and launch capabilities.\n\nWith a high-latitude polar launch capability and vast, remote  terrain, my State offers unparalleled advantages for both government  and commercial space initiatives. The Pacific Spaceport Complex-Alaska,  or PSCA, on Kodiak Island is at the forefront of these efforts as a  premier…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…rule, this legislation ensures neutrality and  prudent decisionmaking by fiduciaries.\n\nMy colleagues on the other side of the aisle have made many claims  about the supposed advantages of ESG investing.\n\nAllow me to set the record straight. ESG funds have underperformed  for years. According to Morningstar, ESG funds lagged the U.S. Market  Index and the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…don't know why foreign nationals and major  corporations, BlackRock or otherwise, are buying up single-family  residences. We should stop that. We should, frankly, give tax  advantages to get rid of the ownership of those from corporations and  foreign nationals to get them to American citizens so they can own  those houses and own their ability to have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…restrictions on the import and export of natural  gas and allows American LNG to flourish once again.\n\nMr. Speaker, America should never ever voluntarily surrender its  energy advantages, not when our production strengthens families, their  paychecks, and communities, and certainly not when Texas and our Gulf  Coast stand ready to supply LNG to the world…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…people to live in  poverty because of a lack of energy, so they are going to use coal.  What we can do is produce that coal. We can help them if we unleash our  technological advantages and help find better ways to use coal and  natural gas more cleanly. We should use our expertise in finding ways  to control emissions with carbon capture and other pollution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…countries, including Angola, Mozambique,       Tanzania, and Zambia.\n\nQ2: What is AGOA's impact on critical minerals supply       chains?\n\nA2: AGOA offers limited tariff advantages to the mining       sector, since most minerals already face relatively low       tariffs. Its real value lies in the realm of soft power. In       June 2025, China announced…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…to  do extensive research by universities, the NIH, and the FDA. We created  a framework to do research on the 4,800 believed analogues of fentanyl.\n\nI believe it has two advantages. One, if we find one of these  analogues that has no harm and even has a positive effect for some  issue, that creates your off-ramp. There is already an off-ramp in the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…trusted entities in       the deployment of a trans-Atlantic submarine fiber optic       cable described in subsection (a), and the associated       geopolitical and economic advantages;\n\n(6) the potential connectivity opportunities to maximize       investments in the United States economy through the use of a       trans-Atlantic submarine fiber optic…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…people always guided by an exalted justice and benevolence. Who  can doubt that in the course of time and things the fruits of such a  plan would richly repay any temporary advantages which might be lost by  a steady adherence to it? Can it be, that Providence has not connected  the permanent felicity of a nation with its virtue? The experiment, at  least,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}]