[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…security. His strategic vision and unwavering resolve have  significantly enhanced the capabilities and readiness of the unit,  ensuring the United States maintains its strategic advantage in the  space domain.\n\nColonel Schmitt's leadership has fostered a culture of excellence and  innovation within Mission Delta 4. He has consistently inspired  and mentored…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693489/recognizing-colonel-ernest-r-bobby-schmitt"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…contributes to  their dehumanization and the discrimination against them. None of these  amendments before us today are even remotely necessary. They are simply  an effort to take advantage of a culture war, partisan issue to drive a  wedge into this bill. Does it belong here?\n\nOn this particular amendment, for a servicemember who has a child  experiencing gender…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…percent over the past  23 years. This steady erosion is not due to foreign competition alone,  but to deliberate business decisions by Jones Act carriers who choose  to take advantage of legal loopholes that let them outsource high-value  work overseas while still reaping the benefits of domestic  protectionism.\n\nDespite these clear defects in the law,…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…current National  Security Adviser, former Congressman Waltz, and it was bipartisan  legislation.\n\nIt is not some DEI program--some program that is designed to provide  women an advantage in the Department of Defense. What it is is a  program that gives us a security advantage.\n\nEvery combatant commander who has come through my office has  highlighted the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…testing. If a power resumes testing because the U.S. is  abandoning the moratorium, those countries will develop new types of  warheads, close the technical and scientific advantage that we have  always had, and be a detriment to our national security.\n\nFurthermore, scientists are already doing groundbreaking experiments  and simulations, as our professor…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…improvements we can  make in terms of encouraging countries to better utilize the trade  preferences offered under AGOA and to maximize their government  strategies to take full advantage of those benefits. I look forward to  working with my colleagues to improve AGOA over the next 3 years, but  extending the legislation is a first critical step.\n\nMadam Speaker,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…the Encouraging  Public Offerings Act of 2025 sponsored by the chair of our  subcommittee, the gentlewoman from Missouri (Mrs. Wagner), which would  allow issuers to take advantage of confidential draft registration  statements that are currently available only to EGCs. It also makes it  easier for companies to have access to capital by giving them…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692736/encouraging-public-offerings-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…that realistic backdrop for training and  testing. Healthy and well-managed natural ecosystems play an essential  role in maintaining the readiness of our military troops, an advantage  that is unique to the U.S. military.\n\nThe military has even used ESA-listed wildlife to add complexity to  training exercises, treating them as sensitive infrastructure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congress called Members of Congress lunatics.\n\nThat was an act of incivility.\n\nThere comes a time, Mr. Speaker, when you cannot allow the  President's incivility to take advantage of our civility, and that is  what is happening in this country. His incivility is overwhelming our  civility. We cannot allow this. That act of incivility was in direct…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…hundreds of millions of  dollars for substance use disorder treatment. In fact, we were the  second in the Nation to implement this waiver, and a total of 37 States  now take advantage of this.\n\nMr. Chair, 83 percent of people who are treated in the rural parts of  Colorado and across the Nation are on Medicaid. This will significantly  impact red States,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…In spite of this very small step we are taking with this bill, it is  insufficient to take on the enormous challenge of fighting fraudsters  in this country who will take advantage of those who have laid their  lives on the line for all of us.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  intend to vote ``yes.'' I yield back…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…simply craft a bill.  Republicans being in charge of the Senate and the House, they bring it  to the floor; we debate it; it either passes or it doesn't pass.\n\nIt has the advantage of going through committee and being considered  and having people weigh in on whether it is a good idea or not. But to  simply reinvent and pretend, if you will, that the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…accounting. We need new competition.\n\nSecondly, we need to go after negotiating with Big Pharma. Medicare  should be negotiating drug prices.\n\nThird, we should be stopping Medicare Advantage from ripping off the  American people. They are upcoding, and they are making people sicker  than they actually are. We should make competitive procurement for the  government.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692232/addressing-our-exploding-deficit"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…relationship to lessen tensions.\n\nSecond, if not renewed, we risk the possibility that each side will  go beyond the treaty's limit in a misguided pursuit of geopolitical  advantage.\n\nThird, there is no nuclear strategic gain from deploying more  warheads on more delivery vehicles. Our massive, largely invulnerable  nuclear arsenal is more than sufficient…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…pharmaceutical middlemen, also known as pharmacy benefit managers,  and achieving mental health parity by going after insurance companies  that mislead seniors in Medicare Advantage with lists of doctors that  aren't actually available. Americans have deep concerns about the state  of their healthcare, and these reforms represent a down payment on the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…similar to their own and the  management staff at these facilities.\n\nThe Democratic Party has tried to prevent people from working there,  saying that they are being taken advantage of, which is preposterous.  Anybody who looks at these packaging or light manufacturing facilities  will see immediately why you have to pay some people under minimum  wage.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694041/opportunities-to-stay-in-place-for-disabled-workers"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…who will live on the  street.\n\nIn 6\\1/2\\, 7 years, the Medicare trust fund is empty and your  hospital gets an 11 percent cut and much of the financing things like  Medicare Advantage and those actually just become, let's just say,  difficult.\n\nLet's walk through some of this. I pulled up this chart because I  haven't used it in a few months and I am realizing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…this funding benefits our own missile defense industrial  base, as it provides for coproduction activities and shared technology  development. It is certainly to our mutual advantage.\n\nWith that, I urge a ``no'' vote on the amendment.\n\nMr. Chair, I yield 1\\1/2\\ minutes to the gentlewoman from Minnesota  (Ms. McCollum), the ranking member.\n\nMr. CALVERT.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…operational, federally licensed spaceports capable of  delivering payloads to orbit. Managed by the Alaska Aerospace  Corporation, its remote location provides a strategic advantage,  reducing risks to populated areas and offering access to vital polar  and Sun-synchronous orbits. This capability is essential for Earth  observation, climate monitoring,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Mr. McDOWELL. Mr. Speaker, today we do what lifelong bureaucrats in  this town fear most: We cut their funding.\n\nFor far too long, Washington bureaucrats have taken advantage of the  American taxpayer, sending their hard-earned money to fund the corrupt  foreign aid complex, and pushing government funding for educational  programs that groom our…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692537/rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we do reconciliation? It is a way to get through the  filibuster in the Senate under the 1974 Budget Control Act.\n\nI have brought pieces of legislation to reform Medicare Advantage  because you have seen The Wall Street Journal and ProPublica stories  of, functionally, the criminality that is going on. The MedPAC report  basically shows hundreds and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…programs; the food stamp programs; the Pell grants. There is  program after program you get, but you would lose these programs if you  had both parents in a home.\n\nNobody takes advantage of all 90 programs, but I think it is probably  not unusual to have people take advantage of 6 or 7 programs. Then, it  would not be unusual for people who have a mother…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…young ladies like to keep that to  themselves, but we have to look past that.\n\nWe in Congress have to legislate forcefully. We have to go after  these bastards who are taking advantage of our babies every single day.  If we don't, this problem will continue to exist. I asked law  enforcement: What do you need? They need technology. They need us to  listen.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…joint efforts advance clean energy and agricultural  technologies and promote rural economic growth. As global competition  intensifies and our adversaries seek to gain an advantage by feeding  and clothing the rest of the world, it is vital that we strengthen and  preserve this interagency collaboration to keep pace through  innovation.\n\nThis bill will…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…centers alone is  predicted to increase by up to 20 percent each year over the next 5  years. Coal will help power them. It will give our industry an edge, a  competitive advantage. In turn, more workers will find that they get  steady, reliable paychecks. Coal miners will also get new  opportunities. All of America will get a boost.\n\nMore American…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…are already here illegally. You know, I am 100 percent  behind President Trump's effort to get rid of all Islamists who hate  our country, as I just previously said, take advantage of the system  when they come here. Don't defraud our government. Don't come here to  try to destroy us. Assimilate with the Americans in this country to  make our country…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to late fees and accelerated interest rates on  credit cards. That is why we are actually talking about overdraft  protection today, because time and time again people take advantage of  affordable, convenient, disclosed, not hidden overdraft protection so  that their family can avoid a late fee on a credit card, which she just  gave an excellent overview…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…challenge. We don't know  how these cases will turn out, so there is uncertainty at this moment  whether the whole redistricting war is going to end as a wash or with a  modest advantage for one party or the other.\n\nNow, it really shouldn't matter. I am against gerrymandering wherever  it occurs no matter which party stands to benefit, but this present  uncertainty…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…something that we know all too well  in my community. Wildfires continue to ravage every part of California.  Unfortunately, fire season is now all year long, and we must take  advantage of the technologies available to try to fight these terrible  tragedies.\n\nThe Advanced Capabilities for Emergency Response Operations Act, also  known as the ACERO Act, which…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…just about Montana. Energy security is national  security, and Montana's mining industry plays a vital role in ensuring  America and our allies maintain a strategic energy advantage over our  adversaries.\n\nWe can be sure of one thing: The people who benefit from America not  harnessing our abundant natural resources are currently sitting in  Beijing,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]