[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…district has $14 trillion of wealth. The income inequality in this  country soared.\n\nSo one of the things this group wants to do is to renew economic  revitalization in advanced manufacturing in these communities and to  have a real plan for new semiconductors, new robotics, advanced steel,  advanced automobiles, and have new factories and new industry come…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…jobs. It jeopardizes  tomorrow's breakthroughs, our competitiveness, and the livelihoods of  the next generation.\n\nThis is about whether America leads in clean energy, advanced  manufacturing, quantum computing and semiconductors, or cedes those  opportunities to competitors abroad. We are supposed to win all the  races and make us great again. We are falling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…subsidizes the  manufacturing, uses forced labor, and manipulates its currency.\n\nWe cannot cede our leadership to China or any other country. This  also means investing in advanced manufacturing, securing domestic  battery supply chains, and protecting the Inflation Reduction Act's  historic EV investments.\n\nCalifornia's Advanced Clean Cars II program would…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…everyone loves electric vehicles--my car has a traditional  internal combustion engine--but think of the national security  implications of falling behind in batteries and advanced manufacturing.  We see in Ukraine that the future battlefield is electrified.\n\nWe need to be pressing forward, not just in electric vehicles and  batteries, but on all fronts. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…energy supply chain, they would not have canceled $8 billion worth of  grants to over 300 energy projects across the country.\n\nThey would not have decimated the 45X Advanced Manufacturing  Production Credit, which sought to encourage more domestic  manufacturing and production of clean energy components.\n\nInstead, my colleagues across the aisle should…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…surrounding  cushion to help him go back for a second round.\n\nThat is what it is all about in America. If you want to be an  engineer or if you want to contribute to our advanced manufacturing  economy, we want your talent. With the Baird-Houlahan bill, what we are  going to do is see NSF do what it is already doing but double down for  a continuing educational…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…call home, the advancements in mobility, where are our  auto industry is innovating, growing, and moving towards.\n\nNow, Mr. Speaker, I came to Congress by way of an advanced  manufacturing research lab, and I was working with a lot of incredible  small manufacturers, mid-size manufacturers, and even large-scale  manufacturers in this space that the acronym…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Association with improved access and  management authority in the Apex Industrial Park.\n\nThe Apex Industrial Park is a critical driver of job creation,  logistics, and advanced manufacturing in southern Nevada and the  critical update provided by this bill would open the door to more  efficient growth, infrastructure investment, and regional coordination.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691120/apex-area-technical-corrections-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Foundation to leverage the unique investments  and expertise in a wide range of fields, including quantum science,  artificial intelligence, fusion energy, and, of course, advanced  manufacturing.\n\nAlongside these research partnerships, this legislation also  authorizes collaborative initiatives in education, training, and  development to build a stronger workforce…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…manufacturing systems.\n\nRather than enhancing new energy generation and bolstering good- paying jobs in the United States of America across all energy sectors,  including advanced energy manufacturing, the U.S. Department of Energy  has ceded ground to global competitors like Communist China.\n\nLast Friday, U.S. Secretary of Energy Chris Wright announced that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…not impose these  tariffs.\n\nThe harm to Connecticut is far from limited to just energy prices.  Some of the largest State industries--including aerospace, defense,  advanced manufacturing, medical devices--all rely on trade with Canada  to remain profitable. These industries source key production imports  from Canada, including aerospace parts, critical…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…pipeline is absolutely essential, Mr. Speaker.\n\nBecause of this Trump-Musk antiscience agenda undermining the  symbiotic relationship and threatening Michigan's future in advanced  manufacturing, environmental protection, and next-generation mobility  technologies--news flash, we had 40-plus new factories built and  developed in Michigan last year alone--the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…tell you this: New York-22 communities are resilient. We have  rebuilt before, and we are building again. We are building with Micron  and others, with investments in advanced manufacturing, with world- class dairy farmers and growers who continue to feed the Nation, and  with workers who never stop fighting for a better future.\n\nWashington should be our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…makes certain that America remains on course to  lead in space and does not cede ground to our competitors.\n\nThrough NSF, the bill prioritizes critical research and advanced  manufacturing that bolster private sector innovation, strengthen  university-industry partnerships, and train the next generation of  scientists and engineers right here at home--investments…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Duyne).\n\nMs. VAN DUYNE. Madam Speaker, the One Big Beautiful Bill Act that we  passed is wholly focused on unleashing growth for Main Street,  empowering expansion of advanced manufacturing, and delivering the  skilled job opportunities that will enrich people with valued learning  trades that help build American innovation, technology, and  infrastructure.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…industries, robust financial institutions, and dynamic  export sector.\n\nThe island plays a significant role in global supply chains,  particularly in the semiconductor and advanced manufacturing sectors.  Yet, despite its economic strength and proven track record of  responsible financial governance, Taiwan continues to be marginalized  and held to a second-class…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Bureaucracy grows, while real-world risks go  unaddressed.\n\nWe saw the same pattern play out in upstate New York. Micron is  making a historic investment in bringing advanced semiconductor  manufacturing back to the United States, creating thousands of good- paying jobs and strengthening domestic supply chains critical to our  national security.\n\nYet, even after…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Republican Senate, America is back.\n\nIt is a fact that inflation is down from 5 percent to 2.5 percent.  Gas prices have hit a 4-year low, averaging $2.95 a gallon. Advanced  manufacturing and industry are returning to U.S. soil.\n\nPresident Trump has secured over $8 trillion in investments that will  fuel job growth and create opportunity. The stock…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Here in Michigan, Turkish-American trade and investment have  contributed to local growth and job creation--totaling approximately  $545 million in 2024 alone. From advanced manufacturing and automotive  partnerships to agricultural exports, the economic link between  Michigan and Turkiye continues to strengthen our state's role in the  global economy.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the Department of Energy Research and       Innovation Act (42 U.S.C. 18641 and 18645), and section 973       of the Energy Policy Act of 2005 (42 U.S.C. 16313);\n\n(F) advanced manufacturing technologies, including       efficient storage systems and alternatives to high-      temperature processing, for the purposes of optimizing energy       consumption,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…thinking that supports the growth of a  versatile STEM workforce. Statistical analysis underpins everything  from the development of artificial intelligence to improving advanced  manufacturing.\n\nThis bill will allow us to teach these skills more effectively  through R&D and new curricula and methodologies. H.R. 730 also directs  the National Academies to…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…of Energy, to secure our  supplies of critical energy resources.\n\nWe know what is at stake with the next-generation economy: cutting- edge technologies, like AI and advanced manufacturing, hold tremendous  promise to lift up communities across the country with stable, good- paying jobs, while lowering costs for hardworking families.\n\nMr. Speaker, the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…2013  levels.\n\nI respectfully think my colleague's amendment goes too far in  eliminating this program. Again, things that EERE does well: geothermal  technologies, advanced manufacturing, and industrial efficiency  improvements.\n\nIt also includes essential work on critical materials that will lay  out the groundwork for technologies that will reduce…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…distributed ledger, data       storage, data management, and cybersecurity technologies.\n\n(iv) Quantum computing and quantum sensing.\n\n(v) Additive manufacturing.\n\n(vi) Advanced manufacturing and the Internet of Things.\n\n(vii) Nano technology.\n\n(viii) Robotics.\n\n(ix) Microelectronics, optical fiber ray, and high       performance and advanced computer hardware…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…promised when I took office to deliver for Virginia's  Fifth District. This bill does just that with more for the  Commonwealth, supporting the growing nuclear industry, advanced  manufacturing, and workforce development sectors. It also takes  necessary steps to address the extraordinary threats in the cyber  domain posed by AI and quantum computing.\n\nMr.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697799/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the Nation.\n\nThis project is a powerful example of how we strengthen our economy  by investing in our communities, empowering our workforce, and leading  the way in advanced manufacturing.\n\nI commend Alstom for their continued commitment to Hornell and thank  the skilled men and women who are driving this legacy forward.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and global energy demand is expected to  double by 2050.\n\nCoal is reliable, affordable, and essential to meet the increasing  power demands of the AI revolution and advanced manufacturing. The RMP  amendment locked up an astonishing 48 billion short tons of coal. That  is enough to meet U.S. coal demand for the next 116 years.\n\nMr. Speaker, 92 percent…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…the William Forrence  Health, Physical Education, and Recreation Building, the Ronald B.  Stafford Center for Arts, Science, and Technology, and the Institute  for Advanced Manufacturing among other improvements. The growth has  stemmed from their responsiveness to the needs of the local community  and businesses. This dedication is further seen in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}]