[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…to war and combat and then sending them home to live in squalor.\n\nWith regard to standing up to China, I introduced an amendment  requiring congressional approval before advanced AI chips, critical to  our most sophisticated weapons and intelligence systems, could be  exported to Beijing. It was blocked.\n\nI also proposed raising the Taiwan Security…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…self-conscious result of a military policy to  concentrate the Palestinian population into an ever-smaller slice of  land.\n\nThe starvation that we are witnessing today, it is an advanced and  accelerating stage of the military strategy that is being executed by  the Netanyahu government to force Palestinians out of northern Gaza and  to induce them to leave…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…people who are struggling to make every single dollar stretch.\n\nMs. PRESSLEY. Mr. Speaker, they are struggling to make every dollar  stretch because of the harmful policies advanced by your dictator in  chief. Vote ``no.''", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…address the complex challenges of spinal health, the  Foundation has created four specialized task forces led by experts in  their fields.\n\nThe Opioid Task Force which has advanced research on minimizing  opioid use while still optimizing pain relief.\n\nThe Bone Health Task Force promotes bone health screening protocols,  research, and public education.…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…higher resolution images, but  because of tariffs, they had to pay significantly more money to  purchase this machine. That is money they now can't use for other  things.\n\nAdvanced medical equipment like this is increasingly expensive under  the Trump administration. Add to that the Medicaid cuts in the big,  ugly bill and the end of the ACA tax credits,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…its use  of biotechnology to manufacture low-carbon concrete.\n\nWith global demand for building materials set to rise through this  century, we must prioritize investments in advanced materials science  and scale-up domestic manufacturing by fostering an innovation pipeline  that creates jobs and enhances our competitiveness on the world stage.  This bill…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…million was intended to support production of  synthetic graphite, including construction of a large plant in Alabama.  Also, $31 million was cut that was going to build an advanced glass  factory at the site of an old coal plant in Detroit.\n\nAs a result, the United States will have less capacity to support  real and reliable power. This bill does not…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…real worry-- that that technology, if transferred to the UAE, would be quickly  transferred to China, allowing China to be able to outpace us, to  outrun us in the race to advanced AI.\n\nBut the UAE knew that there was a way to get what they wanted, that  there was a way to change the policy of the United States, and it was a  $2 billion investment in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Yegidis (1995-2003), Maurice  Daniels (2005-2016), Anna Scheyett (2016-2021), and its current dean,  Philip Hong (2022-present).\n\nFor six decades, the School of Social Work has advanced the  University of Georgia's teaching, research, and service mission. It has  conferred more than 9,000 degrees in social work and nonprofit  management and leadership while…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…meetings about racism and fundamentalism, bringing together Christians,  Muslims and Jews for the purpose of advancing greater cooperation and  mutual understanding. He has advanced Christian-Muslim relations in  such places as former Yugoslavia, advocating for peace-building  measures to diffuse global conflict in the region, while supporting  many traditionally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…model reduces waste, improves efficiency, and  strengthens the capacity of frontline communities to withstand and  recover from future disasters.\n\nGood360's innovative use of advanced data and resource matching  technology accelerates donation routing and optimizes logistics. This  system enables the delivery of critical goods up to three times faster,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…resilience, and creativity to produce an incredible generation of  workers. Soon, their vision became a reality as WRTP BIG STEP developed  pre-apprenticeship programs and advanced training courses that  increased the number of minority workers, ensuring everyone has a  pathway to a quality career in the trades.\n\nOver the last 50 years, BIG STEP has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Whether you live in Albany, New York  State, or any other part of this great country, there is a bold, vital  message that comes from Albany: The future of chips and the most  advanced semiconductor chips is here in America--not overseas, not  China.\n\nThese chips are vital to so many parts of our lives--our phones and  computers and our cars and our national…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…ICE  warrants, and there are other things.\n\nI might add, just so that the people on the committee here  understand, in June of 2025, the House Committee on Appropriations  advanced the fiscal year 2026 Department of Homeland Security  appropriations bill. It included bipartisan reforms and safeguards  designed to protect U.S. citizens and vulnerable…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Foundation to leverage the unique investments  and expertise in a wide range of fields, including quantum science,  artificial intelligence, fusion energy, and, of course, advanced  manufacturing.\n\nAlongside these research partnerships, this legislation also  authorizes collaborative initiatives in education, training, and  development to build a stronger…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…contributions of Mr. Charles ``Charlie'' Webb. Charlie graduated high  school in Colorado in May 1970 and in August 1970 reported to Fort  Knox, Kentucky. for Basic Training and Advanced Individual Training at  the Armor School. He was assigned to the 2nd Armored Cavalry Regiment  in January 1971 in Bind Lach serving as border patrol between Germany  and Czechoslovakia.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Secretary of Health and Human       Services shall submit to the Congress a report on the Abraham       Accords Office, including--\n\n(A) an evaluation of how the Office has advanced progress       toward conformance with Food and Drug Administration       regulatory requirements by manufacturers in the Abraham       Accords countries;\n\n(B) a numerical…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…second place finish in  the Lancaster-Lebanon League, and fourth place finish in the district  3A team tournaments. Ending with a 16-4 record, the Hempfield Black  Knights advanced to states. On May 24, Lehman and Garcia defeated their  opponents from Dallastown after climbing back from a large deficit.\n\nLehman and Garcia crowned an excellent season…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692412/congratulating-cooper-lehman-and-braylen-garcia-tennis-doubles-champions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…William Clark, who is stepping down as chair of the Okefenokee Swamp  Park Board of Trustees after 15 years of hard work and dedicated  service.\n\nSince 2010, Dr. Clark has advanced the mission of Okefenokee Swamp  Park, promoting a community connection with nature and preserving its  ecological health through stewardship, education, and outdoor  recreation.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…dedicated to the study of classical  antiquity and the history of glass. Through these roles, she has  strengthened professional collaboration, supported emerging leaders,  and advanced the highest standards of museum practice.\n\nMr. Speaker, I ask that the United States House of Representatives  join me in recognizing Dr. Karol Wight for her exemplary contributions…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697880/recognizing-dr-karol-b-wight-on-her-retirement"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…leadership  within the Oneida Nation. He was elected Chairman of the Oneida  Business Committee in 1995 and again in 2005, where he advocated  tirelessly for policies that advanced Indian gaming, economic  development, healthcare, higher education, and the preservation of the  Oneida language. His long-term vision was to build a strong,  sustainable…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…States Capitol Historical Society is  recognizing Patrick as a recipient of the Freedom Award.\n\nThe award serves to recognize and honor individuals and organizations  that have advanced greater public understanding and appreciation for  freedom as represented by the U.S. Capitol and Congress.\n\nMadam Speaker, there is no question in my mind that Patrick McHenry…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695396/united-states-capitol-historical-society-recognizes-patrick-mchenry"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…together others from  many faiths to work towards better cooperation and understanding.  Through dialogue and visitations, the Ecumenical Patriarch Bartholomew  has significantly advanced Orthodox relations with the Roman Catholics,  Lutherans, Baptists, and others through visitations and open dialogues.\n\nIn addition, His All Holiness has visited several Orthodox…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "John Thune", "party": "Republican", "sentence": "…this bill  because their anti-Trump hysteria knows no bounds.\n\nHere are the facts. Nicolas Maduro is a narcoterrorist who helped  lead the so-called Cartel of the Suns. He advanced large-scale drug  trafficking, armed an illegitimate militia, solicited arms for a  terrorist organization, presided over unfree and unfair elections,  targeted political…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…nations. Here in Michigan, Turkish-American trade and investment have  contributed to local growth and job creation--totaling approximately  $545 million in 2024 alone. From advanced manufacturing and automotive  partnerships to agricultural exports, the economic link between  Michigan and Turkiye continues to strengthen our state's role in the  global…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…U.S.C. 18644);\n\n(C) modeling and simulation, machine learning, artificial       intelligence, data assimilation, large-scale data analytics,       predictive analysis, and advanced computational, storage, and       networking capabilities in order to optimize algorithms for       purposes related to energy and climate;\n\n(D) quantum information sciences,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…selection boards. Sec. 248. Behavioral health. Sec. 249. Travel allowance for members of Coast Guard assigned to                Alaska. Sec. 250. Tuition Assistance and Advanced Education Assistance Pilot                Program. Sec. 251. Recruitment, relocation, and retention incentive program for                civilian firefighters employed by…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…their beneficiaries.\n\n``(4) Developing methods to monitor fraud and scam metrics       within the Department to--\n\n``(A) provide internal and external reporting;\n\n``(B) enable advanced data analytics; and\n\n``(C) facilitate proactive and robust fraud and scam trend       identification.\n\n``(5) Developing comprehensive training plans for       Department employees…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…in 1984. After graduation, what began as a brief visit to his  alma mater evolved into a lifelong career of service. Starting as an  admissions representative in 1984, he advanced through various  leadership positions before being selected as President in 2004 at age  42, making him the youngest president in the school's history.\n\nDuring Collins' tenure…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "James Risch", "party": "Republican", "sentence": "…progress in the Indo-Pacific       region.\n\nThe proposed sale will improve Japan's capability to meet       current and future threats by providing stand-off capability       via advanced, long-range strike systems for employment on       Japan Air Self-Defense Force fighter aircraft. Japan will       have no difficulty absorbing these articles and services…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}]