[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…television. But within the last decade, satellite capabilities have  become more sophisticated and are now being woven into the fabric of  our mobile networks. With these advancements, mobile consumers now have  even greater connectivity and the comfort of knowing they can reach  first responders and loved ones in a time of need, no matter where they…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693468/precision-agriculture-satellite-connectivity-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…breakthroughs in clean energy and technology--our greatness has always  come from empowering science, not mocking it.\n\nTrump and Republicans are working to gut these critical advancements.  Their tactics echo the worst chapters of history, and they mirror the  tactics of authoritarian regimes today. If we fail to call this out, we  risk normalizing it.\n\nI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I rise today to recognize five pioneering  Californians who this year were awarded Nobel Prizes for their  groundbreaking advancements in medicine, physics, and chemistry.\n\nJust last month, the Nobel Foundation announced the annual recipients  of their world-renowned awards, recognizing those who ``conferred…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…I met with Rochelle Tittmann, a mom of four, who was  diagnosed with cancer when she was 29 weeks pregnant 8 years ago. By  the grace of God, her family, and the medical advancements made  possible by the HHS, by the National Institutes of Health, by the CDC,  she is here today, and her youngest daughter, Rae, is in the second  grade.\n\nThese are the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690049/who-we-are-fighting-for"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…the good Representative I am of the State of Michigan, I believed that  the moonshot of the next 50 years, and I still do, is hailing from the  place that I call home, the advancements in mobility, where are our  auto industry is innovating, growing, and moving towards.\n\nNow, Mr. Speaker, I came to Congress by way of an advanced  manufacturing research…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…support of H.R. 1770, the Consumer  Safety Technology Act.\n\nOur consumer protection agencies play a critical role in ensuring  unsafe products do not enter the U.S. market. Advancements in  technology, especially as it relates to artificial intelligence, have  the potential to help alleviate the stress some of these agencies may  face in being underfunded…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693412/consumer-safety-technology-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…brain over time. It leads to a progressive loss of control over  movements, thoughts, and emotions. There is currently no cure. However,  there is hope. Because of ongoing advancements in medical research and  continued investments in biomedical science, we are closer than ever to  the possibility of breakthrough treatments and perhaps even a cure in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…tired playbook of excuses. We know that the big  oil industry sees California's clean cars and clean truck sales as  existential threats. California has made tremendous advancements not  just in technology but in markets, but that is why the fossil fuel  industry has launched an all-out assault on California's rules.\n\nI will give you just one example.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…workplaces, in our schools, and all across this country, as the  administration has armed itself with Project 2025 and has sought to  redefine American society and roll back advancements of the civil  rights era.\n\nWe see it in the executive orders that Donald Trump signed in his  first days in office, terminating diversity, equity, and inclusion  across…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…was last reauthorized  in 1992. We should ensure that it continues to have the authorities it  needs to implement many of our Nation's broadband efforts and  technological advancements in such areas as spectrum management and  artificial intelligence.\n\nH.R. 2482 helps achieve this goal. This bipartisan bill reauthorizes  the NTIA and elevates its leadership…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…Health Bureau,  which oversees important programs that support children and pregnant  women.\n\nCountless women across the country have become mothers thanks to the  incredible advancements in IVF, and a good number of this President's  women supporters supported him because he vowed to make the treatment  more accessible. How dare this man take that away from…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Huntington's disease is a rare genetic  disorder that slowly damages the brain over time. There is currently no  cure. However, there is hope, thanks to Medicaid research advancements  and investments.\n\nRachel recently reached out to me and shared her brave story as she  grieves the loss of her father, whom she tragically lost to  Huntington's. She has…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691303/recognizing-huntingtons-disease-awareness-month"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…has created a strong and cohesive unit, dedicated to the  mission and each other.\n\nUnder Colonel Schmitt's command, Mission Delta 4 has achieved  numerous milestones and advancements, contributing significantly to the  defense of our Nation. His expertise and strategic acumen have been  instrumental in navigating complex challenges and adapting to the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693489/recognizing-colonel-ernest-r-bobby-schmitt"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…upon federal grants, a       testament to the world-class quality of our research and its       leadership in the biomedical field. These grants enable       groundbreaking advancements that position the United States       at the forefront of scientific information.\n\nI had planned to apply for a federal grant in 2025 to       further my research, but with…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Americans  and our communication networks from threats posed by rapidly evolving  next-generation technologies. It also ensures that the standards used  to build technological advancements are designed from the start to be  safe and secure.\n\nH.R. 2449 establishes a task force at the Federal Communications  Commission to study sixth-generation, or 6G, technologies…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…there is food on our tables, clothes on our  backs, and fuel in our vehicles. However, beyond that, agriculture is  science, technology, and innovation. Its cutting-edge advancements will  drive the future of food production and environmental stewardship.\n\nThe blue FFA jacket is more than just a uniform. It symbolizes hard  work, commitment, and leadership.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…control center, and cutting-edge telemetry capabilities.  Furthermore, the PSCA is a key contributor to economic development in  Alaska, creating jobs, fostering technological advancements, and  attracting investment from domestic and international space companies.\n\nThe Alaska Aerospace Corporation was established in 1991 by the  Alaska Legislature and has…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…opportunity to take a  piece of legislation that is over 100 years old in its origin and  modernize it into the 21st century. That is what we have done with the  technological advancements and the transparency.\n\nI am very proud of the work that our Agriculture Committee has done.  I certainly would encourage a ``yes'' vote on this piece of  legislation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…infrastructure.\n\nThe implications extended far beyond Southwest Virginia. This mission  laid the groundwork for nationwide drone delivery applications and  inspired regulatory advancements by the FAA. It served as a springboard  for companies to explore widespread drone delivery as a viable,  scalable solution.\n\nMr. Speaker, as we reflect on the 10th anniversary…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…threats related       to the misuse of connected or autonomous vehicles, Advanced       Driver Assistance System (ADAS) -equipped vehicles, ride-      sharing services, and advancements in automotive       technologies, including cybersecurity threats to underlying       software technologies (including artificial intelligence-      enabled technologies)…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Trusted Communications Networks Act of 2019, as added by       subsection (a).\n\nMr. BILIRAKIS.\n\nMr. Speaker, I rise in support of H.R. 2458, the Secure Space Act.\n\nAdvancements in satellite technology have enabled broadband internet  to be deployed at commercial scale. We must protect these systems from  foreign adversaries. The Secure Space Act…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690259/secure-space-act-of-2025"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…congressional  district in Northeast Ohio and throughout the Nation. Innovation in  medical technology leads to better outcomes and a higher value of  overall care. Broad advancements, including state-of-the-art non- invasive precision treatments, among others, have the capacity to  revolutionize patient care and improve health outcomes.\n\nIt is sobering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695861/recognizing-september-as-national-prostate-cancer-awareness-month"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…enforcement: What do you need? They need technology. They need us to  listen. They need funding. They need our help.\n\nThis is an American problem. It will not go away. With the  advancements of technology that we are seeing today, they will reach  out and touch every single person they possibly can because it makes  them money.\n\nThis is like cancer, unfortunately.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today in strong support of H.R. 859, the  Informing Consumers About Smart Devices Act led by Representative  Fulcher.\n\nIn recent years, we have witnessed remarkable advancements in  consumer goods technologies. While these innovations certainly make  daily life more convenient, they also carry the risk of collecting data  from users, often without…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…individual growth to occur.\n\nWe are a long way from getting to the point where we can say we are  done with this. We will never be done with it. There will always be new  advancements in therapy, new advancements in dealing with the human  mind, the brain, the least explored and least understood part of the  human body, but it is who we are as God's creatures…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…national security, our  economic strength, and our global position in the artificial  intelligence race.\n\nThis amendment strengthens our ability to safeguard America's  advancements in artificial intelligence by ensuring we identify,  monitor, and address vulnerabilities that foreign adversaries could  exploit to the detriment of our national interests.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…only do you give the customers  of that larger institution, that successor merged institution with  greater resources to provide lower cost services, more technological  advancements, but, yes, you allow them to invest in what? They invest  in consumer protection.\n\nYou allow them to make sure that people in their organization are not  making mistakes…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…solar system in interstellar  space, continue to operate with DOE's groundbreaking propulsion  systems.\n\nThis DOE-NASA partnership has driven and will continue to drive  advancements in high-performance computing, keeping us at the forefront  of research and development.\n\nAdditionally, their collaborative work on nuclear energy is vital to  establishing…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…role in America's  ability to stay ahead of international competitors like China on  spectrum policy.\n\nI am confident that ITS will continue to contribute to innovative  advancements that are crucial to our global competitiveness.\n\nThis bill also directs ITS to establish an initiative to support the  development of emergency communication and tracking…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693438/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…fact,  in the last 2 months, DOE has taken 52 actions to secure our grid and  lower energy prices.\n\nIt is clear that our Nation is on the precipice of great  technological advancements that are straining our electricity supplies,  primarily driven by energy-intensive users such as data centers and  domestic manufacturing.\n\nThe timing of projected demands…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}]