[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…revolution has contributed to our historic energy  independence and cut our CO2 emissions from energy  production. That is true, but even small leaks of methane wipe out that  advantage from a climate perspective.\n\nWorld markets and domestic politics are demanding that the industry  can prove with real credibility and transparency that we fixed this  methane…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…that a  nation of 340 million people can project power and values across a  globe of more than 8 billion. Yet, tragically, President Trump has  systematically taken apart the advantage these allies give us. He has  insulted the leaders of Canada, Germany, France, and the United  Kingdom--our closest democratic allies--not to mention countries like  Denmark.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…technology, and yes, we should innovate on finance. However, we also  have to have advanced manufacturing in this country to remain the world  superpower.\n\nPeople say comparative advantage, but comparative advantage is you  get to choose what your comparative advantage is in, Mr. Speaker. If  China had just done comparative advantage, then they would have been…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…cuts that you are  talking about, inevitably we have to look at Medicaid, Medicare, and  Social Security.\n\nWe look at the fact that in Virginia, just eliminating Medicaid  Advantage is 660,000 Virginians. We see that 46 percent of the children  in America receive their healthcare through Medicaid. When we look at  Medicare, it is beyond belief what that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…institutions.  That is what is prohibited. It allows both Native American Tribes and  startup incubators to host them.\n\nI am aware of several instances where bad actors took advantage of  the halo, if you will, of being in a church to get investments that  were inappropriate. This has been an issue for Ranking Member Waters.  She has negotiated changes…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…vote ``no'' on this resolution.  If they keep it up, I am going to name all of the Republicans who took  PPP money. Is that socialism? I am going to name them who are taking  advantage of other programs that they call socialist. I am going do it  if they keep this up.\n\nMs. WATERS. Mr. Speaker, for those who are expecting their Social  Security checks this…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…at the bit to get more data on exactly what happens  if they explode one of their untested weapons.\n\nIf we do this, we would be giving away the most significant strategic  advantage that our country has, which is this huge database of exactly  what works and what does not work in detailed and very technologically  aggressive designs for our nuclear weapons.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…old.\n\nHer husband just qualified for Medicare, and she felt relieved that  that worry about his health insurance would be take care of. She then  found out that the Medicare Advantage Program that she would be having  him sign up for runs $200 a month. Her original premium that she is  paying for health insurance for him and for her is $279 a month.\n\nSo…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congress called Members of Congress lunatics.\n\nThat was an act of incivility.\n\nThere comes a time, Mr. Speaker, when you cannot allow the  President's incivility to take advantage of our civility, and that is  what is happening in this country. His incivility is overwhelming our  civility. We cannot allow this. That act of incivility was in direct…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…other is, there is a lack of  confidence on the administration about the capacity of the American  people, the American innovators, the American entrepreneurs to take  full advantage of solving the issue of climate change by building out  clean energy, by doing efficiency.\n\nThat really, really works. And a confident person, a confident  country doesn't…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688164/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…American progress has also depended on  those who persevered in the face of prejudice. Their story shows that  diversity is not a threat nor a weakness. It is a competitive  advantage. It is a source of national strength. It has driven  innovation, expanded opportunity, and is a common theme throughout our  shared American story.\n\nIn a time of rising division,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…The vast majority of this  aid served as a lifeline, helping to keep small businesses afloat  during troubling and uncertain economic times.\n\nUnfortunately, bad actors took advantage of the program early in the  pandemic when SBA removed or weakened internal controls. Upon taking  office, the Biden administration reinstituted longstanding antifraud  controls…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…In spite of this very small step we are taking with this bill, it is  insufficient to take on the enormous challenge of fighting fraudsters  in this country who will take advantage of those who have laid their  lives on the line for all of us.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  intend to vote ``yes.'' I yield back…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…like Social Security and Medicaid.\n\nThe fact is that American families today are living paycheck to  paycheck. Some of the biggest corporations in the country are taking  advantage of it, all while Americans are paying more for less due to  corporate price gouging and shrinkflation while the CEOs of the  Nation's largest grocery stores and supermarkets…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…automotive, industrial, defense, and medical companies. The close  proximity to E.J. Basler Co. and its valuable services offer companies  in Illinois' fifth district a competitive advantage and drive economic  development within the district.\n\nMr. Speaker, I ask my colleagues to join me in celebrating the  longstanding dedication and success of E.J. Basler Co.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692550/recognizing-ej-basler-co"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…have these programs which are conditioned upon not marrying somebody  with an income, but they even have benefits that are sometimes superior  to people who are not taking advantage of these programs.\n\nI mentioned Robert Rector and what he said at the relevant hearing.  The penalty for getting married obviously varies from person to person,  but, in…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…SCHWEIKERT.--The Wall Street Journal articles from the last year?  I think they have done five or six major, major exposes on something we  called Medicare part C. It is the Medicare Advantage. It was the sort  of managed care version within Medicare option that was developed by  Republicans in 2005.\n\nOne of their articles basically says that they identified about…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "John Thune", "party": "Republican", "sentence": "…clear--that any damages awarded  as a result of claims brought under this statute would be forfeited to  the U.S. Treasury and not be allowed for an individual Member to take  advantage of.\n\nJust to be clear, no personal enrichment, accountability, and, I  think, protection for the article I branch of our government, which, in  my view, based on what we…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…reputation for building the  ``Cadillac of Firetrucks.''\n\nThough Young Fire closed in 1991, Dick's passion for innovation never  waned. In 1993, he launched the Performance Advantage Company in  Lancaster, which continues to design and distribute tool and equipment  mounting solutions for the fire service, military, and other industries  in over 38 countries.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Mr. McDOWELL. Mr. Speaker, today we do what lifelong bureaucrats in  this town fear most: We cut their funding.\n\nFor far too long, Washington bureaucrats have taken advantage of the  American taxpayer, sending their hard-earned money to fund the corrupt  foreign aid complex, and pushing government funding for educational  programs that groom our…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692537/rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…American people, and help our  brothers and sisters get healthier.\n\nThat means taking on farm bills, nutrition policy, how we deliver  healthcare. Maybe things like Medicare Advantage and these things  should be rewarded for making their populations healthier instead of  running around scoring them as sicker. There are solutions here.\n\nWe have known this…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…similar to their own and the  management staff at these facilities.\n\nThe Democratic Party has tried to prevent people from working there,  saying that they are being taken advantage of, which is preposterous.  Anybody who looks at these packaging or light manufacturing facilities  will see immediately why you have to pay some people under minimum  wage.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694041/opportunities-to-stay-in-place-for-disabled-workers"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…helped build a campaign from the ground up. Together,  we delivered a victory many said was impossible, defeating an incumbent  in a district with a 2-1 Democratic enrollment advantage. That race was  the foundation for everything that has followed.\n\nIn Albany, Nate served as my chief of staff and helped lead one of  the most active offices in the State…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…sector with improvements in efficiency, security, and transparency. We  need to make sure the Federal Government is reaping the same benefits  and using technology to its advantage.\n\nThis bill would not only make these agencies more effective, but it  would protect consumers in the process.\n\nMr. Speaker, I urge my colleagues to join with me in voting…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…conversations that focused on the need to extend the  progrowth policies of the Tax Cuts and Jobs Act.\n\nOver 17 visits across my district, I spoke with our seniors on  Medicare Advantage. I spoke with Hoosier farmers on National Ag Day at  our Purdue Extension facility in Johnson County. I heard from our  Indiana Realtors--and no one knows our communities…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689234/all-policy-is-local"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…table, we can promote fair competition, protect our  national security, and prevent our adversaries, like China, from  shaping the future of global communications to their advantage and to  our detriment.\n\nMr. Speaker, I appreciate the partnership of Representatives Dingell,  Walberg, and Clarke, as well as the work of the Energy and Commerce  Committee,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693510/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$3 trillion of savings. We  wrote the bills.\n\nWe had Ph.D. economists help us model them and get our numbers right.  We got a preliminary number from CBO that the Medicare Advantage  modernization saves $1.8 trillion, making it the biggest savings bill  in U.S. history.\n\nMr. Speaker, guess how many cosponsors we have? Zero. Zero because it  is hard,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…I have stood on  this floor many times, Mr. Speaker, to speak out for victims and  survivors of people who have been abused and against anyone who breaks  the law or takes advantage of an innocent person.\n\nWe will not be characterized as insensitive to that, but House  Republicans  who didn't sign the discharge petition remain focused on truth,  accountability,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…technology, and  infrastructure.\n\nIn north Texas, we are in a perfect position to lead this new era of  American growth. Our businesses and our workforce are ready to take  advantage of these opportunities. Whether they are in energy, advanced  manufacturing, law enforcement, education, or technology, north Texas  has something for everyone.\n\nThat is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…as their first partner and  our allies over dictatorships like Russia and China. It is essential  that these countries walk the walk.\n\nAmerican largesse will not be taken advantage of by those who accuse  the United States of being part of a global war party or the global  deep state.\n\nMadam Speaker, I urge my colleagues to support this measure and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]