[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…mechanism. In fact,  they objected--many of them--to a standing army at all. But the concept  of a military force defending the United States was that it be aimed at  foreign adversaries and enemies. The threats from abroad were its  target, not internal policing, not problems of law enforcement within  the homeland.\n\nThat is precisely what President Trump…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…appalling to see our President of these United States, expected  to be a reliable standard-bearer of democracy, align himself and as a  result ourselves so closely with our adversaries, even organizing a  sit-down to determine the fate of Ukraine without Ukraine at the table,  and without the input of our European allies at all.\n\nWhatever comes out of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…our national security by giving regulators the  tools they need to track cross-border transactions and stop digital  assets from being used to evade sanctions or fund our adversaries.\n\nThe bill is not perfect, and it does not resolve every issue. Like  many of my colleagues, I am deeply concerned about the Trump family's  potential conflicts of interest…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Commander of U.S. Cyber  Command. The demands of this job are mind-boggling. The cyber threat to  the United States cannot be overstated. And, as SALT TYPHOON  demonstrated, our adversaries have succeeded in inflicting serious  damage to U.S. national security. The Commander of CYBERCOM needs to  have a sophisticated understanding of this threat and how it…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700213/nomination-of-ltg-joshua-m-rudd"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…limitations for that liability is 5 years, meaning future  administrations could apply those penalties retroactively.\n\nSo simply put, we cannot continue to allow foreign adversaries to  control technology that can fuel domestic and political polarization  and civil unrest. We need the President to follow the law that Congress  passed and bring TikTok…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…whether to allow oil development in  the Arctic, America's energy landscape looked very different. We were  importing significant amounts of oil, much of it from our political  adversaries. Oil prices were rising, and U.S. energy could not meet  demand.\n\nYet, even in that context, in those challenging years, for decades  and across both political parties,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…applying the Secure and Trusted framework to the satellite  industry, we will take another crucial step toward protecting the  public from untrusted entities and our foreign adversaries. The  requirements in this legislation will not only benefit our Nation but  will also help further the United States' ability to protect our  allies, as they, too, rely…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690258/secure-space-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…offers clear advantages for millions of  American workers. AGOA is essential to also protecting U.S. foreign  policy interests in Africa.\n\nAs we speak, China and other U.S. adversaries are trying to undermine  the African Continent to do this kind of work. In fact, Chinese  officials seek to deepen China's commercial ties with African  countries, prevent…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…here in the United States that should be getting to the  children who need it.\n\nEvery day that the United States fails to provide this aid is a day  that China and our other adversaries have an opportunity to step into  the void and earn goodwill around the world.\n\nAs the Secretary pointed out yesterday--and Secretary Rubio said  this--China's generosity…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…by the fact that we are at a  place where we have maligned others in the past for brutish  isolationism and for colonial instincts that we have long condemned in  our own adversaries.\n\nMr. Speaker, I urge my colleagues on both sides of this aisle to vote  ``yes,'' to do our jobs so that we may reaffirm our authority and rein  in reckless action.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…security clearances and knowledge of their Departments'  most sensitive programs. Their service is vital to our national  security. Thousands were fired without cause. Our adversaries couldn't  be happier, and they may be profiting from those mistakes right now.\n\nThese cuts come at a time when we are prioritizing--we in the U.S.  Senate--funding to expand…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…or  many of the other perks of office. He is using it for his own personal  ends and weaponizing the Department of Justice against his personal  opponents, his political adversaries--a violation of basic norms of the  Department of Justice and of our democracy.\n\nHe is prosecuting political enemies in courts that he has filled with  MAGA zealots and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…military force. We have not done so.\n\nNow, the third circumstance in which a President is authorized to use  force is in the event of imminent threat of attack from our  adversaries. And that is simply not the circumstance here.\n\nInstead, what the administration seems to be relying on is a claim  that it has the power, somehow, to put organizations…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…democracy.\n\nThis is our moment. This is our moment to save democracy. I know it  sounds like an exaggeration to say that our democracy is now under  attack, but it is from adversaries and enemies abroad--China, Russia,  Iran, North Korea. But we also have to make sure that we safeguard our  liberties at home against attack and efforts to undermine them,…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…important step to provide Americans with the  confidence to trust that the devices they use in their homes to connect  to the internet are free from the influence of our foreign adversaries.\n\nH.R. 866 accomplishes this objective by requiring the Secretary of  Commerce, acting through the Assistant Secretary of Commerce for  Communications and Information, to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…enforcement personnel in detaining the illegitimate President of  Venezuela, someone who had become the head of a drug cartel and who was  working with our most concerning adversaries all around the world,  whether it is Cuba, whether it is Iran, whether it is Russia or China.\n\nAnd, in fact, Venezuela had become a hub for illegal drug  trafficking, along…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…For decades, the United States has led the development of next- generation wireless technology. To maintain our technological  leadership and defend against our foreign adversaries, we must continue  our leadership in standards development, including our participation in  global, industry-led standards bodies.\n\nWithout participation by U.S. agencies…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…50 years later, the answer to this problem lies in our ability  to reshore essential energy production as well as refining facilities  that can absolutely compete with our adversaries.\n\nImportantly, Mr. Speaker, the Trump administration has prioritized  opportunities to combat undue influence from those same adversaries.  For instance, last week, the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…global leader in the development and deployment of artificial  intelligence. Maintaining that leadership requires vigilance against  supply chain vulnerabilities that foreign adversaries can exploit. Our  Nation has already faced significant challenges in scaling artificial  intelligence infrastructure. We cannot allow foreign manipulation or  interference…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…President Biden through the  failed Inflation Reduction Act does nothing but shackle our energy  producers, raising costs for consumers, and forcing our allies into the  hands of adversaries.\n\nBy repealing the Biden administration rule, we can deliver on the  mandate that Americans voted for in November and unleash American  energy production. This will allow…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688176/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…any foreign person identified pursuant to subparagraph       (A) has been subjected to sanctions imposed pursuant to       sections 231 and 235 of the Countering America's Adversaries       Through Sanctions Act (22 U.S.C. 9525 and 9529).\n\n(b) Form and Availability.--\n\n(1) Form.--The report required by subsection (a) shall be       submitted in unclassified…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…in Europe.\n\nThe proposed sale will enhance Denmark's capability to meet       current and future threats by providing a credible force that       is capable of deterring adversaries and participating in NATO       operations. The proposed sale will support its goal of       improving national and territorial defense as well as       interoperability…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698533/arms-sales-notification"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to find the  benevolence was gone and the all-powerful government was still there.  Let that be a lesson to our misguided countrymen.\n\nThis should also be a warning to our adversaries around the world  that the Monroe Doctrine has been revived and that America is again  willing and capable of defending the New World from the intrigues of  the old.\n\nEvery…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…regions of  the world important to America's strategic interests.\n\nHunger can drive children to join militias or nations to descend into  chaos, opening up an opportunity for adversaries to step in and coerce  a country for natural resources or military capabilities.\n\nHunger fuels desperation, and desperation fuels unrest. In the Sahel  region of Africa,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Farm Service Agency, including  support for $10.5 billion in capital access for farmers and ranchers.  And it supports efforts to track foreign-owned land to prevent our  adversaries like China from buying up America's farmland.\n\nIt also makes investments in rural development programs at USDA. In  South Dakota, that money goes far in supporting water…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…proprietary  information, or trade secrets.\n\nThis allows cybersecurity vulnerability to be addressed and data to  be secured before it is exploited by malign actors, including our  adversaries. My colleagues know that malign actors affiliated with  China, Russia, Iran, and others are after us all day, every day, 365  days a year.\n\nThese vulnerability disclosure…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…it. They buried it.\n\nMr. Speaker, the American people deserve the truth that exporting  American LNG strengthens our country. U.S. LNG exports replace dirtier  fuels from adversaries like Russia and Iran. In fact, during Biden's  LNG export ban, Russia overtook the U.S. as the lead supplier of gas to  Europe. In no world was this good for the American…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…is the  first step in allowing the State of Alaska to acquire lands that are  critical to two essential projects: Ambler Road and the Alaska LNG  pipeline.\n\nCurrently, our adversaries have a choke hold on worldwide mineral  supply chains. Alaska, our 49th State, has rich deposits of 49 out of  the 50 minerals on the critical minerals list.\n\nWith such…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…campus, the American people should know it.\n\nI don't see why anybody would have a problem with this. It is clear.  We are talking about national security at a time when our adversaries  are on the move.\n\nI will note my sincere gratitude to both the chairman of the  Education and Workforce Committee as well as the committee staff for  working with my team…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…not less, and at the same time, we better not be taking any  generation offline.\n\nRight now, we are scheduled to take 115 gigawatts of power offline in  this country. Our adversaries in Communist China are doing what? They  are outproducing us. We are projected to need 170 gigawatts on top of  that.\n\nIt is time that people wake up. We have an all-of-the-above…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}]