[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…you  did not vote for this. This is ridiculous. It is preposterous and it is  just stupid.\n\nYesterday, it was reported that the Secretary of Defense, the  National Security Advisor, and the Vice President leaked war plans to a  journalist. This is the same administration that accidentally fired  nuclear scientists and engineers who maintain our nuclear…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…over the  objection of his Secretary of Defense General Jim Mattis; over the  objection of his Secretary of State Rex Tillerson; over the objection  of his National Security Advisor General McMaster; and over the  objection of his Chief of Staff General John Kelly.\n\nHad President Trump, in his first administration, not torn up that  agreement, we would…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…SCHNEIDER. Mr. Speaker, I am proud to rise today to recognize and  express my deep appreciation and gratitude to Emma Weir, who served as  Communications Director and Senior Advisor for the New Democrat  Coalition over the past 4 years.\n\nEmma has been an extraordinary part of our team--bringing not only  her sharp communication skills and strategic insight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Sergeant Haynes served as the Senior Enlisted Airman for  Space Base Delta 2 at Buckley Space Force Base in my home state of  Colorado. In this crucial role, she was the principal advisor to the  installation commander, overseeing the morale, welfare, training,  climate, readiness, and professional development of over 1,000  personnel. Her leadership was instrumental…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "Ms. BUDZINSKI. Mr. Speaker, I rise today to recognize the service of  and express my deep gratitude for my agriculture policy advisor, Aleksi  Knepp, for her outstanding service to my office over the past 2\\1/2\\  years.\n\nSince joining my team in 2023 as legislative assistant, Aleksi has  been entrusted with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…work on the staff  of the New Democrat Coalition and later her work in the Office of  Congressman Eric Swalwell, where she served as a senior legislative  assistant, senior advisor, and inaugural director of Future Forum.  During that time, Sarah also earned her Master of Arts in Security  Studies from Georgetown University.\n\nAt the start of the 116th…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695833/recognizing-sarah-kaplan-feinmann"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Governor and Executive Director of the  Colorado Department of Higher Education, becoming the first person in  our state's history to hold both roles at once. Joe was a strategic  advisor to then-Governor John Hickenlooper to increase the state's  investment in higher education and expand opportunities for students  from low-income backgrounds. Throughout his…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689302/recognizing-chancellor-joe-garcia"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…resignation from their positions. Secretary of Defense Pete  Hegseth, CIA Director Radcliffe, Director of National Intelligence  Gabbard, Secretary of State Rubio, National Security Advisor Waltz,  Chief of Staff Wiles, and Vice President Vance were among those  involved in the plans Hegseth shared against DOD policy on a Signal  group chat on unsecured, nongovernment…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689228/responding-to-signal-chat-leak"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…``Journey to Reconciliation,'' where white and  Black people across the South rode buses together to challenge  segregation laws, a precursor to the Freedom Rides.\n\nRustin was an advisor in Martin Luther King, Jr.'s inner circle as  King advocated pacifism and nonviolence for achieving equal treatment  for African Americans. Rustin applied his brilliant strategic…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…pushing her to transition to public health. After  returning to the United States, she worked for the U.S. Department of  Health and Human Services as the principal public health advisor  throughout New England and as a nurse consultant for the Health Care  Finance Administration.\n\nFor the past thirty years, Tess has led Bi-State Primary Case  Association,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…national gangs.\n\nThis law enforcement experience, gained at both the state and federal  level, had Mr. Barron well-prepared for his subsequent role as Counsel  and Special Advisor to then-Senator Joe Biden, serving on the United  States Senate's Judicial Committee's Subcommittee on Crime and Drugs.  Soon after, he was a member of the Justice and Civil…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…can defend the United States  against imminent attack, but there was no such imminent threat posed by  the Iranian nuclear program, as the President's own National Security  Advisor testified to Congress shortly before this strike.\n\nAnd as the Israeli Foreign Minister announced before the U.S. strike,  that the Israeli actions had set the nuclear program…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…liberty, prosperity, and       equality will quickly become relics of the past.\n\nBernadette Allen, US Ambassador, retired; Rand Beers,       Former Deputy Homeland Security Advisor; Mark Bellamy, US       Ambassador, retired; John Beyrle, US Ambassador, retired;       James Bishop, US Ambassador, retired; Charles Blaha, Senior       Foreign Service Officer,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…portfolio included oversight of  the United States' relationships with Canada and Mexico and countries  throughout Central and South America. She went on to serve as Senior  Policy Advisor to three consecutive Assistant Secretaries of State for  Western Hemisphere Affairs at the U.S. Department of State, helping to  manage policy in the region. She continued…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Advisory  Board.\n\nAdditionally, Mr. Vo is admired for his strong engagement with the  Vietnamese community of Pomona Valley where he has served as a Board  Member, President, and Advisor, before becoming Vice President of the  Vietnamese Community of Southern California. In 1992, he founded the  Vietnamese American Community of USA, where he later was a Co-Chair,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…perfectly positioned him  for his role in the office. His primary responsibilities included  serving as the Congresswoman's Veterans affairs, national security, and  foreign policy advisor. Mac was instrumental in creating and managing  Representative Roby's constituent Veterans' Advisory Committee, which  allowed the Congresswoman to gain additional insights,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Afghanistan, where he was charged with training and  coordinating with the Afghan National Police. He later deployed with  the 101st Airborne Division to Afghanistan as an advisor to the  National Directorate of Security. Following the deployment, Rob served  for two years as a Company Commander in the 101st Airborne's 3rd  Brigade Combat Team.\n\nAfter…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…respect to such       event that would require registration of the sponsor as a       broker or a dealer under the Securities Exchange Act of 1934,       or as an investment advisor under the Investment Advisers Act       of 1940; and\n\n(5) where no specific information regarding an offering of       securities by the issuer is communicated or distributed…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Legislative Assistant.\n\nThroughout his tenure in my office, Mitchell has faithfully served  the constituents of Louisiana's 1st Congressional District and has  become a trusted advisor to me and an invaluable part of our team.  Whether giving tours, meeting with constituents, or working on complex  policy issues, Mitchell has approached every aspect of his…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the end the following:\n\n``(3) Deputy under secretary.--The Deputy Under Secretary       of Commerce for Communications and Information shall--\n\n``(A) be the principal policy advisor of the Under       Secretary;\n\n``(B) perform such other functions as the Under Secretary       shall from time to time assign or delegate; and\n\n``(C) act as Under Secretary…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…serving as agent, trustee, or custodian.\n\n``(iii) A State-chartered trust company serving as agent,       trustee, or custodian.\n\n``(iv) A plan administrator or investment advisor, acting       in a formal custodial or fiduciary capacity for the benefit       of a plan.\n\n``(B) Eligible institution.--The term `eligible       institution' means an insured…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…includes serving as Deputy Political Director at  the Republican National Committee, Director of Hispanic and Women's  Affairs in the George W. Bush White House, and Senior Advisor to two  U.S. Attorneys General at the Department of Justice. As a She Leads  America honoree, Jennifer believes leadership is a calling to serve  others with both truth and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…lives were lost or injured  during this military operation, thanks to the leadership of President  Trump, the advice and counsel of Vice President JD Vance, National  Security Advisor and Secretary of State Marco Rubio, Secretary of  Defense Pete Hegseth, General Dan Caine, and the brilliant planning and  flawless execution of the men and women of the U.S.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…the largest Air National Guard units in the Country, but a  premiere one unlike any other--a profound testament to his leadership  skills. He serves as the Senior Enlisted Advisor to the Wing Commander  on all issues affecting mission effectiveness, health, morale,  readiness, enlisted development, and mentoring of approximately 1,900  Airmen.\n\nThroughout…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Political Science and a Juris Doctorate degree, Molly began her  career on Capitol Hill as a Legislative Assistant for Rep. Andy Harris  (MD-01) in 2019, before becoming Senior Advisor on Health Policy and  later Legislative Director for Rep. Richard Hudson  (NC-09) in 2021. In  January 2023, Molly became Counsel for the Subcommittee on Health for  the House…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…hearings regarding technology  policies, Federal Trade Commission, and Department of Commerce.\n\nRecently, Brannon accepted a role in Senator Todd Young's office as a  Policy Advisor. I thank him for his service, congratulate him on his  new role, and wish him the best.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690576/recognizing-brannon-rains"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…broadcasting,  where he worked with WTVJ in Miami, co-founded Omni Video, and later  served as Engineering Manager at Telemundo. He also shared his  expertise as a Technical Advisor for the Broward County School Board,  mentoring the next generation of media professionals.\n\nOutside of his professional achievements, Mr. Lewerenz was known for  his generosity,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Candidate School in Fort Belvoir,  Virginia. After graduation, Corbett commissioned in the United States  Army and served with the Military Assistant Command, Vietnam (MACV) as  an advisor for the South Vietnamese Army. For his meritorious service,  he was awarded the Bronze Star, Air Medal, and Vietnam Cross of  Gallantry.\n\nCorbett was first elected to the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Health--Seth began his career on Capitol Hill as a Health  Legislative Assistant for Dr. Michael Burgess (TX-26) in 2016 before  moving to the Senate to work as Health Policy Advisor for Senator Rob  Portman (OH) in 2017. In May 2021, Seth joined the Subcommittee on  Health for the House Committee on Energy and Commerce when I served as  Subcommittee Republican…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…becoming Chairman of the full committee, Christopher  has been an expert policy communicator as a dependable and reliable  member of my team serving as Senior Communications Advisor.\n\nRecently, Christopher departed the Committee on Energy and Commerce  to accept a role as the Director of the Office of Communications for  the Centers of Medicare and Medicaid…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}]