[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Oregon grass seed growers estimate that about half of their exports-- nearly $200 million in sales--are being canceled, thanks to the global  tariffs.\n\nDonald Trump and his advisers claim there is nothing to worry about.  They say the economists and the pundits are overreacting, and  everything is going according to plan. Secretary Bessent is on cable…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Trump's first term, he withdrew from the Iran  nuclear agreement, after which Iran, as we know, accelerated its  uranium enrichment program.\n\nToday, some of President Trump's advisers have even proposed that we  resume nuclear testing. We cannot do that. It would be an unmitigated  disaster, subjecting countless Americans to cancer-causing radioactive…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…am hoping to use my few minutes to step back from the  dizzying torrent of news that we have been delivered, often  contradicting sources of news from the President and his advisers, and  just ask some basic questions about the wisdom of this extraordinary  military endeavor and the administration's future plans in Venezuela.\n\nI think the basic question…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…millions of dollars, if  not billions. This operation is, and apparently always has been, about  one thing: seizing control of Venezuela's oil. President Trump and his  closest advisers have made that clear. It is about President Trump  using the power that he has as President, without restraint, to get the  oil that he wants.\n\nThis is not my assertion. These…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I am again coming to the House floor, the  people's Chamber, to say: The emergency isn't coming. It is now.\n\nDonald Trump's advisers are threatening to suspend habeas corpus.\n\nHabeas corpus is the constitutional right that protects Americans  from being detained without charge, without trial, and without…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691330/threat-to-suspend-habeas-corpus"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…colleagues, let me keep this very simple.  We provided a lot of funding in the Inflation Reduction Act so that  those who have very sophisticated finances and very powerful advisers  that try to avoid ever paying their taxes don't get away with it,  because it is a fundamental fairness all across America.\n\nOrdinary working people have the money taken…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688893/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…day,  Donald Trump says yes to tariffs; the next day, no to tariffs; one day,  tariffs on this country; the next day, tariffs on that country. Even  Donald Trump's own policy advisers are struggling to explain his flip- flopping.\n\nThe only thing Donald Trump's tariffs have succeeded in is raising  the  odds of recession and sending markets into a tailspin.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…irrelevant to the larger,  more well-known VC funds who have the resources to shoulder the  compliance burdens associated with registering with the SEC as  registered investment advisers. They can already do this, but they are  the big ones. They are the ones based in San Francisco and New York.  That option isn't available for these emerging regional fund…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697192/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…exhibited through  bravery against that is profound.\n\nI am just so honored, and I know the gentlewoman feels the same way,  to have met President Zelenskyy and so many of his advisers,  individuals in the military, and wounded soldiers. Russia has lost over  100,000 soldiers. We are not sure how many. It is a lot. Those soldiers  didn't have to die. They…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…It would become readily  apparent that their work is squarely in sync with U.S. national  interests.\n\nOf course, if one believes, as the President and some of his closest  advisers believe, that climate change is a hoax and that any program or  organizations with the words ``climate'' or ``nature'' in its title  should be eliminated, then it is not surprising…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…GOP's donors. It is a scam, a  handout to the rich, paid for by nickel-and-diming moms and dads who  are just trying to get by.\n\nEven Elon Musk, one of Donald Trump's top advisers, called the  Republican bill a ``disgusting abomination.'' Let me repeat that, a  disgusting abomination. He said: ``Shame on those who voted for it. You  know you did wrong.''…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…fund his own personal gulag.\n\nAnd, by the way, while we talk about checks and balances, let's not  forget how the Trump administration is arresting judges. His allies and  advisers are attacking judges publicly and calling to impeach those who  disagree with him.\n\nAnd, of course, Trump is blatantly ignoring the courts. And worse  than that, the White…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…decisions, either       individually or among the membership of the group as a whole;       and\n\n(C) is neither associated nor affiliated with brokers,       dealers, or investment advisers.\n\n(2) Issuer.--The term ``issuer'' means an issuer that is a       business, is not in bankruptcy or receivership, is not an       investment company, and is not a blank check,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…trivial, but texts involving advice about her  questioning of Michael Cohen, all designed to figure out how to get  Michael Cohen to be able to somehow go after Trump or Trump's advisers  or people around the President.\n\nThat, to me, is what we talk about with censure, which is  contemplated, of course, in our rules and in the structure. The  gentleman talked…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…with  credentials like a Series 65 or a Series 7 to become accredited  investors. This was a very helpful step forward, but licensing  requirements for brokers and investment advisers go beyond what is  needed to properly weigh the risks of private offerings for an  individual's personal finances.\n\nFollowing the principle that merit, not just wealth, should…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693887/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…brilliant tactical move, which was brilliantly planned and executed  after in-depth conversations with the intelligence community and the  talented array of Presidential advisers that President Trump has.\n\nMy colleague on the other side of the aisle should do what we on our  side of the aisle have been doing, and that is congratulate the  President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "French Hill", "party": "Republican", "sentence": "…including issues involving financial       products and services;\n\n``(F) an analysis with regard to existing policies and       procedures of brokers, dealers, investment advisers, and       other market participants related to senior investors and       senior investor-related topics and whether these policies and       procedures need to be further…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…also encouraged to see a statement of  administrative support from the Office of Management and Budget stating  that if the legislation were presented to the President, his advisers  would recommend that he sign it into law.\n\nFinally, I am not an attorney, but I thank my friend, Congressman  Knott, for his support in helping get this legislation through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…I think is  amateurish behavior with respect to the treatment of our NATO allies.  It has to start with an interview that I saw with one of the  President's senior policy advisers, Stephen Miller, on CNN, a couple of  nights ago.\n\nMr. Miller said that the U.S. Government--``obviously, Greenland  should be part of the United States.''\n\nThat is absurd.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…K through 12 Federal grant funding. I want to thank Senator Rosen for  coleading this bill with me.\n\nAccountants play a key role in today's economy. They serve as trusted  advisers for companies large and small, assist in measuring business  performance, help individuals and businesses file their taxes in an  accurate and timely manner, assist government…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…fiscal year 2024 level.\n\nReviving the warrior ethos, rebuilding the military, reestablishing  deterrence--these are priorities we hear about all the time from the  President's advisers. I certainly have no problem with rowing in that  direction. I am all for high standards of physical fitness, but pushups  alone--pushups alone--aren't going to stop Chinese…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the House Small Business  Committee.\n\nMr. HILL of Arkansas.  He is a leader in  every way and also in the House Foreign Affairs Committee.\n\nMr. Speaker, he has his two top advisers with him, Eleanor and Mary  Clay.\n\nMr. HILL of Arkansas.  He is a former Congressman returning to the House  Financial Services Committee.\n\nMr. HILL of Arkansas. Mr. Speaker,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Act, the House Republican  majority kept its promise to preserve the 2017 tax cuts and provided  further relief for American families.\n\nThe White House's Council of Economic Advisers estimates the bill  will raise Utah wages between $4,300 and $7,700 over the next 4 years,  putting more money in the pockets of our hardworking Americans. Typical  families…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…require the Securities and Exchange Commission to  revise the definition of a qualifying investment, for purposes of the  exemption from registration for venture capital fund advisers under the  Investment Advisers Act of 1940, to include an equity security issued  by a qualifying portfolio company and to include an investment in  another venture capital…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…education and hands-on experiences, FFA  continues to make a lasting impact on the agriculture industry.\n\nNational FFA Week is also an opportunity to recognize the educators,  advisers, and mentors who guide these young leaders, as well as the  families and communities that support them. Their investment in  agricultural education ensures that future generations…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…businesses in developing AI technologies into  their operations.\n\nThese centers operate in partnership with universities and community  colleges across the country and are trusted advisers to local  entrepreneurs.\n\nThis approach builds on work already underway. In September 2024,  America's SBDCs, in partnership with Google, launched America's SBDC AI  U, which…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…counseling, training, and outreach to help  small businesses safely evaluate and adopt artificial intelligence  tools.\n\nThese centers already serve as trusted boots-on-the-ground advisers  in communities across the country, such as the University of Missouri- Columbia and Sedalia and other places where these SBDCs are providing  real help, real boots on the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}]