[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Trump Administration has taken the       position that conditions in Haiti have improved, a conclusion       that goes against Trump's own Department of State that has       advised zero travel of any kind to Haiti. How can we in good       conscience force this part of our community to return to a       place we have deemed unsafe?\n\nThe termination of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…certain temperatures, we would have to loosen the bottom of our  pants and stop doing physical training, or PT. The National Institute  of Occupational Safety and Health, NIOSH, advised OSHA on the need to  protect workers from heat stress back in 1972, and again in 1986, and  yet again in 2016.\n\nWorkers have waited long enough. Thanks to Representative Chu's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…without  even going to the Ethics Committee, much less a court, they want to  arraign her on some charges based on a newspaper article that she did  something lawful. However ill-advised it may have been, she took a  phone call from one of her constituents.\n\nMr. Speaker, I don't think it is the position of the very  distinguished gentleman that, if we find…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…that this program and its funding are supported  by President Trump and were passed out of our Appropriations Committee  with near unanimous support.\n\nThis amendment is ill-advised, and I urge my colleagues to vote no.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699443/consolidated-appropriations-act-2026"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…accept the  consequences of his actions and their actions by not ignoring them?\n\nMr. Speaker, I urge my colleagues to join me in condemning the  President's unvetted and ill-advised pardons that are leading to repeat  offenses. Congress should be here to protect innocent Americans and not  look away from the consequences of the President's actions.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698990/condemning-the-january-6-pardons"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…friendships and endured hardships.\n\nAs the song says: ``Some days are diamonds. Some days are stone.''  Happily, I have experienced more diamonds than stone.\n\nShakespeare advised us all: ``This above all: to thine own self be  true, And it must follow, as the night the day, Thou canst not then be  false to any man.''\n\nIn that vein, Mr. Speaker, I have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…is the Republican majority taking  urgent action to bolster Americans' finances, boost growth, and restore  confidence? Regrettably, they are not.\n\nInstead, among other ill-advised items, they are tackling the so- called problem of noncitizens voting, which is already illegal. I say  so-called problem because the Bipartisan Policy Center's analysis of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…in  a manner offensive to, and subversive of, the Constitution, in that:\n\nBy his orders and directions to subordinates, retaliated against law  firms and attorneys who have advised or represented, or been associated  with those who advise or represent, litigants who displease him, in  violation of the Constitution's prohibition on retaliation against…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…teams. Every one of them  had to be signed off.\n\nThis is not efficiency. This is adding redtape in the midst of a  crisis, authored by Kristi Noem herself. Experts say this ill-advised  decision very likely hindered recovery efforts.\n\nAs it stands today, FEMA is operating with a quarter fewer staffers  compared to 18 months ago--one-quarter fewer--including…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, Minnesotans are grieving the loss of two  precious lives and enduring immeasurable community suffering due to the  ill-advised policies of the Trump administration and the failed  leadership of DHS under Kristi Noem.\n\nTheir systemic refusal to prioritize public safety and adhere to any  semblance…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…notice to  Congress so that there can't be a secret war; giving Congress some  ability, once notice is provided, to try to withdraw notice if it  thinks that the war is ill-advised.\n\nBut the War Powers Resolution also did something else: It gave the  power to even one Member of Congress, one Senator or one House Member,  if a President initiates war…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Republican. This  should not be a partisan issue, and I am disappointed that President  Trump continues to ignore the outrage and the opposition to his  irrational and ill-advised tariff policy.\n\nIt is time for the Senate to stand up and exempt small businesses in  our country. There is a trade war going on. We should allow small  businesses not to…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the CRA to  micromanage a park or a park-access rule this narrow in the way that is  being proposed with this resolution. The entire scheme is untested,  reckless, and ill-advised.\n\nIf my colleagues accidentally ban off-roading in Glen Canyon, I hope  they are ready to explain that to their constituents, assuming they  ever hold townhall meetings again.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…with people facing similar  struggles.\n\nThis is a cruel idea. For the health and safety of all young  Americans, the President must immediately reverse course on this ill- advised, cruel, and dangerous plan.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690731/defunding-suicide-hotline-for-lgbtq-youth"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…commission to look at the  systematic failure of this Agency.\n\nRigorous use-of-force training and policies are an absolute must. As  attorney general of the State of Connecticut, I advised police forces  about what the law required of them. The proposals that we have made  and the demands that we have set forth are hardly novel or radical.  They are basically…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…brings over a decade of private sector experience as  a partner at Kirkland & Ellis, where he represented U.S. companies in  cases before the International Trade Commission and advised on supply  chain issues. He understands, from the boardroom to the factory floor,  how trade policy impacts ``Forgotten Americans,'' real businesses, and  our long-term competitiveness…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…for a hospital, concerned  citizens banded together to open the forty-eight-bed hospital. In 1969,  the Sisters of Mercy who operated the hospital approached the board and  advised them that they could no longer continue its operations. Over  the next few years, seven townships in Mercer County stepped forward  and took over the hospital. They created…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697414/recognizing-mercer-health-on-their-75th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that, with respect to the EDD fraud in the COVID era, the  Governor's office failed to take the basic commonsense steps that other  States took that the Federal Government had advised. For example,  cross-checking applications for unemployment against the prison rolls,  something that almost every other State did, and California didn't do.  I would not…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…FedEx's lead attorney, Chris told Fred that there had never been  an airline that willingly participated in a movie where they gave  permission to crash their plane. Chris advised against all of it.\n\nYet, Fred wanted to think outside the box, and he signed off on the  idea. He was really impressed with the production staff and the movie's  star, Tom…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…the Comprehensive Policing and Justice Reform Amendment  Act of 2022, the CPJRA Act, D.C. Law 24-345, among numerous other  police-related policy matters, most of which we advised against in the  Oversight and Government Reform Committee. We met with D.C. officials,  including in hearings, and we advised against what they intended to do.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…will give us an opportunity to do that. It is 10 after 3 at  this point, and I am not sure when the distinguished majority leader  will schedule that, but Members should be advised that unless we are  able to get a unanimous consent request and give the President his  choice for Chairman of the Joint Chiefs, those are items that can still  be the order…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…shouldn't do it because it leads to dislocation. No, it led to the  Embassy being in Jerusalem, and it led to the Abraham Accords.\n\nWe know that last week the President was advised not to bomb Iran,  that it would lead to World War III. No, it has led to a cease-fire and  the ability to have the Abraham Accords extended to other countries,  including…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…to Request Medical       Examination.--\n\n``(1) In general.--Any member of the Coast Guard who       receives a notice of involuntary administrative separation       shall be advised at the time of such notice of the right of       the member to request a medical examination under subsection       (a) if any condition described in such subsection applies…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…ample margin of safety in the  regulations that already existed?\n\nMr. Speaker, this is not about stripping away all regulations on tire  manufacturing. It is one specific ill-advised, ill-timed, expensive  regulation.\n\nMr. Speaker, the EPA was under no obligation to do this regulation.  They may have been under an obligation to look at unregulated hazardous…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…security. If you have ever  worried about your electricity bill or wondered if prices at the pump  might cancel a family vacation, then you should care about reversing  ill-advised lockups of our energy and mineral resources.\n\nEnergy production is critically important to the Western way of life,  sustaining small rural communities and generating much-needed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…released a final rule  setting new energy efficiency standards for tankless water heaters.  Like any last-minute rule from the previous administration, this effort  was ill-advised and ill-timed. It should not, and cannot, stand.\n\nHowever, the enactment of H.J. Res. 20, which provides for  congressional disapproval of the rule titled Energy Conservation…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690091/hj-res-20"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…work ethic, sharp intellect, and the ability to build  trusting relationships on both sides of the aisle have made him an  invaluable part of my team.\n\nHis legislative team advised me each week in Congress and shepherded  more than 40 bills through the House and got more than 15 bills signed  into law.\n\nThese are real results that have made a difference…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688120/thanking-alex-cisneros-legislative-director"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…through the booking process. I told them then that they  have a potential for a better life and a better day, but their path to  a brighter future comes through my jail. I advised them to take that  time in that jail to reflect upon their life and the potential that  they have to turn themselves around.\n\nYears later, Mr. Speaker, I have had these same…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Republicans  focused on restoring commonsense governance: prioritizing American  jobs, economic strength, and practical solutions. S.J. Res. 31, like  other measures undoing ill-advised Biden-era policies, represents a  decisive step in the right direction.\n\nLet's get back to smart, forward-thinking policies that actually  serve the American people, not far…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…exchange student in  1955. He sailed across the Atlantic with fellow students. They spent  the time discussing American customs and culture.\n\nIt was on this ship that he was advised to avoid asking out girls who  wore a pin because the pin indicated that they had been pinned by a boy  and were not available to date. He traveled across the United States…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]