[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…organized a traveling exhibition on women's  suffrage, launched a popular newsletter called ``A Different Point of  View,'' created a bipartisan Honorary Congressional Advisory Council,  and testified before Congress.\n\nSince its founding, the museum has played an integral role in  uplifting and celebrating the many women in history who have had an  impact…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…law  enforcement, community policing, mental health and addiction. I have  also had the honor of working with him through my Mental Health and  Substance Use Disorder Advisory Council, where his insights have been  invaluable.\n\nChief Tate's compassionate approach to policing is respected and  recognized by his peers. He has won numerous awards including…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700084/congratulating-chief-jeff-tate-on-his-retirement"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…New Jersey in 2012.\n\nIn these moments, our ability to communicate with one another and  with emergency responders is vital. That is why the FCC should have a  permanent advisory council that can provide recommendations regarding  both the rapid restoration of communications services in the event of  widespread or major network disruptions and the steps…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…president of the Dakota County Farmers Union and  regularly attends Farmers Union events at the local, state and national  level.\n\nI know Linda through her work on my Farmers Advisory Council, which  she has been a member of since I came to Congress in 2019. Linda has  provided invaluable feedback to my work on agriculture policy as I've  fought to ensure family…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I recently held the first meeting of my  Youth Advisory Council, a group of two dozen high school students from  my district who will help guide my work here in Congress.\n\nThese students spoke boldly about their fears and hopes for…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696966/youth-advisory-council"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…that  it needlessly pits two things that are not in conflict, that is,  brokerage windows and the plan's designated investments.\n\nMy colleagues know, in 2021, the ERISA Advisory Council examined  brokerage windows. They noted that fewer than one-third of the  retirement plans even offer a brokerage window, and roughly 2 percent  of plan participants with…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…universities and other research  institutions across the country.\n\nSince President Trump took office, his administration has canceled  more than 70 NIH study sections and advisory council meetings that are  the final step in grant approval. This means that more than $1.5  billion in funding has been withheld so far--illegally and in blatant  defiance of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contributions that Jenna Cousins has made through her volunteerism at  Gulf Highlands Elementary School. Jenna supports the school in so many  ways. She is at every School Advisory Council (SAC) meeting, supports  all extra-curricular events, and consistently pitches in whenever  needed. The students know her and look forward to seeing her around  campus.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690853/recognizing-jenna-cousins"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Eighth District.\n\nThe bill strengthens the cybersecurity of critical telecommunications  infrastructure by permanently establishing a Federal Communications  Commission advisory council to increase the security, reliability, and  interoperability of communication networks.\n\nThe FCC established the Communications Security, Reliability, and  Interoperability…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…being elected, I have heard from military servicemembers and  surviving family members about their struggles accessing VA benefits.\n\nIn my district, I started a Veterans Advisory Council, and we often  discuss this very topic to find ways to better this situation. I am  always looking to ensure that Department of Veterans Affairs leaders  hear the concerns…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…a sophomore at Waukee High School and already a well- regarded leader across civic and academic organizations. From his role  as a member of the State of Iowa's Youth Advisory Council and Lead  DSM's Youth Leadership Initiative, to his active engagement as an Eagle  Scout, mock trial participant, and church leader, Carrington's record  is defined by…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691587/recognizing-sirmichael-carrington-williams-thomas-on-receiving-the-2025-billy-michal-student-leadership-award"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and Exchange Commission to       Suspend Exemption; Reports to Congress.--The Securities and       Exchange Commission, acting in consultation with the National       Advisory Council on International Monetary and Financial       Problems, is authorized to suspend the provisions of       subsection (a) of this section at any time as to any or all…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…doubling  expensing for equipment, this bill gives Utah entrepreneurs the freedom  to grow, hire, and thrive.\n\nOver 70,000 small businesses stand to benefit. With our Rural  Advisory Council, I heard directly from Utah farmers and ranchers, the  backbone of our State. The bill raises the death tax exemption,  protects family farms, and strengthens food security…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…leader by example, Jane's work on behalf of our  veterans is well known across Arizona, which is why I jumped at the  opportunity to ask her to be a part of my veteran advisory council.\n\nJane's powerful voice, grounded by personal experience and genuine  desire to help those who served, has been an invaluable resource for me  and has greatly informed…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Mercedes Anderson-Brando has made through her  volunteerism at Gulf Highlands Elementary School. Mercedes supports the  school in so many ways. She is at every School Advisory Council (SAC)  meeting, supports all extra-curricular events, and consistently pitches  in whenever needed. The students know her and look forward to seeing  her around campus.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691793/recognizing-mercedes-anderson-brando"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…its first equity investment in the critical       minerals sector the following year. In 2023, a review was       undertaken of the effectiveness of the President's Advisory       Council on Doing Business in Africa (PAC-DBIA), an initiative       launched during the Obama administration with the mandate to       advise the U.S. president, through the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…effectively, providing a positive influence on the school culture. In  addition to his work with the Eagle Eyes Program, Mr. Ross is an  invaluable member of the School Advisory Council. His contributions to  the council are marked by thoughtful insights and a collaborative  spirit. He brings a unique perspective as a parent, helping to bridge  the gap…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…as President and  CEO, he serves as a Michigan Federal Delegate for the Independent  Community Bankers of America and is a long-time member of FIS's  Strategic Planning Advisory Council.\n\nMr. Speaker, let us join in recognizing Mr. David Williams for  receiving the distinguished Best Community Banking Award for 2025. I  thank him for his enduring commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695770/recognizing-mr-david-williams-for-receiving-the-best-community-banking-award-for-2025"}]