[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…out of committee and to  confirm them on the Senate floor, notwithstanding the political and  policy differences that we may have. But the Senate's constitutional  role to advise and consent regarding executive branch nominations is an  important check on Agency leadership's abuse and overreach and raising  these objections regarding EPA nominations…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…way for generations of women and       Black Americans in the military. Today women and Black people       hold leadership roles, serve on the Joint Chiefs of Staff,       advise the President, and serve as Cabinet leaders. We all       owe her a lot, but we still have much to learn from her.       Currently, women and people of color can learn from…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…unconstitutional racially based gerrymandering       past, which must be abandoned, and must now be corrected by       Texas.\n\nPlease respond to this letter by July 7, 2025, and advise       me of the State's intention to bring its current       redistricting plans into compliance with the U.S.       Constitution. If the State of Texas fails to rectify the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Constitution, in that:\n\nBy his orders and directions to subordinates, retaliated against law  firms and attorneys who have advised or represented, or been associated  with those who advise or represent, litigants who displease him, in  violation of the Constitution's prohibition on retaliation against  individuals for engaging in First Amendment-protected conduct,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…often  takes positions contrary to the positions of the IRS and the Office of  Chief Counsel. As a result, the National Taxpayer Advocate needs her  own independent counsel to advise and adopt legal positions so that she  can effectively advocate for taxpayers and to advise Congress.\n\nMr. Speaker, I am pleased that the committee is marking up the  National…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689380/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…have multiple-use lands. They are not meant for just  one industry. They are meant for everybody that uses those public  lands.\n\nWhen I served on the U.S. Federal committee to advise the Forest  Service, we got all of these stakeholders together to implement the  2012 planning rule, and it was the same deal. We did it deliberately.  We did it with all stakeholders…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…CSRIC must become a permanent fixture at the  FCC.\n\nH.R. 1717 requires the FCC to do just that. Under this bill, the FCC  would be required to establish a permanent council to advise the agency  on the security, reliability, and interoperability of communications  networks within 90 days. This Council would include representatives  from trusted communications…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…she could be misdiagnosed.\n\nThey don't tell her that half of the personnel in the so-called  clinic have no medical credentials at all and, therefore, are not  equipped to advise on any medical complications, such as an ectopic  pregnancy.\n\nThey don't tell her that this is not a medical clinic at all. In  fact, because it is not, this woman's privacy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…history of an institution that, first of all,  respects the prerogative of the person who won the Presidency while  also protecting our prerogative to have some oversight and to advise  and consent.\n\nBoy, when I think of supporting Lloyd Austin for Secretary of  Defense, a decision I came to regret--not because I didn't like him but  because he proved to…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…INTEROPERABILITY.\n\n(a) Establishment.--Not later than 90 days after the date       of the enactment of this Act, the Commission shall--\n\n(1) establish a council to advise the Commission on issues       including the security, reliability, and interoperability of       communications networks; or\n\n(2) designate for purposes of this section an…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Federal Government and the Coast Guard;\n\n``(2) ensure meaningful and timely engagement with--\n\n``(A) Native Hawaiian organizations; and\n\n``(B) Tribal organizations;\n\n``(3) advise the Commandant on all policies of the Coast       Guard that have Tribal implications in accordance with       applicable law and policy, including Executive Orders;\n\n``(4)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…President  Biden now exposed by the Trump administration: $500,000 for a Lesbian  Justice Foundation in Canada; $9.3 million to the John Snow Research  and Training Institute to advise Russian doctors on how to perform  abortions and gender analysis; $800,000 for transgender people, sex  workers and their clients and sexual networks in Nepal; $7.4 million…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…may occur on the Board.\n\n(4) Prohibition on payment.--Members shall not be paid for       serving on the Commission.\n\n(5) Responsibilities.--The Commission shall--\n\n(A) advise the Commission on the design of the medal of       sacrifice for law enforcement officers and first responders;\n\n(B) promote the establishment of the medal of sacrifice for…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…effectiveness of the President's Advisory       Council on Doing Business in Africa (PAC-DBIA), an initiative       launched during the Obama administration with the mandate to       advise the U.S. president, through the commerce secretary, on       strategies to expand the United States' commercial engagement       across Africa. The review found that the Trump…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Washington who supported nation- building fantasies throughout the Middle East; yet now certain  individuals within the administration seek to lead the President  astray.\n\nI would advise President Trump to remember the wise words of his  inaugural address, when President Trump said:\n\n[W]e will measure our success by the wars we never get       into.\n\nPresident…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…American Blockchains Act takes a strategic, thoughtful  approach by directing the Commerce Department to lead the Federal  Government's blockchain effort. The Department will advise the  President, establish a Blockchain Deployment Program, and ensure that  the United States remains competitive in the development and  application of this critical technology.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…any witness and accompanying such       witness shall be permitted to be present during the testimony       of such witness at any public or executive hearing and to       advise such witness while the witness is testifying of the       witness's legal rights; provided, however, that in the case       of any witness who is an officer or employee of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Justice). Under the previous order, the  question is, Will the Senate advise and consent to the Kupor  nomination?", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693292/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…conservative leader, policy expert, and  political strategist whose faith has guided her throughout a  distinguished 20-year career in public service. She helped elect and  advise two U.S.  Presidents and two U.S. Attorneys General while leading national  grassroots and communications efforts that achieved historic gains  among minority, veteran, and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}]