[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…``Beautiful for Billionaires Bill'' that got rammed through with a  simple majority. We have seen it with the change in the rules to allow  100 nominees to go through at a time under advice and consent. We have  seen it with clean air standards that help everyone being repealed.  Over and over and over again, the Republicans take the path that allows  them to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…traditional House committee.\n\nDaniel has been at the epicenter of all of our crisis communications,  tackling difficult questions with a level head, and providing excellent  advice. My senior management team and I have always trusted Daniel's  judgment and strategic thinking. While working separately on my  campaign, Daniel helped propel me to a 30-point…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the President whatever he wants in the name of his having the  prerogative.'' He should name his own team, but we have a  responsibility. It is a constitutional obligation. ``Advice and  consent'' is more than just saying: Give him his own team. If we had  been responsible in this body--if my Republican colleagues had stood up  and spoken out as they should…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bill  actually diverts Federal TANF funds meant for low-income families to  fund so-called crisis pregnancy centers, which provide pregnant women  oftentimes with fake medical advice with the goal of dissuading them  from accessing contraception or abortion care.\n\nRepublicans aren't providing more funding for TANF. God forbid they  do that. Giving this…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…dear friend, husband, stepfather, uncle, and  granddad.\n\nBefore taking this office, and once sworn in, Alan provided me wise  counsel sharing pragmatic, solutions-oriented advice on how to be of  service and make change.\n\nAlan exemplified community spirit and dedication to others, business  acumen, incredible generosity, friendship, and, of course,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the great Joyce Beatty  who has been battling some issues. She worked her way through them and  put off surgeries for as long as she could.\n\nYet, perhaps against some of the advice that she may have received,  she understood, as she said in her own words, the importance of being  here on behalf of the American people and to stand up and push back  against…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…he was a big titan of  business or a leader of industry in the world. He was just somebody who  was interested in what you had to talk to him about, and he would offer  his advice.\n\nIn Memphis, he did have his hand in just about everything. Our  basketball arena, FedExForum, has made the city the home of an NBA  team. That is because of Fred Smith. Our…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the community.\n\nOn a personal note, it has been an honor to know Mrs. Booker for  almost five decades. I will always cherish her friendship as well as  her sage counsel and advice that have been invaluable to me as I have  served in Congress. Accordingly, the impact of her life is inspiring  and exemplifies the kind of love and devotion to others for…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…treatment, as it was alleged in  the veto message, because the site wasn't authorized when it was  inhabited.\n\nOn these points, it appears the President's staff gave him bad  advice, bad facts, or both.\n\nThe reality is, the Tribe came to the Everglades after being driven  from their homes in the early 1800s. As the Miccosukee moved to what is  now Everglades…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…wanted and the people were demanding.\n\nI am very proud to thank John for what he has done to assist, but  there is also another person who provided me with some very sage  advice, someone who I have great respect for and have admired over the  decades: Ralph Nader.\n\nMany of you may not know the name, but Mr. Nader was a crusader for  justice of the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…practice, service as a  legislator, and raising two young daughters, Jerry took me in. He gave  me an office in his firm and was always there to help me with a case or  give advice about a tricky legal issue.\n\nJerry received many awards and accolades, but he would say that his  biggest success was his family. He and Rosemarie were married for over  60…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690315/in-remembrance-of-gerald-p-mcdermott"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…journey on the House side of  Capitol Hill began as an intern in my Washington, D.C. office back in  2019. He then moved over to the House Ethics Committee and was promoted  to Advice and Education Clerk where  he helped respond to questions from Members and staff throughout  Capitol Hill. Matt returned to my team as a Staff Assistant and  Legislative Correspondent.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…that  time that, if he did not have international observers at his election  to verify that it was an honest election, the world would not believe  the results. He ignored my advice, which was no surprise. He went ahead  with the election and had a disputed result. He claimed victory, which  others said didn't happen, and he did it again a few years  later.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…those paths to a nuclear weapon.\n\nColleagues, we wouldn't be here today discussing this if President  Trump hadn't torn up the first agreement that was working against the  advice of his entire foreign affairs and security staff. That is what  happens when you scoff at diplomacy--diplomacy that works, agreements  that worked--and unleash events in the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…brought her expertise in science and the law to the VA's senior  leadership. As a Staff Attorney for the VA's Office of General Counsel,  Maryam was in charge of giving legal advice about research agreements,  intellectual property licensing and smart phone application  submissions.\n\nAfter her first five years at the VA, Maryam saw an emerging need to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…his second term--I have given several  speeches about this--agreed to it. And I said at the time it was a  mistake. A lot of people said it was a mistake.\n\nHe got some bad advice, and I know who gave him that advice. And they  are no longer there. But be that as it may, I called the President and  talked to him about it. And he said: No, I am going…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…``(a) Secretary of the Coast Guard.--\n\n``(1) In general.--There is a Secretary of the Coast Guard,       appointed from civilian life by the President, by and with       the advice and consent of the Senate.\n\n``(2) Not operating as a service in the navy.--Subject to       section 103(c) of Public Law 107-296 and when the Coast Guard       is not operating…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…shared that he  learned to depend on others and not to take anything for granted. Jack  continued by encouraging others that ``you must go after it yourself.''  What great advice.\n\nI express best wishes to Jack for a deserved retirement, and I thank  him for his devotion to Pennsylvania's 13th Congressional District and  especially to beautiful Fulton…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…that some Deputy Chief of Staff thinks was cute to say on  TV.\n\nSo you want to get me back to thanking the President for all the good  things he is doing? Then give him good advice.\n\nOne of two things happened with Greenland. Either, one, the President  came up with the idea that maybe we should have Greenland as a part of  our assets, and somebody said…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…deprives states of  the power to protect their own citizens through state law. I am deeply  troubled by alarming national trends and the proliferation of AI  chatbots, providing advice to our children. Increasingly, children have  been suffering, and parents have been unable to pursue an effective  means of encouraging the industry to police itself.\n\nSadly,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Mississippi, where his family lives, and to pursue new opportunities.\n\nThis bill, this 65th NDAA in a row, would not have been possible  without John Keast. His work ethic, his sound advice, and his  partnership with his Democrat counterpart Liz King--all were essential.  We could not have achieved this bill without his tireless leadership.\n\nI want to thank him…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…friend--well respected by Members of  Congress on both sides of the aisle and his peers in Washington. A  consummate professional, John was a reliable resource to those who  sought advice or counsel. No matter one's role, John treated those  around him fairly and with respect, providing mentorship and guidance  to those in need.\n\nAs native of Bethesda, Maryland,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Senate       committees; and 1 private sector ethics briefing.\n\nIn 2025, the Committee staff handled approximately 12,974       inquiries (via telephone and email) for ethics advice and       guidance.\n\nIn 2025, the Committee wrote approximately 1,023 ethics       advisory letters and responses including, but not limited to,       822 travel and gifts…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…present       security of the digital economy and infrastructure and       cybersecurity policy efforts before the Commission, Congress,       and elsewhere;\n\n``(H) provide advice and assistance to the Assistant       Secretary in carrying out the policy responsibilities of the       NTIA with respect to cybersecurity policy matters, including…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…communities are being met.  Today, this organization, led by executive director Alisha Rone, serves  close to 700 children each year. Its team of 120 individuals provide  support, advice, and--when needed--intervention to parents and their  children.\n\nThe CDC's early intervention services are key to ensuring the  lifelong success of our children. Offering free…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…have  councils of people that are experts in their fields who come to D.C.  The Department of Labor has them. People from the labor community come  and have councils to give advice on bills.\n\nWe know we have ample crude. We know the ingenuity of the American  people to have ample crude. What we are talking about today is where 40  refineries in California…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…threats posed by the  Iranian regime and its proxies. No American lives were lost or injured  during this military operation, thanks to the leadership of President  Trump, the advice and counsel of Vice President JD Vance, National  Security Advisor and Secretary of State Marco Rubio, Secretary of  Defense Pete Hegseth, General Dan Caine, and the brilliant…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, pursuant to House Resolution 707, I call up  the bill (H.R. 3015) to reestablish the National Coal Council in the  Department of Energy to provide advice and recommendations to the  Secretary of Energy on matters related to coal and the coal industry,  and for other purposes, and ask for its immediate consideration in the  House.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…FAA  Temporary Flight Restrictions, novel electric vertical takeoff and  landing aircraft (eVTOL) certifications, promoting new sustainable  fuels, right down to real-time advice to a pilot at a distant Signature  Aviation base on how to unsnag a challenge clearing customs.\n\nFor so many years, we have seen Mary on the bustling ramps at Super  Bowls,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…greater  capacity than before.\n\nI thank Elder Childs for his continued dedication to and love of our  neighbors and neighborhoods. I thank him personally for his mentorship  and advice to me in serving in this position. I congratulate him on his  recent promotion and a lifetime of service to our community.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}]