[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…for students across  Colorado.\n\nAppointed President of Pikes Peak State College in 2001 and later  President of Colorado State University-Pueblo, Chancellor Garcia has  long advocated for expanding higher education access and student- centered programs. Through these roles, he also successfully grew  enrollment and strengthened public-private partnerships.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692493/congratulating-chancellor-joe-garcia-on-his-retirement"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…careful       consideration by the District's elected representatives, who       are directly accountable to District residents. Members of       this very Committee have long advocated for the principles of       federalism on which this nation was founded. They have       consistently condemned federal overreach and fought       forcefully and convincingly…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Communications Commission to establish a process to more thoroughly vet  internet service providers participating in the Universal Service  Fund's high-cost program.\n\nI have long advocated for reforms to combat waste, fraud, and abuse  in the high-cost program. Following an investigation by Energy and  Commerce Committee Democrats in 2017, we requested that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the UAE want?\n\nThe UAE wanted advanced AI chips in order to have an advanced AI  center in the United Arab Emirates.\n\nWell, what did we see transpire?\n\nThe UAE repeatedly advocated for having access to these chips that  the United States had previously said were a security risk.\n\nThen a company closely associated with the UAE buys $2 billion of  Trump's…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I thank Ranking Member Waters for her  leadership, under which we have advocated to create an economy that  works for all people, not just Elon Musk and wealthy billionaires.\n\nThat is why I oppose this measure to overturn the Consumer Financial  Protection--emphasis…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…commitment to improving lives in the Chattahoochee Valley/ Quitman County was evident through his service on more than 13 boards  and commissions, often as Chairman. He tirelessly advocated for better  education, healthcare, and public services, leaving a lasting impact on  countless lives.\n\nOn a personal note, ``CP'' was my friend and supporter for many  years.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…careful       consideration by the District's elected representatives, who       are directly accountable to District residents. Members of       this very Committee have long advocated for the principles of       federalism on which this nation was founded. They have       consistently condemned federal overreach and fought       forcefully and convincingly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…over  1,800 jobs in commercial fishing alone.\n\nH.R. 261 is a giveaway to megacorporations at the expense of the  American taxpayer, the oceans, and the Great Lakes we have advocated to  protect.\n\nSome of the marine sanctuaries most at risk because of this  legislation are iconic spots off the coast of California: Monterey Bay,  Channel Islands, and the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…enforcement.\n\nThere is a concern about the weapons of war that are brought onto our  streets and kill multiple people. There are a number of reasonable  measures that have been advocated by one group after another across  this country to make our streets safer and to have parents, when they  send their children off to school, know they will come home and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…up the mantle of Portsmouth Black Heritage Trail founder  Valerie Cunningham, Ms. Boggis has worked not only to preserve NH's  African American history but has relentlessly advocated for its central  place in American history. In doing so, she is helping to shape a  better future for all of us.\n\nThe Black Heritage Trail helps confront the systemic racism,…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Islander       Americans' representation at all levels of government is       necessary to ensure that the Asian and Pacific Islander       community is properly acknowledged and advocated for.       Throughout APAPA-SOC's ten years, its ability to empower       Asian and Pacific Islander Americans of all ages has left its       community a legacy that promotes…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694253/congratulating-the-asian-pacific-islander-american-public-affairs-solano-county-chapter-ahead-of-their-10th-anniversary"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…leading multinational political  organization for the Pacific Islands region, has prioritized the  region's need to build trade capacity and infrastructure and has  specifically advocated for preferential trade agreements given its lack  of competitiveness due to its small national markets, isolation from  the global market, and high cost of operating and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…across the South rode buses together to challenge  segregation laws, a precursor to the Freedom Rides.\n\nRustin was an advisor in Martin Luther King, Jr.'s inner circle as  King advocated pacifism and nonviolence for achieving equal treatment  for African Americans. Rustin applied his brilliant strategic mind to  execute aggressive, peaceful action in the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…testing and prevention. He has fought for the rights and dignity of our  neighbors living with HIV or AIDS, including our LGBTQI+ community and  undocumented neighbors, and has advocated to protect and expand the  funding necessary to end the HIV epidemic.\n\nMr. Speaker, on behalf of Illinois' Third Congressional District, it  is my honor to commend Omar Martinez…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…careful       consideration by the District's elected representatives, who       are directly accountable to District residents. Members of       this very Committee have long advocated for the principles of       federalism on which this nation was founded. They have       consistently condemned federal overreach and fought       forcefully and convincingly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Scripture that       God wants us to maintain our dignity as Christians by       avoiding such things.\n\nStone-Campbell Church Movement leader Alexander Campbell       (1788-1866) advocated for a rational and deliberative       understanding of Christianity, firmly rooted in the New       Testament. He opposed both speculative theology and emotional       revivalism,…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…be able to  write that off in the first year instead of having to amortize it over  a number of years--as used to be the law and it is what my colleagues  on the other side advocated for last summer--they will start paying  that again so that they can't take that write-off. That hurts small  business.\n\nSo I ask you, Mr. Speaker, just to consider that…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that their voices were  heard. He used every opportunity he had to make sure their voices were  heard, but he didn't just speak for the communities that he  represented. He advocated, and he used every policy tool available to  see that their values were reflected in policy here. He was a leader in  our delegation and in the whole Chamber on issues like…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698740/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…has a  disability.\n\nThe bill is named after Charlotte Woodward, an advocate with Down  syndrome who received a lifesaving heart transplant a decade ago. Since  then, she has advocated tirelessly to ensure that others living with  Down syndrome and other disabilities have the same access to lifesaving  care that she did.\n\nUnfortunately, there have been…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…specializes in high-volume  concrete manufacturing for runways and taxiways at major airports.\n\nUnderstanding the power of influence, Pat served as a role model and  leader. He advocated for many of his teammates during pivotal moments  in their lives and has been involved in many community advancement  initiatives. Alongside his wife Beth, Pat founded Team…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Speaker, I rise today to recognize and honor the  service of Victorville City Councilwoman Debra Jones. During her nearly  fourteen years of dedicated public service, Debra has advocated  tirelessly for the Victorville community and its citizens' most  pressing concerns. Debra is renowned in our community as a selfless and  caring servant and is a true friend…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…the same conviction and discipline to his leadership  within the Oneida Nation. He was elected Chairman of the Oneida  Business Committee in 1995 and again in 2005, where he advocated  tirelessly for policies that advanced Indian gaming, economic  development, healthcare, higher education, and the preservation of the  Oneida language. His long-term vision…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…We have students  at a fairly selective university who can't do basic math, and, by the  way, the State also has the highest illiteracy rate in the entire  country.\n\nI have advocated for reforms to our education system in California  that would actually close achievement gaps and serve students. As chair  of the Early Childhood, Elementary, and Secondary…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…today.\n\nI rise in strong support of H.R. 2965, the Small Business Regulatory  Reduction Act of 2025.\n\nI certainly join those remarks of my colleagues on this side who have  advocated for the bill. I would like to back up a bit and talk more  generally about regulatory burden and how this bill is an important  step in dealing with a much larger problem.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…including provisions  that would disband Hezbollah, eliminate all coordination with and  support from the Iranian regime, and end persecution of American  citizens who have advocated against Hezbollah's influence over the  Government of Lebanon.\n\nThis bill, the PAGER Act, offers a clear roadmap to strategically  realign the Lebanese Government to no longer…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…prohibiting our ability to revitalize American  manufacturing and achieve energy dominance, while taking steps that  reduce emissions through innovative technologies that I have advocated  for alongside my colleagues across both aisles of this Chamber.\n\nWe need to remember that our manufacturing, energy, and environmental  policies do not need to be at odds…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…we are not going to allow that. We  are not going to bring that to the floor, and I think that is  appropriate.\n\nIn fact, as the Speaker knows or can learn of, I have long advocated  for much stricter germaneness rulings here on the floor, and the  Committee on Rules needs to have a much stricter germaneness ruling. I  think if it is not absolutely on…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…people  while retaining reasonable FOIA--for those who don't understand what  ``FOIA'' is, that is the Freedom of Information Act--and Sunset Act  protections.\n\nI have always advocated for more transparency at TVA, first in the  State legislature, then as a mayor, and now as a Congressman.\n\nI thank my good friend, Representative Cohen, who I don't see in…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…State of Arizona has  taken the brunt of this.\n\nThis CRA needs to be done away with because we have to have that  ability. The predecessor of the gentleman across the way advocated no  mining. In fact, he used a national monument, disgracefully, to  actually bring in a tin-silver mine. Yes, that is bad, but we can have  our cake and eat it too. That…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699270/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…much like I did in 2015, I  worked with my colleagues to provide wind and solar an appropriate  glidepath for the orderly phase-out of the tax credits.\n\nMany of my colleagues advocated pulling the rug out from wind and  solar projects, but I worked to find a sensible compromise. Based on  that compromise, the law's December 31, 2027, placed-in-service…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}]