[{"senator": "George Whitesides", "party": "Democrat", "sentence": "…Unit's 3rd  Platoon Mavericks during one of the most challenging conflicts in  American history. From August 1967 to June 1970, Mauro bravely took to  the skies, engaging in aerial combat operations where skill and courage  were paramount to mission success and the safety of his fellow  soldiers.\n\nAfter years of valiant service, Mauro transitioned out…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…with fire responses across the country. We know that a quick response  is critical to containing wildfire and saving homes and lives. That is  why I introduced the Wildfire Aerial Response Safety Act along with  Congressmen Neguse, Crane, and Ciscomani.\n\nAs Representatives from States with dangerous wildfire seasons, we  understand how important it is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698693/delayed-wildfire-response-efforts"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…prevent, mitigate,  and respond to wildfires is aviation. Crewed aircraft have long been  used to monitor and fight fires. Now, advanced aviation technologies  and uncrewed aerial systems can advance our response to wildfires.\n\nIt is important now more than ever that crewed and uncrewed aircraft  work together safely alongside ground operations. That…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700125/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…may not want to face it, but it was done with bombs that were  provided by American taxpayers and approved by this Congress.\n\nIsrael unleashed the most deadly and destructive aerial bombardment  campaign since Vietnam. More than 200,000 buildings were destroyed.  Thousands of children were killed and injured. Thousands are amputees.  And in just the last…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of S. 160, the Aerial Firefighting  Enhancement Act.\n\nThis bill amends the Wildfire Suppression Aircraft Transfer Act of  1996 to reauthorize the sale of aircraft and parts by the Defense  Department…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691859/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Halasi-Kun's service has been recognized with some of the  military's highest honors, including the Legion of Merit, the  Meritorious Service Medal, the Air Medal, and the Aerial Achievement  Medal. His professional achievements are matched by his academic  accomplishments, having earned advanced degrees in Military Operational  Art and Science as well…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Aviation Corps' UH-60A/L/M Black Hawk utility helicopters;       AH-64A/D/E Apache attack helicopters; CH-47F Chinook cargo       helicopters; Schweizer 333 helicopters; and Aerial Scout       helicopters; and other related elements of logistics and       program support.\n\n(iv) Military Department: Army (SR-B-KYQ).\n\n(v) Prior Related Cases, if any: SR-B-KUW,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Army's premier site for  brigade-level, force-on-force training exercises. Finally, the McGregor  Range in southern New Mexico supports Patriot missile live-fire  exercises, aerial gunnery, and large-scale mobilization training.  Without these vital training areas, we would risk losing our military's  strategic advantage over hostile foreign nations.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Annex Item No. vii\n\n(vii) Sensitivity of Technology:\n\n1. The AIM-120C-8 Advanced Medium Range Air-to-Air Missile       (AMRAAM) is a supersonic, air- or surface-launched, aerial       intercept guided missile featuring digital technology and       micro-miniature, solid-state electronics. AMRAAM capabilities       include look-down/shoot-down, multiple…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695757/arms-sales-notification"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…outstanding  section 404 permit applications and jurisdictional determinations and  eliminate duplicative and unnecessary permitting processes for areas  such as pesticides, aerial fire-retardant use, and so much more.\n\nThe bottom line is that without reforming the Clean Water Act,  America cannot efficiently build roads, bridges, pipelines, ponds,  dams,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Base. With  more than 12,000 Reserve Airmen and 59 unit-equipped aircraft, her  leadership of the 22nd Air Force has directly contributed to our  Nation's security through aerial spray, fire suppression, weather  reconnaissance, tactical airlift and airdrop and aeromedical  evacuation.\n\nAs Major General Coburn continues her service to the United States…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "James Risch", "party": "Republican", "sentence": "…size, weight, and power (SWaP) engineered to meet challenging       requirements in a variety of platforms, including ground       vehicles, helicopters, and Unmanned Aerial Vehicles (UAVs).       The SSDL provides multiband, multi-mode networking       capabilities, ideal for warfighters on the tactical edge,       allowing them to switch networks…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691198/arms-sales-notification"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…marked the first official drone package  delivery in this country. It was the first time in our Nation's history  that medical supplies were delivered to patients via Unmanned Aerial  Vehicle (UAV), setting a global precedent for how drone technology can  serve humanity.\n\nThe drone delivery was made possible through an extraordinary  collaboration among…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…decorations. Later in his Air Force career,  he cross-trained in journalism, working in public relations and  advertising and coordinating with local officials for USAF Thunderbirds  aerial demonstration performances.\n\nTom's commitment to community extends beyond elected office. He is a  former member of the Rockwall County Appraisal Review Board, past  president…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Annex Item No. vii\n\n(vii) Sensitivity of Technology:\n\n1. The AIM-120D-3 series Advanced Medium Range Air-to-Air       Missile (AMRAAM) is a supersonic, air-launched, aerial       intercept, guided missile featuring digital technology and       microminiature solid-state electronics. AMRAAM capabilities       include look-down/shoot-down, multiple…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…system in achieving documented mission outcomes, where       appropriate in the context of the product or service       acquired.    Study on Threats Posed by Unmanned Aerial Systems At or Near the Land                 and Maritime Borders of the United States\n\nThe Committees are concerned that hundreds of encounters       with unmanned aircraft…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 390) to utlitize the Advanced Capabilities for Emergency Response  to Operations project of NASA to improve aerial responses to wildfires,  and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…a platform essential for the Army to meet the fight  in the long distances between islands in the Pacific.\n\nThe Navy Reserve will finally get four more KC-130Js to provide  aerial refueling, spare engines, and contested logistics in the Pacific  Ocean.\n\nSome of the most important provisions in this bill help the Pentagon  fix many of its broken and antiquated…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699327/consolidated-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Aerial Firefighting       Enhancement Act of 2025''.       SEC. 2. MODIFICATION AND REAUTHORIZATION OF AUTHORITY FOR                     SALE BY DEPARTMENT OF DEFENSE OF AIRCRAFT…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…central to his vision of national rejuvenation. He has made it clear he  is willing to use force to make that happen.\n\nThe warning signs are in plain view. China is ramping up aerial  incursions, conducting illegal exercises that simulate a blockade  around Taiwan, threatening sanctions against Taiwanese industries, and  relentlessly targeting Taipei with…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…what would have  been his 101st birthday.\n\nAt a young age, Al answered the call to serve his country during  World War II, enlisting in the U.S. Air Force. Serving as a B-17 aerial  gunner with the Eighth Air Force was an experience that forever shaped  his life.\n\nAfter returning home to New York, Al continued to serve his community  by joining the Congers…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}]