[{"senator": "Mike Bost", "party": "Republican", "sentence": "(b) Report.--\n\n(1) In general.--Not later than 180 days after the date of       the enactment of this Act, and every 180 days thereafter       until the termination date specified in paragraph (2), the       Secretary of Veterans Affairs shall submit to the Committees       on Veterans' Affairs of the Senate and House of       Representatives a report on the implementation of subsection       (d) of section 7616 of title 38, United States Code, as added       by subsection (a).", "title": "Health Professionals Scholarship Program Improvement Act of 2025", "date": null}, {"senator": "French Hill", "party": "Republican", "sentence": "For purposes of this Act:\n\n(1) Appropriate members of congress.--The term       ``appropriate Members of Congress'' means the Speaker and       minority leader of the House of Representatives, the majority       leader and minority leader of the Senate, the Chairman and       Ranking Member of the Committee on Financial Services of the       House of Representatives, and the Chairman and Ranking Member       of the Committee on Banking, Housing, and Urban Affairs of       the Senate.", "title": "Taiwan Conflict Deterrence Act of 2025", "date": "2025-07-21"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "(B) Committees specified.--The committees specified in this       subparagraph are--\n\n(i) the Committee on Agriculture, Nutrition, and Forestry,       the Committee on Foreign Relations, the Committee on Finance,       and the Committee on Homeland Security and Governmental       Affairs of the Senate; and\n\n(ii) the Committee on Agriculture, the Committee on Foreign       Affairs, and the Committee on Oversight and Reform of the       House of Representatives.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2025-12-04"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Not later than 5 years after the date of enactment of this       Act, the Comptroller General shall submit to the Committee on       Oversight and Government Reform of the House of       Representatives and the Committee on Homeland Security and       Governmental Affairs of the Senate a report on agency       compliance with this Act.", "title": "Guidance Out of Darkness Act", "date": "2025-03-03"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "(c) Definitions.--In this section:\n\n(1) Appropriate congressional committees.--The term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Homeland Security of the House of       Representatives; and\n\n(B) the Committee on Commerce, Science, and Transportation       and the Committee on Homeland Security and Governmental       Affairs of the Senate.", "title": "Department of Homeland Security Vehicular Terrorism Prevention and Mitigation Act of 2025", "date": "2025-11-17"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "(c) Definitions.--In this Act:\n\n(1) Appropriate congressional committees.--The term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Homeland Security of the House of       Representatives; and\n\n(B) the Committee on Homeland Security and Governmental       Affairs of the Senate.", "title": "Syria Terrorism Threat Assessment Act", "date": "2025-11-19"}, {"senator": "French Hill", "party": "Republican", "sentence": "``(D) Report to congress on review and plan.--\n\n``(i) In general.--Not later than 365 days after the date       of enactment of this paragraph, the Board of Governors shall       submit a report to the Committee on Financial Services of the       House of Representatives and the Committee on Banking,       Housing, and Urban Affairs of the Senate containing--\n\n``(I) the findings of the review required by subparagraph       (A); and\n\n``(II) the remediation plan required by subparagraph (C).", "title": "Bringing the Discount Window Into the 21st Century Act", "date": "2026-02-09"}]