[{"senator": "Sharice Davids", "party": "Democrat", "sentence": "…There were no survivors. Mr. Speaker, 67 innocent lives were lost: 60  passengers, 4 flight crew, and 3 Army soldiers.\n\nThere is no one in my home State who hasn't been deeply affected by  this tragedy. Kansas is known as the Air Capital of the World, a place  where aviation is not just an industry, but a way of life. The  passengers on Flight 5342 were…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…his administration has  failed there, they have made life so miserable for Federal workers that  they had no choice but to leave.\n\nFederal workers should be ``traumatically affected.'' Those are the  words of the Office of Management and Budget Director Russ Vought, an  unelected bureaucratic.\n\nThe Federal workforce has dwindled by 200,000 since January,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…watches this deployment of the National Guard in his  State. How are the people of Oregon reacting to the misuse of our  National Guard? Is there faith and trust in the military affected by  the President's deployment of the National Guard in a circumstance that  a Federal judge has found is unnecessary because whatever protests have  happened in the past…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Prostate Cancer Awareness Month. As co-chair of the bipartisan Men's  Health Caucus, this issue is close to my heart.\n\nEvery year, the Black community is disproportionately affected by  prostate cancer. Specifically, Black men are twice as likely to die  from prostate cancer as their White counterparts. This alarming trend  highlights an urgent need for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Nation is disheartening, to say the least,  and a dangerous precedent to entertain for any free people.\n\n``It is my responsibility to speak out, not because I agree with the  affected individuals or sanction acts for which they are accused, but  because if we wish to live in a democratic society, we  must defend the lawful rights of all, including those…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…President does not  believe in climate change.\n\nThat is why I will continue to fight for the reinstatement of these  funds for Crisfield, for Maryland, and for every community affected by  flooding across this country.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690467/cuts-to-fema-bric-grants"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…authority and responsibility to the Executive that we have as the U.S.  Senate.\n\nThis is our responsibility, and part of the reason is that we are  close to people who are affected by these policies. It is a shirking of  our responsibility for the U.S. Senate to essentially cede that  authority to a President, particularly when we are seeing in every…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…going to happen, my  impression was she was going to hold off.\n\nThe other thing that was unfolding was that the Seventh Circuit,  putting Illinois--and Chicago has been really affected by this. The  Seventh Circuit made a decision in support of the district court there,  but that looked like it was going to the Supreme Court. And they may do  a shadow docket…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…express  my deepest condolences to the families of each of the victims and  embrace them during this time of hurt. We stand in solidarity with all  of those who have been affected by this heartbreaking event. Their pain  is our pain, and their grief is felt by all who hear them. In this  moment of profound sorrow, our thoughts and prayers are with the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689828/mourning-devastating-tragedy-in-santo-domingo"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…lethal  combination that doesn't just impact one party, one State, or one  community. This impacts all of us, and any one of us and our families  or someone we love could be affected.\n\nDonald Trump doesn't take this moment to unite us as a country.  Instead, he has chosen to fan the flames. He refuses to bring us  together to unequivocally denounce all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…30,000 potential registrants in just 2 years--about 12 percent of all  voter registrations during the period. State officials acknowledged in  court that over 99 percent of affected voters were U.S. citizens.\n\nNow, even Kansas's Republican secretary of state, who championed the  bill when he was a State legislator, has warned against it, saying:\n\nIt didn't…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republicans have cited about $200,000 in costs for manufacturers  associated with this rule that they seek to repeal, but understand that  is the total cost of the rule for all affected manufacturers combined.  If you break that down, the Department of Energy estimates the costs  per manufacturer at about $2,555.\n\nThat is a ridiculous amount to even discuss…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…of legislation.\n\nAgain, I thank Representative Moolenaar for being such a great  bipartisan partner. We owe it to Shandra, her family, and every other  patient who has been affected by contaminated bone grafts to ensure we  are doing everything we can to prevent these unnecessary tragedies from  ever happening again.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692765/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…neighbors. They are essential to our economy, our       communities, and the cultural fabric of this nation.\n\nAfter the catastrophic earthquake in 2010--an event that       affected more than three million people and claimed over       200,000 lives--the United States granted Temporary Protected       Status to Haitians already living here. At the time,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…and with  compassion. His leadership was grounded in facts, calm under pressure,  and, most importantly, rooted in empathy for the victims, their  families, and all of those affected.\n\nAt a time when our community needed strength and clarity, Chief Story  was there, not only with answers, but with presence. He brought  together law enforcement, emergency…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…worked out with the Biden  administration, do you still have that in the file? And GAO sent a  letter back and said: We declared this, in 2023, just an order because  it only affected one State, just California.\n\nHere is the problem. GAO, as I mentioned in the beginning, in their  very own legal opinion, said: If an Agency says it is a rule, it is a  rule.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…2024 ROD Must Be Nullified\n\nThe 2024 ROD's restrictive approach is unlawful,       unworkable, and deeply harmful to our people whose lands and       livelihoods are directly affected.\n\nS.J. Res. 91 and H.J. Res 131:\n\nUpholds federal law\n\nDefends Congress's authority\n\nRestores the 2020 program\n\nStrengthens U.S. energy security\n\nRespects Inupiat voices,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country, and that is the  expiration of tax credits that could lead to a massive increase in  healthcare costs.\n\nWe are talking about 22 million Americans who will be directly  affected, some of them seeing thousands and thousands of dollars in  increases in their healthcare costs. That is something that a lot of  these folks simply cannot afford.\n\nMr. Speaker,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…regulatory delays. The result is cleaner air, a cleaner environment.\n\nThe reality is that most of these companies and the people who run  them live in the very communities affected by emissions. They have  every reason to care about cleaner air and healthier environments.\n\nWhat they need is smart, flexible policy, not arbitrary and  capricious restrictions…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…been testimony that 98 percent of our  municipalities operate under cybersecurity poverty, meaning they don't  have the resources to defend themselves. These intrusions have affected  communication providers, energy operators, water systems,  transportation networks, and other sectors that are fundamental to  public safety and economic stability.\n\nWhat…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…their replacement payment through  direct deposit instead of having to risk mailing another check.\n\nThis is a simple fix, Mr. Speaker, and it will help expedite relief  to affected taxpayers, keep government checks out of the hands of  criminals, and ultimately make our government more efficient.\n\nMr. Speaker, I urge all of our colleagues to support…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…caregivers, medical professionals, and       researchers have made tremendous strides in advancing       treatment options and improving the quality of life for those       affected by the disease;\n\n(9) esophageal cancer can be prevented through early       detection of its precursor, Barrett's esophagus, which can be       eliminated with curative outpatient…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…depending on the committee  involved and depending on the type of legislation, there are reasons  why these things are there, and almost regardless of which committee is  affected, you can normally benefit from this. And, in fact, it is  normally quite hazardous to just bypass all of this, because that is  how we legislate, without making sure that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber harvesting, litigation, and  misguided environmental regulations, has drastically affected county  revenue, creating very real economic impacts in its wake.\n\nFranklin, Garland, Hot Spring, Howard, Johnson, Logan, Montgomery,  Newton, Pike, Polk, Pope, Scott, and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…However, this bill imposes a costly  mandate that every aircraft within the system implement a technology  called ADS-B In.\n\nMr. Speaker, most of the aircraft that would be affected by this  bill, those with a takeoff weight of over 12,500 pounds, already have  superior technology for collision avoidance called TCAS II.\n\nMr. Speaker, this is technology…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700112/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…spend  this bad, but the trillions of dollars of debt that were racked up had  consequences, Mr. Speaker.\n\nIt had consequences not only in terms of our national debt, but it  affected the pocketbooks of families all across America because that  bloated spending in Washington, which is money we don't have, by the  way; and it increased inflation to the point…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…bill.\n\nFor far too long, our communities have been plagued by poisonings  from fentanyl and fentanyl-related substances. Every one of our  congressional districts have been affected by this crisis. Kids are  dying. They are dying, and Congress has got to make this permanent.\n\nIllicit drugs have poured across the border, made it onto the  streets, and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…small businesses, including women-      owned small businesses and minority-owned small businesses;\n\n``(ii) businesses located in rural areas; and\n\n``(iii) small businesses affected by hurricanes or other       natural disasters; and\n\n``(J) at least annually, meet with representatives of State       securities commissions to discuss opportunities for…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…the taxpayers $1.8 trillion through unilateral rulemaking and executive  orders.\n\nThis brazen abuse of executive power stymied commerce and our free  markets and directly affected our ability to innovate and remain  competitive in the international economy.\n\nThe effects of this aggressive regulatory regime was clear: Gas  prices rose to the highest…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688641/deregulation-empowers-free-enterprise"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…recognizing the economic and other  benefits that Congress intended it would enjoy as a result of ANCSA's  settlement of aboriginal land claims.''\n\nThat is from the people who were affected on the ground by this  misguided resource management plan that the previous administration put  in place. It is an honor to be here today to be able to use the CRA to,  hopefully,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]