[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…percent. This is a sales tax on everyone in the  country, but it is a sales tax that, as all sales taxes do, fall  hardest on those who can least afford it.\n\nThe new sales tax is affecting retirees particularly. So from NBC  News:\n\nRetirees `stunned' as market turmoil over tariffs shrinks       their 401(k)s.\n\nWe have a Social Security system that is a good…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…National Police Week and talk about officer safety and  wellness, I would be remiss if I did not call for the immediate  restoration of hundreds of millions of dollars that are affecting  nearly 40 States in public safety grant funding that the Department of  Justice chose to abruptly terminate. Some of that canceled funding went  to law enforcement training;…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…And  so we also know that a quarter of farmers and ranchers are getting  their healthcare this way. And then we think about the fact that this  issue is disproportionally affecting red States, not just blue States.\n\nAll Americans are going to be hurt. This is why your ringing the  alarm is so important. And I would ask a very simple question: Is there…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…going  nuclear--going nuclear--and this is the first time in the history of  the Senate in which the majority has gone nuclear, overruling the  Parliamentarian on a matter affecting legislation--both the  Congressional Review Act and the Clean Air Act.\n\nSo the complex procedural rigmarole you saw last night and today was  all designed to do a parliamentary…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…I also participate in a hearings working group that sets up hearings  across the Nation to highlight how this administration's unlawful and  unconstitutional actions are affecting everyday people. Importantly for  tonight, I participate in the Special Order hour working group, where  my fellow Representatives and I organize time to speak on topics…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…ground.''\n\nLet me, for a moment, point out another great hypocrisy that has  arisen in this situation. This all began as a way to prevent drugs from  reaching this country and affecting families throughout this country.  The President was standing up and down, spouting about how he has  gotten rid of fentanyl. Of course, fentanyl does not come out of this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…or interests of non-agency parties, though it may       alter the manner in which parties present themselves or their       viewpoints to the agency.\n\nWith respect to rules affecting non-agency parties'       submission of information in an agency proceeding, our       previous decisions distinguish between rules that merely       affect the manner in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…to treat disease, and more. These critical  breakthroughs in medical research are our Nation's best hope in finding  cures, prevention measures, and treatments for diseases affecting  millions of Americans.\n\nMr. Speaker, I hope my colleagues will join me in supporting this  resolution to recognize the importance of medical research in America.  I urge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "Mr. SUOZZI. Mr. Speaker, there are so many issues in our country  right now that are affecting our people, but one of the biggest  concerns is an urgent matter that on December 31 of this year, premiums  for people's health insurance are going to be skyrocketing because…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697961/healthcare-crisis"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…have been on the House  Agriculture Committee, three different farm bill reauthorizations, and  he was always willing to meet halfway. Of course, we understood the ag  issues affecting California, and he was very proud, very proud to  represent the upper Sacramento River Valley and all the wonderful  people there.\n\nWhen disaster struck his district with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…practices that provide medically inaccurate  information or that have endangered the health of a woman seeking care.\n\nWe also offered amendments to address the real crisis affecting the  TANF program, which is the Trump administration's decision to seek  revenge against five Democratic Governors by preventing them from  accessing $10 billion in already…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…one bit.\n\nYet, here we are, debating a symbolic resolution that is designed to  distract, deflect, and scapegoat rather than talking about and trying  to solve real problems affecting farmers and rural communities.\n\nThis isn't legislating. It is grievance politics.\n\nMr. Speaker, I urge my colleagues to reject this resolution, and I  yield back the balance…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Republicans rejected my  amendment.\n\nThat seems to be the pattern that we are all seeing, and that is why  we are here today to share the stories on how the affordability crisis  is affecting our constituents.\n\nDexter).\n\nMs. RIVAS. Mr. Speaker, in July, Republicans voted to betray our  values as a Nation and turn their backs on children, working parents,  veterans,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…that on this townhall.\n\nWe had people like Leticia from Camden, who said that with prices so  high ``every choice feels like a sacrifice, and the stress is  constant.'' It is affecting how they are able to hold up and how they  feel when they wake up every morning, what keeps them up at night.  Still, she remains determined to advocate for families like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…consequences of President Trump's medical research cuts. The President  and DOGE instituted a new set of rules at NIH that resulted in 3,500  fewer medical research grants, affecting virtually every area of  medical study.\n\nFunding for mental health was reduced 31 percent, brain diseases by  26 percent, and cancer research by 19 percent. All of these…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…me be clear: The District of Columbia is  not a State. Congress has both the authority and the responsibility to  provide oversight in this matter, as well as many others affecting the  governance of our Nation's Capital.\n\nMr. Speaker, I thank this resolution's sponsor, Representative Gill,  and Chairman Comer, for their leadership on this important…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…about the importance  of cardiovascular health and the steps that we can take to protect our  hearts. Heart disease remains the leading cause of death in the United  States, affecting millions of Americans each year.\n\nThe good news is that many heart conditions are preventable through  small everyday choices. Taking care of our hearts doesn't require…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}, {"senator": "French Hill", "party": "Republican", "sentence": "…privilege.--The provision of any       information by a Federal banking agency under this paragraph       may not be construed as--\n\n``(I) waiving, destroying, or otherwise affecting any       privilege applicable to the information; or\n\n``(II) waiving any exemption applicable to the information       under section 552 of title 5, United States Code (commonly…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "Mr. MESSMER. Mr. Speaker, I rise today to address an issue affecting  both families and businesses in Indiana and across the United States,  which is the expensive, but essential, financial support workers need  to provide care for their young…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…codify the National Coal Council, an important  advisory committee that had aided our Federal Government for 37 years  with expertise and technical reports on all matters affecting the coal  industry and its workers.\n\nThe reestablishment of the National Coal Council couldn't come at a  better time. It is no secret that our energy demands are rising.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the Forest Service's methods of       operations. Instead, the memorandum established the standards       by which program determinations would be made, thus directly       affecting the area for and number of timber sales that would       result in contracts. In essence the memorandum went beyond       how the Forest Service organized its internal operations.…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…reconsideration of the security clearance of any such staff       member and may constitute grounds for termination of       employment with the Committee.\n\n10.11. All personnel actions affecting the staff of the       Committee shall be made free from any discrimination based on       race, color, religion, sex, national origin, age, handicap,       or disability.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…There are 24 cartels that are being deemed terrorist  organizations that are poisoning our streets, that are killing our  families, that are killing our friends, that are affecting all of our  homes and all of our streets in all of our States all across the  country--in fact, to the tune that there have been more people killed  in 2024 by drug overdoses--the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698424/unanimous-consent-requests-the-calendar"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…privilege.--The provision of any       information by a Federal banking agency under this paragraph       may not be construed as--\n\n``(I) waiving, destroying, or otherwise affecting any       privilege applicable to the information; or\n\n``(II) waiving any exemption applicable to the information       under section 552 of title 5, United States Code (commonly…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…2025.\n\nThis bill updates reporting requirements for NOAA's Office of  Commercial Remote Sensing Regulatory Affairs, giving Congress the  ability to monitor how regulations are affecting the expansion and  development of the commercial and remote sensing industry.\n\nRemote sensing uses data collected from satellites to produce images  of Earth and has become…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Mr. Speaker, I rise today to raise awareness of  World Suicide Prevention Day on September 10. Suicide remains a  critical issue, affecting individuals and communities worldwide.\n\nMr. Speaker, 2025's World Suicide Prevention Day is focusing on  changing the narrative on suicide by shifting from a culture of silence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…have not  healed in the years that have passed since then.\n\nMr. Speaker, my Ending Presidential Overreach on Public Lands Act  ensures that the decisions of this magnitude affecting public lands are  made collaboratively, respecting the role of Congress with our  jurisdiction over public land, and taking input from local voices. It  should be Congress…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…requiring facilities to install additional  costly technologies that will increase energy consumption.\n\nBeyond that economic harm, the rule would prove costly to  manufacturers, affecting workers' wages and the expansion of the  domestic tire manufacturing industry.\n\nThe per-company cost to comply with this rule would be four times  what EPA has suggested:…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688526/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.  However, they have lost sight of the kitchen-table issues affecting  everyday Americans. They ignore the rising costs hurting workers and  families in order to cater to their own extreme leftwing base. It is so  bad that even Members in their…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Country, but a  premiere one unlike any other--a profound testament to his leadership  skills. He serves as the Senior Enlisted Advisor to the Wing Commander  on all issues affecting mission effectiveness, health, morale,  readiness, enlisted development, and mentoring of approximately 1,900  Airmen.\n\nThroughout his decorated career, Chief Smith earned…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}]