[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…the  process stinks, the substance is even worse. The bill still kicks 17  million Americans off their healthcare and makes record cuts to  Medicaid, record cuts to the Affordable Care Act, and record cuts to  Medicare.\n\nThat is not all. It kicks off 4\\1/2\\ million from nutrition  assistance, mostly seniors and children. Why? It is to help subsidize…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican Party were elected on their promise to bring prices  down. Instead, the Republican Party is about to become the grinch who  stole Christmas. They want to let the Affordable Care Act credits that  kept health insurance affordable for families expire on January 1.\n\nThis bill, the Reliable Power Act, would let the Federal Energy  Regulatory Commission,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…rips Medicaid by nearly a trillion dollars, adds 15 million people  uninsured, and raises costs for everybody. Now, to add insult to  injury, they refuse to extend the Affordable Care Act.\n\nThis bill that they want to replace it with is a bamboozle. It is a  hoodwink. It is a scam for the American people. It promotes junk plans  that rip off the American…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698369/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…was July 28 of 2017. It was 2:30 in the morning. I was seated at  this desk, and a historic vote was about to take place. The vote was  whether or not we would keep the Affordable Care Act--or ObamaCare, as  it was known then--extending health insurance to millions of Americans,  some of whom had never had it.\n\nAt the time, President Trump was in office,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…attention as people get older, and the UAW rightfully protects their  retirees. We are proud of what they are able to do for the retirees.\n\nHowever, the country pre-ACA, Affordable Care Act, ran into some  severe challenges. Ford had gotten its loan before the recession hit,  and General Motors and Chrysler hadn't done that. They were tragically  and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…cost of overtime if  they provide it. That is the problem. In practice, this bill encourages  employers to keep workers on the job longer rather than expanding  access to affordable care. It increases the time away from families  while offering no assurance that any support for childcare will be  provided. Workers who already receive these benefits will…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…to come to the table and extend  the healthcare subsidies which will prevent premiums from skyrocketing  for the millions of Americans who get their insurance from the  Affordable Care Act marketplace. That is approximately more than 70,000  people, constituents, in my district alone.\n\nDuring that same time, we watched President Trump and his  administration…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Finance Center in New Orleans but  lost his job in April because of Federal workforce cuts enacted by  Trump, Musk, and DOGE.\n\nHis family signed up for insurance through the Affordable Care Act  because his husband was also laid off in the spring. Mike had cancer 5  years ago and continues to have outstanding health concerns.\n\nIf MAGA Republicans don't join…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…transparency, all  to score political points and reward political friends.\n\nOn the other side, Democrats are fighting with courage and  compassion. We are fighting to protect the Affordable Care Act and to  keep healthcare accessible for millions of Americans. We are fighting  to lower costs for families and restore trust in a government that  should be working…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…costs to cover the sicker people who will buy the health  insurance because they need it.\n\nBut the simple fact is, nobody is invincible. All of us need  healthcare. And the Affordable Care Act recognizes that healthcare in  America, aspirationally, should be a human right. And our failure to  provide it to those millions of Americans who will find healthcare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Nation's health and well-being. And  this is not the first time.\n\nThey tried this before during Trump's first administration when he  unsuccessfully tried to repeal the Affordable Care Act and cut  Medicaid, despite its popularity across the Nation, across the  political aisle. He was going after something that wasn't left or  right, that Americans were…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…on the cost-of- living crisis. They are making it worse.\n\nInstead of lowering prices, Republicans passed a bill to cut nearly a  trillion dollars from Medicaid and the Affordable Care Act, which will  strip healthcare coverage for more than 15 million people. Over $500  billion in cuts to Medicare will be triggered by this law, harming  America's seniors.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…neighborhood cleanups as a board member of the Kansas City  Housing Authority and assisted young mothers in obtaining health  insurance. As a volunteer co-chair of the Affordable Care Public  Education Committee in the Kansas City Metropolitan area, she advocated  for the expansion of Medicaid and accessible healthcare. In March of  2012, her efforts…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…ask, how long  can her son take care of Sonia? Is this how we are meant to take care  of our seniors in this country?\n\nSonia's story is not unique. Without renewing the Affordable Care Act  tax credits, millions of Americans could face the same situation that  Sonia is facing today.\n\nMr. Speaker, I thank Sonia for sharing her story.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…aisle  with Democrats. Democrats want to prevent exploding health insurance  premiums. They have already started to show up in some people's mail.  That is because the Affordable Care Act subsidies are about to expire.  Oh, that was part of President Trump's One Big Beautiful Bill Act.\n\nMr. Speaker, I want to ensure that the funding Congress passes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…healthcare  law of the land is what many refer to as ObamaCare. Let's remember the  original name that Democrats gave that bill when they created it. They  called it the Affordable Care Act. Only Democrats voted for it.  Republicans knew it was going to be anything but affordable. It was  going to interfere with the doctor-patient relationship. Unfortunately,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…well or what savings this  bill will have or not have.\n\nIn fact, the Democratic-led CBO has overestimated the cost of Trump's  tax cuts, underestimated the cost of the Affordable Care Act, and  overestimated the impact of the Inflation Reduction Act.\n\nI will note something about this being political misdirection, as my  colleague noted. He said that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…MULLIN. I reserve the right to object.\n\nMr. MULLIN. Mr. President, you know everything that the Senator from  Vermont has railed about is why I think he supported the Affordable  Care Act a.k.a. ObamaCare. I thought it was supposed to fix all this  stuff that he wrote about, and we figured out it hasn't. It has wrecked  the system. It is unaffordable…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…with this basic compromise  agreement that we will not fund abortions with American taxpayer  dollars--well, except for one area, and that is actually ObamaCare.\n\nWhen the Affordable Care Act was passed, there was an attempt to be  able to have the Hyde amendment actually included in that. That was  actually put in in the House of Representatives when they…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…California leadership.\n\nThey don't want to have those conversations. They don't want to talk  about how you manage that problem, how you get more people to be able  to have affordable care instead of what they currently have, which is a  broken system that insurance companies run, forcing individuals onto an  exchange so they can get like my constituent…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…in July to destroy  healthcare for millions of Americans.\n\nWe need to find a path forward toward ensuring that millions of  Americans do not lose insurance through the Affordable Care Act and  Medicaid, something that will raise insurance costs for everyone and  that will increase ER wait times in my State and in every other.\n\nThis Saturday, 20 million…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Government                                           Accountability Office,                                   Washington, DC, December 3, 2025.      Patient Protection and Affordable Care Act: Preliminary           Results from Ongoing Review Suggest Fraud Risks in the           Advance Premium Tax Credit Persist      Hon. Brett Guthrie,      Chairman,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Mr. President, in Texas, my constituents who are on the  Affordable Care Act exchanges, otherwise known as ObamaCare, are  experiencing an 18-percent increase in their insurance premiums. Now,  if you look at employer-provided coverage, which…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…inflation to its highest level in 40 years.\n\nIt is a fact that Biden's Green New Deal was nothing more than  another scam on the U.S. taxpayers, and ObamaCare, known as the  Affordable Care Act, is not affordable to anyone in America.\n\nIt is a fact that Space Command is coming to Redstone Arsenal in  north Alabama and the Golden Dome is on the horizon.\n\nIt…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…more expensive, it is time sometimes to rethink the  foundation. Such is the case with ObamaCare.\n\nMr. Speaker, we all remember those promises made when Obama signed  the Affordable Care Act into law. If you like your doctor, you can keep  your doctor. It turns out that wasn't true. It is also not true the  promise made that this ObamaCare will bend the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…resource plan to maintain  the stability and affordability of their electric grids.\n\nWe have had a lot of discussion. We have been debating for the last  few months. The Affordable Care Act passed 15 years ago. Insurance  rates have doubled since that passed, and now, we are debating whether  to deal with the rising costs of health insurance or continue…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…such       Act by the ADA Amendments Act of 2008, section 504 of the       Rehabilitation Act of 1973 (29 U.S.C. 794), section 1557 of       the Patient Protection and Affordable Care Act (42 U.S.C.       18116), or any other applicable law.\n\n(e) Enforcement.--\n\n(1) In general.--Any individual who alleges that a       qualified individual was subject…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…tax credits from the ACA are extended. They are permanent. These are  the enhanced premium tax credits. It is good, and sad, that my  colleagues are recognizing that the Affordable Care Act is failing.\n\nMr. Speaker, we have heard sad stories. Last night, in the Rules  Committee, the Rules chairman read through different stuff. The Rules'  ranking member…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this money.\n\nYet, when we actually start to look at the studies and articles, here  is the GAO report about the ACA. It has a simple line here.\n\n``Patient Protection and Affordable Care Act: Preliminary Results  from Ongoing Review Suggest Fraud Risks in the Advance Premium Tax  Credit Persist.''\n\nThen you read it, Mr. Speaker, and it is page after page…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…billions of dollars to the NIH and CDC, that will stop  Trump's cuts to American healthcare and insurance and research. There  is a path toward reforming and extending the Affordable Care Act that  both parties should agree on.\n\nBut, folks, if you are listening, your Member of Congress needs to  hear from you, needs to know that you want us to work together…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}]