[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…colleague from California for  leading this important discussion today and for her leadership in  bringing this to the floor.\n\nMr. Speaker, I rise today to talk about the affordability crisis and  the reality the vast majority of American families are facing.\n\nAcross Oregon, people are doing everything they are supposed to do.  They are working extremely…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Mr. HEINRICH. Mr. President, I have come to the Senate floor today to  say what every New Mexican I know can easily tell you: Americans are  reeling from an affordability crisis. It doesn't matter if you are  talking about the price of groceries or rent or healthcare, everybody  is stretched thin.\n\nThey need help and they need it now and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Starker has guided the City with steady leadership,  including navigating the unprecedented challenges of the COVID-19  pandemic and championing efforts to expand housing affordability in  Jefferson County and across the State of Colorado.\n\nBeyond City Hall, Mayor Starker has promoted economic development  throughout the Denver Metro Area through his…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696268/recognizing-mayor-bud-starker"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…actually to plan for 2026. And it is all because these  Republicans aren't willing to do it.\n\nHonestly, it just shows how unserious the Republicans are about  addressing affordability for families at the kitchen table. The cost of  living in this country is skyrocketing. And it is not just the  healthcare bill for these 22 million people; healthcare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…stipulating that raising every American's monthly heating bill is in  the national interest.\n\nThis week, Donald Trump gave a speech where he said: ``We are looking  at affordability--we are going to bring it down for everybody. . . .''  I think he meant we are going to make things more affordable, but you  understand the point.\n\nIf the Republicans…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…electricity prices went up for 70  million Americans, and in which inflation is rocking along at 3\\1/2\\  percent.\n\nI thought we were going to be in this Chamber talking about  affordability.\n\nBy the way, my friends on the Republican side just got shellacked in  an election, from sea to shining sea, where the word is affordability.  They got shellacked on affordability.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Speaker, with only 10 voting days left in this year's  calendar, Congress must act if we are to avert a full-blown healthcare  crisis. I rise today to bring attention to the affordability and  healthcare crisis that is pending upon us.\n\nI think this is what Americans want us to do as opposed to bailing  out Argentina or figuring out how to finance a $300…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have been invested into that State pier  to support the offshore wind industry.\n\nSo the Revolution Wind cancellation threatens our economy, jobs, and,  most immediately, affordability for everyday Americans, most  particularly in Connecticut and Rhode Island.\n\nBut it is not just Connecticut that has benefitted from Revolution  Wind. The supply chain…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…it promotes junk insurance  plans that will rip off consumers and make healthcare even more  unaffordable.\n\nHouse Republicans are incapable of dealing with our Nation's  affordability crisis. They should stop their political games and put  the bipartisan Jeffries bills on the floor today.\n\nMr. Speaker, we deserve better. My constituents deserve better.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698384/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the new  administration and a new Congress, and Republicans have not brought one  bill to the floor of the House that will help tackle the cost-of-living  squeeze and the affordability crisis.\n\nFolks back home really need help. They are paying more on their  groceries despite all the promises, more on their electricity, and now  are facing huge increases…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…think it is because the Republicans are scared. They are scared of  Elon Musk. They are scared to talk about the real problems facing  working families across the country: affordability, the escalating  costs of the overheating climate, what that is doing, higher insurance  costs, and higher electric bills because their summers are longer and  more intense.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…lower the cost of groceries and healthcare for  families around our great country. But this Republican majority never  misses an opportunity to do the opposite of addressing affordability  for the American people.\n\nAfter all of the majority's procedural shenanigans last year, my  resolutions ending President Trump's harmful tariffs on Canada and  Mexico…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…better, and they deserve better.\n\nMr. Speaker, in case anybody tuned in to the President's little press  conference before we gathered here today, he said that the issue of  affordability is a ``hoax.'' It is a ``scam,'' he said.\n\nReally? Anybody who is watching these proceedings, do you really  think that the issue of affordability is a ``scam''? Prices…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…tell working families: Sorry, no money for your  healthcare; can't do a thing.\n\nI mean, really? Give me a freaking break.\n\nThe American people are begging for action on affordability. They are  begging for action to lower the cost of healthcare. What more do they  need to do to get Republicans to take action?\n\nPremiums are about to double, triple, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…polluter friends over the needs of the American  people. If they cared about the American people, they would be bringing  bills to the floor that would actually address the affordability  crisis. Instead, Republicans are debating this bill that they know will  increase prices for Americans.\n\nBy forcing States to consider preferencing dirty and expensive…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…world that is out there paying more and more for their health  insurance.\n\nIt is time to implement policies that work for all Americans and that  provide predictability and affordability.\n\nI am grateful to be a voice from Utah on the Committee on Ways and  Means Health Subcommittee during this critical moment, and I am excited  to see this legislation move…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…of this bill. It  provides $103 billion in budget authority and supports President  Trump's America First agenda. It invests in transportation  infrastructure and housing affordability while cutting wasteful  spending and reducing the Federal bureaucracy. In fact, this bill  codifies DOGE cuts, like reducing HUD staff by 24 percent and DOT by 5  percent,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…generational wealth through innovations such as education programs for  homeowners about wealth transfer and heirs' rights. She has also  implemented covenants to ensure long-term affordability through  property tax limits and advocacy efforts. Her vision for communities  also includes pioneering affordable housing initiatives, advocating for  equitable homeownership…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689058/recognizing-amanda-brewer-for-womens-history-month"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…have a better answer: Build more homes, faster, better, and cheaper.\n\nThe solution to inflation, the solution to higher costs, is always  more supply. The reason we have affordability challenges in housing,  Mr. Speaker, is because we have an inventory shortage. Republicans are  offering solutions to provide more housing stock to lower the costs for…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…infrastructure.\n\nMy legislation will ensure that the regulatory whiplash is in our  rearview mirror. My bill will ensure that when States write their  rules, they consider affordability and accessibility to water treatment  technologies.\n\nThrough this legislation, we are providing certainty and  predictability in the EPA approval process and a little Hoosier…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698043/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…have held the American people hostage, trying to extract insane  things, like free healthcare for illegal immigrants.\n\nIf they were serious about tackling the healthcare affordability  crisis in this country, then they would address the fundamental problem  with ObamaCare. Since ObamaCare took effect, healthcare premiums have  risen by 96 percent and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…requires the National Petroleum Council to collect and examine  information regarding the role of petrochemical refineries in the  United States and their contributions to affordability, security, and  reliability. The report will assess opportunities to expand capacity as  well as current risks to refineries.\n\nH.R. 3109 will provide the Committee on Energy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…ultimately supporting President Trump's  goal of unleashing American energy dominance.\n\nUpcoming legislation that came out of the Committee will ensure that  reliability and affordability are prioritized when making decisions  about our electric grid. These bills will also reverse the trend of the  last 4 years, such as restrictions on natural gas pipelines…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…remove  barriers that prevent us from accessing our own energy and minerals.\n\nBy unleashing Alaska's extraordinary resource potential, we are  providing energy certainty and affordability to Alaska and creating  thousands of well-paying jobs, generating billions of dollars in  revenue for Federal and State coffers, and keeping America and our  allies safe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…I reserve  the balance of my time.\n\nMr. Speaker, my colleagues across the aisle would love to scapegoat  everything on the President's tariff authority. The question of  affordability, which they have all of a sudden gotten into their hands,  is rich given that they presided over the worst inflation spike in 40  years.\n\nUnder President Joe Biden, families…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, today, we rise to discuss the important  issue of home affordability.\n\nAs you just saw on this floor, we passed, with bipartisan support,  led by our chairman of the Committee on Financial Services, French  Hill, from the great State of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Texas infecting cattle and killing  livestock, the already high price of beef will continue to increase.  And, of course, as we are all focused on kitchen table issues and  affordability, that is the last thing we need. That means that anyone  who enjoys a steak or a hamburger will be staring at higher prices in  their local restaurant or at the drive-through…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…out-of-pocket spending maximum for 1 year  is over $20,000. Without a doubt, ObamaCare has proven to be  unaffordable and unsustainable.\n\nIn an attempt to respond to the affordability crisis created by  ObamaCare, Democrats leveraged a public health emergency to shovel  hundreds of billions of dollars to big health insurance plans to mask  the risk of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…Bag of Doughnuts, the forgotten  worker.\n\nThis is why Donald Trump was elected. We care about the forgotten  worker. We are going to fix healthcare. We are going to fix  affordability. Gas prices are already coming down. Grocery prices are  coming down. Wait until that tax cut hits in 2026.\n\nMr. Speaker, I urge support of H.R. 4593 and so should you.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…grow.\n\nMr. Speaker, 2026 will be about bigger paychecks and lower costs on  everything from healthcare to housing to household goods. We are moving  forward with housing affordability legislation to lower costs and  update financing options. We are streamlining and simplifying  permitting processes to create more jobs, reduce costs, and increase  wages.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}]