[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "The  post remains a lifeline for small businesses, who often cannot afford  to use large for-profit shipping corporations, as well as for rural  Americans.", "title": "250th Anniversary of the United States Postal Service", "date": "2025-12-03"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "They simply cannot afford the care that she needs without  Medicaid.", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "3947 for the purposes of offering my amendment to extend the  Affordable Care Act tax credits for 1 year.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-10"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Speaker, our country cannot afford to lose the talent of civic- minded scientists like this.", "title": "Fired By President Trump", "date": "2025-02-26"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "I think, if we are going to move forward on permitting reform but if  we are going to move forward more generally on the question of  affordability, we have to say that shortages are bad for prices.", "title": "Energy Costs", "date": "2026-01-13"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "What has President Trump done to make healthcare more affordable?", "title": "Healthcare", "date": "2026-01-07"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "It is an assault on  the Affordable Care Act.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "So here we are all these years later, as one who helped to write the  Affordable Care Act, the ACA is still standing.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "This policy punishes those who can least afford it: seniors on a  fixed income, veterans, and families already forced to choose between  gas and groceries.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "While  past policies have assumed that veterans have been financially  irresponsible for assuming mortgages they can't afford, today's  financial and housing market puts veterans at risk of losing their  homes in a much more vulnerable situation.", "title": "Prioritizing Veterans' Survivors Act", "date": "2025-04-07"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "We are not in a position where we  can't afford it.", "title": "Providing for Consideration of H.R. Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, Providing for Consideration of H.R. Special Interest Alien Reporting Act of Providing for Consideration of H.R. Jeremy and Angel Seay and Sergeant Brandon Mendoza Protect Our Communities From Duis Act of and Providing for Consideration of H. Res. Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-24"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "No American who cares about       our freedoms, our institutions, and our identity as a nation       can afford to be a bystander.", "title": "Recognizing ``Assault on American Diplomacy''", "date": "2025-05-20"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "increased the child tax  credit and earned income tax credit benefits to put more money in the  pockets of working families struggling to afford the basic necessities  in their life.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-04"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Since then, she and her husband have relied  on Medicaid and he on Medicare for their healthcare because they cannot  afford other types of insurance.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "I am fighting for the parents who can't afford clothes for their  kids, for the families who can't afford groceries, and for the young  people who can't afford to buy a car or a home.", "title": "Protecting the Middle Class", "date": "2025-04-07"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "You can change the Fed chairman all you want, but if you  don't fix the fiscal mess we are in, the outer part of that curve,  which is what sets our mortgage rates, our long-term borrowing rates,  that is still going to be a mess, and the American people aren't going  to be able to afford homes.", "title": "Tax Cuts and Spending", "date": "2025-06-27"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "In addition to weekdays, you can count on Mary to be at  the facility almost every Sunday, along with a loyal team of other  volunteers, ensuring those that are unhoused or unable to afford much  food receive a wonderful, hot meal.", "title": "Recognizing Mary ``adams'' Adamczewski", "date": "2025-05-14"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "We cannot afford to repeat  that cycle here.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Disapproving this rulemaking would help give       consumers access to affordable energy to heat their homes and       businesses to power manufacturing.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Simply put, small businesses can't afford the extensive legal and  regulatory expertise that large, multinational firms employ to comply  with every regulation while still managing their operating costs.", "title": "Small Entity Update Act", "date": "2025-07-21"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "We believe that we can help the American people be able to afford  their groceries, afford an automobile, and afford education.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''", "date": "2025-02-27"}, {"senator": "John Thune", "party": "Republican", "sentence": "So the idea that this has made healthcare less costly and more  affordable for people in the Obama exchanges is just a fantasy.", "title": "Healthcare", "date": "2025-12-10"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "These same small businesses, which are often owned and operated by a  single family or an individual, cannot afford the new equipment  mandated by these unreasonable standards.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''", "date": "2025-03-27"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "They can afford to tell the truth.", "title": "Actual Solutions", "date": "2025-06-03"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "This is not a priority we can afford to kick down the road.", "title": "China", "date": "2025-12-04"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "We cannot afford to waste any more time.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "In  reality, ObamaCare is too expensive to afford without the subsidy.", "title": "Government Funding", "date": "2025-11-05"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "The Housing for the 21st Century Act will help increase home  production, which to date has failed to keep pace with rising demand,  leading to more affordability challenges for all Americans.", "title": "Housing for the 21st Century Act", "date": "2026-02-09"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "When left to their  own devices, the American people will seek out the most efficient model  of an appliance that they can afford.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''; and Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-04"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "With a national debt of over $37 trillion, we can't afford to litter  sensible appropriation bills with wasteful spending.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}]