[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…away healthcare for  political gimmicks only causes further harm. Therefore, we must  continue working to extend the ACA tax credits to ensure Americans have  access to affordable, reliable healthcare.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…saddened by Abby's departure, I am confident that because of her  leadership, the solar industry is well-positioned to continue playing a  leading role in delivering the affordable, reliable, and pollution-free  electricity that Americans are indeed counting on.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699172/congratulating-abigail-ross-hopper"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…and  manages the efficient uses of our airways. NTIA is also charged with  carrying out the bipartisan infrastructure law's historic $65 billion  investment to expand affordable and reliable high-speed internet access  to communities across America, communities like the Sacramento region  where, just 20 minutes outside the city, rural areas still suffer…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…recognition that in America we must keep building, not dismantling our  clean energy capacity where possible.\n\nThe legislation will help power thousands of homes with affordable,  reliable energy, support the creation of good-paying jobs, and boost  local economy all while reinforcing our commitment to energy  independence.\n\nImportantly, this bill ensures…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693917/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…everything possible to slow, stop, or sabotage the  development of affordable renewable energy. Our constituents deserve a  lot better than this. We deserve clean, affordable, and reliable  energy. We deserve good-paying jobs and affordable healthcare. We  shouldn't sacrifice America's health, environment, and livelihoods in  order to do it.\n\nThis legislation…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…largest rate increase and the highest rate increase in  the history of the country.\n\nWhat have we seen out of this administration?\n\nWe have seen just the sabotage of affordable, reliable, clean, and  cheaper energy coming onto the grid, and now this.\n\nThis is an important topic. I have gained a little bit of knowledge  not just from the Energy and Commerce…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Board will continue building on DART's legacy  of innovation--expanding service, improving accessibility, enhancing  sustainability, and ensuring that transit remains affordable and  reliable for all our neighbors.\n\nAgain, I extend my congratulations to Mr. Randall Bryant. I thank him  for his ongoing service throughout our community and for his commitment…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…headlights on as we drive into this unprecedented new hazard, it is  hard to see how we move on from there.\n\nI agree very much with my friend from Kansas that energy that is  affordable, reliable, and clean is our common  goal. And I will give an example because the developers of Revolution  Wind have told me that our offshore wind facility is going to send…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reliable  not just for constituents in Montana but for people all across this  country.\n\nThat is exactly one of the many reasons I am supporting this CRA  today. It means affordable, reliable energy. It means improved national  security. It means good-paying jobs for rural Americans and millions of  dollars in revenue for the U.S. Treasury.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…leasing on over 4 million acres by  inexcusably prohibiting all future development outside of a 4-mile  radius from current development--over 90 percent of North Dakota's  affordable, reliable coal, out of touch. It is gone.\n\nIt also blocks 213,000 acres, or 44 percent, of federally owned oil  and gas acreage from future development. This restriction alone…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…stand  with American families and businesses and lower the cost and restore  energy dominance.\n\nThis legislation should be an easy, bipartisan bill. If you support  affordable, reliable energy, then this bill strengthens our economy. It  lowers prices, and it signals that you have studied the industry and  that you know your facts.\n\nMr. Speaker, I urge…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Mr. DAINES. Mr. President, hydropower produces affordable, reliable,  and clean baseload power in Montana and across the United States. For  years, I have worked with my colleagues to grow our hydropower  portfolio in creating new jobs,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694335/requiring-the-federal-energy-regulatory-commission-to-extend-the-time-period-during-which-licensees-are-required-to-commence-construction-of-certain-hydropower-projects"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Wyoming coal, which is world-class coal, clean coal, low-sulfur coal.\n\nThis is Wyoming coal. We need more of it--not less of it--to power  our Nation. It is available, affordable, and reliable. This has powered  our Nation for  over a century. It continues to be a major source of power for our  Nation, and we need it far into the future.\n\nAnd today, to that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…America's coal industry.\n\nIn combination with the provisions that Republicans enacted through  the reconciliation bill, this CRA will ensure that American energy  remains affordable, reliable, and abundant.\n\nAmerica's future is bright as we unleash responsible natural  resources development to meet our energy and mineral leads, to create  jobs, and to drive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…when energy demand is rising. As manufacturing  is brought back home and new industries like artificial intelligence  and data centers are coming online, our need for affordable, reliable  energy is only growing. It makes no sense for the Federal Government to  restrict access to the very resources needed to power our economy.\n\nIn North Dakota, BLM manages…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…bipartisan. I have had multiple Democrats who have told me that they  are going to vote for this because it is common sense and it actually  helps all of our goals: affordable, reliable energy that also helps the  environment.\n\nMr. Speaker, I urge all of my colleagues to vote ``yes,'' and I thank  the chairman of the Committee on Energy and Commerce…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…over the last 25 years. Natural gas has the potential to  further reduce American greenhouse gas emissions if we continue to  increase production.\n\nNatural gas is an affordable, reliable, and clean source of energy  vital to our country and our economy. We should be expanding natural  gas production, not restricting it. Instead, the natural gas tax will…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…capacity as  well as current risks to refineries.\n\nH.R. 3109 will provide the Committee on Energy and Commerce the  information we need to enact policies to deliver affordable, reliable,  and clean energy to all Americans.\n\nI thank Representative Latta, the chairman of the Energy  Subcommittee, for his leadership on this issue.\n\nI urge all of my colleagues…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…to pay 40 percent more for utility prices this  fall. Why is that? It is right here. This is why this legislation is  needed.\n\nMr. Speaker, natural gas is the most affordable and reliable energy  solution. Also, if it comes from the United States, then it is clean.  An expanded pipeline capacity is critical to lowering costs for  American families and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…been suffering. This national energy emergency is part of  President Trump's swift actions--actions to unleash American energy. It  is part of this broader vision of affordable, reliable, available  American energy.\n\nDemocrats oppose all of that. They have opposed it for the last 4  years. They still oppose it. They have learned nothing from 4 years…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…today in strong support of H.J.  Res. 35, legislation I proudly cosponsored to stand up for North  Dakota's energy producers and hardworking families who depend on  affordable, reliable energy.\n\nFor my first action as a Member of Congress, I wrote to President  Trump and Secretary Burgum urging them to repeal 20 unnecessary and  burdensome rules that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688186/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…unleash American energy, promote innovation, and protect  healthcare for the most vulnerable Americans.\n\nWe claw back wasteful and unnecessary spending. We unleash affordable  and reliable American energy. We support technological innovation by  reauthorizing the spectrum auction authority. We secure Medicaid for  those who need it most. This includes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and  will lead to our allies being forced to rely on gas with higher  emissions coming from adversarial nations like Venezuela.\n\nBusinesses and consumers rely on the affordable and reliable natural  gas underneath our feet. By putting new taxes on this baseload power,  the Biden-Harris administration put the interests of their far-left  base ahead of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688177/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]