[{"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…or respect for the men and women who will be sent to  fight this war--will engage in it--is going to cause problems.\n\nHe has shown us he could care less about the Iraq and Afghanistan  veterans who are screaming from the rooftops right now not to make this  mistake again. If we allow this to continue, I will have to look into  the eyes of young men and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698605/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Bush after       9/11 for his Manichaean view of the world are now largely       replicating it. Implicit in the current worldview is that--      after decades of war in Afghanistan and Iraq, causing deaths       into the millions, and now while continuing to serve as the       crucial accomplice for ongoing genocide in Gaza--the US       government…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…NDAA before us, we had an  opportunity to do right by the Afghan allies who risked their lives to  protect American servicemembers throughout our 20-year involvement in  Afghanistan.\n\nAfter months of bipartisan work and real progress, a key provision of  my Enduring Welcome Act, legislation that passed the Foreign Affairs  Committee with strong bipartisan…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…and over again? This  country always tries to get into ``limited'' military engagements. That  is what Kennedy said about Vietnam. That is what Bush said about Iraq  and Afghanistan. We may go in with intentions of things being very  limited, but the world has a vote on how things go in these other  countries, and we do not know where Venezuela is going…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…effort put into saying: These are our  Oregonians. These are our soldiers, our folks. We have gone and  supported them as they have gone on missions to Iraq and missions to  Afghanistan and missions elsewhere in the world. We go and we welcome  them home, and we think that they will have a very deep understanding  that whatever they are instructed to do,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…cruelty against many more who have  done nothing wrong, many who have risked their lives, families, and  communities to support U.S. servicemembers during the long war in  Afghanistan.\n\nAnother example: Look at the President's commentary related to  members of the Somali community. During a Cabinet meeting last month,  the President called the Somali…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…public schools.\n\nMr. Kenneth Singleton has dedicated decades of service to our  community. From serving in the U.S. Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned him the Meritorious Service Award five times.\n\nFor Mr. Singleton, public service didn't end after the uniform came…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…They have shared how these actions are creating fear and  instability in their lives and communities. One Federal worker, a  disabled combat veteran who served in Iraq and Afghanistan, was  recently fired from his job at the USDA. He summed it up perfectly when  he said: ``This is not the America I swore an oath to protect.''\n\nThat is the sentiment I…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…getting into wars a central premise of his campaign. It  scrambled the political coalitions. It really did. There were a lot of  young veterans who came back from Iraq and Afghanistan and said, ``What  the hell is the Democratic Party even for if not to be the party of  peace?''\n\nIt doesn't mean that we are opposed to the use of force in all  situations.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…current NATO allies. Canada fought nobly with our troops on  the shores of Normandy on D-day and many other places. Both nations  served honorably alongside our Armed Forces in Afghanistan in response  to 9/11. Threatening our neighbors and allies in such a manner is  taking a page out of the very playbook of lies Putin has used  repeatedly against Ukraine.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Mr. SWALWELL. The President has our troops sleeping in squalor, not  on the battlefields of Afghanistan or Iraq, but in Los Angeles. I guess  this is what you would expect from somebody who has described our brave  war dead as suckers and losers.\n\nWe were promised that the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692336/troops-in-los-angeles"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…thank you.\n\nI am also proud to welcome Alissa Ellman, a disabled Army veteran  recently fired from the VA in Lockport, NY, in Western New York. Alissa  served honorably in Afghanistan and was diagnosed with a rare cancer  associated with toxic burn pit exposure.\n\nEven while receiving treatment, she wanted to work; she wanted to  serve her fellow veterans.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…verge of a war with Iran.\n\nWhen I was elected to the Senate in 2012, having served as a Governor  from 2006 to 2010 during a tremendous upsurge in the two wars in Iraq  and Afghanistan, I visited our troops multiple times in the Green Zone  in Baghdad and in Afghanistan. I went to the deployments and the  homecomings; I went to the wakes and funerals,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Well, let's rule out the reasons we know don't hold water. It is not  because Venezuela presents a security threat to the United States.\n\nThere was a reason we went into Afghanistan. However badly that  occupation ended, there was a reason we went into Afghanistan. They  were harboring a terrorist group that had attacked the United States.\n\nVenezuela…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…permission by this Congress, by this body, in a bipartisan way, passing  the PACT Act legislation, which funded care for veterans who were  exposed to burn pits in Iraq and Afghanistan and toxic substances from  their military service.\n\nMy resolution is about all veterans who serve this Nation. Some of  the veterans who have been laid off are park rangers…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…attacks from his classroom at Catholic High  School in Little Rock, Austin was determined to serve his country,  ultimately becoming a Marine Corps officer and deploying to  Afghanistan.\n\nAfter his tour in Afghanistan, Austin came to Washington, D.C., where  he would go on to work as an advocate for the corps on Capitol Hill  and, later, a judge advocate.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…as a direct result of the  Biden disastrous, misinformed leadership, not to mention he empowered  the Taliban, who came crawling out of the hills, to take back control  of Afghanistan.\n\nTo make matters worse, Joe Biden then allowed more than 190,000--let  me repeat that--190,000 unvetted Afghans into this country, no  questions asked, not to mention the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…United       States was struggling with rampant stagflation, high gas       prices, hostages held in Iran, and increased tensions with       the Soviet Union whose invasion of Afghanistan led to the       boycott of the 1980 Summer Olympics.\n\n(8) The Miracle on Ice was a turning point for American       hockey. The game was named the greatest sports moment…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…a way that does not support the       Taliban, and efforts to relocate eligible, fully vetted, at-      risk Afghans and Afghan allies located inside and outside of       Afghanistan to the United States or third countries.\n\n(2) Reports.--\n\n(A) Initial report.--Not later than the date on which the       strategy required by paragraph (1) is completed,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…terrorist who attacked them was an Afghan national. He is one of  tens of thousands of Afghans who were flown into our country following  Joe Biden's disastrous withdrawal from Afghanistan. We now know for a  fact that thousands of these individuals were not properly vetted.\n\nI specifically questioned Joe Biden's Secretary of State, Antony  Blinken, here in…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…continued his distinguished career as the Administrative  Chief for Marine Special Operations within U.S. Marine Forces, Special  Operations Command (MARSOC), deploying to Afghanistan from 2010 to  2011. He later served as the Administrative Chief for both the Marine  Special Operations Regiment and Marine Aircraft Group 29.\n\nIn 2013, Timothy reported…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…in the Middle East, the terrorist attacks of September 11,  2001, occurred. In the days that followed, her ship launched some of  the first Tomahawk cruise missiles into Afghanistan in support of  Operation Enduring Freedom, answering our Nation's call during a  defining moment in American history. She later served in California,  continuing her dedicated…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…of digital warfare.\n\nSergeant First Class Leidlein's service also included several combat  deployments. He led and trained soldiers during Operation Enduring  Freedom in Afghanistan, supporting critical security and nation- building missions that included facilitating Afghanistan's first  national election. Later, he served with distinction in Iraq,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…course,  at the baseball stadium tonight but across America because we believe  that America is back. The respect is back, especially after the  failures of what happened in Afghanistan.\n\nWith this in mind, how do we move forward? One of the things that has  really disappointed me is this debate we have had about Medicaid. I  happen to know a lot about…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Guard  Director of Operations.\n\nIn 2000, MG Hamilton served with the 49th Armored Division in Bosnia- Herzegovina as the Current Operations Officer. He later deployed to  Afghanistan where he served as the Red Team Leader for the Commanding  General. Additionally in 2017, he served as the Joint Task Force  Commanding General for Hurricane Harvey military…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689353/saluting-the-service-of-major-general-patrick-hamilton"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON.  7194) to authorize the President to award the Medal of Honor to  Kareem N. Dockery for acts of valor as a member of the Army while  serving in Afghanistan, and ask for its immediate consideration in the  House.\n\nThe Clerk read the title of the bill.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699589/kareem-n-dockery-medal-of-honor-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Georgian people are among the bravest and most pro-American in  the world. I have had the opportunity, with three of my sons serving  with Georgian troops across the world in Afghanistan and Iraq, to see  how brave and capable the troops of Georgia are. Georgian troops have  fought alongside American troops in the global war on terrorism and had  no limits…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…dates all the way back to World War I. The Danes have been  close partners in the Arctic since World War II, and brave Danish  soldiers fought and died in America's wars in Afghanistan and Iraq.  There is no ambiguity here--no ambiguity. Close ties with our  northernmost allies are what make America's extensive reach in the  Arctic actually possible. And…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…in Texas. The terrorists  entered our country as part of a program called Operation Allies  Welcome in the aftermath of the Biden administration's chaotic  withdrawal from Afghanistan.\n\nSince 2021, I have warned the Biden administration, my congressional  allies and colleagues, and the American public about the failure to vet  Afghan evacuees. Unfortunately,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…colleague, where 5,000 people a year die from  fentanyl overdose. If I were him, I would think that is a pretty big  emergency.\n\nMr. Speaker, I lost 2,500 brothers and sisters in Afghanistan over  the course of 20 years. Our country took that extremely seriously for  every single one of them. Mr. Meeks' State is losing double that from  fentanyl alone every…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}]