[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…inflation this  year under President Trump.\n\nI will highlight two examples of President Trump's reckless actions  in my home State of Rhode Island. Right now, the Rhode Island AFL-CIO  is leading a critical lawsuit against President Trump's cancelation of  the $7 billion Solar for All Program, which was designed to help low-  and middle-income families…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…the job.\n\nHe started out as the business manager of the Rhode Island Laborers'  District Council and rose to become the general president of LiUNA and  vice president of the AFL-CIO.\n\nArthur worked tirelessly to make life better for the working men and  women of our country. He helped found the Laborers' Health & Safety  Fund of North America, transforming…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the past. It is why this  resolution has support from the United Steelworkers, the International  Association of Machinists, North America's Building Trades Unions, and  the AFL-CIO. The Chamber of Commerce, the National Taxpayers Union, and  the National Retail Federation have all endorsed this resolution.\n\nThese are voices from every corner of the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…improving the lives  of workers in Missouri's Fifth Congressional District and throughout  the state. As Mr. Thomas steps down from his roles as Vice President of  the Missouri AFL-CIO and Business Manager of Laborers Local 264, a  position he held for more than 15 years, let us celebrate the work he  has done to defend workers' rights, raise workplace…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…watch C-SPAN  on a black-and-white television set in his prison cell.\n\nYou don't have to be a genius to know that this bill is an attack on  working families. That is why the AFL-CIO says no, and they are scoring  it.\n\nThey call it stablecoin. It is not stable. It is not a coin. It is a  money market account that, under this law, must pay zero percent…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the Americans for Financial Reform and signed  by dozens of organizations representing labor, civil rights,  environmental, and other relevant policy issues; another from the AFL- CIO; a letter from SIRES; another letter signed by the National  Employment Law Project, the Economic Policy Institute, and the National  Partnership for Women and Families;…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of Congress who are ready to be the       champion that pregnant and parenting students in our nation       need and deserve.            Sincerely,\n\nAdvocates for Youth, AFT, AFL-CIO, All* in Action Fund,       American Association of University Women (AAUW), American       Atheists, American Civil Liberties Union, American Humanist       Association,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…future, to be the owners  of crypto.\n\nMs. WATERS. Mr. Speaker, I include in the Record the following  letters from organizations that oppose this terrible bill: a letter  from the AFL-CIO, which is scoring this vote, and a letter from Public  Citizen.                                                           AFL-CIO,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Mr. SHERMAN. Mr. Speaker, today is the so-called culmination of  crypto week.\n\nThe AFL-CIO has sent a letter to every Member, saying that these  bills are an attack on working families and that they will score your  vote on these issues, and to vote ``no'' on…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693667/afl-cio-scoring-crypto-bills"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Teachers, Bend the Arc:       Jewish Action, Black Voters Matter Fund, DC Vote, Friends of       the Earth U.S., Greenpeace USA, Indivisible, Metropolitan       Washington Council, AFL-CIO, More Than Our Crimes, Movement       for Black Lives, Movement for Freedom.\n\nNational Association of Social Workers, National Education       Association, National Women's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Mr. Speaker, I encourage people to support the motion to recommit,  which would actually create childcare availability.\n\nMr. Speaker, I include in the Record a letter from the AFL-CIO which  says, in part: `` . . . there is no evidence that reducing the overtime  rate for employees will spur a widespread willingness of employers to  offer reimbursement…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…one in order. I will not be  offering it because in the absence of the other amendments, it is  really not useful.\n\nThis bill is an attack on working families, which is why the AFL-CIO  says no, and they are scoring it.\n\nThis bill prohibits Congress Members from sponsoring cryptocurrencies  because of the obvious corruption and conflict of interest, but…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…he became southern region president and was reelected by his  peers again in 2024. Additionally, Anthony served as an AFSCME delegate  and vice president of the New York State AFL-CIO.\n\nAnthony embodied the very spirit of union leadership: passionate,  hardworking, and unwavering in his commitment to others. His legacy  will live on through the countless…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…stations, part of the ``green new scam''; subsidize California's  disaster rail system; fund infrastructure and renovation projects at  the wealthy Met Museum and the Michigan AFL-CIO; a dance festival in  Massachusetts; DEI initiatives.\n\nLook, we don't need this. We don't want this. This is what is driving  the train toward the $38.5 trillion debt that…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…``immediately vanish.''\n\nAnother 10,000 construction jobs expected to be created by       the project have also been nixed by Biden's decision.\n\nA prominent union leader and Biden ally, AFL-CIO president       Richard Trumka, lashed the decision in Axios on HBO interview       Sunday, saying Biden should have also announced where he       would replace those lost…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}]