[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…from Newsweek published during the delegation's visit. I asked  unanimous consent that the article be included in the Record: Libya Has  a Deal for Trump That Could Reshape Africa and Europe: https:// www.newsweek.com/libya-deal-trump-could-reshape-africa-europe-11063123.", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697566/recognizing-the-importance-of-a-new-libya"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…do to help were fired while they were in Myanmar trying to figure out  what we can do to help that situation.\n\nSo China's image is being bolstered at our expense.\n\nAcross Africa and Latin America, Chinese Ambassadors are giving  interviews focused on the unreliability of the United States as a  partner. They are inviting local officials to all-expense-paid…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…America who grow the corn, wheat, beans, and  peanuts. It is dairy farmers in Vermont who produce the powdered milk  that USAID uses to feed millions of hungry children in Africa, Central  America, and Asia.\n\nIt is American companies that manufacture the generators, water  pumps, trucks, and computers for USAID's programs, and American  workers--in…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…that the United  States works with every single day.\n\nAt a time when our competitors are working overtime to expand their  influence in Asia, the Caribbean, the Pacific, and Africa we cannot  afford to sit back.\n\nThe PARTNER Act is a concrete step to strengthen U.S. leadership,  deepen our alliances, and keep America the center of global diplomacy  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…and\n\n(2) would preserve investments in a just energy transition       and in clean, reliable, and affordable energy buildout       through development finance investments in Africa that       maximize market opportunities for United States companies and       save lives.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693615/hr-4"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…gentlewoman from the Virgin Islands (Ms. Plaskett), this is an  important bill in terms of not only the Virgin Islands but  strengthening our links, communications, and economy with Africa, as  well.\n\nFor all those reasons, I urge that we support the bill.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…opportunity,  creating jobs, strengthening strategic partnerships, and forging  mutually beneficial economic bonds between the United States and our  allies in sub-Saharan Africa.\n\nSince its enactment in 2000, AGOA has provided duty-free access to  the U.S. market for a broad range of goods from eligible AGOA sub- Saharan African countries. AGOA has…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…adversaries are buying influence, forging  military alliances, and rewriting the rules of global engagement.\n\nThis is not theoretical. This is happening right now. Let's take  Africa, for example, a region poised to become one-quarter of the  world's population. U.S. assistance has helped build stability there  through nutrition programs, education, and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Born in Muskegon and raised in Grand Rapids, Collins was drawn to art  from a young age. Despite initial discouragement, he pursued his  passion, eventually traveling to West Africa to immerse himself in his  cultural roots.\n\nCollins' work has been displayed worldwide, from exhibitions in  Africa to murals honoring historical figures in the United States.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…resolution is one that I am very proud to present. This is  a resolution for slavery remembrance month. As you know, August 1619  was the month and year that enslaved persons from Africa were  introduced into the Colonies. Since that time, we have had an adverse  impact on African Americans in the United States of America.\n\nWe need to retrace some of the history…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Congo, as outlined in United Nations Security Council  Resolution 2666 (2022). Last, it calls on President Donald Trump to  appoint a Special  Envoy to the Great Lakes region of Africa, which will be vital to  addressing the enduring regional security crisis emanating from eastern  DRC.\n\nMr. Speaker, I hope my colleagues will join me in condemning the  ethnic…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699456/reintroduction-of-the-resolution-to-condemn-the-ethnic-violence-in-the-democratic-republic-of-the-congo"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Sudan's gold trade flows through  the UAE.\n\nThe United States needs to stand up and say enough is enough.\n\nFor people who say ``Well, what difference does it make? That is  Africa. That is a long way away from the United States. Why does it  matter?'' well, because, sadly, what happens in Africa, what happens in  Sudan doesn't stay in Sudan. If you can't…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…big wins from diplomacy.\n\nBack when I was younger, the number of countries possessing nuclear  weapons was higher and then decreased. We convinced, through diplomacy,  South Africa to give up their nuclear weapons. At the time of the end  of the Soviet empire, Ukraine possessed the world's third-largest  nuclear weapon inventory, which they voluntarily…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…have gotten terrifyingly close to nuclear  war in  these past 80 years, we have gotten close to disarmament. It is not a  pipe dream. Reagan and Gorbachev also did it. South Africa unilaterally  dismantled their arsenal. Other countries have stopped developing  nuclear weapons before they got the bomb.\n\nIt is possible to disarm, and it is possible to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…colleagues to vote in support  of renewing the African Growth and Opportunity Extension Act.\n\nAGOA is a critical program to advance prosperity for the people of  sub-Saharan Africa and to maintain United States' leadership in the  region. It is a program that has bipartisan support.\n\nAGOA is far from perfect, and so I understand concerns raised by a…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698907/agoa-extension-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…disruptions created by Houthi  aggression in the Red Sea and Gulf of Aden. The result has been a  disturbing spike in pirate attacks in the waters surrounding the Horn  of Africa.\n\nThis bill uses economic power to support ongoing military efforts by  the U.S. and its partners to combat piracy and safeguard trade in this  vital strategic waterway. The…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…``I don't want to just negotiate with you, President Trump,''  President Putin said.\n\nHe said: I want China to be part of the negotiations and India and  Brazil and South Africa--and get this; this will curdle your lunch-- North Korea.\n\nMama Gump said that stupid is as stupid does. President Putin is not  interested in peace. President Putin thinks…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…brutal 6-year war that  saw the proliferation of jihadist groups and widespread human rights  violations, including the resurgence of slavery. Weapons were spread  throughout Africa. Our intervention helped spur mass migration into  Europe and contributed to widespread instability across Africa as  weapons flowed from Libya into the Sahel and Sub-Sahara,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…assistance activities conducted primarily in African nations.\n\nThis funding supports the Defense Health Program, and those funds are  credited with scaling back the AIDS epidemic in Africa. This program  has long enjoyed support across party lines.\n\nMr. CALVERT. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CALVERT. Mr. Chair, the gentlewoman's amendment…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…for  any mission at any moment or any call to action.\n\nOn September 8, 2001, the USS Enterprise departed the Arabian Gulf,  bound for home with a scheduled port call in South Africa for the first  time in about 40 years. Just days later, while still south of the  Arabian Peninsula, those aboard the USS Enterprise watched in horror as  the tragedy of 9/11…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…special-interest aliens move through that area of our border than any  other area of our entire 2,000-mile-long border with Mexico. People  from Russia, China, from Central Africa, from Uzbekistan, and from  multiple other places fly into Tijuana and then literally drive up to  the gap in the fence and walk across, right into the United States.\n\nAt least,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…invasion of Japan.\n\nAfter the war ended, Edward remained on duty during the occupation  until January of 1946. During his service, he traveled the world from  Australia to Africa to Japan and back home through the Panama Canal.\n\nHe was honorably discharged with the rank of Seaman 1st class.\n\nAfter the Navy, Edward built a long and successful career…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…currency backed by the U.S. dollar. That could  change if we don't adopt laws like this.\n\nWho steps in? Adversaries like China.\n\nWe want to have a presence on the Continent of Africa. That is the  next frontier. This assures us of that.\n\nIn the early days, caution was certainly prudent. Stablecoins are a  novel technology with significant questions regarding…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693846/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…adversaries to step in and coerce  a country for natural resources or military capabilities.\n\nHunger fuels desperation, and desperation fuels unrest. In the Sahel  region of Africa, violent extremism is on the rise. Terrorist groups  exploit food insecurity to win recruits and enforce loyalty. Programs  like Food for Peace and McGovern-Dole break that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…to advance the bipartisan  legacy of the African Growth and Opportunity Act, a program which has  been a pillar of U.S. trade and economic engagement throughout sub- Saharan Africa.\n\nAs we all know, trade requires consistent engagement. With over  17,000 tariff lines and complex supply chains, trade is a detailed and  dynamic system which values certainty.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698901/agoa-extension-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…195,000 from the  State of Arkansas.\n\nWe remain forever grateful to the Allied war effort leadership, to  the men and women who served down range in the Pacific, Europe, North  Africa, and beyond, and to those on the home front who taught our kids  and fueled the arsenal of democracy.\n\nOur generation salutes the Greatest Generation for the defeat of  fascism…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…submarines. In fact, it is one of the few military bases where we can  actually reload submarines. We use Diego Garcia to respond to tensions  throughout the Middle East, throughout Africa, and throughout Asia.  Recently, we relocated several B-2 bombers to respond to Iran's  aggression toward demonstrators.\n\nThere aren't words in English to overstate the importance…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…we have statistics.\n\nI remind everybody that people who come here from India, who are the  most successful minority, Philippines, China, Japan, Cuba, the coast of  western Africa all are succeeding wildly in America. All it takes is  hard work and strong families, and all these groups have strong  families.\n\nI encourage our educators and all our policymakers…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…over $9 billion because we cut liberal projects.  Let's look at some of them. One of those pet projects included net-zero  cities in Mexico. Another cut out electric buses in Africa and  taxpayer-funded classes on ``environmental racism.''\n\nAdditionally, Republicans created a $50 billion rural hospital fund.  It is the single largest Federal investment…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…we value--an important moment in our Nation's and, in  fact, in our world's history.\n\nThe Italian campaign was fought across treacherous terrain, from the  shores of North Africa to the waters of Sicily, along the rugged Amalfi  Coast, which ultimately led to the liberation of Rome--the first major  European city liberated during World War II. U.S.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}]