[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Rustin was an advisor in Martin Luther King, Jr.'s inner circle as  King advocated pacifism and nonviolence for achieving equal treatment  for African Americans.", "title": "Introduction of the Bayard Rustin Stamp Act", "date": "2026-02-09"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I rise simultaneously to denounce the President's executive orders  that have  closed the Smithsonian Institution for African Americans.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "That year she published ``Their  Story: The History of Blacks/African Americans in Sewickley and  Edgeworth,'' documenting an often overlooked part of the local  community.", "title": "Mary Elizabeth ``bettie'' Cole Post Office Building", "date": "2025-12-09"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "In 1965, a year before I was born, after 346 years, African Americans  were finally given full citizenship with that crown jewel of the Voting  Rights Act.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "A lifelong  champion for racial justice, McKinney founded Liberty Bank, Seattle's  first black-owned financial institution which countered racially biased  restrictions on loans to African Americans and expanded opportunities  for homeownership in Seattle.", "title": "Recognizing Reverend Dr. Sammuel McKinney", "date": "2025-12-17"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Speaker, February is Black History Month, when we  take special note of the historic achievements of African Americans who  have helped shape today's America.", "title": "Black History Month", "date": "2026-02-12"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "I think for many African Americans today that is the  heartbreak that we face.", "title": "Building A Beloved Community", "date": "2026-01-20"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "The result was Jim Crow 1.0, which  deprived generations of African Americans of the right to vote, the  right to choose leaders who could ease their economic burdens and  expand opportunities for their families.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "When he got there, a crowd had gathered, hundreds of people, African  Americans who lived in that community and knew about Dr.", "title": "Building A Beloved Community", "date": "2026-01-20"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "The removal of these Department of Defense programs was a deliberate  attempt to diminish the contributions of African Americans in the  military and to erase the struggles they overcame in their fight for  justice and equality.", "title": "Black History Month", "date": "2025-02-24"}, {"senator": "Al Green", "party": "Democrat", "sentence": "The theme is African Americans and labor.", "title": "Impact of President on Peace Process", "date": "2025-02-27"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "African Americans have faced enormous challenges in every corner  of life--education, economic security, health care, employment, housing  and the criminal justice system.", "title": "Commemoration of Juneteenth Amid the Erosion of Black History", "date": "2025-06-20"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "Senator Thompson developed a reputation as a respected local  historian for compiling the history of African Americans in Central  Florida and authoring the book ``Black America: Orlando, Florida.'' She  developed a passion for the history of African Americans in Central  Florida.", "title": "Recognizing Geraldine F. Thompson's Service to the Great State of Florida", "date": "2025-04-03"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Donald Trump is undoing the progress  African Americans have fought for, threatening justice, equality, and  our democracy.", "title": "Trump's First 100 Days", "date": "2025-05-06"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Is that someone that I think can be trusted to deal fairly in terms  of minority groups, such as Jewish Americans, African Americans, and  Hispanic Americans?", "title": "Calling on Elected Officials and Civil Society Leaders to Counter Antisemitism and Educate the Public on the Contributions of the Jewish American Community", "date": "2025-05-14"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Frederick Douglass came to Washington, D.C., in 1870 to become editor  of the New National Era paper, which chronicled the progress of African  Americans in the United States.", "title": "Designating the House Press Gallery in the United States Capitol As the ``Frederick Douglass Press Gallery''", "date": "2025-06-09"}]