[{"senator": "Marc Veasey", "party": "Democrat", "sentence": "…profession and her commitment to  justice and public service.\n\nJudge Hicks's distinguished career stands as a testament to  perseverance, excellence, and leadership. As the first African American  woman to graduate from Texas Tech University School of Law in 1974,  Judge Hicks broke numerous barriers in Tarrant County, serving as the  first Black female Municipal…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…conduct.  Sadly, some of the children took their own lives because of their  exposure to what happened on these devices. It is heartbreaking.\n\nI recall one in particular: a young, African-American, high school  student--a track star at his school--who got swept into some sort of  broadcast on social media and in the span of 19 hours became so  despondent and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…of us in the Senate of a key lesson: When pushing back  against an adversary, it is best to do so ``in the company of friends''  rather than alone.\n\nThere is also a popular African proverb: ``If you want to go fast go  alone; if you want to go far, go together.'' Ambassador Rudd understood  that resisting coercion and deterring aggression requires building…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…not name a single  requirement of the Elementary and Secondary Education Act, the main  Federal law that supports K through 12 education.\n\nShe couldn't say whether teaching African-American history courses  violated Trump's Executive order on radical indoctrination. Teaching  the history of our country is considered radical indoctrination by this  President.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…then he went on  to earn a divinity degree from Colgate in 1952. He settled down in  Seattle, where he came to lead the congregation of one of Seattle's  oldest and largest African American churches for forty-three years as  pastor of Mount Zion Baptist Church. He was not only a spiritual guide,  but a community builder who tripled the size of his congregation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Speaker, today, I introduce the Golden Thirteen  Congressional Gold Medal Act. This bill would award a posthumous  Congressional Gold Medal to the 13 men who became the first African  American commissioned and warrant officers in the United States Navy.\n\nIn 1944, the Navy began officer training for 16 African American men.  At that time, there were no…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699496/introduction-of-the-golden-thirteen-congressional-gold-medal-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Wisconsin. Madam Speaker, I thank the gentlewoman from  Alabama for yielding me time.\n\nMadam Speaker, I rise today to urge my colleagues to vote in support  of renewing the African Growth and Opportunity Extension Act.\n\nAGOA is a critical program to advance prosperity for the people of  sub-Saharan Africa and to maintain United States' leadership in…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698907/agoa-extension-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…communities.\n\nIn 2003, Parks was awarded the GIANT Among Giants Award, an annual  award presented by the city of Grand Rapids since 1983 to recognize  exceptional contributions by African Americans to the greater Grand  Rapids community.\n\nRillastine Wilkins, City Council: At age 18 and with $3 in her  pocket, Wilkins made her way to Muskegon, where she had…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…And now, they are attempting to ``rewrite history'' with the  latest executive order targeting the Smithsonian Institute.  Specifically, the Executive Order singles out the African American  History Museum for its ``corrosive ideology.'' Before these relatively  recent attacks, diversity itself had been the goal--in fact, the Brown  v. Board of Education…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…considering pardon applications from across the  country.\n\nIs that someone that I think can be trusted to deal fairly in terms  of minority groups, such as Jewish Americans, African Americans, and  Hispanic Americans? I don't think so.\n\nI am sorry the gentleman doesn't think it is appropriate to talk  about anti-Semitism when we see it. We just have an…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, Commander Janie L. Mines was the first  African-American woman to graduate from the U.S. Naval Academy in 1980.\n\nCommander Kristine Holderied, a Howard County native, was the first  woman to graduate as valedictorian not…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…know how it ends if we don't act. Tonight, I say: We have come  too far and there is too many to go back in time again.\n\nIn 1965, a year before I was born, after 346 years, African Americans  were finally given full citizenship with that crown jewel of the Voting  Rights Act.\n\nI am 59 years of age. I am the first generation in my family, all  born in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, it is my honor and pleasure to extend  heartfelt congratulations to the congregation of First African Baptist  Church in Columbus, Georgia, as they celebrate a remarkable 185 years  of faith and community. This great occasion will be marked by a  celebration at the church…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…come from       animal to human transfer of disease. [FAO] are the ones who       are out in the communities monitoring bird flu, monitoring       for anthrax, monitoring for, African swine fever, which       doesn't necessarily transfer to humans but does devastate our       agricultural sector. And [FAO] enable[s] a response that can       contain matters…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…including interviewing more than 100 community members. In 2000, that  work came to fruition with the publication of her book titled, ``Their  Story: The History of Blacks/African Americans in Sewickley &  Edgeworth.'' It was a one-of-a-kind documentation of a significant and  often-overlooked part of the Sewickley Valley community's history and  heritage.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Madam Speaker, I rise in support of H.R. 6500,  the African Growth and Opportunity Act (AGOA) Extension Act, introduced  by Chairman Jason Smith.\n\nThis bill reauthorizes the AGOA program--first established by  Congress in 2000. AGOA…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698905/agoa-extension-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…responsibility as Representatives  to act on those abuses and rescind the money.\n\nAll of us should be able to vote to eliminate $45 million in  duplicative spending in the African development program. We should all  be able to support eliminating $1.7 billion for radical gender projects  in the Economic Support Fund. Every Member of this Chamber should…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Fame. I am talking  about Lieutenant Governor Jennifer Carroll.\n\nLieutenant Governor Carroll's journey began in the United States Navy  as a jet mechanic, one of the very first African-American females to  serve in that capacity.\n\nThen, after her military service, Lieutenant Governor Carroll brought  her leadership and unwavering service to the people of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…slavery,       championing equal rights and women's rights, and for being a       forceful speaker;\n\n[Whereas, during the Civil War, Douglass was a recruiter       for the first African-American army regiment;\n\n[Whereas Douglass met twice with President Lincoln, first       about the pay and treatment of Black soldiers and then to       discuss the President's…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…boarded a troopship somewhere and  sailed, in some cases, for well over a month just to return to U.S.  soil. It was the same thing with the European theater or the North  African theater.\n\nThere was a long period of time where those combat veterans who had  been under tremendous stress had a chance to decompress over a period  of time with each other…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "French Hill", "party": "Republican", "sentence": "…with the  other World Bank divisions such as the Inter-American Development Bank,  the Asian Development Bank, the European Bank for Reconstruction and  Development, and the African Development Bank.\n\nPrior to 2018, the IDA did not issue debt in the securities markets.  Its funding came primarily from donor contributions and repayments on  past loans.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…best buddies.\n\nIn fact, China has convinced Mauritius to sign on to two Chinese- instigated--actually, Communist Party of China-instigated--two  treaties. One is called the African Nuclear-Weapon-Free Zone Treaty.  This is a China-backed treaty. They convinced Mauritius to join it. It  prohibits the research, stockpiling, and possession of nuclear weapons…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…the diligent work  of the full committee chairman, Chairman Smith, to prioritize this  issue.\n\nMadam Speaker, we have an opportunity to advance the bipartisan  legacy of the African Growth and Opportunity Act, a program which has  been a pillar of U.S. trade and economic engagement throughout sub- Saharan Africa.\n\nAs we all know, trade requires consistent…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698901/agoa-extension-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…40% of the world's       copper is mined in Chile and the Democratic Republic of       Congo, and most of the global supply is refined in China. The       South American and African countries' environmental and labor       records, where workplace hazards and occupational deaths       occur frequently, raise significant concern. China's       prominence…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Federal regulations, Federal law. There is no  question about that. However, there has been some, I guess, well- intentioned laws from some States that in an attempt to ban African  elephant ivory, which we all want to do that--that is not allowed in  America, by the way--States have gone too far and cast this huge net  and said you can't buy any ivory…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Iron Curtain; and\n\nWhereas, this history encouraged many Jews to become leading  proponents and supporters of the civil rights movement, marching  shoulder to shoulder with African Americans and others, united in  support for equal rights, equal protection under the law, and the  recognition and respect of human dignity; and\n\nWhereas, the Jewish community…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and  pass the bill (H.R. 6500) to extend duty-free treatment provided with  respect to imports from certain countries in Africa under the African  Growth and Opportunity Act, to extend customs user fees, and for other  purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…prevention education activities undertaken in connection with the  United States military training exercises and the humanitarian  assistance activities conducted primarily in African nations.\n\nThis funding supports the Defense Health Program, and those funds are  credited with scaling back the AIDS epidemic in Africa. This program  has long enjoyed support…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…throughout the Nation.\n\nDouglass was the first Black reporter admitted to the Capitol press  galleries. From 1871 to 1875, he reported on the House and Senate  action, keeping the African-American community informed during  Reconstruction after the 13th, 14th, and 15th Amendments. He spent  countless hours writing and studying right here in the House Press…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "Mr. COONS. The CEO of the U.S. African Development Foundation is one  Peter Marocco, known to all of us, who watched how DOGE came in and  tore up most of our foreign assistance organizations.\n\nYes, an individual…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699438/consolidated-appropriations-act-2026"}]