[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…trillion--trillion dollars--to the national  debt. I think of my grandson when I think of that. They want to make  the biggest cuts to Medicaid ever. This is the Republican agenda:  Billionaires win. American families lose.\n\nRepublicans have gotten by so far with a bunch of empty and deceptive  promises that none of the outrageous cuts they propose will…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…legislation such as the Bipartisan  Infrastructure Law. Mr. Thomas was also a vocal proponent of pro-labor  reforms to the National Labor Regulation Act, aligning Missouri's  agenda with national priorities.\n\nMr. Thomas' service is not only defined by awards and titles, but by  the lasting impact of his work. He forged partnerships between unions  and…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…strategies are proven, evidence-based solutions to gun violence,  and yet the Trump administration decided they are inefficient.\n\nHouse Republicans are complicit in the Trump agenda to endanger  public safety. In the dead of night, Republicans added a provision to  their budget that would deregulate gun silencers, allowing any and all  private sales of…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the Affordable Care Act for decades.\n\nIt doesn't work.\n\nThe plan also creates a backdoor ban on abortion and reproductive  healthcare.\n\nRepublicans have shown they have no agenda to address healthcare  affordability and access. As Americans stare down notices that their  healthcare costs will increase by tens of thousands of dollars in just  2 weeks,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…to wait for President Trump to keep his promise to  address the cost of living in this country. I am going to help and push  back and introduce the economic dignity for all agenda, a plan to  tackle the high cost of living in our country.\n\nWe need to ensure that in every family in every single corner in our  country, a child has resources that they need…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…legislation  eviscerating Medicaid, abandoning our kids, failing our veterans, and  squandering our future--all for the sake of tax cuts for the ultrarich.  This is the Republican agenda: Billionaires win; American families  lose. Billionaires win; American families lose in the Republican plan.\n\nRepublicans have failed to be honest with the country about the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…42,000 children. This budget would  also take food away from hungry children and deny healthcare to sick  veterans.\n\nWhy are House Republicans pushing such an immoral and cruel agenda?\n\nIt is not to reduce our deficits. In fact, their budget adds nearly  $1.6 trillion a year to our debt.\n\nNo, it is to pass tax cuts for billionaires and foreign investors.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688058/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…challenges my community faces. In Virginia, we are  on the leading edge of President Trump's economy. In my district,  everyone knows someone who has lost their job due to the agenda coming  from the White House and too often from this Chamber. If we do not  change course, what is true in Northern Virginia today will soon be  true in every district in this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695221/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…determined  cannot be used for this purpose. This is government overreach at its  most reckless.\n\nIt is a distraction--a deliberate one--from the fact that President  Trump's agenda is failing to meet the needs of working families. It  doesn't lower prescription costs. It doesn't fix our crumbling  infrastructure, and it certainly doesn't improve the air…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…totally unqualified to oversee the education of our  Nation's children, but Donald Trump doesn't care about that. Linda  McMahon will carry out President Trump's dangerous agenda to dismantle  the Department of Education, privatize the Nation's public schools, and  strip educational opportunities from millions of students across the  country.\n\nIn doing…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…health advice that helps keep our  neighbors healthy and safe.\n\nThen, here, when we are talking about oil and gas and their  lobbyists, they are so firmly in control of the agenda here in the  United States Congress. I just think my colleagues are not solving  problems. Watching the President just remain out of touch is so painful  to people back home…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…in sales set by California requirements.\n\nTo my friends on the other side of the aisle, the global industry and  the market have left them behind. House Republicans have no agenda to  lower the costs for the American people. They are attacking California  by putting on this political Kabuki show for political benefit.\n\nLet's talk about California. Despite…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…community leader, and advocate for spiritual and social transformation.  Over the past decade, she has played a key role in the nationwide  campaign to advance a powerful moral agenda to end poverty.\n\nAs National Security Director for Repairers of the Breach, Rev. Dr.  Owens-Barber has been a steadfast leader of the Poor People's Campaign  and has championed…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Congress--not from votes on  our side. But it was really what allowed for this mass roundup of  people from workplaces, from farms, from schools--all in service of a  political agenda that is not about protecting Americans but is serving  the political interests of the President and the fiendish design of  Stephen Miller, with the implementation of a reckless…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…commercial use.\n\nAgain, House Republicans have chosen this time to ignore the pressing  issues that Americans face and to instead march forward with their  anti-efficiency agenda that drives up energy costs for American  businesses and consumers. Democrats, on the other hand, are here to  defend these commonsense energy efficiency standards and the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Statement of Administration Policy supporting  H.J. Res. 20. Congress should pass H.J. Res. 20 to right the wrongs of  the previous administration, execute President Trump's agenda, and  protect our consumers.\n\nI thank the gentleman from Alabama's Sixth District for his  leadership.\n\nMr. Speaker, I urge my colleagues to vote ``yes,'' and I reserve the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "Ms. LUMMIS. Mr. President, I rise to speak in support of President  Trump's energy dominance agenda and to oppose my colleagues who want to  keep America literally in the Dark Ages when it comes to producing  energy. This, the greatest energy-producing country, is being asked…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…floor with  bipartisan support in both the 117th and 118th Congresses. I look  forward to seeing the Senate take swift action on this bill, which  supports President Trump's agenda to root out fraud and abuse.\n\nMr. Speaker, I urge my colleagues to support H.R. 1804, and I reserve  the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…regulations while hiding  the true impact. This is why my RED TAPE Act is critical. My bill  ensures that Agencies can no longer manipulate a cost-benefit analysis  to push their own agenda. It requires Agencies to prioritize data- driven, measurable economic benefits, not vague ideological  justifications.\n\nWhile some Federal employees complain about the new…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…that seems to be their habit,  their modus operandi these days.\n\nMadam Speaker, House Republicans are fighting tooth and nail to undo  the damage President Biden's radical agenda--maybe that is why they are  complaining, come to think about it--inflicted on our economy, our  freedoms, and the American way of life. It is just that simple.\n\nThis week,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…House GOP leadership, the President,  his administration, and we are neck deep in the process of getting this  over the finish line.\n\nThis bill will deliver on our conservative agenda and make positive  changes that we know that Americans want. From a more secure border to  stronger domestic energy resources, to more efficient Federal programs,  to a tax…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and Commerce, I was pleased to have him as a member  of my team as Chief Counsel for the Environment Subcommittee to help  develop and implement the committee's legislative agenda.\n\nRecently, Jake accepted a role in President Trump's administration to  serve under Secretary of Interior Doug Burgum, as Deputy Solicitor for  Energy and Mineral Resources.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…leadership in the world.\n\nThe other message I heard over and over was this: Keep pressing  forward, unrelenting, undeterred, and unapologetic, to advance the  America First agenda.\n\nMy response, Mr. Speaker: Yes, ma'am. Yes, sir, as sure as the Sun  rises, we are just getting started.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Today, Mr. Speaker, we face a watershed moment for the American  people. This Republican majority was given a clear mandate by the  American people, which is the America First agenda. This bill is our  opportunity to deliver on that agenda.\n\nH.R. 1 stops the largest tax increase in U.S. history, while  providing the largest tax cut for working-and middle-class…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…facet  of Americans' lives. That includes four separate rules on appliances.\n\nThat is right--last year, appliances became the latest focus of  Democrats' radical environmental agenda. One rule applied expensive,  unnecessary, new standards to commercial fridges and freezers, the kind  used in restaurants and grocery stores. The Energy Department estimated…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…shaky power grid. And that is just to start with.\n\nThe administration unleashed a veritable blizzard of Green New Deal  regulations as it attempted to push through its far-left agenda.\n\nThe American people called for a new direction this past November,  and the Trump administration and the Republican majorities in Congress  have wasted no time in getting…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Related Agencies,  or T-HUD, I am particularly proud of that portion of this bill. It  provides $103 billion in budget authority and supports President  Trump's America First agenda. It invests in transportation  infrastructure and housing affordability while cutting wasteful  spending and reducing the Federal bureaucracy. In fact, this bill  codifies…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…gave Trump the Presidency.\n\nMr. ARRINGTON. They undermine the will of the people who  overwhelmingly elected President Trump and gave him the mandate of the  America First agenda. They are not resisting us. They are posturing and  placating the radical left. They are holding back what the American  people wanted and that was a new direction for this…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696731/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…governed by crisis. We rushed preholiday omnibuses,  backroom deals, and broken promises.\n\nMr. Speaker, those days are over.\n\nToday, following President Trump's America First agenda, along with  Chairman   Tom Cole's unmatched leadership, we are doing what the  American people sent us here to Washington, D.C., to do: Put America  first.\n\nMr. Speaker, 12…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you. You think, well,  that doesn't make any sense. It is someone who hit a computer button.\n\nWhat also happens when we actually see stories like: OMB says Trump's  economic agenda will cut the deficit in half. I am trying to find the  policies.  You start to go over it, and many of these stories are actually someone  was giving a speech, and so the AI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]