[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…which was truly heartless. Democrats protected that  funding and increased it by $7 million.\n\nWe shot down Trump's proposals to merge and weaken important Federal  Agencies--Agencies like the Bureau of Alcohol, Tobacco, Firearms and  Explosives, the Drug Enforcement Administration, and the Office on  Violence Against Women and COPS Office under the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…form or survey  that will impose an information collection burden on the general  public.\n\nAlthough well-intentioned, the Paperwork Reduction Act often prevents  Federal agencies like the SEC from obtaining data from the public. This  is the very data that assists the agencies in carrying out their  missions.\n\nThis bill streamlines the ability of the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693955/improving-access-to-small-business-information-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…independent Agencies run by  bipartisan, multimember commissions, like the FTC. Now-Justice  Kavanaugh, while serving on the DC Circuit, wrote that multimember  independent Agencies like the FTC are part of a ``deeply rooted  tradition'' that ``has been widely recognized by leading judges,  congressional committees, and academics.''\n\nThis is because bipartisan…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…entrepreneurs or those people struggling with opioid  addiction. If the majority did, my colleagues on the other side of the  aisle would uplift successful programs and agencies like SBA or SAMHSA,  not gut them.\n\nUnless you are a mega-donor or a loyal MAGA mouthpiece, you do not  matter to this Republican majority. What is happening here isn't just…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…administration is  fighting that ruling. I remain deeply concerned about this  administration's attempt to eradicate the independence of the CPSC and  other independent agencies like the CPSC.\n\nI also strongly oppose the Trump administration's ongoing plans to  fold the CPSC's mission into the Department of Health and Human  Services with a smaller…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…imposes precise, legally binding  spending requirements that constrain executive overreach.\n\nThis will provide much-needed funding and certainty to public land  management agencies, like the National Park Service, that have suffered  tremendous disruption over the past year.\n\nThe bill also protects funding for programs important to combating  and adapting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…of American innovation and is foundational  for continuing basic research discoveries. We hope this work continues  for many decades to come.\n\nSupport for Federal science agencies like the NSF have led to new and  unexpected research directions that would not have been possible  without Federal funding.\n\nThat is why it is important that we recognize the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…talking about--people being laid off  from their jobs, veterans who worked hard for this country and worked  hard in the Department of Veterans Affairs and other Federal Agencies  like the National Park Service, like the EPA, like the DOT. And that is  whom Donald Trump and Elon Musk are firing.\n\nIf you want to save money, I am all for it. I am there…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…dangerous for our country's       future.\n\nScience is not political. It serves all people, regardless       of race, background, or party affiliation.\n\nYes, funding cuts to Agencies like NIH and the National Science  Foundation threaten to halt critical research, slowing the development  of treatment for diseases that impact millions. These cuts will push…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…lost exports. Markets are  shrinking. Input costs are soaring, making it hard for farms to stay in  business.\n\nWe see the sweeping budget cuts and mass layoffs at critical agencies  like NOAA and the Bureau of Reclamation, threatening the services that  farmers depend on: water deliveries, weather forecasting, climate data,  and much more. Farmers need…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…around the  district I represent in the San Francisco Bay Area. I also ask my  colleagues to continue to endeavor to invest not just in the Coast  Guard but in their partner agencies like FEMA and the National Weather  Service to ensure safety and mission readiness.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694198/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…recklessness is hurting rescue efforts. It has hurt the  existing ones, and it is going to hurt more in the future, unless they  reverse themselves.\n\nWe all support making Agencies like FEMA more efficient. Americans  support cutting waste. Americans support improving the Federal  response. But Americans sure as hell don't support DOGE-like cuts to  vital…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…for Elon Musk. Again, it is important that we reauthorize these  programs or authorize these programs for the first time.\n\nHowever, unless we have enforcement ability from agencies like the  Consumer Product Safety Commission, they are not going to mean much  because they require enforcement and investigation. Basically the  agencies are the ones that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…chairman for yielding.\n\nThis bill would nullify President Trump's Executive Order No. 14251,  which rightly excluded 40 national security agencies from collective  bargaining.\n\nAgencies like FEMA, the Coast Guard, the CDC, and the VA cannot  afford to be paralyzed by union red tape when lives are on the line.\n\nI want to emphasize that this is going to nullify…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…emphasized.\n\nIt will protect our public lands, and it will ensure that we are as  ready as we can be for the upcoming fire season.\n\nFor example, we provide funding so that Agencies like the Bureau of  Land Management, BLM, have greater capacity to issue permits for energy  projects. We have included robust funding from mapping and minerals- related work…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…vulnerabilities that could be leveraged by malicious actors       to conduct sophisticated vehicle-based attacks.\n\n(5) The Department of Homeland Security, through agencies       like the Transportation Security Administration and the       Cybersecurity and Infrastructure Security Agency, plays a       vital role in detecting, assessing, and mitigating…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…expenditures that we  should foreswear forever. One is grants, cash handouts to political  favorites with little accountability or oversight, whether directly or  through agencies like USAID. The other is subsidies that replace the  judgment of consumers with that of politicians, distorting the flow of  capital from its highest and best use.\n\nAs we express…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692548/rescissions-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Both the Trump and Biden administrations have made Federal research  security a priority by issuing executive orders and Federal research  security guidance for government agencies like DHS to follow.\n\nDespite this, S&T has not demonstrated how it will protect its $461  million worth of R&D projects from unauthorized access.\n\nEvery taxpayer dollar spent…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…has done some good things, but they have also done things that  were an enormous waste, totally inappropriate, and, in fact, they lost  the trust of the American people. Agencies like this need to be  reformed. The American people aren't going to put up with it anymore.\n\nWhy is the government still funding public television when most  people have hundreds…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…that are simply not in  the interest of the American people.\n\nMaybe USAID has done some good things, but they have also done many  things that were totally inappropriate. Agencies like this need to be  defunded or reformed. The American people aren't going to put up with  it anymore.\n\nTo that end, why is the government still funding public television…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692539/rescissions-act-of-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…Congressional Review Act was enacted through regular  order to create an expedited process for Congress to consider  resolutions that overturn rules finalized by Federal Agencies, like the  Biden EPA's decision to approve California's EV mandate. The CRA's  rationale--as explained by sponsors Don Nickles, Harry Reid, and Ted  Stevens--was to allow Congress…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}]