[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "We couldn't buy land, and we couldn't even open bank  accounts until about 50 years ago.", "title": "Women's History Month", "date": "2025-03-31"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "So I believe we must all,  regardless of political affiliation, reaffirm what both Presidents  Reagan and Gorbachev said 39 years ago:\n\nA nuclear war cannot be won and must never be fought.", "title": "New Start Treaty", "date": "2025-07-22"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "Almost 25 years ago, George W.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "I was here, a month ago today, sharing stories from businessowners in  New Hampshire who weren't sure how they were going to keep operating if  specialized machinery that they can only get from Canada suddenly costs  25 percent more.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "A few months ago, they were all for getting rid of it.", "title": "Central Texas Floods", "date": "2025-07-14"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, 20 years ago our,  pilots flew the first biofueled F-16 aircraft out of a major base in  our country.", "title": "Reflecting on Impact of Illegal Action in Venezuela", "date": "2026-01-08"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "As I noted during Senate consideration of the NDAA a few months ago,  the President has played politics with our Nation's military and tried  to use them to advance his authoritarian agenda, be it here at home or  abroad.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "He now has the lowest approvals any  President has seen through his first 100 days since they started  polling 80 years ago.", "title": "Trump Administration First 100 Days", "date": "2025-04-28"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Speaker, 5 years ago today, that painting towered over the swarm  of insurrectionists Donald Trump sent to this Capitol.", "title": "January 6 Attack", "date": "2026-01-06"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "I urge you to reject these measures and uphold the values       Congress sought to advance more than 50 years ago when it       passed the District of Columbia Home Rule Act: that District       residents should enjoy the ``powers of local self-      government'' that all other Americans enjoy.", "title": "District of Columbia Judicial Nominations Reform Act", "date": null}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Republicans in this body need to remember the sacred promise made to  children with disabilities 50 years ago and stand by it rather than  turn a blind eye.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Even Donald Trump,  2 hours ago, admitted the July 4 deadline is a fake.", "title": "One Big Beautiful Bill", "date": "2025-06-27"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "When we discussed this bill 2 years ago, David Ortiz, then FERC's  Director of the Office of Electric Reliability, testified before the  Energy and Commerce Committee that FERC couldn't execute on the bill  because FERC does not have the capacity to assume other agencies'  expertise.", "title": "Reliable Power Act", "date": "2025-12-17"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "He began his law enforcement career with the Phoenix Police  Department, and nearly 4 years ago joined the Apache Junction Police  Department.", "title": "Mourning Loss of Officer Gabriel Facio", "date": "2025-06-10"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "His wife  died of cancer a decade ago, and by the time she passed, his family's  medical bills had topped $1 million.", "title": "Healthcare", "date": "2025-12-10"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Today, an American homeowner spends about 34 percent more money on  appliances than they did just 15 years ago.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "I tried doing it the right way again, 2 weeks ago.", "title": "Unanimous Consent Requests--The Calendar", "date": "2025-12-17"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "Rinnai America is headquartered in my hometown of Peachtree City, and  3 years ago, it opened a state-of-the-art facility in Griffin, Georgia,  two cities I proudly represent in this Congress.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "John James", "party": "Republican", "sentence": "This legislation keeps faith with families, teachers, and  students by giving them the resources and support they were promised  over half a century ago.", "title": "Marking A National Milestone", "date": "2025-11-20"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "A few hours ago, the CBO put out a report.", "title": "Math is Such An Anathema", "date": "2026-02-11"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "Founded  152 years ago, the Fort Worth Fire Department is a nationally  recognized agency with a rich history of serving and protecting the  13th-largest city in the nation.", "title": "-9999", "date": "2025-04-08"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "Four years ago, I established the 16th District Congressional Veteran  Commendation to recognize the heroic wartime sacrifices and admirable  peacetime community involvement of my constituents.", "title": "Recognizing the Recipients of Florida's 16th Congressional District Veteran Commendation", "date": "2025-12-03"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "There is a whole series of things we have done  to reduce spending, but none of it appears to be big enough to deal  with the cost of the refinancing of debt that is coming off the very  low interest rates from a few years ago to the much higher interest  rates today, to the medical inflation, to the healthcare utilization,  and to just the things that are basic driven by our demographics.", "title": "Facing Fiscal Reality", "date": "2025-11-20"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Spain, just a few weeks ago, experienced nationwide  blackouts, and their economy came to a grinding halt.", "title": "Big, Beautiful Bill", "date": "2025-05-07"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Speaker, 20 years ago this spring, there was a  Cinderella moment in southeast Kansas.", "title": "Congratulating 2006 Iola Fillies on Don Bain Hall of Fame Induction", "date": "2026-01-15"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "I called the Congressional Research Service  several years ago because I was interested in this.", "title": "Count the Crimes to Cut Act", "date": "2025-12-01"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "It wasn't that long ago that I was on this floor talking about  15,000 a day, 10,000 a day coming in illegally.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "We have Jocelyn Nungaray, a woman whose mother I have gotten to know,  a woman whose mother I invited to join us at the inauguration of  President Trump a year ago because of her courage for standing up and  calling out the lawlessness of the people who have been released on the  streets of this country and that resulted in the death of her daughter,  Jocelyn.", "title": "Ice Under Attack", "date": "2026-01-13"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "So let's feed the American people with the bipartisan cooperation  they deserve and the bipartisan cooperation that has always been a part  of the Food Stamp Program because, over decades ago, two famous  Senators, Dole and McGovern, in a bipartisan fashion, came up with the  idea that why should we have people that are nutrition deficient in the  United States when the Federal Government has warehouses full of plenty  of food.", "title": "Government Funding", "date": "2025-11-03"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "The truth is the Democratic Party  abandoned the middle class for the liberal elite class a long time ago.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}]