[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…our  partner forces.\n\nFor these reasons, I will urge defeat of this amendment.\n\nMr. Chair, I yield to the gentleman from California (Mr. Calvert).\n\nMs. McCOLLUM. Mr. Chair, I agree with the gentlewoman from Georgia.  We need to do more for our children here at home. I fail to see how  cutting the Department of Education, canceling grants, some of them…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…reality.\n\nIn any event, why don't we talk about what Congress can actually do?  The President's new budget proposes to cut--so this is something that  my colleague and I could agree on--$1 billion across 40 Department of  Justice grant programs which support local police departments to reduce  violent crime, hate crime, and crime against women.\n\nWould…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…decision is right for them.  It is not our job to tell any high school graduate that they need to go  to college, right? I hear Republicans say that all the time. I tend to  agree. I believe that students deserve all of the options and all of  the support to make the choice that is right for them.\n\nYet mandating incomplete information while gutting the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…With the majority's  actions on H.R.1, Republicans have dealt the remaining pillars of  reconciliation a fatal blow.\n\nWhile section 312 has never been used in reconciliation, I agree that  it has been used in regular order. But I want to make clear that use of  section 312 authority, up until now, has only been invoked when the  issue at hand was narrow,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…It is the education system that this country afforded me that  provided me the opportunities that resulted in my standing here, giving  these remarks.\n\nSo, while we can all agree that there are ways we can improve our  education system, we should also be able to agree that there is a role  for the Federal Government in helping to ensure that all students--50…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…comes to  helping improve the quality of life for our people, we are told we  can't afford it? It doesn't have to be this way, and both Vladimir  Putin and Donald Trump seem to agree. Both Presidents have spoken  favorably of extending New START.\n\nIn September, Putin said: ``Russia is ready to continue to adhere to  the central quantitative restrictions…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…President, all week, Democrats have made clear that  there is a simple, commonsense path forward.\n\nFirst, pass these five critical funding bills that we all  overwhelmingly agree on and prevent a serious shutdown. Secondly, split  off the DHS bill so we can negotiate reforms to rein in ICE and the  CBP. It is what the vast majority of Americans want…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699437/consolidated-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans; I heard a lot of buyer's remorse.\n\nRepublican Members from those districts I visited are nervous,  worried, and scared as could be. They know their voters don't agree  with Trump, but they are too scared to buck him. In the upcoming  reconciliation, we will see what they do. Will they side with Trump  against what Americans need and want…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…billionaires can be  excluded and don't have to pay in the same amount or some totally  circumvent the law altogether and pay nothing?\n\nIt is long overdue, Mr. Speaker, don't you agree, for a vote to take  place. For all the citizens in your district, the more than $300  million that comes in, imagine what that does to the local economy in  your district,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…the Tuskegee Airmen remained a part of  the curriculum in training our Nation's airmen--something so basic,  something so nonpartisan, something that we should all be able to agree  on--that a group of men who went and put their lives on the line for a  world, for a country, that, when they returned home, they were still  called the N-word.\n\nThey were…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…apparent reason. Decisions on whether to list a species as  endangered should be based on science as Congress intended under the  Endangered Species Act, not on politics.\n\nWhile I agree with my good friend from California that ensuring  reliable water supply and storage is essential to northern California,  for both of my friends from northern California,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690598/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…after watching colleagues and public figures gunned down in front of  their families.\n\nThis is the America we are living in right now, and this is not okay.  We don't need to agree with someone's politics to say that their murder  is a tragedy. The assassination of Charles Kirk, the murders of  Minnesota House Speaker Melissa Hortman and her husband,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…understand the points made by my colleague, but I would like to  present a middle ground. Since we don't have unanimous consent for the  Major Richard Star Act today, let's agree to a vote. Let's have a time  agreement that would authorize the Senate to take a single up-or-down  vote on passage of this bill before the end of the year. This time  agreement…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have great respect  for him, but the bottom line is that this bill does not consider  individual circumstances. It is not just people that are selling drugs.\n\nLook, I totally agree that if someone is selling fentanyl, it is a  totally different situation from someone who is arrested for possessing  it. The fact of the matter is this bill covers both those…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Act to make this  commonsense change to allergen information on drug labels a reality.\n\nI am proud this bill is strongly bipartisan. My colleagues on both  sides of the aisle agree it is a no-brainer. I am hopeful that together  we can make this country safer and healthier.\n\nMr. Speaker, I extend my heartfelt thanks to Adina and her family for  her deep…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692132/recognizing-adina-togal"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Trade for sponsoring this  particular bill.\n\nMr. Speaker, I urge unanimous support for H.R. 859, and I reserve the  balance of my time.\n\nMr. BILIRAKIS. Mr. Speaker, I couldn't agree more. There is no  question that this is definitely needed.\n\nMr. BILIRAKIS. Mr. Speaker, I commend Representative Fulcher, the  vice chairman of the subcommittee, and also…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Selected Reserves Tuition       Fairness Act of 2025. I acknowledge that provisions of the       bill fall within the jurisdiction of the Committee on Armed       Services. I agree that your forgoing further action on this       measure does not in any way diminish or alter the       jurisdiction of the Committee on Armed Services over the       subject…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…House Committee on Foreign  Affairs agreed to discharge the bill and forgo further consideration of  the measure so that it may proceed expeditiously to the House Floor. I  agree that this discharge in no way diminishes or alters the  jurisdiction of the Committee on Foreign Affairs or prejudice its  jurisdictional prerogatives on this measure or similar…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693668/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…more wisdom to be found than in the clause which confides the question  of war and peace to the legislature, and not to the executive  [branch].''\n\nHamilton, who didn't always agree with Madison or Jefferson, wrote  that ``the Legislature can alone declare war, can alone . . . transfer  the nation from a state of Peace to a state of War,'' and ``if the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…(i) is not       tendered, the member will remain       in the Reserve component until completion of the member's       enlisted service obligation.\n\n``(D) The member shall agree to perform such duties or       complete such terms under the conditions of service specified       by the Coast Guard.\n\n``(3) Expenses.--Expenses for which financial assistance…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…outside objectors--CRAs technically can't be reviewed by the courts.\n\nIt will be interesting to see when it gets to the Supreme Court  because I believe the Supreme Court will agree with me: Regulators can  call it whatever they want to, but when you are waiving regulations and  allowing other regulations to take their place, that is subject to the  Congressional…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…by proxy. Speaker  Pelosi put it in order a few times, and no one agrees with this.\n\nThe hardworking Americans go to work. When we sign up for this job,  as has been said, we agree to come to this Chamber, 435 of us.\n\nMr. NORMAN. If you want to get into Members of your own party who  voted coming off boats and just basically took a vacation, it ends…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…is automatic  spending. It is not mandatory.\n\nMr. ROY. I have been saying in this building repeatedly that the math  has to math. The math has to add up.\n\nWould the gentleman agree that that is the fundamental and core  problem in this town when we are talking about the state of affairs?\n\nFor example, we in this process have taken Medicare off of the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…from further consideration of H.R. 1503, the Stop Forced       Organ Harvesting Act of 2025, so that the measure may proceed       expeditiously to the House floor.\n\nI agree that your forgoing further action on this measure       does not in any way diminish or alter the jurisdiction of       your committee or prejudice its jurisdictional prerogatives…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…the other side of the aisle for working  with us closely on this important piece of legislation and coming up  with a bill that works for both parties. My Democratic friends agree  that it is time to stop funding terrorist organizations in Afghanistan  and across the Middle East.\n\nI thank my dear friend Shawn Ryan from middle Tennessee, former Navy…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…enjoy serving with  him, as well.\n\nMatt, let me quickly interject here. This institution is built on  debate, and as every Member in this Chamber can tell you, we don't  always agree on things. Matt, let me give you your first chance at  providing a rebuttal. As the father of a Naval Academy graduate, we  have a pretty important game coming up, so I will…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…able-bodied, unemployed adults  covered by Medicaid will now have to work in order to continue  receiving their fully subsidized healthcare. The vast majority of  Americans agree that Medicaid should be a safety net, not a long-term  entitlement for those who are able to work but choose not to.\n\nThe One Big Beautiful Bill Act strengthens and secures…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "French Hill", "party": "Republican", "sentence": "…transactions with  sanctioned entities, allowing them to more effectively trace funds and  uncover illicit networks during financial crime investigations.\n\nThe gentlewoman and I agree that while the private sector can provide  a helping hand in tracking down bad actors, it is ultimately the  government's responsibility to provide clear legal guidance and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…country manage their payments and their  bills between paychecks. It should be competitive and it should be  accessible. We should vote ``yes'' on this resolution so that we agree  with the Federal Reserve of New York when they say that to cap this fee  to do price intervention here is to deny credit and deny this product  to the hardest working families…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…Trade Policy Act.\n\nSenator Coons is a good friend and a great ally, and, reluctantly, I  stand to oppose this motion on this particular procedure.\n\nFirst, Senator Coons and I agree about much on trade policy,  including the need for the United States to have more high-standard  free-trade agreements, like the United States-Mexico-Canada trade  agreement,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}]