[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Member  of Congress today.\n\nThis Big, Bad Bill reverses the progress we've made addressing  climate change, resulting in thousands of lost jobs in renewable  energy, dirtier air and water, more extreme heat events, and poorer  health outcomes. At a time when energy demand is surging and clean  technologies are finally delivering lower costs and good-paying…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…outdoors? I do. Organize  like hell to keep these extremely loud data centers and their emissions  out of your community.\n\nSo, for more expensive utility bills, and increased air, water,  light, and noise pollution, we get a lot more AI slop bullshit that  nobody asked for.\n\nThe Silicon Valley billionaires don't care about our communities.  Believe me when…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697553/protecting-michigan-communities-from-data-centers"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…is one of achievement in parks,       wilderness land, and wildlife refuges. According to studies       by the Environmental Protection Agency, the quality of our       air and water has continued to improve during our       administration.\n\nIn many big cities, the number of days on which pollution       alerts are declared has gone down. And if you…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…launched a  full-scale assault on America's scientific enterprise. Federal  investments in science power nearly every aspect of our modern life,  medical breakthroughs, clean air and water, accurate weather forecasts,  safe food, and real solutions to the climate crisis.\n\nThis administration has made their position painfully clear. They  simple many don't…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…act to curb  emissions from vehicle exhaust, factories, powerplants, and many, many  more locations. Relaxing these standards will result in more pollutants  in our air and in our water.\n\nThe fact is, these pollutants are not just numbers on a chart; they  are the reason millions of Americans are suffering from asthma, heart  disease, and other respiratory…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…bills that the Republican majority has brought to the House  Floor this week. These bills roll back vital protections that ensure  our constituents have access to clean air and water, and can weigh in  on projects that will affect the health of their selves, their  families, and their community.\n\nMake no mistake, the six bills before the House this…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…tell you the plan: Medicare for all. I will tell  you the vision. It is that every American has access to affordable  healthcare, to good jobs, to good schools, to clean air and water,  housing they can actually afford, safer communities, and a functioning  democracy. That is the vision.\n\nI want the American people to know that Democrats are not giving…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696754/medicare-for-all"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…this bill is a fitting tribute.\n\nWilderness areas hold immense importance for a variety of reasons.  They support and provide essential ecosystem services, including clean  air, water, carbon sequestration, and critical wildlife habitat.\n\nProtecting the wilderness is not just about preserving pristine  environments. It is also about safeguarding our national…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…billion per year and increased costs by the end of the  Trump administration.\n\nRepublicans' obsession with coal is going to cost Americans billions  of dollars and pollute our air and water for nothing except some  additional cash for Republicans' friends in the coal industry. It is  really a rotten deal for the average American.\n\nMr. Speaker, I also want…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Federal minimum wage. We must help seniors age with  dignity and independence. We must ensure healthcare and housing are  affordable and readily available. We must protect our air, water, and  open spaces for all to enjoy health and the joy of getting outside in  our beautiful State.\n\nA better future is possible if we fight for it. I can assure you all,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…am tempted to say he is their puppet; certainly, he  is their instrument--to take a wrecking ball to environmental  protections that have safeguarded Americans from toxic air and water  pollution for decades.\n\nAnd so, far from ensuring clean land, water, and air for all, Elon  Musk and EPA are giving Donald Trump's big polluters a carte blanche to  trash…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…could receive their rightful benefits from the VA.\n\nFurthermore, there were 800 underground tests that sometimes vented,  and radioactive contaminants came out in the air or the water table.  That is a problem we are still dealing with today. Some of you may know  the story of the Baneberry shot.\n\nLast year, the Nevada Legislature passed a resolution…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…parents and grandparents will  have to sell their houses to afford medical care. Because of this  budget, more consumers will get ripped off. Because of this budget, our  air and water will have more toxic chemicals. That is the truth. That  is the reality.\n\nMost people in this country feel like the economy doesn't work for  them, and it hasn't for a…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…just capitulation.\n\nToday, instead of helping lower costs for working families,  Republicans are pushing partisan bills to overturn environmental laws  that protect our air and water. It is ridiculous.\n\nCosts are going up, markets are tanked, court orders are being  ignored, and we are talking about a rule that we will hear about later  today that we…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…have invested in emissions control technologies. They did that because  they took their responsibility seriously. They want to be good stewards  of our resources and of our air and water.\n\nAmerican businesses are dedicated to protecting the health, safety,  and vibrancy of their communities. What they need is regulatory  certainty, not a rule that locks…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…rise and help grow our country. That is critical to our economic  well-being. We all want to see this growth go hand in hand with  environmental stewardship, leaving our air and water just as pristine  for the next generation.\n\nThe IMPACT Act builds on previous industrial decarbonization efforts  by focusing specifically on cement, concrete, and asphalt.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688937/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}]