[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…about priorities, especially in eastern North Carolina, I visited  our child development center, and part of the funds we see in this bill  are going to help Seymour Johnson Air Force Base. When I think about  the work that is needed at Cherry Point, there are specific efforts in  here that help this community through the Flightline Utility  Modernization…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, now on Qatar, yesterday, reports came  out that the royal family of Qatar is set to gift Donald Trump a luxury  747 for him to use as his own Air Force One.\n\nWithout a shred of shame, Donald Trump will lecture families about  putting up with higher prices that he himself triggered and then accept  a $400 million private…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690971/qatar"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Constitution is  involved. The provision of the Constitution commonly known as the  emoluments clause enables officials of the Federal Government--from a  sergeant in the Air Force or some other military branch to the  President of the United States--to accept payments or benefits from a  foreign power or other foreign entity or individual but only…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…I fought for military  construction projects that will improve quality-of-life  infrastructure--barracks, housing, and Child Development Centers,  including one at Travis Air Force Base. I am proud of our work pressing  the Department to take sustainment costs seriously, and I commend the  committee staff for their tireless efforts to strengthen this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…probationary employees. They were one of many veterans fired  abruptly, without cause, without reason.\n\nIn another case, a veteran with 8 years of Active Duty service in the  Air Force was fired from the VA in Michigan after receiving an  ``outstanding'' performance review. His probationary period was set to  expire last week, just 12 days after he was…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…however, without recalling the stories, laughs, and prayers he and I  shared at the dinners Mrs. Freida helped prepare.\n\nIndeed, Mrs. Freida lived a life of service. As an Army & Air Force  Exchange Services Manager at Maxwell Air Force Base for nearly two  decades, she helped lift up countless servicemembers and military  families. From singing in the First…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693379/mourning-the-loss-of-mrs-freida-b-dority"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…visionary artist, who has worked  tirelessly to preserve history, mental youth, and strengthen  multicultural identity in San Diego.\n\nMr. Barajas served in the United States Air Force from 1961 to 1964.  During his service,  he worked as a Technical Illustrator, a skill that would later  influence his artistic career. He was recognized as a Newfoundland…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Guard Base in Westfield, Massachusetts.\n\nColonel Halasi-Kun's career is a testament to dedication, leadership,  and excellence in service. Commissioned from the United States Air  Force Academy in 1998, he went on to graduate from the Euro-NATO Joint  Jet Pilot Training program in 2000. Over the course of his career, he  has accumulated more than 3,150 flight…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…accessing the care and support that  they have earned.\n\nNew Mexico is home to a strong and proud veteran community with a  deep military tradition, spanning from Holloman Air Force Base to White  Sands Missile Range and from Kirtland Air Force Base to Cannon Air  Force Base.\n\nWe owe it to those who have served to ensure that they can access  healthcare,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…flying off of an aircraft carrier in the first gulf  war. No nation--at least today--matches the combat capability, the  professionalism, the effectiveness of the U.S. Navy, Air Force, Army,  Marine Corps, and now Space Force. And I will include the Coast Guard,  too, because we like to count the Coast Guard, especially when they  partnered with us on…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…Stewart, where housing has desperately needed upgrades following  alarming reports of mold and pest infestation; resources to bring the  F-35A flight simulators to Moody Air Force Base in Valdosta and  accelerate the arrival of those aircraft to South Georgia; resources to  replace the control tower at Robins Air Force Base, where our  servicemembers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Sustainment Command  (Expeditionary), Orlando, Florida; The 77th Sustainment Brigade, Joint  Base McGuire-Dix-Lakehurst, New Jersey; The 655th Regional Support  Group, Westover Air Force Base, Massachusetts; The 359th Transportation  Battalion (Terminal), Fort Eustis, Virginia; and Headquarters Company,  55th Materiel Management Center (Theater Sustainment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Speaker, I rise today in support of H.R. 4495, the  SBA Fraud Enforcement Extension Act. I am the co-lead on this  legislation, along with my friend, colleague, and fellow Air Force  veteran, Representative Downing.\n\nDuring the COVID-19 pandemic, more than 30 million small businesses  were negatively impacted. The Federal Government took action to ensure…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Mr. Speaker, I rise today as a veteran of the United  States Air Force on this national Women Veterans Day to tell Secretary  Hegseth and President Trump that women who raise their hand and swear  an oath to protect and defend this Nation are…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…the violence against members of the National Guard from West  Virginia and condemning that horrific act that took the life of Army  Specialist Sarah Beckstrom and has left Air Force Staff Sergeant Andrew  Wolfe gravely injured.\n\nMr. Speaker, as it relates to the Save Our Seas 2.0 Amendments Act,  this bill will improve the administration of the National…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Commendation. Her 20-year service to our country  followed by her heavily involved community service is a template for  American Exceptionalism.\n\nTSgt. Ybarra enlisted in the Air Force in May 1986, through the  delayed enlistment program and began active duty on September 15, 1986,  from the Syracuse, NY Military Entrance Processing Station (MEPS). She…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…to and including their lives to keep  us safe. They put their lives on the line to secure liberty and  security, and I am grateful to the thousands serving today at Dover Air  Force Base, the Delaware National Guard, and throughout our Armed  Forces.\n\nThey and their families deserve the same devotion to them that they  are providing to us.\n\nI come from…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…communities.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman from Florida.\n\nHe took over for a good friend of mine. We  have a very common district. I represent Hill Air Force Base, and he  represents the Colorado Springs area, which we all know is where the  Air Force Academy is located. With a lot of shared connection to the  Colorado Springs…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I rise today to recognize a warrior of the  United States Air Force, Chief Master Sergeant Jason Q. Shaffer.\n\nChief Shaffer embodies the mindset and diligence that is needed to  defend our Nation. He entered the Air Force in March 2000 as…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Month: Dale Karst\n\nMr. ALFORD. Mr. Speaker, today, I am honored to recognize our  September Veteran of the Month: Mr. Dale Karst.\n\nDale proudly served in the United States Air Force, entering service  on September 16, 1966. After basic training, he was stationed at  Whiteman Air Force Base with the Air Police Squadron before deploying  to Vietnam with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…subsection (b).\n\n(d) Covered Individual Defined.--In this section, the term       ``covered individual'' means an individual who served on       active duty in the Army, Navy, Air Force, or Marine Corps as       an aircrew member of a fixed-wing aircraft, including as a       pilot, navigator, weapons systems operator, aircraft system       operator, or…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Capability (Sec. 36(b)(5)(A), AECA)\n\n(i) Purchaser: Government of Romania\n\n(ii) Sec. 36(B)(5)(A), AECA Transmittal No: 20-83; Date:       November 3, 2020; Implementing Agency: Air Force.\n\n(iii) Description: On November 3, 2020, Congress was       notified by congressional certification transmittal number       20-83 of the possible sale, under Section 36(b)(1)…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689947/arms-sales-notification"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…require charging? My amendment builds on President Trump's executive  order that we must put the mission at the core of what we do forward.\n\nUnder the Biden administration, the Air Force previously planned for  acquisitions of all light-duty, nontactical vehicles to be electric by  2027, Mr. Chair. Now, what they forgot is in many of the defense  facilities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…leadership of my friend and fellow Oklahoman, Chairman\n\nTom Cole.\n\nThis package will strengthen American military superiority and fund  the E-7 Wedgetail program at Tinker Air Force Base. It also ends open- border policies of the Biden era, champions measures to make America  healthier, and allows the Nation to build stronger, travel safer, and  support…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699306/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Defense Authorization Act for Fiscal Year 2026, my vote would  have been in the affirmative.\n\nMy absence is due to my attendance at the dignified transfer ceremony  at Dover Air Force Base to receive the remains of the two Iowa National  Guard servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…there, he recognized the potential of the ROTC program, and  after his first experience with them he was set on a path to earn his  pilot's license, graduate, and head to Air Force Pilot Training as soon  as possible. He dedicated five years and one day of service to his  country before his release from active duty.\n\nBeginning in June 1968, Danny spent…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Smith on this important piece of legislation.\n\nI rise today in support of this en bloc package, which contains four  of my amendments. The first requires the Secretary of the Air Force and  the Director of the Air National Guard to work together to modernize  the Air National Guard's fighter fleet.\n\nLast year's NDAA required a similar report, but this report…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…the Aviator Cancers Examination Study Act, or  the ACES Act.\n\nFar too many of our military aviators and aircrew are being diagnosed  with cancer at troubling rates. A 2021 Air Force study supported by  additional Department of Defense research found that aviators face a 29  percent higher likelihood of testicular cancer, a 24 percent higher  likelihood…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…educational services, such as individuals with  asthma, autism, chronic respiratory illnesses, intellectual  disabilities, and much more.\n\nUnder the Biden administration, the Air Force suggested using the  Exceptional Family Member Program for families who want to help their  child transition. Democrats also introduced a bill to expand this  program to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Mr. Speaker, I rise today to recognize the 85th birthday  of the 55th Wing, the ``Fightin' Fifty-Fifth'', headquartered at Offutt  Air Force Base in Nebraska. This Air Force organization is home to the  thousands of men and women who dedicate their lives to providing global  vigilance as a vital part of America's…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}]