[{"senator": "Juan Vargas", "party": "Democrat", "sentence": "…from 1961 to 1964.  During his service,  he worked as a Technical Illustrator, a skill that would later  influence his artistic career. He was recognized as a Newfoundland Air  Force Base Boxing Champion and honorably discharged as Sergeant.\n\nAn Associate of Arts graduate of Los Angeles Trade Technical-College,  Mr. Barajas first became involved with Chicano…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…priorities, especially in eastern North Carolina, I visited  our child development center, and part of the funds we see in this bill  are going to help Seymour Johnson Air Force Base. When I think about  the work that is needed at Cherry Point, there are specific efforts in  here that help this community through the Flightline Utility  Modernization…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…the FBI building, moved to a place where you can have  security.\n\nWe have some number of security organizations. They are all located  either in the suburbs or at Boeing Air Force base. Boeing Air Force  base is a secured piece of much acreage, so they are not subject to  that risk.\n\nAll of these agencies, including the CIA at Langley and other  agencies,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Sustainment Command  (Expeditionary), Orlando, Florida; The 77th Sustainment Brigade, Joint  Base McGuire-Dix-Lakehurst, New Jersey; The 655th Regional Support  Group, Westover Air Force Base, Massachusetts; The 359th Transportation  Battalion (Terminal), Fort Eustis, Virginia; and Headquarters Company,  55th Materiel Management Center (Theater Sustainment Command),…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…fought for military  construction projects that will improve quality-of-life  infrastructure--barracks, housing, and Child Development Centers,  including one at Travis Air Force Base. I am proud of our work pressing  the Department to take sustainment costs seriously, and I commend the  committee staff for their tireless efforts to strengthen this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…accessing the care and support that  they have earned.\n\nNew Mexico is home to a strong and proud veteran community with a  deep military tradition, spanning from Holloman Air Force Base to White  Sands Missile Range and from Kirtland Air Force Base to Cannon Air  Force Base.\n\nWe owe it to those who have served to ensure that they can access  healthcare,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…prayers he and I  shared at the dinners Mrs. Freida helped prepare.\n\nIndeed, Mrs. Freida lived a life of service. As an Army & Air Force  Exchange Services Manager at Maxwell Air Force Base for nearly two  decades, she helped lift up countless servicemembers and military  families. From singing in the First Baptist Church's Choir to  overseeing its Meals on…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693379/mourning-the-loss-of-mrs-freida-b-dority"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…Stewart, where housing has desperately needed upgrades following  alarming reports of mold and pest infestation; resources to bring the  F-35A flight simulators to Moody Air Force Base in Valdosta and  accelerate the arrival of those aircraft to South Georgia; resources to  replace the control tower at Robins Air Force Base, where our  servicemembers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…fiscal year 2026 Military Construction,  Veterans Affairs, and Related Agencies Appropriations Act in its  current form.\n\nI represent a district that is home to Robins Air Force Base, Fort  Benning, and Marine Corps Logistics Base Albany. These installations  are more than just military sites. They are the backbone of communities  where servicemembers…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…These  are communities that know firsthand what happens when Washington breaks  its promises and when jobs and investments disappear.\n\nWe remember back home when Griffiss Air Force Base closed. We  remember when Carrier left. Those were our sheet metal workers. We  remember when New Venture Gear and a Chrysler plant closed. Those were  our UAW brothers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…some major wins for my  district and for New Mexico, including a long-overdue 3.8 percent pay  raise for all military personnel, authorization of funding for Kirtland  Air Force Base, and language which I am most grateful for to hold the  Department of Defense accountable for cleaning up munitions and  unexploded ordnance on Tribal lands, including…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697793/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…is set to provide essential  upgrades to the land-based component of our nuclear triad.\n\nI thank the airmen, the security forces, the missileers, everyone at  Malmstrom Air Force Base in Great Falls, Montana, for their continued  hard work on the initial planning and construction phases of this  project.\n\nNuclear deterrence is the bedrock of our national…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698101/importance-of-ndaa-passage"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the weekend, know this: Your summer will be  easier because we are passing the President's One Big Beautiful Bill  Act.           Honoring the 509th Bomb Wing at Whiteman Air Force Base\n\nMr. ALFORD. Mr. Speaker, I rise today with immense pride for the  brave airmen of Missouri's own 509th Bomb Wing at Whiteman Air Force  Base in my district, who executed…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…eighteen years of dedicated service, Mr.  Woodward is stepping down from his responsibilities as the Director of  Public Affairs for the 82nd Training Wing at Sheppard Air Force Base in  Wichita Falls, Texas.\n\nThroughout his 30-year career as a Public Affairs Specialist, Mr.  Woodward has been a tremendous source of expertise for the United  States…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…our installations and force  readiness.\n\nWe have seen time and again what devastating extreme weather can do  to installations. In 2018, Hurricane Michael mauled Tyndall Air Force  Base in Florida, my home State, and cost the Air Force $4.9 billion to  rebuild. When Typhoon Mawar ran through Guam and devastated the island,  this Congress provided almost…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…defend our Nation deserve quality homes, supportive communities, and a  true sense of belonging.\n\nOne of the most outstanding examples of this commitment is at Offutt  Air Force Base in Bellevue, Nebraska. There, Burlington Capital  partnered with the United States Air Force to redevelop and manage the  base's military family housing community. Through…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Mr. Speaker, I rise today to recognize the 85th birthday  of the 55th Wing, the ``Fightin' Fifty-Fifth'', headquartered at Offutt  Air Force Base in Nebraska. This Air Force organization is home to the  thousands of men and women who dedicate their lives to providing global  vigilance as a vital part of America's…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…in aerospace and aviation.\n\nMy district in California encompasses a number of military, space,  and aerospace facilities, including Naval Air Station Lemoore, Edwards  Air Force Base, Naval Air Weapons Station China Lake, NASA Armstrong  Flight Research Center, and the Mojave Air and Space Port.\n\nWe are known for our innovation and research and continuing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Logistics Readiness  Squadron; and much more.\n\nMajor Hanson's background proved critical in his unique ability to  support my efforts on behalf of the men and women at Sheppard Air Force  Base in Wichita Falls, Texas. Having trained at Sheppard in 2018, where  he completed the Air Force's Maintenance Officer Fundamental Course, he  brought firsthand understanding…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "John Thune", "party": "Republican", "sentence": "…can continue serving  our residents.\n\nThere is a lot more I could talk about that we have accomplished for  South Dakota this year. There are the investments in Ellsworth Air  Force Base, including full funding for the B-21 mission and supporting  infrastructure. There is the support for local law enforcement in the  One Big Beautiful Bill and new border…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…dedication to supporting them.                           Recognizing Steve Hiatt\n\nMr. MOORE of Utah. Mr. Speaker, I rise today to honor Steve Hiatt,  the recipient of the Hill Air Force Base 2025 Community Wingman Award.\n\nHill Air Force Base is one of the most important contributors to  northern Utah's economy and livelihood, employing over 23,000 military…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Defense Authorization Act for Fiscal Year 2026, my vote would  have been in the affirmative.\n\nMy absence is due to my attendance at the dignified transfer ceremony  at Dover Air Force Base to receive the remains of the two Iowa National  Guard servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.\n\nHad…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Month: Mr. Dale Karst.\n\nDale proudly served in the United States Air Force, entering service  on September 16, 1966. After basic training, he was stationed at  Whiteman Air Force Base with the Air Police Squadron before deploying  to Vietnam with the 377th Combat Defense Unit.\n\nHe was stationed at Tan Son Nhut during the Tet Offensive, one of the  most…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…far, I am proud to have  secured millions of dollars in critical investments for the State of  Nebraska. One of my top priorities was securing critical funds for  Offutt Air Force Base in the Defense appropriations bill. In total, we  obtained $83 million for the United States Strategic Command, the 55th  Wing, and the 557th Weather Wing--all of those…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Only three cities across the Nation received this honor, reflecting  the remarkable commitment the people of Minot have shown to the men and  women stationed at the Minot Air Force Base.\n\nThrough events like the Prairie Warrior Auction and efforts by local  leaders and initiatives led by the Minot Area Chamber, this community  goes above and beyond to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690742/minot-north-dakota-named-a-2025-great-american-defense-community"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Officer to Australia. His leadership  extended across various levels of the Air Force, including roles as  Flight Commander of the 54th Fighter Training Squadron at Reese Air  Force Base, Chief of Airspace at Randolph Air Force Base, and Air Force  Reserve Commander at Reese Air Force Base. In 2004, Lt. Col. Davison  took on the role of Director of Combat…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}]