[{"senator": "Jack Reed", "party": "Democrat", "sentence": "This Trump environmental plan will undo restrictions on air pollution  from powerplants, cars, and trucks.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''", "date": "2025-03-26"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "These are regulations that are responsible for safe drinking water,  for  reducing air pollution, and preventing exposure to cancer-causing  chemicals.", "title": "Reliable Power Act", "date": "2025-12-17"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "In 2021, the Natural Resources  Defense Council estimated that air pollution from fossil fuels cost  Americans an average of $2,500 a year in medical bills--or over $820  billion in total.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-20"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Now, I understand that many Republicans in Congress do not like that  California is able to take steps to address its extraordinary air  pollution from the transportation sector, but they are in luck.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "_04  Recission of Funding to Address Air Pollution-----  ---------     Budget Authority                                              -70          0          0          0          0          0          0         0         0         0          -70        -70--     Estimated Outlays                                              -5        -20        -10         -5        -10        -10        -10         0         0         0          -50          -70 Sec.", "title": "Greenhouse Gas Reduction Fund", "date": "2025-07-09"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "We are saying yes to the  air pollution that is going to result.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-02-26"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "It attacks our federal investments in clean energy, which will cost  over 790,000 jobs over the next decade and raise household energy  bills, all while adding to air pollution and worsening our climate  crisis.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "When President Richard Nixon signed the Federal Clean Air Act in  1970, California, under Governor Ronald Reagan, was given a waiver,  letting us set stricter air pollution rules than the Federal  Government.", "title": "Clean Air Isn't A Partisan Issue", "date": "2025-05-01"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "The Washington Post recently reported on what too many of us already  know: Air pollution and climate change are choking even the most  treasured corners of our country.", "title": "Clean Air and Healthy Parks Go Hand in Hand", "date": "2025-07-16"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "The dangerous air pollution this rule protects us from can  cause cancer, birth defects, developmental disorders, and neurological  problems, even at small levels of exposure.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''", "date": "2025-05-21"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "It is like calling increased air pollution the blue sky  initiative.", "title": "Tipped Employee Protection Act", "date": "2026-01-13"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "61, another  attempt by House Republicans to ensure workers and communities continue  to breathe toxic air pollution.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''", "date": "2025-03-05"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "For 50 years, both Democrat and Republican  administrations have granted these Clean Air Act waivers that are  essential for reducing toxic air pollution, protecting public health,  and cutting greenhouse gas emissions that dangerously warm our planet.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the National Highway Traffic Safety Administration Relating to ``Federal Motor Vehicle Safety Standards; Fuel System Integrity of Hydrogen Vehicles; Compressed Hydrogen Storage System Integrity; Incorporation By Reference''", "date": "2025-05-21"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "There is nothing ``reliable'' about air pollution giving our children  asthma.", "title": "Promoting Efficient Review for Modern Infrastructure Today Act", "date": "2025-12-11"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "The Trump administration's ``Make America Healthy Again'' report  celebrates the progress we have made in reducing toxic air pollution,  progress we made in part by regulating coal mines.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "John James", "party": "Republican", "sentence": "In addition to air pollution, Republicans care about clean air.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "The results during  President Trump's first term were overwhelmingly clear: Source  reclassification reduces hazardous air pollution in our communities.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "Simply put, the ``once in, always in'' policy hurts America's  manufacturing and energy sectors while doing nothing to actually  improve air pollution.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''", "date": "2025-05-21"}]