[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "And the gift in question is that the country of Qatar is going to  literally provide a luxury aircraft--not just any luxury aircraft to  the President of the United States but Air Force One.", "title": "Qatar", "date": "2025-05-12"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "It is going to increase hazardous  air pollution across America.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''", "date": "2025-05-21"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "Navy SEAL,  I myself as a pilot flying off of an aircraft carrier in the first gulf  war.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Air travel with children is a nightmare, and I am just talking for  the nonparents who have to deal with them at an airport.", "title": "Bottles and Breastfeeding Equipment Screening Enhancement Act", "date": "2025-11-17"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, this past weekend, I prayed, and thanks to  God for saving the lives of every single one of our precious soldiers,  sailors, airmen, marines, and intelligence officers who were deployed  secretly to Venezuela by the President of the United States without  consent of Congress.", "title": "Reflecting on Impact of Illegal Action in Venezuela", "date": "2026-01-08"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Smoke filled the air for  days throughout the region.", "title": "Wildfires in Oregon", "date": "2025-06-12"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "He served in the Air Force and then Army,  deploying to Kuwait and Iraq, where he earned a Bronze Star.", "title": "Veterans Deserve Better", "date": "2025-03-06"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "This Trump environmental plan will undo restrictions on air pollution  from powerplants, cars, and trucks.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''", "date": "2025-03-26"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "From the GAO:\n\nAs background to these issues, we issued a legal decision       concluding that a Clean Air Act preemption waiver was not a       rule subject to CRA but was instead an adjudicatory order.", "title": "H.J. Res. 88", "date": "2025-05-21"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "We are saying yes to the  air pollution that is going to result.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-02-26"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Speaker, I rise today to recognize and celebrate  the 100th anniversary of Delta Air Lines, a remarkable milestone for  one of the world's most innovative and enduring airlines.", "title": "Recognizing Delta Air Lines' 100th Anniversary", "date": null}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Air Force, conducting  signals analysis in support of Operation Iraqi Freedom.", "title": "Recognizing Jasmine Baker", "date": "2025-04-07"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Yesterday, I urged the Speaker to join me on the House floor to  debate this reckless budget one-on-one so we would have an opportunity  to fully air, in a transparent way before the American people,  Democratic values and Republican values, the Democratic perspective on  this budget and the Republican perspective.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Do you like breathing clean air and being outdoors?", "title": "Protecting Michigan Communities From Data Centers", "date": "2025-12-04"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "They are all located  either in the suburbs or at Boeing Air Force base.", "title": "Providing for Consideration of H.R. Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Speaker, I rise today to honor Steve Hiatt,  the recipient of the Hill Air Force Base 2025 Community Wingman Award.", "title": "Highlighting Republican Successes in 2025", "date": "2026-01-21"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Chairman, I might sound like a little bit of a broken  record here, but, unfortunately, the broken record of $37 trillion in  debt and climbing continues as well, so we have just got to keep at it.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Westerman, the chairman, for  his leadership on this issue and all energy-related issues.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Nothing in this bill allows for a project  to bypass NEPA, the Clean Air Act, the Clean Water Act, or the  Endangered Species Act, nothing.", "title": "Critical Mineral Dominance Act", "date": "2026-02-04"}, {"senator": "James Risch", "party": "Republican", "sentence": "The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign Relations Committee.", "title": "Arms Sales Notification", "date": "2025-11-07"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "Speaker, I thank the chairman for the  time.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Speaker, I rise today to honor my constituent,  Julie Humes of Donnellson, Iowa, a flight nurse with Air Evac Lifeteam  and a recipient of the American Ambulance Association's prestigious  Star of Life award.", "title": "Recognizing Pella Marching Dutch", "date": "2025-12-03"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I chair Oversight Subcommittee on Ways and Means, but I also chair the  Joint Economic Committee.", "title": "Facts and Math", "date": null}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Air Force and  a lieutenant colonel who answered the call to duty after 9/11, serving  bravely in Operations Iraqi Freedom and Enduring Freedom.", "title": "Congratulating Larry Haskell on His Retirement", "date": "2025-07-15"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "That Chinese gear was clustered near sensitive military  assets, including Nebraska's Offutt Air Force Base and our nuclear  missile silos.", "title": "Fact Act", "date": "2025-05-05"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "It continued in 2019, when a Saudi military trainee opened fire at  the Pensacola Naval Air Station, killing three Americans, including one  young man from my home State of Alabama.", "title": "-9999", "date": "2025-10-08"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Speaker, I rise today with profound respect and  gratitude to recognize the exceptional service and unwavering  dedication of Robert Anthony Longo, a proud veteran of the United  States Air Force and our esteemed Veteran of the Month for April 2025  from Michigan's 9th Congressional District.", "title": "Recognizing Robert Longo As April 2025 Veteran of the Month", "date": "2025-04-08"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Requirement for Coast Guard to provide analysis of                alternatives for aircraft.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-07-23"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "A rock of her community, Pam was recognized in 2018 with the Marietta  Citizen of the Year Award, and again in 2024 with the Len Gilbert Award  for her advocacy for Dobbins Air Reserve Base and Clay National Guard  Center.", "title": "Recognizing Pam Younker on Her Retirement", "date": "2025-05-23"}]