[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…Department of Defense flowed massive  military assets into the Caribbean: the Iwo Jima Amphibious Ready  Group, the 22nd Marine Expeditionary Unit, attack submarines, P-8  Poseidon aircraft, Aegis destroyers, F-35 fighter jets, and eventually  the USS Gerald R. Ford Carrier Strike Group. The administration never  explained why this buildup was necessary other…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…robust emergency services  that maintain safety and mission readiness across the Force.\n\nAcross the DOD, more than 8,800 civilian firefighters respond to  structural fires, aircraft emergencies, hazardous materials incidents,  and other life-threatening events each year.\n\nMr. Speaker, I cannot think of a more critical and all-American cause  or more of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695629/filling-firefighter-positions-on-military-installations"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the U.S. experienced nearly 78,000 wildfires that burned  more than 5 million acres. One tool we can use to prevent, mitigate,  and respond to wildfires is aviation. Crewed aircraft have long been  used to monitor and fight fires. Now, advanced aviation technologies  and uncrewed aerial systems can advance our response to wildfires.\n\nIt is important now…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700125/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…pandemics and  natural disasters, airships are uniquely capable of accessing remote  locations or damaged landscapes and delivering resources and services  where traditional aircraft often cannot.\n\nThis amendment could enable and reintroduce the world to practical,  economical, and environmentally friendly airship transportation, in  addition to the fact…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…a Federal  scientist who, in his own words, was fired by President Trump and Elon  Musk.\n\nHere are his words:\n\nI worked for the U.S. Geological Survey. I was a small       aircraft operator and captain of a research vessel. As the       only captain at my science center, my termination effectively       shuts down a vessel that is required for a number…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688246/fired-by-president-trump"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…negotiations with you. But it  is also explicitly prohibited by the U.S. Constitution.\n\nAnd the gift in question is that the country of Qatar is going to  literally provide a luxury aircraft--not just any luxury aircraft to  the President of the United States but Air Force One. And why does this  matter? Air Force One is not just a random luxury airplane. It is…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…clearer timeframes for the licensing decisions made by the  State Department for direct sales of defense items by private firms to  foreign buyers.\n\nWhile large systems, such as aircraft, ships, tanks, and missiles,  are principally provided via the foreign military sales, or FMS,  process, a number of important items, such as small arms, vehicles,  radars,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694831/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…boats  in open waters, the amassing of naval assets around Venezuela, the  President's authorization of covert activities, the seizure of ships,  the coordinated attack of 150 aircraft that not only extracted  President Maduro and his wife but also bombed sites around the  country--this is bigger than an arrest warrant.\n\nMore than 200 enemies have been killed.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…notwithstanding our possession  of the strongest and most courageous military in the world, America's  greatest strategic asset is not the might of our arms or size of our  aircraft carriers; it is the strength of the alliances we have around  the world.\n\nThe web of partnerships we built after World War II, NATO, our  Pacific alliances, our hemispheric…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…goods and to make ends meet and to provide shelter.\n\nAmerican manufacturers rely on an economy to maintain resilient  supply chains, keep production lines open--and that means aircraft from  Everett, WA, or cars and trucks from Detroit, MI.\n\nAmerican farmers rely on our economy to keep fields planted-- production in eastern Washington and northern and central…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…showed that women could excel as welders,  as builders, as defenders of our Nation's security, and, as I learned  at her birthday, as excellent dancers on the decks of an aircraft  carrier in between shifts.\n\nHer work on the Essex-class carriers was vital to our Navy's success,  but her example reached even further. Jean blazed a trail for women who…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…also says that if Donald Trump wants to engage in military  hostilities against Venezuela, he must seek authorization from Congress  first.\n\nAs we speak, America's largest aircraft carrier, the Gerald Ford, is  on its way to the Caribbean. It is part of the largest military buildup  in our hemisphere that we have seen in decades.\n\nAccording to press…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…well-trained  workforce is critical to our national security.\n\nSince the agency was created in the aftermath of 9/11, TSA has helped  prevent terrorist attacks against U.S. aircraft from happening.\n\nThe jobs of TSA employees are difficult, from the Transportation  Security officers' perspective who screen millions of passengers a day,  to Federal air…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Venezuela.\n\nSeven Americans were wounded in that military operation. There is a  functional blockade of Venezuelan oil. As others have pointed out here,  Mr. Speaker, an aircraft carrier strike group sits nearby, poised to  again send Americans into Venezuela should the President order it.\n\nLet's talk about hypocrisy. In the 118th Congress, this body…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699367/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…advocate for every one of them. For example, this bill deals  principally with fixed-wing aviators. I am hopeful that we will  similarly rally around legislation for rotary-wing aircraft pilots.\n\nI am genuinely hopeful that, upon completing this study, we will be  significantly closer to understanding the root causes of aviator  cancers. More importantly,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES. Mr. Speaker, I move to suspend the rules and pass the  bill (S. 2503) to require all aircraft to be equipped with Automatic  Dependent Surveillance-Broadcast In, to improve aviation safety, and  for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…(SSBN-738), USS John C. Stennis (CVN 74), and successfully  completed two deployments.\n\nThroughout his service, he has not only accumulated over 2,000 flight  hours in various  aircraft, but numerous military decorations, including the CAPT Tim  Tibbets Leadership Award, six Navy Commendation Medals, as well as the  Navy/Marine Corps Achievement Medal.\n\nAs…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…in an economically  disadvantaged high school.\n\nUnder his leadership, this program became the first in the Nation to  award high school students with the National Aerospace/Aircraft  Assembly certification.\n\nIt is with great pride that I recognize his exceptional achievements  in building the local talent pipeline, with graduates securing  positions at…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690495/congratulating-bill-mcinnish"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…investments. One of the most important investments is the Navy's sixth- generation fighter, F/A-XX. Our Navy, our joint force, and our future  combatant commanders need this aircraft.\n\nRelying only on the Air Force's sixth-generation fighter, the F-47,  does not solve our air superiority challenge.\n\nI am a fervent supporter of the F-47 and would have done…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…including Hawaii, Okinawa, and the  Philippines.\n\nIn more recent history, the Delano Municipal Airport gained  distinction as the home of a squadron of Northrop P-61 Black Widow  aircraft--twin-engine fighters that played a key role in defending the  Pacific Coast during the war.\n\nToday, Delano is best known for its thriving agricultural industry.  The city…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Pennsylvania that increases funding by $30 million for  procurement of the Army's heavy dump trucks and offsets it with a $30  million reduction to future tactical unmanned aircraft system  development. While that development remains important, the Army's heavy  dump trucks are critical to current operational needs.\n\nThese trucks are manufactured by companies…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693689/department-of-defense-appropriations-act-2026"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…earlier this week, from July 12 of 2025: This week the  Trump administration, the State Department, and the DOD approved $100  million to go to the LAF for the Super Tucano aircraft.\n\nIn listening to what the State Department said regarding the sale of  military equipment to Lebanon, this is their statement: ``This proposed  sale will support the foreign…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…thing in the Department of Defense we can look at is what  Pete Hegseth, who I think is going to be a great Secretary of Defense,  has pointed out. He feels, in today's world, aircraft carriers are  maybe not entirely obsolete but are not as valuable as they were 30  years ago. That should be obvious from what happened over the weekend  when Ukraine used…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Dakota and served in  World War II, Korea, and Vietnam.\n\nOn January 11, 1968, he piloted a mission that took off from Thailand  and, while descending into the target area, the aircraft crashed,  killing Commander Olson.\n\nCommander Olson's remains were not recovered until 2001, and he has  been memorialized on the Courts of the Missing at the National Memorial…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697598/commander-delbert-austin-olson-post-office"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…warning and monitoring.\n\nObviously, protecting human life is our paramount concern in  monitoring volcanic activity, but it is not just people on the ground  who are at risk. Aircraft that are flying within 1,000 miles of a  volcanic eruption can experience damage if they are not made aware of  the smoke. Volcanic eruptions can be detrimental, and even…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Midwest Army aviation.\n\nThis proud combat aviation unit has one of the oldest Army aviation  flight facilities in the National Guard. Built in 1972, it currently  supports 11 aircraft and more than 50 full-time personnel.\n\nUpgrading the facility will save over 500 man-hours and prevent more  than $200,000 in annual damage to blades and equipment. A new…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692960/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…of my time.                    Amendment No. 248 Offered by Mr. Ogles\n\nMr. CALVERT. Madam Chair, I look forward to working with the  gentlewoman. We need a place for those aircraft to land in Greenland.\n\nMr. CALVERT. Madam Chair, I certainly rise in support of the  amendment. The amendment prohibits the expenditure of funds to create,  procure, or display…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Funds.\n\n(iii) Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nThree (3) P-8A Patrol Aircraft.\n\nFour (4) Multifunctional Distribution System Joint Tactical       Radio Systems.\n\nFour (4) Guardian Laser Transmitter Assemblies for the AN/      AAQ-24(V)N.\n\nFour (4) System…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698533/arms-sales-notification"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…before us, the ROTOR Act.\n\nThe ROTOR Act seeks to fulfill a longstanding recommendation from the  National Transportation Safety Board to require ADS-B In technology on  aircraft operating in our national airspace system. That recommendation  reflects years of accident investigation and careful analysis.\n\nBut we must also recognize that this bill does…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700109/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…term       ``covered individual'' means an individual who served on       active duty in the Army, Navy, Air Force, or Marine Corps as       an aircrew member of a fixed-wing aircraft, including as a       pilot, navigator, weapons systems operator, aircraft system       operator, or any other crew member who regularly flew in a       fixed-wing aircraft.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}]