[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…their hard work on  this important issue.\n\nH.R. 2591 was unanimously approved in the T&I Committee in June, and  it is endorsed by several key stakeholders, including U.S. airlines,  air traffic controllers and pilot unions, the general aviation and  business aviation industries, first responders, and many others.\n\nMr. Speaker, I encourage my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…President, on Newark Airport, for months and now  especially this week, Americans flying in and out of Newark Airport  have experienced increasing delays and disruptions. Airlines are  canceling flights. There is a shortage of air traffic controllers. They  are relying on 1990s technology in 2025. One Newark air traffic  controller even said that flying…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690645/faa"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. Speaker, last month marked the 1-year anniversary of the D.C.  midair collision where a U.S. Army Black Hawk helicopter collided with  American Airlines Flight 5342 near Washington National Airport, or DCA,  tragically claiming all 67 lives aboard both aircraft.\n\nIt was the first mass-casualty commercial plane accident in…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700110/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize and celebrate  the 100th anniversary of Delta Air Lines, a remarkable milestone for  one of the world's most innovative and enduring airlines.\n\nAs Delta commemorates a century of service in 2025, we in Minnesota  are especially proud to reflect on the deep roots this company has in  our state through the history…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…system. There  have been numerous accidents, with the Potomac DCA midair collision  being among the most tragic.\n\nAt approximately 8:52 p.m. on January 29, 2025, American Airlines  Flight 5342, flying from Wichita, Kansas, to Ronald Reagan National  Airport, collided with UH-60 Army Black Hawk helicopter PAT 25 while on  final approach to runway 33…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of our Nation's people, embodied in an extraordinary  young American, U.S. Olympic figure skater Maxim Naumov.\n\nDespite having endured unspeakable loss, the tragic American Airlines  crash over Arlington, Virginia, in January of last year that claimed  the lives of both his parents, Vadim Naumov and Evgenia Shishkova,  Maxim stepped onto the ice this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698839/uplifting-spirit-of-olympic-skater-maxim-naumov"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, I am proud to be a cosponsor of the  ROTOR Act. I thank the sponsor as well.\n\nOn January 29, 2025, a U.S. Army Black Hawk helicopter and American  Airlines flight 5342 collided midair outside of DCA, and 67 lives were  lost.\n\nAmong the victims were families from my community in northern  Virginia. We lost children, parents, and…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700113/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to thank the Okolona Fire  Protection District for their bravery and heroism in response to the  tragic crash of UPS Airlines Flight 2976 in Louisville, Kentucky.\n\nOn Tuesday, November 4th, a cargo jet bound for Hawaii crashed  moments after takeoff. Unable to gain altitude, the jet went down just…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Oversight Reform bill represents a major  step forward for aviation safety.\n\nNot even 1 year ago, 67 people lost their lives when a Black Hawk  helicopter collided with American Airlines Flight 5342 over the  Potomac, and it was one of the deadliest aviation disasters in history.  I do thank the families who are represented in the gallery today for  their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…health care to make our pilots healthier and our  skies safer.\n\nI am proud that this bipartisan legislation is widely supported in  Congress and also by the aviation community, airlines, pilot unions,  and air traffic controllers.\n\nMr. Speaker, I urge my colleagues to support it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…again to  close the government, again to take food out of the mouths of families  who need it, again to deny pay to Federal employees, and again to stall  flights and cancel airlines and do all the rest that they have done. We  are not going to let them succeed in that gambit. That is right.\n\nWhile the Democrats keep voting to shut the government down,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…at a young age. She attended school in Rosemead, California, and  became a naturalized citizen at 18 years old. Carmen began her career  as a night attendant for American Airlines and worked as a ticket  office manager. She co-founded Steve Roberts Custom Builders, a very  successful home design and construction company based in North Texas.  Carmen…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the District of Columbia Fire  and Emergency Medical Services Department, whose swift and selfless  actions in the aftermath of the devastating collision between American  Airlines Flight 5342 and a United States Army Blackhawk Helicopter over  the Potomac River showed heroism in the face of tragedy.\n\nWhen the unthinkable happened on that cold January…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690276/recognizing-the-heroism-of-the-district-of-columbia-fire-and-emergency-medical-services-department"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Congress to wait until the NTSB completes  its investigation so that Congress first has all the facts.\n\nOn January 29, 2025, an Army helicopter collided with an American  Airlines flight while on final approach to Ronald Reagan Washington  National Airport. The fatal collision claimed the lives of all 67  passengers and crew in both aircraft.\n\nThe NTSB,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…three different transit systems. It wouldn't be doable until 2045 at a  minimum.\n\nRight now, today, for decades, a traveler could take a flight on  Southwest or several other airlines from L.A. to San Francisco in about  an hour.\n\nNo, we are told that this vision, this new plan, amounts to  substantial progress such that the results of the audit are--let's…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…requires Amtrak to install baby changing tables in all ADA- accessible restrooms on trains owned by Amtrak. These facilities are  common on other transportation modes, including airlines. They are  likewise necessary on intercity passenger rails.\n\nThe bipartisan bill is a long, overdue improvement to Amtrak service.\n\nMr. Speaker, I urge support of this legislation,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692155/baby-changing-on-board-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…those who don't, Noel Wien is considered the father of Alaska  aviation--the first pilot to successfully fly from Anchorage to  Fairbanks in 1924. Wien went on to found Wien Airlines, a commercial  airline that operated in Alaska for nearly 60 years.\n\nAs the Presiding Officer knows, these were some intrepid pilots. That  was 100 years ago he did that first…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…growth, including five hospitals,  advanced medical programs, and an economic impact exceeding $7.5  billion.\n\nNamed alongside leading business and academic figures like Delta  Airlines Ed Bastian and University of Georgia President Jerry Morehead,  Dr. Hanley is in great company.\n\nHe credits all recognition to the dedicated staff and workforce at  Northeast…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Mr. President, in January of this year, tragedy struck just  a few miles from here when an Army Black Hawk helicopter collided with  American Airlines Flight 5342 at Ronald Reagan Washington National  Airport. Sixty-seven souls were tragically lost in an instant.\n\nAfter the crash, it quickly became evident that there were…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…for a while.\n\nNow, as everyone knows, folks aren't being paid while we are in a  shutdown. Our air traffic controllers are not being paid. In fact,  starting tomorrow, the airlines are going to be canceling flights. Our  staffs are not being paid. Federal employees are not being paid. These  young men and women here, our pages, are not being paid. Our…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…breaking  the bank.\n\nIt is not just about driving, either. If you have flown lately, you  have probably experienced the delays, cancelations, and chaos plaguing  America's airlines and our airports.\n\nPresident Trump's big, beautiful bill tackles this head-on by  investing in modern air traffic control technology, expanding staffing  pipelines, and overhauling…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…also played with the New York Jets, Carolina  Panthers, and Green Bay Packers from 1994 to 1998. After retiring from  football in 1999, Pat flew corporate jets for United Airlines and Delta  Air Lines before becoming a Captain at  American Trans Air, now ATA Airlines. Moreover, he founded Terrell  Materials, a very successful company that specializes…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…on our aviation system aren't  isolated to major cities and large airports as the viability of the Air  Service Program is also now put at risk. This program incentivizes  airlines to provide commercial flights to rural communities that  normally wouldn't be able to attract business from major airlines on  their own. In Kansas, there are five such airports…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…another transit system for 2 hours to get into San Francisco. That  would be a 6-hour trip with three transit systems in 2045 that you  could do today in 1 hour on Southwest Airlines.\n\nMr. Speaker, we have cut off Federal funding for this boondoggle. It  is time for the State to do the same and stop wasting the precious  dollars of our hardworking taxpayers.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}]