[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I was privileged to join colleagues from  both sides of the aisle this week in the House vote that was  overwhelming in bipartisan fashion to end the damaging Trump tariff  regime on Canada. The Senate had already taken the same action three…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699953/ending-the-trump-tariff-on-canada"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…constituents directly. It is sad that many Members of Congress have  rolled over and enabled this cruelty that is now happening in our  country.\n\nThere are Members on this side of the aisle who have not been silent,  who have actively opposed this President and will continue to speak  out. Democrats will continue to be a check against this President. We  will…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have decided that it is more important to save foreign  manufacturers some money than it is to save $3.1 billion for American  families. My colleagues on the other side of the aisle have decided to  listen to the lobbying efforts of foreign companies over domestic  companies, many of whom have factories in Republican districts.\n\nMadam Speaker, it just…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…constituents, to get an answer, and was brutally thrown to the ground  and handcuffed. That is wrong, and I cannot believe that we don't have  Senators on both sides of the aisle calling this out as outrageous.\n\nThis is what a democracy is about. It is about us coming to the U.S.  Senate, speaking out, asking questions, getting information so we can…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…colleagues to support H.R. 2399.\n\nMrs. DINGELL. Mr. Speaker, I have no further speakers, and I am  prepared to close.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support H.R. 2399, and I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…government?\n\nLet me state for the record what millions of Americans can already  see with their own eyes and what Trump's own Cabinet can see and what  my colleagues across the aisle are hoping nobody will ask them about.\n\nElon Musk has no idea what he is doing.\n\nHe has fired people who guard our nuclear arsenal. He has gone after  the people protecting…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688728/elon-musk-has-no-idea-what-he-is-doing"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…examples: the business passthrough.  The Joint Committee on Taxation, passthrough for LLCs, says this  revision in the law will cost $736 billion. My good friend across the  aisle says: I want to use a magic baseline to show things cost less. He  says: We will use a technique here, some magic math, and tell the  people that it only costs $6 billion,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…universal  healthcare. I have been a cosponsor of the Medicare for All Act since  day one because I know it will guarantee a healthy nation.  Unfortunately, my colleagues across the aisle have made it crystal  clear: They have no appetite for meaningful reforms like Medicare for  All.\n\nHere is what we need to do right now: We need to extend the enhanced  tax…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…will ripple across Connecticut. It will reverberate through the  country to the Presiding Officer's State, to Virginia, New York,  Maryland, colleagues on both sides of the aisle.\n\nThe cost of living in Connecticut will rise drastically. We already  have one of the highest costs of living in the country. Taxing these  goods will put an undue financial…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…after a major disaster.\n\nMr. Speaker, our residents must be able to live safely and fully  rebuild their lives after disaster strikes. I urge my colleagues on  both sides of the aisle to support this legislation. It is critically  important for our families.                 Ending Corporate Greed Through Price Gouging\n\nMs. TLAIB. Mr. Speaker, families in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, finally, I want to say a little bit  about last week.\n\nThere are those on the other side of the aisle now shedding crocodile  tears that, last week, the minority asserted its right not to proceed  to a bill that has zero legislative text. Imagine--imagine--they said,  the nerve…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690962/stablecoins"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…the last World War II veteran to serve in this very  Chamber, Mr. Speaker. He was a respected individual and is still  referenced often by colleagues from both sides of the aisle. In fact, I  will never forget coming to Congress in 2019 in the 116th session of  Congress. It was my first term. I got sworn in on January 3, as we do.\n\nMr. Speaker, I said…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…because the progressive left and the MAGA right and everyone  in between is finally waking up against this rotten system.\n\nWhen people are united and when people work across the aisle, amazing  things can happen because the American people are kind and good and  decent.\n\nMr. Speaker, it is an honor to have worked with Congressman Massie. I  particularly…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696898/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…is what you call the big businesses, big banks  being able to do whatever they want to do. All they have to do is get  individuals like my friend on the opposite side of the aisle to stand  up and support them with what they want to do.\n\nAgain, I will remind you that when these big mergers take place, they  lay off people, and they close down branch…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…to ensure that San Diego and Coronado do not need to move  from emergency to emergency to secure adequate funding for this plant.\n\nI thank my colleagues on both sides of the aisle who have helped move  the ball forward on this issue, including the San Diego delegation, our  California senators, and my colleagues who are former Navy SEALs, who  understand…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692166/international-boundary-and-water-commission-authority"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…such a  lasting impact, but Jack is a very uncommon staffer. He is a trusted  adviser, not only to me but to many members on the Transportation  Committee on both sides of the aisle.\n\nOver the years, he has played an integral role in shepherding through  Congress numerous major legislative priorities to improve America's  transportation network and build…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…about the  environment. We care about people's health. We care about the future.  We care about the economy.\n\nIt is a little bit curious to me to hear our friends across the aisle  say that we don't care about any of that stuff. In Texas, we have a  saying, Mr. Speaker: It just ain't so.\n\nMr. WEBER of Texas. Mr. Speaker, I have no further speakers, and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…and  the clerks who worked tirelessly, who stayed up for weeks on end, who  dealt with ridiculous crises deadlines, who negotiated and renegotiated  in good faith across the aisle to achieve this result.\n\nI want to thank in particular the folks who make the SAC-D  subcommittee work--of course, principally, Rob Leonard, my clerk, and  Rob Karem, who is…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…floor?\n\nMr. GRIFFITH. Thank you, Mr. Speaker.\n\nMr. GRIFFITH. Mr. Speaker, let me be clear: I meant no offense and no  criticism. As the gentleman from the other side of the aisle and from  New Jersey knows, I love parliamentary procedure. One of the reasons  that we have parliamentary procedures and rules of parliamentary  procedures is to make the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…bipartisan progress. It has passed the House  Committee on Education and Workforce and most recently the Senate  Agriculture Committee with strong support from both sides of the aisle.\n\nWith over 300 votes in the House last Congress, this bill is ready to  cross the finish line.\n\nLet me be clear. This is a win for everyone involved. It supports our  children's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…American people to keep this country safe and to  support our finest military men who are willing to risk it all in  defense of America.\n\nMy friend on the opposite side of the aisle mentions hip surgery. I  think that is entirely different than a sex change operation. That  doesn't say the person doesn't have it. With regard to the military and  the funding,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…about 60 percent of the  green new scam. I think we should have done better.\n\nThe House had core components in it to reform Medicaid. My colleagues  on the other side of the aisle were saying we are going to be taking  Medicaid away from people. Medicaid goes up between 20 and 30 percent  under our budget over the next 10 years.\n\nMedicaid under our bill…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…allows our dairy  farmers to have their products go right back into the communities from  where they were produced.\n\nI thank my colleagues in both Chambers on both sides of the aisle for  helping put this nutritious, high quality whole milk back into our  schools and also for bringing back common sense into how we keep  Americans healthy.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698185/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today in support of H.J. Res. 75.\n\nMy colleagues on the other side of the aisle will say this resolution  is unnecessary. We have heard that. Let's be clear. What is unnecessary  is placing so-called energy standards on commercial refrigerators and  freezers,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689128/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…illegal  reentry--illegal reentry--after deportation or a felony conviction  within the United States.\n\nLet me be clear to preempt some of the concerns on the other side of  the aisle. This bill adheres to strict and constitutionally protected  due process, requiring a conviction in a court of law to trigger the  enhanced penalties while leaving room for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I would note just an observation: One of our  colleagues on the other side of the aisle who is a cancer survivor--and  God bless him for it--was raising issues about government funding and  about what funding should or shouldn't exist and what this  administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…about ``affordability.'' It has  become the political hot-button buzzword. It is affordability.\n\nThis is being driven intentionally by my colleagues on the other side  of the aisle because they have got virtually nothing to run on. They  made a choice to shut the government down in order to set up a fight  and to try to elevate the issue of healthcare…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…proud  Pennsylvanian, Corey Comperatore.\n\nPolitical violence of any kind has absolutely no place in our  society. Yet, the violent rhetoric coming from my colleagues across the  aisle has not stopped. Now, a year after the assassination attempt on  President Trump's life, they have turned their violent action toward  our courageous ICE agents, who work every…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…chairman of the Energy Subcommittee, a  member of the Energy and Commerce Committee, and a leader in this  arena.\n\nIt is frustrating that we lost 42 days because our side of the aisle  wanted to open the government and wanted to have the government  operating. We  wanted to sit down and work through the issues before us, not choosing  to not fund the government.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…to my  Democratic colleagues talk about the cost of living going up.\n\nMr. Speaker, during the first week of the Biden administration, my  colleagues on the other side of the aisle shut down the Keystone XL  Pipeline. My Democratic colleagues implemented energy policies that  have immediately caused energy prices to go up, causing massive  suffering and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}]