[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…job crafted by the Democrats. Even FOX News reported that 76 percent of  Americans view the economy negatively. That is how truly out of touch  President Trump is with the alarming reality millions of American  families are facing.\n\nLet me help paint the picture for President Trump and his Republican  accomplices: Utility bills are skyrocketing across…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…so essential to the well-being of our democracy.\n\nThe Executive order makes an assumption that noncitizen voting is a  problem. The assertion that noncitizens are voting is alarming.  Fortunately, it is not true. Also, Federal law already bars noncitizens  from voting in congressional and Presidential elections.\n\nSo this is not a question of whether there…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…thank my colleagues across the aisle, especially  Representative Pfluger, the lead sponsor of the House version of this  bill, for acknowledging the urgent need to address the alarming rates  of aviator cancers.\n\nMr. Speaker, this isn't a partisan issue. It is about doing right by  those who served.\n\nSadly, since we passed the House version of the bill,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Yet, we have 700,000 homeless people including tens of thousands  of veterans. Getting Americans housing and mental health services needs  to be a national priority.\n\nIt is alarming to hear that instead of solving the problem there are  some rightwing media commentators who want to execute mentally ill  homeless people. I think the words they said were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695728/making-homelessness-a-national-priority"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…strike  would be clearly illegal. Yet, in his own words yesterday, the  Secretary of Defense claimed that the second strike was the ``correct  decision.'' This by itself is an alarming admission.\n\nBut I am, frankly, not surprised by the Secretary's statements. For  years, he has expressed contempt for the law of armed conflict and has  championed servicemembers…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Black community is disproportionately affected by  prostate cancer. Specifically, Black men are twice as likely to die  from prostate cancer as their White counterparts. This alarming trend  highlights an urgent need for action.\n\nTo address the disparities in prostate cancer outcomes, we must  ensure at-risk populations have access to prevention, early…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, President Trump's repeated bullying of  Canada and its eloquent Prime Minister Carney is both embarrassing and  alarming. Our country could not have a better neighbor or trading  partner than Canada.\n\nDeclaring emergencies where none exist, Trump delights in these  executive decrees for tariffs.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699975/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…than 200 families trying to get into  school on the base; resources to construct a new barracks at Fort  Stewart, where housing has desperately needed upgrades following  alarming reports of mold and pest infestation; resources to bring the  F-35A flight simulators to Moody Air Force Base in Valdosta and  accelerate the arrival of those aircraft to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…President Trump has earned $1.2 billion since he entered office. The  Trump family has been using the Office of the Presidency, and the way  that they are doing this is extremely alarming to me and my fellow  Democrats.\n\nNow, let me go through this timeline once more.\n\nIn September 2024, on the campaign trail, the Trump family launched  World Liberty Financial,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…to speak about  the tremendous value that NOAA--the National Oceanic and Atmospheric  Administration--provides the American people.\n\nOver the past few weeks, we have heard alarming reports that the  Trump administration wants to make good on its Project 2025 promise to  ``break up and downsize'' and privatize portions of NOAA, including the  National…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…colleagues that we are  being alarmist about this budget proposal.\n\nWe aren't being alarmist. House Republicans' cuts to Medicaid, SNAP,  and other essential programs are alarming. These are real people who  are depending on us to make sure they still have healthcare and are  able to feed their families.\n\nThese are real people who come to my townhalls,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691411/gop-tax-scam-hurts-women-and-families"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…any transparency for these plans, and many of the decisions  were clearly done haphazardly, without thinking through the  consequences.\n\nYesterday, the VA released another alarming announcement, saying they  are on pace to lose 30,000 staffers without having to resort to a  reduction in force--as if that made things better. They proposed  80,000, and…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Director that refused to bow to  his will, several other experienced, respected, trusted public health  experts resigned from the CDC in protest. Some are now also sharing  alarming allegations of the widespread culture of conspiracy and  incompetence and willful ignorance of science that is now defining  R.F.K.'s leadership. Just this week, 1,000--1,000--HHS…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…millions of American  women in condemning Trump's attempt to gut funding for women's health  research.\n\nThe Trump administration has rescinded women's research projects at  an alarming rate. These projects include lifesaving research on early  breast cancer detection and so much more. Trump even shut down the  Women's Health Initiative, our Nation's largest…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…against  Erdogan's jailing of the top opposition leaders.\n\nNow, Trump has not started jailing journalists, but the pace of  harassment in the first 60 days of his second term is alarming.\n\nHe has denied access to government buildings, including the White  House, to journalists who don't use preapproved language from the White  House. He is preferencing credentials…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "French Hill", "party": "Republican", "sentence": "…unprecedented number of  special interest aliens from China, Iran, and Russia.\n\nA special interest alien is a person who poses as a potential threat  to the United States. This is alarming and a national security risk.\n\nLast Congress, I asked the Biden Administration to be transparent  about encounters with known or unknown terrorists entering our country.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693075/special-interest-alien-reporting-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…County for years to come.                     Anti-Semitism Has No Place in America\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today with urgency and  determination to address the alarming rise in anti-Semitic violence  that is sweeping across our Nation.\n\nIn recent weeks, two young Israeli Embassy staffers, Yaron Lischinsky  and Sarah Milgrim, were shot and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…handed down to the States.  Therefore, abortions are still occurring across the country, and the  rapid rise in access to the chemical abortion drug, mifepristone, is  deeply alarming.\n\nIt is estimated that mifepristone accounted for 63 percent of the  abortions in 2023, resulting in approximately 642,700 unborn babies  losing their lives that year.\n\nWomen…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…stations and convenience stores all across our country.  So the children end up being the unknowing consumers of these poisonous  products and being sent to the hospital at an alarming rate.\n\nMy efforts to close this loophole and stop this from happening are  included in this appropriations package. It will keep these dangerous  products out of the hands…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696662/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, The Nation's Report Card  recently showed that our education system is in a state of crisis.  There has been a steady and alarming decline. However, right now, we  have an opportunity to turn the tide by catalyzing a revolution in  school choice across the country.\n\nOne-half of the equation is the Educational…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691230/universal-school-choice"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…actively promote,  and generate billions from. Worse yet, the law also deprives states of  the power to protect their own citizens through state law. I am deeply  troubled by alarming national trends and the proliferation of AI  chatbots, providing advice to our children. Increasingly, children have  been suffering, and parents have been unable to pursue…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…have produced this reality for our citizens.              Serial Child Molester Released Early in California\n\nMr. KILEY of California. Mr. Speaker, I rise today to share the  alarming news that in California a serial child molester by the name of  David Funston has been granted early release.\n\nThe parole board has granted parole to Mr. Funston, a serial…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…tragic killing of a 21-year-old  Capitol Hill intern. That was an incredible tragedy. Of course, any  homicide is an incredible tragedy, but that one really was.\n\nDespite these alarming trends, the radical D.C. Council has chosen to  undermine the very department responsible for protecting the city. Its  antipolice law strips the Metropolitan Police Department…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…component of the United States  industrial base. Despite their importance, over the last few decades,  small businesses have been squeezed out of the industrial base at an  alarming rate, with nearly half of the businesses leaving over the past  10 years. This threatens America's economic interests and strategic  readiness, which must be remedied.\n\nMr.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687942/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…with a  particular emphasis on accurately identifying when suicide is a primary  or contributing factor.\n\nThe mental health crisis among America's veterans has reached an  alarming level. Suicide is now the second leading cause of death for  veterans under the age of 45.\n\nDespite ongoing efforts, the Department of Veterans Affairs struggles  to accurately…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…dangerous tool for  surveillance. This allows unelected bureaucrats to monitor and  potentially restrict how Americans spend their hard-earned wages.\n\nRecently, we have seen alarming examples of this kind of overreach,  from the Chinese Communist Party using its digital currency to track  and control citizens to Prime Minister Trudeau in Canada freezing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…billion deficit. The State's nonpartisan  legislative analyst came out with an absolutely scathing report,  calling the State's financial situation and the Governor's budget  ``alarming.'' The report raised ``serious concerns about the State's  fiscal sustainability'' and noted that the Governor's budget does not  materially address those concerns.\n\nThis,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…leadership on this legislation and  for his commitment to enhancing the security of our Nation's critical  infrastructure.\n\nIn recent years, the United States has faced an alarming surge in  malicious cyber activity originating from  groups aligned with the Government of the People's Republic of China.\n\nThese actors have demonstrated a level of sophistication…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Americans cast their ballots, they have to have full confidence  that their voice carries equal weight and that our elections are  protected from abuse. Yet, in recent years, alarming loopholes that  allow voting without proper identification, lengthy time to vote before  elections, or time to register when you show up to vote have weakened  the confidence…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Hezbollah and the  Houthis to attack Israel just over this past weekend, amassing  ballistic missiles, building armed drones, and expanding its nuclear  weapon program at an alarming rate.\n\nThe Iran threat is wide-ranging and multifaceted, and the Iran  Sanctions Act is the foundation of our tools to combat this threat. We  know this threat isn't going…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}]