[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the Chinese, to spread lies and  indoctrinate people about what China, Iran, and Russia want Americans  to believe about our own country, about our own government. This is  alarming when an app is the top news source of Americans under the age  of 30. Let me give some examples of these practices.\n\nIn December 2023, Rutgers University found that TikTok's…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…from all over  the country come to that shadow hearing, and it was the largest act of  congressional immigration oversight since Donald Trump took office.\n\nWhat we heard was alarming, and I have worked in this space for a  very  long time. Border Patrol Commander Gregory Bovino and his rogue  immigration agents are terrorizing everyone regardless of immigration…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…under investigation for sharing highly sensitive  data with the DOGE team.\n\nWhile courts across our country step in to try to stop DOGE, its  destabilization continues at an alarming rate. I am concerned Elon Musk  wants to privatize Social Security and, through his new computer  company he just bought, is going to try to be paid by the government to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689396/trump-administration-lies-about-social-security"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Yet, we have 700,000 homeless people including tens of thousands  of veterans. Getting Americans housing and mental health services needs  to be a national priority.\n\nIt is alarming to hear that instead of solving the problem there are  some rightwing media commentators who want to execute mentally ill  homeless people. I think the words they said were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695728/making-homelessness-a-national-priority"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, President Trump's repeated bullying of  Canada and its eloquent Prime Minister Carney is both embarrassing and  alarming. Our country could not have a better neighbor or trading  partner than Canada.\n\nDeclaring emergencies where none exist, Trump delights in these  executive decrees for tariffs.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699975/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…their staff  who have met with the extraordinarily knowledgeable and dedicated  occupants of that position over the years would strongly disagree.\n\nIf you believe that the alarming proliferation of conventional  weapons, including small arms like machine guns and shoulder-fired  missiles that are susceptible to ending up in the hands of terrorists  and…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…job crafted by the Democrats. Even FOX News reported that 76 percent of  Americans view the economy negatively. That is how truly out of touch  President Trump is with the alarming reality millions of American  families are facing.\n\nLet me help paint the picture for President Trump and his Republican  accomplices: Utility bills are skyrocketing across…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…$3.3  trillion over 10 years and by more than $30 trillion over 30 years-- again, all in pursuit of making billionaires richer.\n\nAnd if those eye-popping debt numbers aren't alarming enough, CBO  projects that if interest rates go up by as little as 1 percent, the  costs could double. This is the most fiscally irresponsible bill ever  to come to the Senate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, I want to begin with a truly disgusting  and alarming piece of news the American people got this morning. This  morning, the former President of Honduras, Juan Orlando Hernandez, was  released from prison after Donald Trump gave…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Speaker, I thank Representative Strong for sponsoring this  legislation,  but I must acknowledge that over the past few weeks, the Trump  administration has taken several alarming actions that work to counter  the work we are trying to do today with this legislation.\n\nMr. Speaker, I urge the Trump administration to work with Congress  and not against…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688747/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…were undocumented.\n\nTrump's actions tell us that no one is safe from his storm troopers.  How ICE agents are going about fulfilling Trump's arbitrary arrest  quotas is also alarming.\n\nMasked, plainclothes officers have been entering communities and  abducting people to process them for deportation. This is extremely  dangerous for several reasons. The…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…any transparency for these plans, and many of the decisions  were clearly done haphazardly, without thinking through the  consequences.\n\nYesterday, the VA released another alarming announcement, saying they  are on pace to lose 30,000 staffers without having to resort to a  reduction in force--as if that made things better. They proposed  80,000, and…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…business and commerce to operate  successfully during a time of inconsistent policy initiatives with  major trading partners like Canada, China, and Mexico.\n\nWhat is more alarming is that this trade policy also undermines the  Republican Party's historic commitment to free markets and open trade.  It is not based on a clear, comprehensive, well-balanced…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…against you, the voters. He is  using these Agencies as instruments to suppress your vote.\n\nThe Department of Homeland Security and the Department of Justice  have both taken alarming actions in recent months targeting the vote.  At DHS, a senior Department leader, Heather Honey, an election denier  and conspiracy theorist in her own right, reportedly told…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…contracts, which enables  them to bring their talents and their innovation to bear in our Federal  Government.\n\nOver the last decade, small businesses have been leaving at an  alarming rate. Nothing we are doing is working to reverse that trend.  In fact, the number of small business vendors in the government's  ecosystem has been cut nearly in half.\n\nHaving…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691849/plain-language-in-contracting-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…County for years to come.                     Anti-Semitism Has No Place in America\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today with urgency and  determination to address the alarming rise in anti-Semitic violence  that is sweeping across our Nation.\n\nIn recent weeks, two young Israeli Embassy staffers, Yaron Lischinsky  and Sarah Milgrim, were shot and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…actively promote,  and generate billions from. Worse yet, the law also deprives states of  the power to protect their own citizens through state law. I am deeply  troubled by alarming national trends and the proliferation of AI  chatbots, providing advice to our children. Increasingly, children have  been suffering, and parents have been unable to pursue…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…handed down to the States.  Therefore, abortions are still occurring across the country, and the  rapid rise in access to the chemical abortion drug, mifepristone, is  deeply alarming.\n\nIt is estimated that mifepristone accounted for 63 percent of the  abortions in 2023, resulting in approximately 642,700 unborn babies  losing their lives that year.\n\nWomen…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "French Hill", "party": "Republican", "sentence": "…unprecedented number of  special interest aliens from China, Iran, and Russia.\n\nA special interest alien is a person who poses as a potential threat  to the United States. This is alarming and a national security risk.\n\nLast Congress, I asked the Biden Administration to be transparent  about encounters with known or unknown terrorists entering our country.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693075/special-interest-alien-reporting-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…stations and convenience stores all across our country.  So the children end up being the unknowing consumers of these poisonous  products and being sent to the hospital at an alarming rate.\n\nMy efforts to close this loophole and stop this from happening are  included in this appropriations package. It will keep these dangerous  products out of the hands…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696662/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I rise today to call for  Congress to act with urgency to address the alarming news that we have  just heard from Las Vegas of the discovery of yet another illegal,  dangerous biolab run by Chinese nationals.\n\nIn 2023, when the secret lab in Reedley,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…tragic killing of a 21-year-old  Capitol Hill intern. That was an incredible tragedy. Of course, any  homicide is an incredible tragedy, but that one really was.\n\nDespite these alarming trends, the radical D.C. Council has chosen to  undermine the very department responsible for protecting the city. Its  antipolice law strips the Metropolitan Police Department…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, The Nation's Report Card  recently showed that our education system is in a state of crisis.  There has been a steady and alarming decline. However, right now, we  have an opportunity to turn the tide by catalyzing a revolution in  school choice across the country.\n\nOne-half of the equation is the Educational…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691230/universal-school-choice"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…with a  particular emphasis on accurately identifying when suicide is a primary  or contributing factor.\n\nThe mental health crisis among America's veterans has reached an  alarming level. Suicide is now the second leading cause of death for  veterans under the age of 45.\n\nDespite ongoing efforts, the Department of Veterans Affairs struggles  to accurately…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Americans cast their ballots, they have to have full confidence  that their voice carries equal weight and that our elections are  protected from abuse. Yet, in recent years, alarming loopholes that  allow voting without proper identification, lengthy time to vote before  elections, or time to register when you show up to vote have weakened  the confidence…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…billion deficit. The State's nonpartisan  legislative analyst came out with an absolutely scathing report,  calling the State's financial situation and the Governor's budget  ``alarming.'' The report raised ``serious concerns about the State's  fiscal sustainability'' and noted that the Governor's budget does not  materially address those concerns.\n\nThis,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Businesses Not Fraudsters Act.\n\nMr. Speaker, SBA financial assistance programs are critical to  entrepreneurs. Unfortunately, fraudsters infiltrated pandemic-era loans  at an alarming rate. An estimated $200 billion was stolen from honest,  hardworking small businesses who needed help when they were forced to  close their doors during the COVID-19 pandemic.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…dangerous tool for  surveillance. This allows unelected bureaucrats to monitor and  potentially restrict how Americans spend their hard-earned wages.\n\nRecently, we have seen alarming examples of this kind of overreach,  from the Chinese Communist Party using its digital currency to track  and control citizens to Prime Minister Trudeau in Canada freezing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Hezbollah and the  Houthis to attack Israel just over this past weekend, amassing  ballistic missiles, building armed drones, and expanding its nuclear  weapon program at an alarming rate.\n\nThe Iran threat is wide-ranging and multifaceted, and the Iran  Sanctions Act is the foundation of our tools to combat this threat. We  know this threat isn't going…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…receive instructions on  official congressional proceedings from Epstein, a convicted felony sex  offender with deeply concerning international associations, is  especially alarming and inappropriate given her own past service in the  U.S. Department of Justice and her current role on the House Permanent  Select Committee on Intelligence, and raises serious…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]