[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…potentially positive       outcomes into adulthood, such as improvements in education.\n\nThat is what studies show being enrolled in Medicaid leads to.\n\nHow about Native Americans and Alaskan Indians?\n\nFour in 10 American Indian/Alaskan Native people are       enrolled in Medicaid, the highest enrollment rate among any       race and ethnicity category. This includes…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…more unstable and less safe. It's also hurting our military  readiness here at home, with sea-level rise and extreme weather  flooding our bases. Permafrost thaw is making Alaskan runways unusable.  Radar stations are at risk of falling into the sea.\n\nMr. Chair, we don't have the luxury of ignoring the very real effects  of climate change happening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of       increased frequency in the number of maritime accidents,       including spill events, and the potential impacts to the       Arctic maritime environment and Native Alaskan village       communities in the vicinity of the Bering Strait.\n\n(4) An evaluation of the ability of the Port of Point       Spencer, Alaska, to serve as a port of refuge…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…and we have a duty to ensure  that it continues.\n\nAlaska's business community stands with them. The Alaska Support  Industry Alliance, representing 547 companies and 35,000 Alaskan  workers, warned that the 2022 plan jeopardizes the jobs and investment  that their families depend on. National organizations from the National  Federation of Independent…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this year, I led a bipartisan congressional delegation to  Taiwan, Japan, and South Korea. Taiwan has already signed a letter of  intent with the State of Alaska to purchase Alaskan LNG, and both Japan  and South Korea are deeply interested in pursuing American energy from  Alaska as well as other Pacific Rim nations.\n\nThe message we heard at each stop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…life more expensive for America's  working families.\n\nWhile some claim this tax does not directly impact my home State of  Alaska, what is bad for American energy is bad for Alaskan energy.  Alaska holds over 100 trillion cubic feet of natural gas, and the  Alaska LNG project is our best chance to bring it to market. Yet,  burdensome Federal regulations…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Mr. President, I am coming down to the Senate floor for  the second time in about a month to try to pass a really important bill  for some really heroic constituents of mine, Alaskan Native Vietnam  veterans, and I am going to explain this bill a little bit.\n\nHopefully, the Senate is going to work well, because when I tried to  pass this a month ago, Senator…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…conservationists in the world, with  a long-standing record of balancing conservation with responsible  resource and infrastructure development. On top of the jobs provided to  Alaskan residents, responsible resource development funds various  initiatives across the State, including education, infrastructure, and  community services. It feeds our families,…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…for oil and gas leasing and development in the NPR-A and to  take into account the long history of safe and responsible oil and gas  development on the North Slope. All these Alaskan voices were ignored.\n\nImportantly, my joint resolution is supported by the North Slope  Regional Trilateral, which is made up of the elected leaders of the  North Slope Borough,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…at Holloman Air Force Base, New Mexico,  and the 43rd Tactical Fighter Squadron at Elmendorf Air Force Base,  Alaska. His staff assignments included service at the Pentagon, Alaskan  Air Command, and the Fifth Air Force.\n\nAfter his promotion to colonel in 1985, he attended the Army War  College and held senior leadership positions across the Air Force.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…say at the Federal level that we should be  able to do this.\n\nSo that is what my ARTIST Act does. It prohibits States from banning  the importation, sale, or possession of Alaskan Native handicrafts made  with walrus ivory. Environmental groups support it. By the way, the  Biden administration supported this. It is straightforward bipartisan  legislation…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…The Department is mandated to do that while protecting important  values, including sensitive areas, as well as providing for subsistence  use for Alaskans. This is generally Alaskan Natives who live in the  North Slope area.\n\nCongress really envisioned this as a balance here, where you had  responsible exploration and development moving in tandem with…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the new State would develop these abundant  natural resources for the benefit of all Alaskans and all Americans.\n\nThe Biden administration took step after step to block the Alaskan  people from developing these resources. The Biden administration levied  more sanctions on the State of Alaska than they did on Iran. Congress  time and time again has passed…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Natives. They serve at higher rates in the  military than any other ethnic group in the country.\n\nThey had a situation when so many--and I mean thousands and  thousands--of Alaskan Natives were serving in Vietnam. When a whole  host of Americans didn't want to serve in Vietnam, Alaska Natives  answered the call. So we have tens of thousands of Vietnam…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…it is Thursday here in the U.S. Senate,  and it is time for a great tradition--I think one of the greatest  traditions in the history of the U.S. Senate. It is called ``The  Alaskan of the Week'' speech, which I try to give most Thursdays. It  has been a while. For the pages, this is the highlight of the week.  Even our friends in the media like this…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]