[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…create better lives. After  extraordinary oppression and vicious policies and more, they found a  way forward.\n\nThere is a disproportionate number of Native Americans and Alaska  Natives that rely on these programs, people who have maintained  extraordinary dignity despite promises made and promises broken.\n\nSo many people are talking about that idea of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…acres  to selection by eligible Alaska Native Vietnam-era veterans under the  Dingell Act.\n\nFor those who are watching, the resource management plan allows and  enables Alaska natives who served our country so bravely during the  Vietnam war to access upwards of 11 million acres of lands at issue.\n\nHere is the problem, Mr. Speaker. By passing this resolution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…war  additional time to apply for and claim the land allotments that they  were promised.\n\nIn 1906, Congress passed the Alaska Native Allotment Act to provide  individual Alaska Natives up to 160-acre allotments. However, this law  was later repealed with the passage of the Alaska Native Claims  Settlement Act in 1971. While many Alaska Natives were able…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693475/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…addition, this  legislation will resolve land management issues tied to the Mahoney  Lake power project.\n\nANCSA was enacted by Congress to settle the aboriginal land claims of  Alaska Natives. Under ANCSA, Alaska Native Corporations were  established to receive land under the settlement and disburse money to  Alaska Natives. The Cape Fox Corporation, or CFC,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…take them up, so we are  where we are. But now these bills are going to be going to the  President for his signature.\n\nTwo of the bills we just passed are important for Alaska Natives, and  I am proud to have been able to work on these important measures. It  has been a multiyear effort to get them to the President's desk. Again,  I don't care, really,…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…horrifically successful, as the last  lease sale held received no bids.\n\nThe Biden administration's anti-energy decisions limit economic  opportunities for local Alaskans and Alaska Natives living within ANWR.\n\nCongress must move to repeal the Biden administration-era ROD that  runs counter to congressional intent and unfairly reduces economic  opportunities…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…and then went into the 2020 plan and selected a far more restrictive  alternative from it.\n\nSo with virtually no public process, no public comment, no  consultation with Alaska Natives who call the North Slope home, the  Biden administration unilaterally cut off access to 6.8 million acres  of our petroleum reserve. That is an area that is larger than…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the  country were like Alaska Native people in terms of service to our  military, we would have a better America.\n\nThey underwent an incredible injustice because so many Alaska Natives  went to Vietnam to serve in the war when a lot of Americans--let's face  it--were avoiding service in Vietnam. So these great men and women went  to serve their country…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Representative Begich, this legislation would extend the  Alaska Native Vietnam era veterans land allotment program for an  additional 5 years, to end on December 29, 2030.\n\nAlaska Natives have long experienced land-related hardships.  Recognizing this, Congress passed the Alaska Native Claims Settlement  Act in 1971 to settle the aboriginal land claims of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…formed the Borough, in part, to       ensure our communities would benefit from oil and gas       development on their ancestral homelands. It was the first       time Alaska Natives took control of their destiny using a       regional municipal government. The Borough exercises its       powers of taxation, property assessment, education, and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…has enacted, and they played games to discourage  development like only offering unfavorable acreage in their lease sale.\n\nThese policies run counter to the wishes of the Alaska Natives across  the North Slope of Alaska. I had the honor of leading a bipartisan  delegation of my colleagues on the Natural Resources Committee to the  North Slope last year…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…development truly a matter of life or death for  Alaskans. In 1954, the Interior Department, with the help of the  University of Pittsburgh, conducted a study of the health of Alaska  Natives. Many of our communities in rural Alaska all had some of the  lowest levels of life expectancy in the entire world. Between 1980 and  2014, the average lifespan increased…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…important pieces of legislation for a great part  of Alaska, and this is the Alaska Native community in my State. These  are incredible, patriotic Americans. By the way, Alaska Natives serve  at higher rates in the military than any other ethnic group in the  country. They are great Americans. They add so much to our State. They  are the first peoples…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…the day, we hear from voices across America, but we  don't hear from the voices of the people of my home State. The people  who I have spoken with, the landowners, the Alaska Natives, who were  not consulted by the previous administration in the development and  approval of this resource management plan, have stepped forward and  said: We need to remove…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…development truly a matter of  life or death for Alaskans. In 1954, the Interior Department, with the  help of the University of Pittsburgh, conducted a study of the health  of Alaska Natives. Many of our communities in rural Alaska all had some  of the lowest levels of life expectancy in the entire world. Between  1980 and 2014, the average lifespan increased…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the United States' desk for a signing. And this  is a really big deal for my constituents.\n\nHere is what it is: I talked about what I called the special  patriotism of Alaska Natives. They serve at higher rates in the  military than any other ethnic group in the country.\n\nThey had a situation when so many--and I mean thousands and  thousands--of Alaskan…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}]