[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…community were invited to discuss the  importance of extending TPS for Haitian nationals. Therefore, I include  in the Record their testimonies:  Testimony of Attorney Mirian Albert of Lawyers for Civil Rights to the\n\nCongressional Field Hearing on the Termination of Haitian Temporary                              Protected Status\n\nLawyers for Civil Rights…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…community. Her spiritual journey began at Ebenezer, and  despite receiving her calling many times, she initially ignored it.  However, with strong encouragement from Reverend Dr. Albert P. Jackson,  her sister Jeanette, other family members, friends, and her late  brother, Rice, Reverend Carr became inspired and felt a strong urge to  fulfill the calling she…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…American,''  ``immigrants,'' ``racial,'' ``Black,'' and ``women.''\n\nThey are not trying to erase all of our history. In fact, they have  restored a Confederate statue of General Albert Pike here in  Washington, D.C., and ordered a portrait of Robert E. Lee to be placed  in the Pentagon. These are men who committed treason against this  country in the defense…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…family in Schererville to commemorate this significant milestone.\n\nEdith Brown was born on February 13, 1917, in Muskogee, Oklahoma. She  was one of four children born to Luther Albert Brown and Dora Rozolia  Draper Brown. Her family went on to live in Kansas City, Kansas, and  after her parents passed Edith moved to the south side of Chicago,  Illinois,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…TAKANO. Mr. Speaker, we gather on the floor of the House of  Representatives to pay tribute to two United States marines who died in  service to our Nation. Lance Corporal Albert A. Aguilera of Riverside  and Lance Corporal Marcelino M. Gamino of Fresno were both killed in a  tragic vehicle accident while on deployment as part of Joint Task  Force-Southern…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…stuff out of Federal facilities. What  is this about? Why is it that it is uncomfortable for people to learn  about that?\n\nIt is not uncomfortable for me. I was very proud of Albert Sabin.  When Albert Sabin finished his professional career at the Medical  University of South Carolina because Albert Sabin discovered how that  little drop of serum on a…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the  North America's Building Trades Unions and the Laborers' International  Union of North America, LIUNA.\n\nMr. Speaker, I include in the Record a statement in support from  Albert Gore, executive director of Zero Emission Transportation  Association, representing the views of the domestic electric vehicle  industry; a letter of support from a group of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I rise today to recognize Mrs. Veena Black,  an Albert Einstein Distinguished Educator Fellow, a dedicated  elementary schoolteacher for over 20 years, and a personal friend who  has served our office with exceptional commitment…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697562/recognizing-albert-einstein-distinguished-educator-fellow-veena-black"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I rise today to honor my parents, Albert  and Sarah Stutzman.\n\nThey are celebrating their 50th anniversary this Saturday, one day  after Valentine's Day. I just want to acknowledge them in all that they  have done…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700043/happy-50th-anniversary-albert-and-sarah-stutzman"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…dedication to God, family,  and country.\n\nThese monuments serve as symbols of all the values the Scottish Rite  stands for.\n\nI thank the generous donors: Illustrious Brother Albert Nelson, Jr.,  and Lady Nellie; Dr. and Sir Knight James Arnold and Lady Barbara;  Illustrious Brother Charles White and Lady Nordene; and Brother Morgan  Derst and Lady Pam…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Alami, Mohammed: AL JAZEERA INTERNATIONAL.\n\nAlani, MUHANNAD: FOX NEWS; Alarian, Laila: AL JAZEERA       ENGLISH; Alba, Carmen: NBC NEWS; Albano, Thomas: CBS NEWS;       Albert, Christopher: CBS NEWS; ALBERT, JESSICA: WRC-TV/NBC-4;       ALBINO REYES, Carlos: WFDC-TV Univision; Alcindor, Yamiche:       NBC NEWS; Alcock, Shane: AL JAZEERA ENGLISH;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Kinnison.\n\nVeteran of both the Korean and Vietnam Wars: James Myers.\n\nVeterans of the Cold War: Marvin Clark and Charles Portz.\n\nVeterans of the Vietnam War: Leron Allred, Albert Amen, Walter  Anderson, Sammy Archer, John Babich, Clifford Baker, Virgil Barnhart,  Weslie Bater, Selby Batty, Richard Block, Louis Branch, Jr., Miles  Brekke, C. Brown, Charles…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…give your best.      Rise . . . rise up to heaven Darin with tears in yours eyes,             for our world you have blessed.       In loving memory of Darin Coward.      by Albert ``Bert'' Carey Caswell", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize Albert Busacca,  a World War II combat veteran, on his 100th birthday. His bravery,  resilience, and selflessness as a veteran helped shape a better world  for future generations.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692324/recognizing-wwii-combat-veteran-albert-busacca-on-his-100th-birthday"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…different schools across the country as well as with platforms like the  Khan Academy where you can have a direct dialogue with a chatbot or,  for example, a reanimated version of Albert Einstein that  teaches you physics, or you can have a dialogue with a historical  figure as you are learning history, or with a literary character as you  are reading a classic…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Call; Tomlinson, Hugh: Times of London; Toropin, Konstantin:       Military.com; Torres, Craig: Bloomberg News; Touchberry,       Ramsey: Washington Examiner; Traver I Garriga, Albert: EFE       News Services; Tribble, Sarah: KFF Health News; Trumbull,       Mark: Christian Science Monitor; Trunsky, Andrew: New York       Times; Tucker, Brianna: Washington…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]