[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…is the money coming from to do that? What is it being taken  from? Lethal strikes against vessels off the coast of Venezuela are  increasing. Then the Secretary of Defense allegedly gave an order to  kill everybody on a boat. What is the legal authority under which those  orders were given?\n\nThese strikes both are an escalation abroad and a direct attack…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697914/venezuelan-strikes-and-congressional-war-powers"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…the USAID inspector general by  83 percent, making any waste, fraud, or abuse hard to uncover.\n\nAnd it would gut global health programs like Trump, Rubio, and Musk  say they allegedly want to conserve. Not even House Republicans went  this far.\n\nThis amendment would undermine American workers, American businesses,  and our national security. I urge a ``no''…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688891/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…international law for the use of military force for drug interdiction  alone.\n\nWe have condemned campaigns of extrajudicial killings in other  countries that have done so to allegedly combat the drug trade--like  the Philippines under Duterte--and we must not engage in that conduct  here.\n\nBut the second strike on September 2 compounds the illegality.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…who no longer has support to be the queen. Yet in the United States of  America, we have someone in the Cabinet, Howard Lutnick, who is all  over these Epstein files and who allegedly had business with Epstein  after he was convicted of pedophilia, but is still in the Cabinet.\n\nWe need to ask ourselves: Are we in America going to have the lead  accountability?…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…been debunked time and time again by doctors and scientists.\n\nIn fact, he fired, just recently, the Director of the Centers for  Disease Control and Prevention because she allegedly stood up to his  anti-vax efforts. Since then, the CDC has made it practically  impossible for healthy adults in many States to receive the COVID-19  vaccination if they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…self-harm to the world.\n\nTake, for example, a horrific case that happened just last summer on  the online platform Roblox. Several people associated with 764 located  in Tennessee allegedly used the platform to entice a 13-year-old,  located hundreds of miles away in New Jersey, to carve the initials of  each person into her leg and send the group pictures and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…help place key personnel in  agencies that now are looking to benefit his companies financially.\n\nMr. Speaker, going back to the data privacy point, Elon Musk and DOGE  have allegedly used Musk's AI chatbot, Grok, within Federal agencies.  This model has likely been trained on nonpublic data by incompetent  DOGE workers. DOGE has also sought access to…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…these exact words, but  incitive language, language that would cause people to do ugly things,  incitive language, ``fascism.''\n\nThen, this reporter mentioned another word, allegedly a word that  would create, what I would call, some spark within a person that might  drive a person to say something or do something that would be harmful,  incitive language.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…in  America. We should not be cheering and gloating over the downfall of  people who did nothing wrong but show up to work. It is not right.\n\nMeanwhile, all of this is done allegedly to save money. Yet, if we  were serious about saving money, the President would lead by example  and not by exception. We know that practically every other weekend the  President…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…this Nation are not safe from the reign of terror of  this President.\n\nIn Milwaukee, Judge Dugan, a State court judge, was arrested by the  FBI for obstructing justice by allegedly directing a migrant out of her  courtroom through a side door, as Federal agents waited to arrest him  in the hallway. He was there for a hearing on charges unrelated to…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…The Vallejo detectives never  connected Muller to the kidnapping of Denise.\n\nIt was such a sensational story about how the detectives acted and  about how Aaron and Denise allegedly concocted a kidnapping that even  Netflix came out with a documentary called the ``American Nightmare.''  Madam Speaker, it became one of the most watched docuseries on Netflix.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689139/recognizing-seaside-police-department-chief-nick-borges"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Rules Committee, Republicans rejected an amendment  that would have required the Department of Justice to release the  Epstein files, multiple criminal investigations which allegedly  documented trafficking of young women and girls by Jeffrey Epstein, a  sex offender and financier with whom the President often socialized.\n\nFor years, the President and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Congressional District Champion of the Week.\n\nOn December 18, Conrad, a loss prevention specialist at a Walmart in  Canton, Ohio, was working in the store when a man being held for  allegedly shoplifting pulled a gun on a Canton police officer who was  present and attempting to question and detain the suspect.\n\nThe man pointed the gun at the officer and pulled…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698833/champion-of-the-week-conrad-piero"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Because the man in the Oval Office, Mr.  Trump, told us he wants us to protect those files, does not want them  public.\n\nOn July 17, the Wall Street Journal reported on a letter allegedly  written by Trump to Epstein as part of a birthday book for his 50th  birthday in 2003. The letter is signed at the bottom ``Donald.'' It  features a drawing of a woman's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…claims to Medicare and  Medicaid as well as to private insurers.\n\nThen, this week, in Mississippi, a trial started for a man who faces  charges from the Justice Department for allegedly participating in a  scheme to steal $77 million in Federal aid intended for needy families.  Instead, the scammers spent the money on luxury vehicles, investments,  private…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…serious public safety threat, especially for women, children, and the  elderly. Just in February--and this is a case in point--there was a  lady in Massachusetts. She was allegedly raped after ordering an Uber  Eats delivery to her home. The app indicated that a woman would be  delivering her order. Instead, an illegal alien with horrific  intentions…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…FINDINGS.\n\nCongress finds the following:\n\n(1) On June 17, 2024, 12-year-old Jocelyn Nungaray was       brutally murdered in Houston, Texas.\n\n(2) Two illegal aliens who were allegedly members of the       Tren de Aragua gang have been charged with her murder.\n\n(3) On March 4, 2025, President Donald J. Trump signed       Executive Order 14229 (90 Fed. Reg.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…line.\n\nA deal was cut, apparently, where we made a deal that we said we will  pass all of these bills as one package. Republicans voted for things  they didn't like because, allegedly, Democrats in the Senate would go  along at the end. As sometimes happens, people don't keep their word.\n\nThat package that was negotiated, that was agreed upon, and that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…illegal  immigrants coming into our country. We want to know: Where did they  come from? How did they get here? Where were they before? We want to  know all the data that we allegedly collected. Congress has a right to  know.\n\nWhy would DHS need Congress to codify their authority to give us this  data? It is because of activist radical judges that stop…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…people who really were  homeless and children who really were hungry and kids who, through no  fault of their own, really were autistic, instead of stolen--a portion  of which allegedly was sent to a terrorist organization in Somalia.\n\nMan, these people ought to all be put in jail, including the  politicians. It makes me want to stick my head in an oven.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Honduras and a leader of MS-13,  also known as Fantasma, was wanted in his home country for a quadruple  homicide. After being charged with firearms charges in Honduras, he  allegedly bribed his way out of jail and illegally entered the United  States.\n\nIn Houston, the criminal history of an illegal alien from El Salvador  included convictions for sexual…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to the government  but, more importantly, affect the tax bill you receive.\n\nLet me stipulate for the record that when I am attacked a lot in the  coming weeks for saying, allegedly, I want to have taxes go up, I am  emphatically for cutting taxes. I would like to zero out the tax code,  eliminate the income tax, and get rid of the IRS. I would like…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…haven't done  anything.\n\nThey haven't spent any money making any lives better, yet, strangely,  it is still receiving Federal dollars to the tune of $4 million for  projects allegedly in the watershed of the regions of Illinois,  Indiana, Michigan, Minnesota, New York, Ohio, Pennsylvania, and  Wisconsin.\n\nThe commission's programs are duplicative of other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…homemade flamethrower and  Molotov cocktails to attack individuals marching for the release of  Israeli hostages held by the terrorist group Hamas. This deranged  individual allegedly yelled the words ``free Palestine.'' He yelled  this during the attack.\n\nReporting suggests that the individual may have overstayed his visa  that the Biden administration…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691714/boulder-colorado-attack"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…accepted as plead. In these instances, the excerpts below reflect the  claims as plead by the victims and their families.  Only Fans Parent Company Faces No Liability for Allegedly Profiting Off                          Rape of a Miami Teenager\n\nIn April 2022, Michelson Romelus and Bendjy Charles       allegedly filmed each other on video while they…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…partisan. It was a reporter for the Wall Street  Journal. This is supposedly what Mark Zuckerberg had to say:\n\nI missed out on Snapchat and TikTok, I won't miss on this.\n\nThat is allegedly what he said.\n\nNow, while Meta is among the first offenders when it comes to  children's safety, they are not alone. I have talked many times--and my  colleagues know--about…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…exploitation involving vulnerable children, and the public  needs to know that this is probably just the tip of the iceberg.\n\nI will give you three examples.\n\nOne sponsor allegedly applied to take in two migrant children as  their father--and as I will show you today, I have two other examples  of a person pretending to be a father who was not a father.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…base an enforcement action on, or execute a consent       order based on, practices that are alleged to be inconsistent       with any such guidelines, unless the practices allegedly       violate section 2.       SEC. 4. DEFINITION OF COVERED DEVICE.\n\nAs used in this Act, the term ``covered device''--\n\n(1) means a consumer product, as defined by section…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}]