[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…meet demand.  The Investing in Main Street Act of 2025 introduced by my colleagues,  Representatives Chu, Finstad, and McIver, will strengthen and grow the  SBIC program by allowing banks and Federal savings associations to  invest up to 15 percent of their capital and surplus into SBICs.\n\nThis change will correct a discrepancy caused by a historical…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…positions to campaign and to engage in politics.\n\nOf course, the Trump administration issued an executive order  essentially undoing many of the provisions of the Hatch Act, allowing  members of the administration to use their official offices to campaign  for Donald Trump and Republicans, something that is totally outrageous,  something that is totally…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…away from  how extreme this bill is. This bill hypocritically bans safe and  effective medications for an entire group of people just because of who  they are, while still allowing them for everyone else.\n\nThis bill will not lower the cost of your healthcare. It will not  protect children. It will not ease the strain on doctors and other  healthcare…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698352/protect-childrens-innocence-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…risk. These tax credits are       not just helpful they are essential. It is unimaginable to       consider life without them.\n\nThank you again for your leadership and for allowing me the       opportunity to lift my voice on this critical issue.''", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698417/healthcare-is-real"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…It can't happen. We  are the body that has the option of ignoring the hardship and the  catastrophic consequences of this on the families we represent or  sparing them and allowing them to continue having access to healthcare  they depend on.\n\nMr. WELCH. That is exactly right. That is exactly right. That is  within the power. This is the wonderful thing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…chip sales to China in exchange for a 25  percent fee. What happened to tough on China?\n\nBoat strikes: Republicans have abdicated their constitutional war  powers authority, allowing the Trump administration to carry out  extrajudicial killings off the coast of Venezuela under the guise of  stopping drug trafficking. Meanwhile, Trump just pardoned the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…settlement, reducing the need for  protracted litigation, and helping to resolve disputes sooner rather  than later.\n\nThis bill also expands the role of special trial court judges,  allowing them to hear additional cases and act when there are issues  such as contempt, thereby helping to clear backlogs and improving the  court's overall input.\n\nIt holds Tax Court…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…accountable to the       people who live in the District.\n\nCongress should respect the District's authority to govern       itself, especially on matters of public safety. Allowing       these bills to move forward would set a troubling national       precedent by permitting federal intervention into local       policing policy, even when the local reforms…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Speaker, I urge all of my colleagues in the House to pass the  Hotel Fees Transparency Act. It will be a win for families and  consumers. It is about fairness, transparency, and allowing hardworking  families to focus on making memories together and not worrying about  surprise charges and costs.\n\nMr. Speaker, I urge a ``yes'' vote.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…add to the grid given the current  multiyear gas turbine shortage.\n\nGrid reliability regulators have been basically clear: Renewable  energy and batteries were critical in allowing the grid to endure  multiple heat waves this summer.\n\nThat is why Texas has added more solar and wind energy to their power  grid, more than any other State in the country,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Representatives Lucy       McBath, Deborah Ross, and Don Bacon: the Understanding       Student Parent Outcomes Act of 2025. This bill would make a       meaningful difference by allowing essential data collection       on the barriers to college graduation for pregnant and       parenting students. Legislation like this is necessary to       ensure that pregnant…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…U.S. reserve currency and provides a huge competitive advantage for our  country.\n\nThis bill allows a complete takeover of our financial system by Big  Tech companies by allowing these massive companies to issue their own  cryptocurrencies.\n\nFor example, Google has 3.5 billion daily users, and META has over 2  billion active daily users, not to mention…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693842/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…reserve the  balance of my time.\n\nMr. Speaker, I thank my colleagues, Chairman Williams and Ranking  Member Velazquez, for this incredible work and, as Mr. Stauber said,  allowing us to work together in this way.\n\nMr. Speaker, I thank Mr. Stauber for his incredible work in this area  and for his willingness to advocate for so many Americans, including…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…consistent with the long held request by the       District of Columbia to allow the ability to electronically       transfer legislative acts to Congress, rather than only       allowing physical copies be transferred. The challenge and       barriers created by this current requirement were clearly       exposed during both the recent COVID pandemic restrictions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I thank my generous colleague for allowing  me to speak today.\n\nAs Members of Congress, we are elected to champion the voices of our  people and pass legislation to make their lives better. Instead, House  Republicans…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690938/gulf-of-america-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…cutting enforcement and redirecting resources to  customer service. This is especially important as we approach tax- filing season and implement the working families tax cut, allowing  families to keep more of what they earn.\n\nJust as this package strengthens economic security and  accountability, it also reinforces America's security and leadership at…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Utah is the only State in the region without a SWERI center.  Representative Kennedy's legislation corrects this oversight by  authorizing an additional institute in Utah, allowing the State to  expand research, strengthen watershed restoration, and develop  innovative fuel-reduction strategies.\n\nWe know that forest management is the single most crucial…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…this issue, to misrepresent the issue, make no sense.\n\nSurely, of all of the things in the world that we can disagree on,  perhaps we can at least agree that we should not be allowing felons in  this country, and that when someone is here illegally and commits a  felony that this law ought to apply.\n\nHave not the events of the last recent days shown that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…with the village's small town charm, the original  village hall built in 1898 is still used today. In 1900, The  Cincinnati, Hamilton & Dayton Railway depot was constructed, allowing  the village to continue its agricultural commerce. In 1958, Tontogany  became the home of the newly formed Otsego Local School District which  was formed when the state pushed…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in America happen in Great  Britain first, I think it is something we should pay a great deal of  attention to.\n\nAbout 6 years ago, in this body, an amendment was offered allowing  16-year-olds to vote in Federal elections. Well over half the Democrats  voted in favor of 16-year-olds. Why would one want to do that?\n\nMr. Speaker, 16-year-olds have nowhere…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…worry whether an illegal alien  driving under the influence of alcohol is going to cause them bodily  harm or kill them outright.\n\nWe simply cannot continue the status quo of allowing aliens who  entered our country illegally or were allowed by the Biden  administration's open border policies and who decide to drive drunk or  under the influence--we can't…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…heard. Enforce the law. Protect the citizens. Restore the  sovereignty of our border. Now, thank God, we have.\n\nMr. Speaker, I thank the gentleman from Texas (Mr. Roy) for allowing  me to address these concerns.\n\nMr. HIGGINS of Louisiana. Where are they now?", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…electrical  infrastructure for Navajo families who have lived without power for  generations. Their efforts brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692643/recognizing-travis-brown"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…honored to co-lead with  my colleague from California.\n\nThe Investing in Main Street Act of 2025 makes critical improvements  to the Small Business Investment Act of 1958, allowing Small Business  Investment Companies, or SBICs, to invest more resources in Main Street  businesses across southern Minnesota and across the country.\n\nFrom Winona to Worthington,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687920/investing-in-main-street-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…country try to block the will of the people and  what they wanted to see done. This includes some of our Nation's social  media companies. According to reports, Facebook is allowing a black  market to thrive on its platform where illegal aliens can buy ride  share and delivery driver accounts from credentialed users. In effect,  what this black market…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "French Hill", "party": "Republican", "sentence": "…national security.\n\nMrs. Beatty's commonsense bill authorizes private-sector firms,  operating under an OFAC license, to conduct nominal transactions with  sanctioned entities, allowing them to more effectively trace funds and  uncover illicit networks during financial crime investigations.\n\nThe gentlewoman and I agree that while the private sector can provide…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…formidable task, Officer Schneider has not only met but  repeatedly exceeded expectations.\n\nThrough his efforts within the traffic unit, he has been able to  secure grant funding, allowing the Lincoln Police Department to acquire  essential vehicles and equipment that promote traffic safety, including  traffic motorcycles, a DUI enforcement vehicle, multiple…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…lower rate of 50 to 70 percent to the vulnerable  population?\n\nAre we going to continue to allow the provider taxes and the gaming  of the system, the money laundering that is allowing money to go to  California to be gamed and to be doled out to illegal aliens and put in  their general budget as they openly brag, or are we going to fix that?\n\nAre we going…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…below those  thresholds are classified as area sources and subject to more flexible  requirements.\n\nIn 2020, under President Trump, the EPA adopted a more rational  approach allowing facilities that significantly reduced their emissions  to be reclassified as area sources. This commonsense change rewarded  emissions improvements and reduced unnecessary…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…wonderful to see him continue to achieve greatly and  inspire others around him.\n\nKen worked tirelessly to prepare for the games by exercising at his  local YMCA every day and allowing the thrill of competition to drive  his desire to win. Ken reminds us all how important it is to keep  moving and take care of ourselves so we can make the most of life at…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}]