[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…(President), Starlight Bridge Club (Secretary),  Girlfriends Bridge Club (President), Magnificent Bridge Club, and  Network, Inc.\n\nMoreover, her contributions to organizations such as Alpha Kappa  Alpha Sorority, Inc., Gamma Tau Omega Chapter, where she is a Golden  Soror and Pearl Member and SISTERS, Inc. highlight her commitment to  enriching the lives of those…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…host of other relatives who loved him dearly.\n\nOn a personal note, Cliff was my longtime friend and supporter for  over 50 years. He was also my brother in the bond of Kappa Alpha Psi  Fraternity, Inc. His wise counsel and sage advice have profoundly  influenced my journey and success as I serve in Congress. For that, I  will always be grateful. Moreover,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Lifetime       Achievement Call to Service Award, was honored as one of the       Top 50 influential Leaders Worldwide in Pentecostalism and he       is an active member of Kappa Alpha Psi Fraternity, Inc.\n\nNow, therefore, be it resolved that, on behalf of the       constituents of the Ninth Congressional District of Texas, I       am proud to salute Apostle…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Medical  Graduates. Before his eager return to the medical field, he worked a  multitude of jobs: as a counselor for the Los Angeles Unified School  District, as a clerk at the Alpha Beta Supermarket, as an instructor  for a nursing assistant class, and as an Administrator for the  Comprehensive and Training Act Program at the Gardena Community Center.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…system, and help patients regain function. Most  patients with CIDP require life-long treatment to manage their  symptoms.\n\nIn the case of primary immunodeficiencies, hemophilia, alpha-1  antitrypsin deficiency, and other conditions, the body does not make  important proteins, or those proteins are functionally damaged. These  patients also rely on plasma-derived…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696010/recognizing-international-plasma-awareness-week-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…director of the mailing department.\n\nWhile she worked at Point Park, Mrs. Cole earned her associate of  arts degree in journalism and communications. She was inducted into the  Alpha Sigma Lambda, a National Honor Society for part-time students, as  one of the 13 charter members of Point Park Gamma Epsilon chapter. She  boasted at the time she was possibly…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…called ``In Her Honor,'' the ARIAH Foundation  and Mothering Justice uplift the lives of women like Fatima, Black  mothers who should still be with us today.\n\nA proud member of Alpha Kappa Alpha Sorority, Inc., Fatima worked for  Abbott Nutrition and was a devoted stepmother to her teenage daughter,  China Carter.\n\nAfter multiple heartbreaking miscarriages,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689832/recognizing-black-maternal-health-week"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and his  legacy forward.\n\nFor over 60 years Mr. Jenkins served Mount Zion Baptist Church as a  deacon, offering his time, prayer, wisdom and treasure. As a proud  member of Alpha Phi Alpha Fraternity, Inc. for 70 years, he embodied  the fraternity's ideals of manly deeds, scholarship, and love for all  mankind and was honored by the Gamma Omicron Lambda…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…Humanitarian Award from Central  Florida Steppers; 2022 Warrior for Democracy Award from The League of  Women's Voters: 2022 Mountain Top Trailblazer Award from Cultured  Pearls of Alpha Kappa Alpha; 2018 Drum Major Social Justice Award from  Alpha Pi Alpha Fraternity, Inc.; 2016 Legislative Advocacy Award from  Democratic Women's Club of Florida Inc.; 2013…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…beyond the wins. He helped the University of  Texas-Arlington Movin' Mavs wheelchair basketball program start, and he  was also very active in the Fort Worth chapter of Kappa Alpha Psi.  Coach LeGrand, or Snake, as everybody affectionately called him, was  someone everyone loved.\n\nMadam Speaker, you would see him in downtown Fort Worth, and you  would…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693978/9999"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, I include in the Record the  following Proclamation commending the Mu Mu Lamda Chapter of Alpha Phi  Alpha Fraternity, Inc. on its 50th Anniversary.\n\nWhereas, Alpha Phi Alpha Fraternity, Inc., founded on       December 4, 1906, at Cornell University, stands as the first…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the age of 86.\n\nMr. Bartlett was born in 1939 in Rye, attended North Carolina Central  University, graduated with a degree in accounting, and membership  during college of the Alpha Kappa Chapter of the Kappa Alpha Psi  fraternity. Mr. Bartlett turned his degree into a career as a Treasury  agent and as an auditor for the IRS.\n\nMayo Peter Bartlett was…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, I rise today to recognize the 81st Convention  of the Kappa Alpha Order, which will be held in Roanoke, the heart of  Virginia's Sixth District. It is a distinct honor to welcome this  historic brotherhood back to its roots. Kappa Alpha Order…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693202/recognizing-kappa-alpha-orders-81st-convention"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I rise today to recognize Keaton  Beasley of Simmons Bank.\n\nKeaton is a graduate of Henderson State University, a member of the  Alpha Phi Alpha fraternity, and a banker in Little Rock.\n\nKeaton exemplifies the ethos of a community banker, frequently  working with children, adults, and seniors to teach them…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…or whether it was deployment overseas to  the Middle East as part of Operation Enduring Freedom, Marc and I were  in it together.\n\nHe was the heart and soul of our company, Alpha Company ``Wolfpack,''  and the 2-135th General Support Aviation Battalion ``Blackjacks.'' An  amateur photographer and a true patriot who was a 9/11 first responder  and who…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}]