[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…heartless trend. They are destroying what decades  of research has built. The billions in funding cuts and thousands of  staff cuts threaten the race to find cures for Alzheimer's, ALS,  cancer, and other devastating illnesses. The impact will be felt far  beyond our borders, and it will be generational.\n\nFor decades, we have taken the lead on the global stage…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Mr. Speaker, I rise in support of extension of  the ACA tax credits.\n\nI met Shadene Butchart in Chicago. She has ALS. Since the ACA tax  credits have expired, her health insurance premium consumes the  entirety of her husband's Social Security check. She will not be able  to afford any health…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698805/breaking-the-gridlock-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…primary role in several  sectors. The NIH supports noncommercial and clinical research with  private sector innovation, allowing for major achievements in rare  diseases such as ALS, substance use disorders, stroke, and Parkinson's.\n\nDuring my time in Congress, I have continuously advocated on behalf  of medical research. Congressional action has helped…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize the Trivits  family from Hockessin, Delaware.\n\nRecently, Evan Trivits wrote to me about his wife, Angela, who, last  September, was diagnosed with ALS. The slow and progressive impact of  ALS, paired with our devastating lack of clarity about its causes, is a  metaphorical perfect storm of grief.\n\nThe Trivits family dreams…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Center or the University  of Buffalo to advance their lifesaving work.\n\nThese cuts mean delayed treatments, denied cures, stolen hopes from  patients battling cancer, Parkinson's, ALS, Alzheimer's, and so many  other devastating diseases. I felt the pain and hope of patients,  grandparents, mothers, fathers, and children who are counting on the  next clinical…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…are a direct  threat to American lives and health. If Trump and Republicans succeed  in slashing NIH funding, it means that crucial research into diseases  like Parkinson's, ALS, and multiple sclerosis will be delayed or  abandoned altogether. It means that hospitals and research centers will  struggle to continue their work. It means that the next…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…year. We  did it too. A 60-percent increase to NIH's budget over the last  decade--60 percent, money that is used to research and develop new ways  to fight childhood cancer, ALS, Alzheimer's, you name it.\n\nIf you own a television and you ever turn it on, you can't avoid an  ad for a new prescription drug. They are on all the time, with great  promise,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…800 number and limited hours of operation.\n\nAt the National Institutes of Health, it would freeze funding for new  research grants, including research on cancer, Alzheimer's, ALS, heart  disease, diabetes, kidneys, mental health, maternal mortality,  infectious diseases, genetic diseases, and the list goes on and on.\n\nCommunity health centers would receive…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…medications or the decision to end subsidies that keep  health insurance affordable, or it is laying off thousands of  researchers working to help cure pediatric cancer or address ALS or do  research into HIV AIDS--decision after decision that moves us in  the wrong direction, that makes us sicker, poorer, and more divided.\n\nI am usually one of the first…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…coverage kicks  in, while families are left to shoulder an additional $20,000 a year in  out-of-pocket costs.\n\nCongress has acted before for rapidly progressing diseases like ALS.  We should do the same here. As one of my constituents put it, this bill  puts health and dignity first.\n\nMr. Speaker, I urge my colleagues to support the BRIDGE for YOAD Act.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700027/relief-for-early-on-set-alzheimers-disease"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…the House of Representatives,  Representative Cory Mills founded PACEM Solutions International, LLC,  and PACEM Defense, LLC, and acquired AMTEC Corporation, now renamed as  ALS, Inc., companies which engage in security and military contracting  with the United States Government, as well as foreign nations;\n\nWhereas in August 2024, the Office of Congressional…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ago this next month.\n\nWhy do I bring that up? I bring that up because I get cancer groups  that come into my office all the time. Mr. Speaker, you get cancer  groups, you get ALS groups, you get people who have a heart to solve a  problem, and they want money. They want funding. I have to say no. If  they don't come in and say: Well, we know that we…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, I rise today to recognize ALS Awareness  Month, to honor those who have lost their lives to this awful disease  and to share my support for our fellow Americans living with ALS.\n\nLast year, I had the opportunity…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}]