[{"senator": "Norma Torres", "party": "Democrat", "sentence": "…demonstrates her enthusiasm for  public education systems in the Inland Empire. Her hard work has left a  lasting impact on many, as seen by her recognition as Chaffey College's  2002 Alumni of the Year, and with Chaffey College being named a top-10  finalist for the 2017 Aspen Prize for Community College Excellence.\n\nBeyond her contributions to Chaffey College,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Excellence in High School Journalism Awards ceremony. Others were  National Merit Scholarship winners and so much more.\n\nAmong the impressive things about Dominion are its proud alumni  networks. School representatives told us about 15 alumni have returned  to be teachers at Dominion High School.\n\nMr. Speaker, I congratulate the class of 2025, and I look…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…for equality in education and the       enduring pursuit of justice in Leflore County and beyond;\n\nWhereas the legacy of Amanda Elzy High School lives on       through its alumni-many of whom have remained in Mississippi       and work tirelessly to improve their communities, including       through civic engagement, grassroots organizing, and…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694753/recognizing-the-amanda-elzy-high-school-multi-year-reunion"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…Regeneron STS is the most prestigious science  competition for high school seniors in the country and has been held  annually as a program of Society for Science since 1942. Alumni from  Regeneron STS have gone on to become recipients of the world's most  distinguished science and math honors, including the Nobel Prize and  National Medal of Science.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688578/recognizing-owen-zhang-for-scientific-excellence"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…return to the conversation that I was holding forth on regarding the  Department of Justice.\n\nI have here this page called ``Justice Connection, Urgent Message  from Recent DOJ Alumni Decrying Attacks on Justice Department.'' I  believe I asked unanimous consent to have this put in the Record, but  if I did not, I am asking it now.\n\nMr. MERKLEY. Thank you…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…initiatives, and providing an education  that encourages critical thinking, ethical leadership, and civic  engagement; and\n\nWhereas, the college's commitment to its students, alumni, faculty,  and staff has created a legacy of intellectual curiosity, innovation,  and community engagement that continues to inspire future generations;  and\n\nWhereas, on this…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…students will foster meaningful  relationships between America and Germany, while giving participants  new perspectives on peoples and cultures beyond their own. Many CBYX  alumni go on to distinguished careers in foreign affairs and public  service using the language skills gained through this scholarship  program.\n\nThis year, Avi will travel to Germany…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693199/recognizing-avi-bender"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…students will foster meaningful  relationships between America and Germany, while giving participants  new perspectives on peoples and cultures beyond their own. Many CBYX  alumni go on to distinguished careers in foreign affairs and public  service using the language skills gained through this scholarship  program.\n\nThis year, Emiko will travel to Germany…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693200/recognizing-emiko-mukai"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…will carry forward  this tradition to the next century and beyond.\n\nHebrew University is home to over 23,000 students and 1,400  researchers across six campuses. Faculty and alumni have received 9  Nobel Prizes and registered more than 11,000 patents. Its impact has  shaped not just Israel but the whole world, including in Virginia  through the Mid-Atlantic…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697239/100th-anniversary-of-hebrew-university-of-jerusalem"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…year of service to the  State of Hawaii by welcoming 103 corps members to classrooms across our  islands. In total, the TFA network in Hawaii now has 631 corps members  and alumni, collectively improving the lives of over 18,000 students.\n\nI especially commend the program's focus on locally-rooted  leadership. TFA Hawaii has recruited 259 corps members…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696215/congratulating-hawaii-teach-for-america-teachers"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…likely to have run-ins with the law,  less likely to enter foster care, and less likely to experience poor  health.\n\nI am proud to serve in Congress with notable Head Start alumni, such  as my colleagues Representative Tony Gonzales, Teresa Leger Fernandez,  Andre Carson, Jahana Hayes, and of course, Georgia's very own Senator  Raphael Warnock.\n\nSadly,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…social economic  policy and development, trauma and violence prevention, and many more.  Its students contribute countless internship hours to institutions  across Georgia. And alumni of its Athens and Gwinnett campuses, as well  as its online program, are engaged in meaningful careers in service to  the well-being of our society.\n\nOn the 60th anniversary…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…enrich, and empower, Leyden does more  than reach; it uplifts. It lives by one simple, powerful motto: Do  What's Best for the Kids.\n\nI congratulate the students, teachers, alumni, and school leaders of  this century of service. Here is to the next 100.                              Migrant Abduction\n\nMr. GARCIA of Illinois. Mr. Speaker, I rise today…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Patel is much more than a local  business leader; he is an active philanthropist and a homegrown product  of our community. A fellow California State University, Fullerton,  alumni, he shows his dedication to our community through his work with  the Anaheim Family YMCA and Anaheim Police Association.\n\nI call on my colleagues to join me in recognizing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688533/recognizing-mr-bharat-patel-for-his-contributions-to-our-orange-county-community"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…resources for school enrichment programs, residential  camping programs, adult volunteer training, teen workforce development,  civic engagement, and graduating senior and 4-H alumni scholarships.\n\nIt is clear that Marlene Law has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…iconic blue FFA jackets from across the  country visit our offices on Capitol Hill. In my home State of  Minnesota, FFA has 15,000 members and 220 chapters, as well as 97  alumni chapters. This year, Minnesota FFA chapters will participate in  local events aligned with the National FFA Week calendar.\n\nI always appreciate having the opportunity to visit…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700169/congratulating-chris-tungseth"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Outstanding Engineer in  Industry. He was involved with the Boy Scouts of America and was a  member of the Honorable Order of Kentucky Colonels, the University of  Kentucky Alumni Association, the Veterans of Foreign Wars, and a life  member of the Pearl Harbor Survivors Association. He received the  Mayor's Spirit of Lexington Award.\n\nVaughn P. Drake,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…him the best of luck and continued success with the Seattle Seahawks,  of course, except when he plays the Green Bay Packers. He has made all  at St. Norbert, St. Norbert alumni, and everyone in Wisconsin's Eighth  Congressional District incredibly proud.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692195/recognizing-mitch-van-vooren"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…football champions. Our Hoosiers  beat Miami 27-21, and finished a perfect season and brought the title  home to Indiana.\n\nI say that as a proud IU alum, former chairman of our IU Alumni  Association, over 800,000 living alumni strong. My wife, Mary, and I  have been cheering on our Hoosiers since our college days.\n\nWe will be talking about this play for a…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699173/indiana-college-national-football-champions"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…including Ohio Valley Conference (OVC) Coach of the Year in 1982, OVC  Hall of Fame Inductee in 2004, MSU Athletic Hall of Fame Inductee in  1995, the 2017 MSU Distinguished Alumni Award, and most recently, the  MSU Founders Award for University Service in 2025.\n\nWayne has used his legacy on the sidelines and the power of the  airwaves to give back to…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Arizona\n\nMr. CISCOMANI. Madam Speaker, I rise today in honor of Cochise  College being ranked the number one community college in Arizona, an  honor that faculty, students, alumni, and all Arizonans should be very  proud of.\n\nCochise Community College has two campuses and four centers in  Cochise County and is known for its affordable tuition, small…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…has remained steadfast  in its founding ideals such as personal attention, intellectual  curiosity, and a deep respect for individuality. The school's faculty,  students, and alumni continue to embody these values, carrying forward  the founders' dream of education that not only prepares young people  for college, but also for meaningful, purposeful lives…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…friend and colleague's concern is sincere about faculty  involvement in reporting in institutions,  of course, that know how to keep records of sports donors, boosters,  and alumni who are contributing various things. I think this is even  more important.\n\nMy colleague argued that requiring researchers to disclose foreign  gifts and contracts would be…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Indians  consistently had great performances on the mound and in the batter's  box.\n\nAlong the way, the Lady Indians were supported by a dedicated fan  base of parents and alumni that fueled their desire for victory.  Without the fan support and the support of their coaches, none of this  would have been possible.\n\nI will always be grateful for the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693117/recognizing-hillsboro-high-school-lady-indians"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Violence.\n\nAt his undergraduate alma mater, Illinois State University, Judge  Knecht was an adjunct professor for nearly three decades and is a  recipient of their Distinguished Alumni Award.\n\nAgain, I congratulate Judge Knecht on this momentous achievement in  his legal career and thank him for his continued service to the State  of Illinois. I wish Judge…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "John Boozman", "party": "Republican", "sentence": "Mr. BOOZMAN. Mr. President, I rise today to honor a century of  leadership, service and sisterhood embodied by the bright young women  and alumni of the University of Arkansas's Kappa Kappa Gamma chapter,  Gamma Nu. This year marks Gamma Nu's 100th anniversary of proudly  encouraging and sustaining a culture of excellence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695796/recognizing-100-years-of-the-gamma-nu-chapter-of-kappa-kappa-gamma"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…placed second.  Each student on the team--Antonio Franco, Will Gajecki, Rex Giberson,  and Jack Ross--earned silver for their individual performance.\n\nFive Garden Spot FFA alumni also received American FFA Degrees in  2025, the highest honor bestowed to FFA members, and were recognized at  the convention. These individuals were Gracie Albright, Sydney…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698930/congratulating-the-garden-spot-future-farmers-of-america"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…University of Illinois College of Law. At  Illinois State University, his time as an adjunct professor lasted  nearly three decades and he is a recipient of their Distinguished  Alumni Award.\n\nI want to congratulate Judge Knecht on this momentous achievement and  thank him for his continued service to the state of Illinois. I wish  Judge Knecht, his wife…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694150/congratulating-judge-jim-knecht-on-50-years-of-service"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…(HAPCOA)\n\nPeace Officers Research Association of California (PORAC)\n\nCivic, Community & Reform-Focused Organizations\n\nAfrican American Mayors Association\n\nNext Generation Alumni Leadership Council\n\nPrince Jones Jr. Foundation\n\nCoalition of Moms Against Police Brutality\n\nThis broad coalition reflects a shared understanding across       communities,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}]