[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Kloey Kehl for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nKloey has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691929/recognizing-kloey-kehl"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Lilith Roberts- Ruiz for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nLilith has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691136/recognizing-lilith-roberts-ruiz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Jackson Rogers  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nJackson has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689986/recognizing-jackson-rogers"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Fernanda Orozco  Saenz for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nFernanda has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691035/recognizing-fernanda-orozco-saenz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Julissa  Martinez for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nJulissa has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691749/recognizing-julissa-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Amelia Brown  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAmelia has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691860/recognizing-amelia-brown"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Adrienne Van  Bruggen for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nAdrienne has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691190/recognizing-adrienne-van-bruggen"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Caden Beiser  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nCaden has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691240/recognizing-caden-beiser"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Jaretssy  Sandoval-Perez for earning the Arvada Wheat Ridge Service Ambassadors  for Youth Award.\n\nJaretssy has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689993/recognizing-jaretssy-sandoval-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Devonte  Bonggas-Ellenburg for earning the Arvada Wheat Ridge Service  Ambassadors for Youth Award.\n\nDevonte has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691185/recognizing-devonte-bonggas-ellenburg"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Amelia  Ferkuniak for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nAmelia has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689635/recognizing-amelia-ferkuniak"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Omar Lautenbach  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nOmar has overcome many challenges along their journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689451/recognizing-omar-lautenbach"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Diego Estrada  Ponce for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nDiego has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690381/recognizing-diego-estrada-ponce"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Kai Weiss for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nKai has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691740/recognizing-kai-weiss"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Veronica  Quezada for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nVeronica has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689438/recognizing-veronica-quezado"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…commitment to addressing diverse community challenges with tailored  support. Led by Ann, the leadership team within RSVP Pasco has also  been a driving force behind its success. Ambassadors have taken on  vital roles in recruitment, outreach, and event planning. When the  CARES Senior Center closure displaced 25 volunteers, RSVP Pasco worked  diligently to…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}]