[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize James Millard  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nJames has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689697/recognizing-james-millard"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Fernanda Orozco  Saenz for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nFernanda has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691035/recognizing-fernanda-orozco-saenz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Arianna Roberts  Garcia for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nArianna has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689672/recognizing-arianna-roberts-garcia"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Ibrahim Yousuf  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nIbrahim has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691464/recognizing-ibrahim-yousuf"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Tasia Howard  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nTasia has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689785/recognizing-tasia-howard"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Anastasiia  Bilobrytska for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nAnastasiia has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691161/recognizing-anastasiia-bilobrytska"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Pete Rapa for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nPete has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689458/recognizing-pete-rapa"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Alyssa Sayers  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlyssa has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691840/recognizing-alyssa-sayers"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Angel Lamus  Bonilla for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nAngel has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689731/recognizing-angel-lamus-bonilla"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Jordan Reil for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nJordan has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691099/recognizing-jordan-reil"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Nyx Walton for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nNyx has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691487/recognizing-nyx-walton"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Veronica  Quezada for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nVeronica has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689438/recognizing-veronica-quezado"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Violeta  Monserrat Diaz Martinez for earning the Arvada Wheat Ridge Service  Ambassadors for Youth Award.\n\nVioleta has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690383/recognizing-violeta-monserrat-diaz-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Alicia Montoya  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlicia has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689448/recognizing-alicia-montoya"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Nathan Angel  Perez for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nNathan has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691983/recognizing-nathan-angel-perez"}]