[{"senator": "Donald Norcross", "party": "Democrat", "sentence": "…is what  fundamentally is going to change here. If your boss requires it and if  you work, you have to be paid. It is the system that is not broken now.  This would create ambiguity for those workers saying they are  voluntary.\n\nThat is not good. In fact, we call those captive meetings now when  they come in to preach why worker unions are bad, but they…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…their own ``less-      than-lethal projectile devices'' that could later be more       easily modified to be fully lethal. For the last decade, the       gun industry used ambiguity in the existing regulation of       firearms to create a market for unfinished frames and       receivers, as well as kits to finish assembling them, which       were the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Congress, not the President, with the power to declare war.\n\nNow, there may be a fog of war and a murky uncertainty concerning the  battle damage assessment, but there is no ambiguity here when it comes  to the Constitution. Article I, section 8 provides that ``Congress  shall have [the] Power . . . To declare War''--not the President, or  the President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…tired of these endless, forever wars. We know that  President Trump will exploit, bend, and break any law. The courts have  even said it. That is why this body should leave no ambiguity, no  wiggle room, and no daylight about our congressional intent and  congressional authority. Congress has the sole constitutional right to  declare war, not President Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…own to replace these plans.\n\nEven oil and gas industry experts across the political spectrum agree  that the use of the CRA on land use plans creates regulatory and legal  ambiguity. In fact, Kathleen Sgamma, as I just told you, President  Trump's former nominee to lead the BLM, recently said--and it is a  quote worth repeating--``There could be some…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…class.\n\nThe indiscriminate stripping of collective bargaining rights through  executive action was an illegal gray area if not outright unlawful.\n\nThis legislation ends that ambiguity. It should never have been a  partisan issue.\n\nMr. MANNION. I am grateful to my colleagues on both sides of the  aisle for working together toward this meaningful solution.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697993/protect-americas-workforce-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the Fiscal Responsibility Act--always a narrow  provision. But not now.\n\nHow else can we take a look at this? How about if we look at whether  it was resolving a technical ambiguity. Yep. Every single time,  resolving a technical problem, in bipartisan fashion, narrow provision.\n\nAnd most importantly, has this provision of 312, which is not in the  section…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…autopilot. Neither is a  viable option.\n\nStopgap measures afford the administration broader discretion over  the budget and cede our authority over Federal spending. The more  ambiguity we afford them, the more they will exploit it. One of the  best ways to rein in this reckless administration is by providing  precise spending levels for specific projects…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…I. The Danes have been  close partners in the Arctic since World War II, and brave Danish  soldiers fought and died in America's wars in Afghanistan and Iraq.  There is no ambiguity here--no ambiguity. Close ties with our  northernmost allies are what make America's extensive reach in the  Arctic actually possible. And I have yet to hear from this  administration…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…ecosystem currently operates in a fragmented  regulatory environment that lends itself to significant challenges for  both businesses and, more importantly, investors.\n\nThe ambiguity in classifying a digital asset, either as a security or  a commodity, has led to confusion, legal uncertainty, and, ultimately,  consumer harm.\n\nAmerican innovation is a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693769/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…financial data for any purpose other than initiating a       payments transaction by the consumer.'' When combined, these       two provisions within the rule create further ambiguity       regarding the scope of the proposal for merchants. Without a       meaningful exclusion for merchants, the Bureau's authority       could extend from players in consumer…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…banking regulators, such as the Federal  Reserve Board, before issuing this final rule.\n\nCreating different merger rules for banks with different charters  would add significant ambiguity for both banks and their customers.\n\nThankfully, the current OCC under President Trump has recently  indicated they will abandon this flawed rule. However, without this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…record of success, a recent BLM review raised  questions about whether the park's use of the land aligns with the  terms of the original patent.\n\nH.R. 2876 clears up this ambiguity by affirming the park's current  use is valid and consistent with the public purpose envisioned at the  time of the conveyance.\n\nThis is a simple, bipartisan bill that cuts…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…needs clear and explicit guidance for our  agencies and federally funded researchers. While this body has passed  multiple bills to protect American research, unintentional ambiguity  has created confusion within the academic research community. H.R. 1318  will eliminate confusion around the implementation of research security  requirements and increase…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…issues like how it should apply to partnerships.  The notice is within the Treasury's authority, but the Democrats  dislike the outcome.\n\nApproving this resolution would revive ambiguity, inviting audits,  litigation, and significant compliance costs. Therefore, I register my  objection when the unanimous consent request is made.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699912/9999"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…responsibilities entrusted to Congress.\n\nOur criminal statutes must be clear and effective so that individuals  who exploit children are held fully accountable under the law. When  ambiguity exists, it can undermine enforcement and allow dangerous  conduct to fall outside the reach of existing statutes.\n\nRecently, a court decision in United States v. Howard highlighted…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698894/child-predators-accountability-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…found  that complicated and confusing language in the bill was impeding the  ability of American researchers and their institutions to protect  taxpayer-funded research.\n\nThis ambiguity could also allow for loopholes, allowing malign  foreign talent recruitment programs in our universities and other  research labs to recruit researchers or access sensitive…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}]