[{"senator": "Al Green", "party": "Democrat", "sentence": "…intervention of any point of order, a motion       offered by the chair of the Committee on the Budget or his       designee that the House concur in the Senate amendment with       the amendment specified in section 2 of this resolution. The       Senate amendment and the motion shall be considered as read.       The motion shall be debatable for one…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693211/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to try to explain it to her again, but math  doesn't lie. It is undefeated.\n\nMr. Speaker, I am going to urge that we defeat the previous question.  I will offer an amendment. My amendment will simply strike section 2 of  the rule. That section, tucked in the rule by Republicans this morning,  prevents the House from voting on Trump's disastrous worldwide…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…claim the time in opposition to the  amendment, even though I am not opposed to it.\n\nMr. GUTHRIE. Mr. Chair, I thank my friend from California for  offering this amendment.\n\nThis amendment would incorporate advanced transmission technologies  into the supply chain considerations that the Department of Energy  would also need to assess, as part of their…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Schultz working with us on this  amendment. I ask my colleagues to support it, and I urge its adoption.\n\nMs. WASSERMAN SCHULTZ. Mr. Chair, I rise in support of this  amendment. This amendment contains noncontroversial amendments that  raise awareness on programs that we all care about. That includes the  need to address a variety of medical care issues…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…body to make sure that it claims its rightful place in  foreign policy when we have an issue like this before us.\n\nThe gentlewoman talks about the spirit of this amendment. This  amendment is issued in the spirit of freedom, and that is all that  Taiwan is looking for, to defend its freedom, and it should be able to  do it.\n\nMadam Chair, I yield back…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693684/department-of-defense-appropriations-act-2026"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…look forward to working with the  gentlewoman. We need a place for those aircraft to land in Greenland.\n\nMr. CALVERT. Madam Chair, I certainly rise in support of the  amendment. The amendment prohibits the expenditure of funds to create,  procure, or display any map that depicts Taiwan as part of the  territory of the People's Republic of China.\n\nLet's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…To add insult to injury, we are given this legislation in an  appropriations bill. We have Senate rules against this.\n\nSo I would recommend that we vote for this amendment, and my  amendment would strip out the language.\n\nI would transfer the remainder of my time to Senator Merkley.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…intervention of any point of order, a motion offered by the       chair of the Committee on Appropriations or his designee that       the House concur in the Senate amendment. The Senate       amendment and the motion shall be considered as read. The       motion shall be debatable for one hour equally divided and       controlled by the chair and ranking minority…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]