[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…patients,       financially destabilizing and having a disproportionate       impact on those who provide care to underserved and rural       communities.\n\nAssociation of American Medical Colleges, AAMC:\n\nWe remain extremely concerned that the budget resolution's       reconciliation instructions would result in unsustainable       cuts to Federal healthcare…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…establish training opportunities in rural  and underserved areas.\n\nThe need to strengthen the healthcare workforce continues. According  to new data from the Association of American Medical Colleges, the U.S.  could see a shortage of up to 124,000 physicians by 2034, and the  American Hospital Association says more than 200,000 new registered  nurses are…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Evidence-based, medically necessary care for  transgender youth is safe, effective, and supported by every major  medical association in the United States, including the American  Medical Association and the American Academy of Pediatrics.\n\nMy Republican colleagues know this, because this intentionally  discriminatory bill includes a bunch of exemptions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698348/protect-childrens-innocence-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…are taking high  blood pressure medication. Men develop heart disease 10 times earlier,  on average, than women according to Johns Hopkins Medicine. According  to the American Medical Association more than one in three adult men  have some form of undiagnosed cardiovascular disease.\n\nAccording to the CDC, about three in four men in the United States…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…insurance premiums have gone up so high in the  United States of America.\n\nNow, I have a bill that eliminates directed consumer advertising, as  approved and requested by the American Medical Association. I won't be  able to add it to this bill--I want to--but I am prepared to join in  the debate about making the system better and more affordable that will…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I yield myself such time as I may consume.\n\nEvery major medical and mental health association in the United  States of America, representing 1.3 million doctors--the American  Medical Association, the American Psychological Association, and the  American Psychiatric Association--all reject this legislation that is  being advanced here. They all support…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…pronounce but spell  Xarelto, but you will also tell your doctor: That is my favorite blood  thinner. I have seen that ad over and over again.\n\nDon't take my word for it.\n\nThe American Medical Association said:\n\nDirect to consumer advertising inflates demands for new and       expensive drugs even when these drugs may not be appropriate       for your health.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…pregnancy to term. After  giving birth, she lost her job and health coverage, and the so-called  clinic never offered real medical care or follow-up support.\n\nThis is why the American Medical Association and the American College  of Obstetricians and Gynecologists have raised serious ethical and  medical concerns about these clinics.\n\nNow, Republicans want…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Award Recipients:\n\nCarlos Bautista, Base Aviation Manager, Fixed Wing Pilot,       EagleMed, Dodge City, Kansas; Chris Crawford, Paramedic,       Field Training Officer, American Medical Response, Portland,       Oregon; Nathanael Day, Flight Nurse, Paramedic, EagleMed,       Dodge City, Kansas; Rudy Drago, Dispatch Lead, AMR River       Medical, Lake…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}]