[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…projects to withholding energy permits, to  issuing illegal stop work orders on fully permitted generation  projects, President Trump is waging a war on affordable, American-made  energy. Most recently, that came in the form of canceled energy  projects. Last week, the Trump administration unlawfully canceled  nearly $8 billion in Federal investments…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…actively working to raise Americans' energy bills, not to mention  the effect that reckless tariffs that, together with this policy, the  Republicans are pushing will drive American energy bills and prices at  the pump sky high.\n\nHowever, I guess those high prices are worth the costs to Republicans  if it means Big Oil and Gas are pleased.\n\nThe Methane Emissions…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688185/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…gas, and coal.\n\nWell, there ain't enough oil, gas, and coal to fuel the world, and it  is more expensive to do it, Donald Trump. What the heck are you doing?\n\nThis is an American energy kill switch. Solar jobs will vanish. Wind  jobs will vanish. Manufacturing jobs will go to China, just the  opposite of what the President says he wants. And people's…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…weights. These health impacts will  particularly harm low-income communities, where the effects are  disproportionately severe.\n\nMr. Zeldin claims these actions will ``unleash American energy,'' but  really they will just unleash more pollution on the American people.  Mr. Zeldin claims that these actions will drive down costs for American  families, but the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…$8 billion in clean energy funding for the whole  country. It included $53 million for 12 projects in Connecticut  supporting lower energy prices, grid reliability, and American energy  independence.\n\nIt was done in a way that was as illogical, chaotic, and likely  illegal as canceling Revolution Wind was. Again, a self-inflicted wound  in every way…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…They have  canceled billions of dollars in investments for our State, including  the hydrogen hub that would expand research and development of hydrogen  fuel, bolster American energy dominance, and bring nearly 10,000 jobs  to the region.\n\nThey have created chaos at critical agencies that keep the lights on  like Bonneville Power Administration. Moreover,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…economy, and even for Republicans themselves. It rips  healthcare from 16 million people. It is the biggest cuts ever to food  funding. It raises energy prices and surrenders American energy  leadership to China. And it rewards the ultrarich.\n\nRepublicans should abandon these destructive policies. But, of  course, they aren't doing that. Instead of fixing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the sake of the American people who are footing the big bill for  all of this, here is an idea. What if Congress considers a taxpayer  recovery fee on every Venezuelan or American energy company that will  benefit from the heroism of America's military. How about putting some  of that money into military housing, which is a disgrace.\n\nLet's refund it back…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ugly bill will raise electricity prices by  a staggering 61 percent over the next decade due to its attacks on  cleaner and cheaper energy and its crippling of the American clean  energy industry.\n\nThe big, ugly bill destroyed tax credits that were designed to  incentivize developers to build more domestic energy projects, raising  barriers to those…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…energy  investments that we made, that have created so many new good-paying  jobs. Republicans are rewarding China by weakening our economic  competitiveness and ceding American energy leadership to our  adversaries.\n\nThe hypocrisy is simple. On the one hand, they say we need more  energy for AI and for everything else, but then, on the other hand,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…demonstrates how Republicans in  Congress continue to ignore the rising cost of living and inflation  that is crushing American families and that they are willing to sell  out American energy to our adversaries like the Chinese Community  Party.\n\nI know it wasn't even 2 weeks ago that President Trump said: I don't  want to talk about affordability.\n\nWell, we…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…threat to our national security.\n\nUnfettered sale of LNG to countries like China and Russia would power  their data centers, AI systems, and cyber missions, all by using  American energy.\n\nThis legislation, importantly, is a departure from how we regulate  all other energy sources. Sources like oil and coal, we have laws that  impose certain restrictions…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697082/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…scale back services.  For what? To pay for tax breaks for the wealthiest people in this  country.\n\nAside from hospitals, there is also going to be a major consequence  on American energy. I commend to my colleagues and those who are  following this debate, in today's New York Times, an article by Thomas  Friedman. He talks about the impact on energy from…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…energy grant dollars that would be out there  trying to create more electricity, more energy here in the United  States. These lawless terminations hamstring American competitors,  drive up energy costs, and hurt domestic manufacturing.\n\nBut this is nothing new for this chaos administration, which has  already prevented hundreds of thousands of clean…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…to them was: Give me your money. Get me  elected. I will let your companies run the show.\n\nI will give you this: Donald Trump kept his promise to Big Oil. He  has gutted American energy production, ceded ground to China on the  clean energy arms race, and rigged the system. There is no  technological neutrality, Senator Kaine. It is all about fossil fuels,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, when it comes to American energy, the  emergency siren is blaring. After 4 years of reckless regulations and  restrictions by the Democrat administration, energy prices have jumped  31 percent. Families…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…eliminates hundreds of billions of dollars in green new scam tax  credits. It reverses electric vehicle mandates that let radical climate  activists set the standards in American energy.\n\nIt ends Biden's war on American energy.\n\nIt streamlines onerous permitting processes so America can get  building again.\n\nIt refills the Strategic Petroleum Reserve…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…bureaucracy. No one produces coal cleaner or  more responsibly than the United States. Nobody understands this better  than President Trump, who is reversing the war on American energy and  ushering in a new age of energy dominance. He is putting Montana over  Moscow and the Powder River Basin over the PRC.\n\nBy passing the CRA today, we are advancing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…the  demands of those 77 million Americans. Those demands include fixing our  border crisis once and for all. This resolution does that. Those  demands include unleashing American energy. This resolution does that.\n\nMr. Chair, I urge strong support for this resolution.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688081/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…weeks before the transition to the Trump  administration.\n\nLast Congress I was proud to introduce the Alaska's Right to Produce  Act which reversed many of these same anti-American energy policies of  the Biden administration and passed the House with bipartisan support.\n\nAlaska is blessed with a tremendous wealth of natural resources. In  fact, when Alaska…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…power for our  Nation, and we need it far into the future.\n\nAnd today, to that case, President Trump is going to sign an  Executive order making clear his commitment to American energy  independence. The President is moving very quickly in terms of boosting  the coal industry. It is part of his bold plan that the administration  has to restore American…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "John Thune", "party": "Republican", "sentence": "…programs that support law enforcement,  promotes public safety in communities across America, invests in  critical infrastructure projects, and it supports efforts to unleash  American energy to provide affordable energy supply to the American  people.\n\nThere is one more thing about this package that is significant. It  spends less money than a continuing resolution.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…global demand for fuels is still rising and is expected to  grow as much as 20 million barrels a day by 2050.\n\nThe world isn't slowing down, Mr. Speaker, and neither should  American energy.\n\nThe REFINER Act takes a serious look at that situation, directs the  National Petroleum Council to review our refining capacity, identify  where we are vulnerable, and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…leading the Budget Committee and leading our Conference to a resolution  passed out of the House that not only extended the tax cuts but secured  the border. It unleashes American energy. It funds our military. All  the priorities, all the mandates that the American people have given us  and have given the President in this past election, it makes good…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689909/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…2 years  to complete.\n\nThe other two branches of government are taking actions to inject  some regulatory common sense into the process. President Trump's  ``Unleashing American Energy'' executive order directs Federal agencies  to confine NEPA analysis to applicable law, and in May, the Supreme  Court ruled unanimously on narrowing the scope of NEPA.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693796/fix-broken-permitting-and-regulatory-laws"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…consistency,  partnership, and respect from their Federal Government.\n\nToday we can answer that call, and I urge my colleague to vote  ``yes,'' and support Alaska, support American energy security.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…economic prosperity.  In 2020, President Trump announced a draft RMP for the central Yukon  that, among other provisions, revoked Public Land Order 5150 and  unleashed American energy.\n\nFor more than a decade, the State of Alaska has worked on this RMP to  revoke Public Land Order 5150, which would unlock millions of acres of  land from restrictive,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, throughout his campaign,  President Trump promised to unleash American energy and to end the era  of overregulation.\n\nIn just 7 months, President Trump has already taken those historic  steps to boost domestic energy production, resulting in gas…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…administration's disastrous energy policies that put  our energy security and the security of our allies at serious risk.\n\nThe White House launched a whole-of-government assault on American  energy production: slow-rolling permits; killing infrastructure  projects, like pipelines; and, most importantly, pandering to radical  climate activists. Then they delivered…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…LNG project, which is projected to deliver 3.5  billion cubic feet of natural gas per day and create more than 10,000  jobs in Alaska.\n\nThese projects are essential to American energy security. They are  essential to Alaska's economic growth, and they are essential to  lowering costs for America's working families.\n\nThis resolution supports President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]