[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…yourself. In each of these  committees in which we sit, on which we sit, we are debating cuts that  will hurt this economy, that will hurt constituents, that will hurt  American businesses, that will hurt our standing in the world.\n\nThis is not a red or blue discussion. This is not even a Black Caucus  or other caucus discussion. This is about what is…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…tax--Japan and South Korea, 25 percent. I mean, again, the  rationale for why we are going after our allies and partners makes no  sense.\n\nThis is a tremendous tax increase on American businesses and  families. It is likely the largest peacetime tax increase in U.S.  history. This new Trump tariff tax will add at least another $3,000 to  the costs for an average…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…putting their security at risk, while  those staff were waiting for instructions to conduct the so-called  ``review.''\n\nThey would not have, prior to any review, forced American businesses  and nongovernmental organizations to lay off thousands of workers by  illegally withholding funds previously appropriated for USAID programs.\n\nUSAID supports programs…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, since the beginning of last year, President Trump has  declared a series of bogus emergencies as a pretext to pickpocket more  than $165 billion from American consumers and businesses of all sizes,  including small businesses, family-owned businesses, farmers, and  everyday citizens. In response, several small businesses sued the  President,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…they identify as their biggest  needs: workforce development, stability, and access to capital. That is  not what we are doing.\n\nIf we continue on this irrational path, American businesses will  suffer.\n\nMr. LATIMER. Mr. Speaker, the mistakes we are making in this  Congress, bill after bill after bill, will damage this Nation's  strength at a time when…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…China, it creates a major problem for companies that trade with China  and that get their materials or send their finished products to China.\n\nMany of them are small American businesses. We have seen and heard  from many of those over the past couple of days. I have been listening  to some who are toy manufacturers. They talk about what has happened…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…period when I worked in my  Dad's shop, in a good year, it would be seven employees, and in a bad  year, it would be four, plus my mom and my two brothers and me.\n\nSo many American businesses are just like this. They are one or two  employees. They are somebody who even has another gig, maybe as an  artist, and they are moonlighting in some area where they…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…absolutely supportive.\n\nThe fact is that Putin is bombing not only Ukraine--civilians in  their hospitals, homes, and education centers, schoolrooms--he is also  bombing American businesses. Of the 600 major corporations with  operations in Ukraine, almost half of them--300--have been damaged or  destroyed in some way by Putin's bombing, drones, missiles.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…given her family a livelihood for a decade and helped put two  children through college. She writes: ``I just don't understand why  Trump thinks putting tariffs will help American businesses. It is not.  It is going to decimate us. People like us will be hit the hardest.''\n\nHowever, then, Janice shows the great resolve of the American people,  the great…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…on the clothes we wear, the  cars we drive, every cup of coffee we have in the morning.\n\nThese rising costs are not just hurting consumers, actually; they are  hurting American businesses and our workforce too. We are already  seeing the impact. It is not a hypothetical.\n\nI call your attention to my home State, the great State of  California, home to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…not have their priorities in order. In fact, it seems to me their only  priority is securing giant tax breaks for their billionaire buddies at  the expense of American families and businesses. H.J. Res. 24 fits  right into the Republican agenda of raising costs on hardworking  Americans.\n\nNow, I would be remiss if I didn't point out the irony of this…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…fix. It is a dangerous retreat  from our role in the world. Foreign aid is just a sliver of our budget,  but it saves lives. It prevents wars, and it opens markets for American  businesses. It is a smart investment in our national security.\n\nAs we speak, Mr. Speaker, there are millions of dollars of food that  has been left rotting over in ports, leaving…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…back these historic  investments in our manufacturing sector, unstable and erratic tariff  policies, and mass elimination of trusted Federal programs and partners  put American businesses at a disadvantage.\n\nAll of these actions by the Trump administration are detrimental to  our ability to compete globally. I encourage my Republican colleagues  to stand…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…when housing is already in short supply--it  will make them more expensive and harder to find.\n\nThose are just a few examples.\n\nThere are countless other imports that American businesses and  families rely on that are going to be hit hard, and these tariffs do  nothing to bring down those costs. They do just the opposite.\n\nThese tariffs could add $1,200…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…The program has resulted in millions of American  households enjoying lower prices for cocoa, coffee, and other goods  that the United States cannot produce at home.\n\nAmerican businesses understand the value of supporting robust U.S.- Africa trade, which supports more than 450,000 jobs across the United  States.\n\nFor this reason, the U.S. Chamber of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…know, our country's ports serve an absolutely critical role  in our national supply chain, moving millions of tons of goods each  year, facilitating trade, which supports American businesses and  consumers across the country. Any disruption to these supply chains  results in increased costs for American families and shortages of  essential goods, just as…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…increases funding for counter-fentanyl and synthetic drug  programs to stop these deadly poisons from crossing our borders and  coming to the United States.\n\nIt puts American businesses first, prioritizing diplomatic engagement  to favorably resolve commercial disputes, disputes abroad, some of them  that have been going on for years, to promote American…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…Trump's  inauguration.\n\nThe Biden-Harris administration, as we all know, in many of these  agenda-driven regulations pushed out of Agencies, was a disaster for  American families, businesses, and industries across our Nation. Their  reckless regulatory agenda prioritized Green New Deal virtue signaling  over good fiscal stewardship and the interests…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Big Beautiful Bill Act. As I have  mentioned repeatedly, Medicaid is not cut for those who need it.\n\nWe are ensuring that American taxpayer dollars are going to help  American businesses. The American Entrepreneurs First Act does not  prevent people with temporary visas or other legal immigrant statuses  from holding jobs at American businesses or from…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…States should do is to join this  cooperation by investing in the Chinese military, and that includes not  just the Government of the United States but all Americans and American  businesses and investors.\n\nSo the President has been right to highlight this growing threat, and  I look forward to continuing to work with President Trump and Secretary  Bessent…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…interests. Prosperity in our hemisphere enhances security  right here at home.\n\nRenewing HOPE and HELP supports nearshoring and more resilient supply  chains, benefiting American workers and businesses, while reducing  reliance on distant and unreliable sources.\n\nI commend Dr. Murphy for his leadership on this issue. Through his  numerous trips to Haiti, he has…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…goods to Americans without a tariff, and the  people of America can sell their goods to our friends in Canada without  a tariff--zero tariffs. Let Canadian businesses and American businesses  compete. Competition makes all of us better. That is one of the shared  values that we have with our friends in Canada. Let American businesses  and Canadian businesses…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…whirlwind 100 days, to say the least, as his administration has taken  swift action to reverse many of the Biden-era policies that I believe  brought major challenges to American businesses and families.\n\nFrom bringing the southwest border crossings to their lowest in  history to ushering in critical private investments to our communities  and boosting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…and  higher employer/employee engagement. In a competitive labor market, the  ability to offer these benefits is vital to attracting and retaining  talent and ensuring American businesses remain competitive at home and  abroad.\n\nFor our economy, the stakes could not be higher. Labor force  participation, particularly among women, continues to be constrained…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…policies only go to  companies that can certify their supply chains are free from this  abuse.\n\nAmerican consumers should not be complicit in human rights  violations. American businesses should not profit from forced labor,  and our government, our tax dollars, must never enable oppression.\n\nMr. Speaker, I urge strong support, and I reserve the balance…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…I thank my friend from Texas for yielding.\n\nMr. Speaker, the legislation before us today addresses a key issue  created in the Biden-Harris administration that harms American  businesses and actually disincentivizes investment to reduce pollution.\n\nThis was originally created during the Clinton administration. It was  the ``once in, always in'' rule…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691590/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the American  people without regard to the impact that it will have on small  businesses.\n\nDrastically changing efficiency standards, without input from the  American public, hurts both businesses and consumers. This will cost  American businesses $8 billion to meet the new standards, and it will,  indeed, take over 90 years for businesses to recapture…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689125/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…emissions control technologies. They did that because  they took their responsibility seriously. They want to be good stewards  of our resources and of our air and water.\n\nAmerican businesses are dedicated to protecting the health, safety,  and vibrancy of their communities. What they need is regulatory  certainty, not a rule that locks them into compliance…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…workers, we must invest in the best curricula and teaching methods.  H.R. 730 will improve mathematical and statistical modeling education  in the United States, ensuring American businesses have qualified  workers with the necessary skills to drive innovation in STEM fields,  including artificial intelligence and advanced manufacturing. This is  good policy,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…here to support H.R. 3679, the Small  Business Artificial Intelligence Advancement Act, sponsored by my  colleagues, Representatives  Mike Collins and Haley Stevens.\n\nAmerican small businesses are the backbone of our economy, and it is  essential that they leverage cutting-edge innovations to keep the  United States at the forefront of the global economy.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}]