[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…voter integrity, barriers are put in people's way, poll taxes are put  in people's way, and the requirement to pay money to prove you have the  right to vote is imposed on American citizens.\n\nMr. Speaker, I am tired. I am tired of fighting the same fights as my  parents, my grandparents, and my great-grandparents, but I fight those  fights as a member of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…or eliminate food assistance for more than 22 million  families. This is America. This President gives 20 million bucks to  Argentina, but he can't find the money for American citizens.\n\nAnother is the administration's attacks on immigrant workers, which  is fueling a labor shortage, thereby hurting farmers in Illinois and  across the Nation, who are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…the SAVE Act becomes law, eligible Americans would have to provide  either a passport or a birth certificate to register to vote and cast  their ballots. About half of American citizens, roughly 150 million  people, don't own a passport.\n\nIf an eligible voter doesn't have the means to pay for a passport,  they would need a birth certificate that states…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690013/safeguard-american-voter-eligibility-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…while the problem is a fake, the bill would have real effect. It  would make the sacred act of voting exponentially more difficult for  all Americans. Over 20 million American citizens--1 in 10 voting-age  Americans--simply don't have the access to the documentation that this  bill would require to vote.\n\nVoting identification in some form ought to…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…reforms, in statute--not promises of  change, not Executive actions worth less than the paper they are  printed on.\n\nLook out on the streets of Minneapolis, where two American citizens  have been gunned down in as many weeks, where tear gas flies through  the air and doors fly off their hinges under the banner of this  administration. In those streets…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…authoritarian playbook. It is one that quite  literally the United States of America was founded on rejecting--the  idea that the British soldiers, when they occupied American cities,  abused American citizens to the point where Americans turned against  them.\n\nI am a former CIA officer, a former Pentagon official. I have worked  alongside the military my entire…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…get home to register  in person, it is an added burden. For rural communities, it is an added  burden. For people of color, it is an added burden. For the 21 million  American citizens who don't have ready access to these documents, it is  a burden.\n\nThe right to vote is sacred, and I will fight any effort to put more  barriers in citizens' way to exercise…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699947/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…ignores the fact that immigrant communities are a vital hub       of entrepreneurial activity in the United States. Immigrants       who may not yet be citizens employ American citizens and pay       taxes to the United States government; they too deserve       access to Small Business Administration resources. Small       Business Majority strongly…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…food stamps or public benefits. I pay       taxes on my earnings and contribute fully through all       required payroll deductions.\n\nMy work is centered on caring for American citizens who       need support with daily living activities. I help individuals       with tasks such as bathing, personal hygiene, dressing, meal       preparation, and mobility.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…in a bipartisan effort to renew the sense of Congress as the  people's House that we can work together. It is time, Mr. Speaker, for  Congress to act. America's people, American citizens, and our  constituents must come first.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…masks on their faces mistreating people. They were  dragging them out of cars, stomping on their heads, and arresting them.\n\nWe have seen oftentimes they have done that to American citizens, and  they did it in error.\n\nThey were also concerned about the immigrants who were taken out of  our community who do so much good in our community.\n\nI am writing a…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696772/take-ice-out-of-memphis"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…foreign gulag without presenting evidence to  a judge that they should be removed.\n\nTrump has done this to legal permanent residents and talked openly  about doing it to American citizens.\n\nWhile unleashing terror on our streets, Trump's brazenly corrupt  decision to accept a $400 million Boeing 747 jet from Qatar for his  personal use is a direct violation…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…intimidation.\n\nThis is government police, sanctioned at the highest levels of our  government, completely unbound, beating and attacking and detaining and  arresting and killing American citizens. This is what America looks  like with an authoritarian government, with no laws.\n\nBut here is what is happening not only in Minnesota but around the  country. Our constituents,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…bill. This 870-page monstrosity includes the largest cuts to healthcare  in American history. It takes healthcare coverage away from more than  15 million Americans, American citizens, including 10 million who would  lose their care due to the $1 trillion in cuts to Medicaid and the  Affordable Care Act and another $5 million because Republicans failed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…assaulted on  their streets, and kidnapped from their homes. Peaceful demonstrators  are being threatened and detained for exercising their First Amendment  rights. Two American citizens were killed on our streets by Department  of Homeland Security agents.\n\nThis is not the America that we learned about in civics class. This  is the behavior of a dictatorship.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699551/no-funding-for-dhs"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…right to access their  phone data at any time, which is absolutely untrue.\n\nMy message to those individuals who were involved in violating the  constitutional rights of American citizens is very simple. You are the  very type of tyrants that our Founders fought against and the reason as  to why they drafted the Bill of Rights. You will be exposed. You…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696923/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…demanding sympathy for illegal aliens who are violent  gang members, rapists, and murderers.\n\nMr. Speaker, each of us is elected to represent our constituents and  put American citizens first. The idea that someone could take the oath  and then storm through law enforcement simply boggles the mind.\n\nIf my colleagues want to talk about priorities, Mr.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691318/elected-officials-storm-ice-facility"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…now know to be  verifiably and completely true?\n\nWhy would we continue to shovel money to an organization that is  funding terrorism against our allies and against our American citizens?  Yet, that is precisely what my colleagues on the other side of the  aisle would wish us to continue to do.\n\nMr. Speaker, let's address the One Big Beautiful Bill Act…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…aisle,  the U.S. Congress has a constitutional role to oversee Washington,  D.C., law and intervene as necessary.\n\nD.C.'s noncitizen voting law is a dangerous policy. Only American  citizens should be permitted to vote in this country, especially right  here in the Nation's Capital city.\n\nI urge my colleagues to support this important legislation to  prohibit…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692313/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…allows for a mechanism to  achieve nationwide injunctions through a three-judge panel.\n\nMr. Speaker, we are also bringing to the floor a bill that will say  that only American citizens should vote in American elections. The  controversy--oh, my gosh--the bloodletting, that we might say in the  United States House of Representatives that only American…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…What can we tell the people who feel we are being unnecessarily  cruel? Every year in this country, about 850,000 people are  naturalized. They are sworn in to become American citizens. I like to  show up at these ceremonies. They have them in Milwaukee, Wisconsin. I  try to show up at one or two a year. It is kind of thrilling to watch  people from…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…simple  things will be true:\n\nNumber one, everyone who shows up to vote in a Federal election will  have to show their photo ID.\n\nNumber two, States will only register American citizens to vote in  Federal elections.\n\nNumber three, States will actually have to remove noncitizens from  the voter rolls.\n\nEvery American--Republican, Democrat, or unaffiliated--wants…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Mr. Speaker, I rise today in strong support of the  SAVE Act because American elections should only be decided by American  citizens. That is not controversial. It is common sense.\n\nThink about it. Democrats have no problem requiring ID to board a  plane, buy a six-pack, drive a car, or even adopt…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…flowing to radical  gender ideology programs around the world. That is not the role of the  Federal Government, and that is not an appropriate use of taxpayer  dollars of American citizens.\n\nTaxpayer dollars should not be used to fund woke projects overseas or  bloated government programs at home. They should be funding efforts  that protect our border,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Speaker, I rise today in strong support of  the Lower Health Care Premiums for All Americans Act, which is the  right prescription to lower healthcare costs and provide American  citizens with more affordable coverage.\n\nNearly 15 years ago, the Democrats unaffordable care act broke our  healthcare system. They broke our healthcare system. Since its  inception,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698370/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…One way that we will be able to help provide those resources to  States is by passing the SAVE Act. The SAVE Act will help protect our  elections and ensure that only American citizens are casting ballots in  American elections.\n\nThe bill will support State and local election officials by providing  them with data and tools to help verify the accuracy…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Representative  Beyer's district who are nearing retirement age today. It is why  organizations like the AARP, the Bipartisan Policy Center, and the  Association of Mature American Citizens have come out in support of  this bill, which received overwhelming bipartisan support in the Ways  and Means Committee.\n\nMr. SMITH of Missouri.\n\nMr. Speaker, no American…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…is an organization that  serves immigrants who are here illegally. Why should the American  taxpayer foot the bill to support illegals in sanctuary cities when so  many American citizens are struggling themselves?\n\nWe will never get inflation under control and interest rates down  until we balance the Federal budget. I ask my colleagues to support my…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699432/consolidated-appropriations-act-2026"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…DC, we should be  doing everything we can to make certain that our air traffic system and  the necessary components are in place to make sure that traveling  American citizens and the citizens of the world who use our airline  system have a safe and secure flight when they board a plane in the  United States. The silliness of where we are today is impeding…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…bipartisan World War II Women's Memorial Location Act. World War II  required great sacrifices of every American citizen. To the great  credit and pride of our Nation, American citizens rose to the challenge  with grit and determination. With millions of men overseas, American  women--popularly known as ``Rosies'' in tribute to Rosie the Riveter-- stepped…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697728/world-war-ii-womens-memorial-location-act"}]