[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Friday, around lunchtime, enough hard-line conservative members  on the Budget Committee withheld their votes and voted ``no,'' not  because they objected to 14 million Americans losing their healthcare,  not because they objected to millions more losing their food  assistance, but because they looked at those numbers and said: Well,  that is a good start.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…in this country, addiction treatment centers. So you are  ultimately talking about hundreds, if not thousands, of hospitals and  health centers closing and millions of Americans losing their  healthcare insurance. And for what? And for what? To be able to hoard a  bunch of money so that the richest Americans can buy a third vacation  home? So that millionaires…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to be hit with  huge premiums for the upcoming year. The nonpartisan Congressional  Budget Office has estimated that these premium increases will lead to  4.2 million Americans losing their health insurance.\n\nTrump and congressional Republicans had no problem giving their  billionaire friends tax breaks in their big, ugly bill, but they refuse  to extend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695820/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…We could have done more. We  obviously had differences of opinion about how much to do, but we  worked in a bipartisan fashion.\n\nSo now, as we face this crisis where Americans are losing their  health insurance, people have retreated to partisan corners again on  things like choice and things like cutting people off of health  insurance, instead of working…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Lehigh Valley. However, with no justification, Musk and DOGE  laid off 85 percent of AmeriCorps' staff and unconstitutionally froze  more than $400 million.\n\nMillions of Americans are losing access to services they rely upon:  veterans receiving mental health treatment, children enrolled in public  schools, homebound seniors in need of assistance and companionship.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691309/cutting-americorps-deprives-americans"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…megabill.''\n\nThis is a sector that has many trade associations, the biggest one,  the American Hospital Association, came right out and said that it will  lead to millions of Americans losing access to healthcare and leaving  many of our hospitals struggling to maintain services and stay open for  their communities.\n\nThe Catholic Health Association said, Congress…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Act in  this legislation, millions of Americans will lose their healthcare. The  assault on healthcare in this one big, ugly bill will result in more  than 17 million Americans losing healthcare in the United States of  America.\n\nShame on the people who have decided to launch that kind of all-out  assault on the health and well-being of everyday Americans.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…sworn into office, each  affirms a commitment to faithfully execute the duties of public office  and defend the Constitution of the United States. But more and more  Americans are losing faith that the actions of our public officials are  principally guided by our Constitution and our laws. And some of my  colleagues even doubt whether truth exists and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that is out of control; to have concern for the American  citizens who have been killed simply exercising their First Amendment  rights; to care about the 4 million Americans who are losing their  insurance, as we speak, because this administration has chosen to put  money into a lawless immigration enforcement operation instead of  protecting people's…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…percentage of Federal election spending by  the top 100 individual donors has jumped from 2 percent to almost 15  percent. That is eight times as much.\n\nThis has resulted in Americans losing faith in the integrity of our  elections and the integrity of our democracy because our democracy is  predicated on the idea that every voice matters, regardless of how…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…pressure in his showers.\n\nRepublicans in Congress, instead of focusing on lowering healthcare  costs, are debating the definition of showerheads. Really? Millions of  Americans are losing their healthcare coverage after Republicans  allowed the Affordable Care Act tax credits to expire.\n\nThe nightmare of families having to choose between taking their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…bill, Republicans cut more than $1 trillion from our  healthcare system, jeopardizing millions of Americans. Reclaiming this  $75 billion from ICE would prevent 700,000 Americans from losing their  health insurance. That is 700,000 Americans protected. That is 700,000  Americans being spared from choosing between seeing a doctor or paying  rent or paying…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Medicaid. That is upside down, and what we are saying is  to the least of these, you are on your own. They deserve better.\n\nWe have 4 days to try to prevent millions of Americans from losing  access to health insurance. Are we going to do it? Time will tell. I  still have hope, but we will see.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Committee will  consider a bill that contains the largest cuts to Medicaid in our  country's history. This outright assault on healthcare will result in  13.7 million Americans losing their health coverage, including many of  the 370,000 Medicaid beneficiaries in my district.\n\nThis includes people like Yvette from Van Nuys who said that she  wants to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691409/gop-tax-scam-hurts-women-and-families"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…credits for 3 years.  This extension will cut premium spikes by 80 percent, on average. It  will wipe out increases for lower income families. It will save over 5  million Americans from losing their insurance.\n\nThis is the solution. We have it in our hands.\n\nWhile this is a straightforward fix for the short term, we know that  our entire healthcare system…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…committees took a sledgehammer to lifesaving programs like Medicaid.  Mr. Speaker, let me tell you what is happening. Democrats fought all  night to save 8.6 million Americans from losing access to Medicaid.  That doesn't include the 4.2 million Americans who will start paying a  whole lot more for their healthcare premiums so big corporations can  get…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]