[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…care that Crater  Lake demands.\n\nExperienced professionals are being driven out under this  administration's corrosive leadership. Our public lands deserve better,  and Americans deserve better.\n\nI will not stand by while Trump attacks our public lands. We must  protect our national parks and the public servants who protect them.\n\nHands off Crater Lake,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691957/hands-off-crater-lake-national-park"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…concession fees for a rental car, or  service charges on just about everything.\n\nI have had it with these junk fees, and I have heard from so many  others that they have too.\n\nAmericans deserve transparency, not bait-and-switch pricing models.\n\nThat is why I introduced the Junk Fee Prevention Act. It is past time  that we get corporate greed under control and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697629/junk-fees"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…administration  and this majority's attack on these lifelines as ``waste.''\n\nThe resources that working families need are not waste. The tools for  economic survival are not waste. Americans deserve better.\n\nMr. Speaker, I oppose this bill, and I urge my colleagues to oppose  it as well.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699004/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…irreplaceable, social contract. As stewards of  this hard-earned benefit, we must protect taxpayers' dollars, but empty  promises to address supposed fraud are not the answer.\n\nAmericans deserve a restored watchdog and efficient program at Social  Security that ensures swift and easy access to their payments.\n\nMr. DOGGETT. Madam Speaker, I yield myself another…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…everything we can to protect you, your family, and your kids in  the right for safety, justice, and your right to pursue the American  Dream.\n\nMr. Speaker, Texans and all Americans deserve better.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…D.C., overriding the choices of local residents and their elected  officials, while ignoring the real issues the rest of the country  faces.\n\nNearly 700,000 taxpaying Americans in D.C. deserve the same right to  self-governance as every other community including control over  criminal laws.\n\nDemocrats on the Committee on Oversight and Government Reform…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…tragedy. Please stand with       us, help us uncover the truth, and give us the respect and       justice that we deserve. We deserve to put this chapter       behind us. Americans deserve to move forward knowing that       they have rights in this country that will be enforced even       in the face of power; in fact, especially in the face of       power.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…and  their families should not lose important consumer protections simply  because they retire, separate from honorable service, or lose their  loved ones. Frankly, all Americans deserve to be shielded from these  kinds of predatory loans, and that is just what our bill does.\n\nHundreds of millions of American consumers could benefit from a 36- percent…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…paycheck.\n\nWe didn't win by going on bended knees and begging big corporations  for better treatment. We did it by unifying working people around some  central ideas that Americans deserve good pay for a full day's work and  that taxpayer dollars are meant for the common good, not for corporate  welfare.\n\nThose ideas brought workers together to win historic…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689085/economic-populism"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…despite their promises, have done nothing to  lower energy costs. In fact, costs keep going up, up, and up, and the  GOP policies are making it worse. I have to say that Americans deserve  a whole lot better.\n\nWe understand that the impact of the big, ugly bill passed a couple  months ago is going to raise the cost of living on hardworking families  across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Speaker, behind every grant line item is a human being who has  overcome great adversity to achieve stability. Trump's cuts will undo  years of hard-won progress. These Americans deserve better from our  government.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697137/addressing-the-housing-crisis"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…they have added this  corrupt, get-rich-quick scheme to give hundreds of thousands of  taxpayer dollars to Trump-aligned Senators. That is outrageous.  Oregonians and Americans deserve better.\n\nMy colleagues should listen to their constituents, vote ``no,'' and  come back to the table and join us in the work to make healthcare  affordable and accessible…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…themselves and sue the federal  government for a $1 million taxpayer funded giveaway would legitimize  their blatant corruption in the so-called clean CR.\n\nMillions of Americans deserve a permanent solution to the healthcare  affordability crisis, much more than the billionaire contributors to  campaigns who just received millions of dollars in tax breaks…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696678/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…preservation laws, attempting to erase and rewrite history in our  public lands, and working to turn our public lands into prisons and  detention centers.\n\nAmericans deserve better. They deserve public lands that are open,  well cared for, and honest about our history, not just a few symbolic  gestures and a free entrance day every now and then.\n\nIt…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…afford everything else.\n\nIt is unconscionable that Republicans are ripping away coverage to  fund their tax breaks for billionaires, the wealthy, and the well- connected. Americans deserve so much better.\n\nMr. Speaker, defeat this Republican bill. Bring the 3-year bipartisan  extension to the floor now.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698388/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…believe in liberty, you vote  ``yes'' on H.R. 2159. If you believe the government should be  accountable to the people, you vote ``yes'' on H.R. 2159. If you  believe that Americans deserve to know the laws that can put them  behind bars, you vote ``yes'' on H.R. 2159. It is bipartisan, common  sense, and long overdue.\n\nMr. Speaker, I strongly urge my colleagues…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…work on this important bill.\n\nWe are also seeking to reverse harmful Biden-era energy regulations  on essential home appliances, including refrigerators and freezers.  Americans deserve the ability to purchase the appliances that best suit  their families' functional and financial needs.\n\nI am grateful to Congresswoman Stephanie Bice and Congressman…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…proper oversight from the start. This simple clarification strengthens  the taxpayer protections and promotes a consistent and reliable penalty  process.\n\nMr. Speaker, Americans deserve a tax system that is fair,  predictable, and transparent. This bill moves us closer to that goal.\n\nI thank Chairman Smith for his leadership on the Committee on Ways…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…crisis lies in the supply side. Put simply, we do not have enough homes  to meet the demand.\n\nSo what should we do?\n\nThrowing money at a problem rarely fixes it. What Americans deserve  are concrete, commonsense regulatory reforms that make it easier to  build more homes. The Housing for the 21st Century Act achieves this by  removing unnecessary regulatory…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…Democrats will vote to oppose today. That is a  fact. We did not write this bill for the Democratic Party, the elites,  or the media. This bill is for hardworking Americans, and they deserve  it.\n\nI am going to just say this as plainly as I can. This is the simple  truth. If you are for a secure border, safer communities, and a strong  military, this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…costs are making that coverage more expensive every  year. Families are paying more, and small businesses are struggling to  keep up with the mandates and the red tape.\n\nAmericans deserve affordable, high-quality coverage that puts  decisions back where they belong with workers, families, and employers,  not the Federal Government.\n\nBottom line, the Lower…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…rules are based on incomplete data, outdated science,  or information that hasn't been properly reviewed for accuracy or  transparency. That is simply bad governing.\n\nAmericans deserve to know that when Washington bureaucrats act, they  are using reliable, high-quality information, not assumptions, not  political agendas, and not flawed data.\n\nMy bill…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700101/information-quality-assurance-act-of-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…authorizations and have any ownership by foreign  adversarial governments, including our adversaries like China, Russia,  North Korea, and Iran.\n\nThis transparency is critical. Americans deserve to know which  companies inside our tech and telecommunications markets are linked to  hostile regimes. Shining a light on this malign influence is the first  step toward…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…election administration, and make our elections secure.\n\nThis legislation is just one step that we can take to ensure  President Trump's executive order could not be undone. Americans  deserve to have confidence in our elections. We must pass the SAVE Act  to prevent noncitizen voting and secure our elections.\n\nMr. STEIL.  Lee), the chair of the Subcommittee…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…The fact is that I completely agree with the objective of my  colleagues on the floor today that we need to get transparency in the  prescription drug pricing system.\n\nAmericans deserve a transparent, affordable, and accessible  prescription drug market. Far too often, the current system fails to  meet those needs. It is not only, though, because we…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694206/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…online turns  out to be far more expensive once these deceptive charges are added.  Additionally, the way these prices are advertised are fragmented and  not uniform.\n\nAmericans deserve price transparency so that they can appropriately  budget for their travels.\n\nThe Hotel Fees Transparency Act requires providers of short-term  lodging to disclose upfront…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690198/hotel-fees-transparency-act-of-2025"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Let's be clear: This does not force anyone to abandon their current  coverage. If you like the crappy ACA ObamaCare plan that you currently  have, you can keep it, but Americans deserve another option, one that  treats them like an adult, not line items in a Federal spreadsheet.\n\nMr. Speaker, the American people are tired of being told that  confusion…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Biden EPA that allows States to ban the sale of gas- powered vehicles. This EPA rule has legitimate constitutional questions  and would increase costs for Americans and manufacturers.\n\nAmericans deserve to choose the car of their choice. In fact, Biden  used liberal California to force a one-size-fits-all solution  nationwide. One State should never dictate…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…that every American can enjoy the access to high-speed  internet. It will save us billions so that we can not only pay down the  debt but also afford the tax cuts which Americans deserve.\n\nIn conclusion, we are in the golden age of American spaceflight. We  are witnessing a true renaissance of space exploration where the future  is literally being built…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "Mr. CRAWFORD. Mr. Speaker, it is particularly important with this  Special Order to clear the air. Americans deserve no less than to  understand the truth of what just transpired in Venezuela.\n\nNicolas Maduro has been removed as the reigning despot,  narcoterrorist, and illegitimate…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}]