[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Aluminum Caucus, Mr. Speaker. It is a  bipartisan caucus. I have these relationships in the aluminum sector,  and they are telling me that they have these smelters that American  companies have in Canada that are making the aluminum.\n\nI don't know if you have ever seen aluminum get made, but it is  really like baking a cake, and steel and all of that.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…must be asked: Why does the administration expend  billions for capturing dirty, defunct crude refineries in a foreign  country, rather than investing in the future of American companies  right here at home?\n\nThe American people deserve an answer. This is not a small amount of  money. They deserve transparency by the Trump administration.\n\nI lived through…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…need.  We need more investment, not to delay or postpone investment because of  tariff uncertainty. And, certainly, they are going to raise prices,  because, again, when American companies have to import, it is American  companies that pay the tariffs. It is not other countries, as the  President  would like you to believe, and those costs get passed on…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…am  going to prioritize you. I am just not going to prioritize you in March  of 2026 before my name is on the ballot, I am going to prioritize you  right now because American companies, American students, American  innovators, American researchers, American veterans, American farmers,  American students deserve all of us fighting for them and not for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…increase the amount of  investment capital available to our country's small businesses for whom  even small investments can mean so much.\n\nAlready SBICs have helped marquee American companies like Costco,  Apple, and Intel get off the ground, back when they were just starting  out. SBICs fill a gap in the investment ecosystem and level the playing  field for…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…In fact, Goldman, the nonprofit Peterson Institute, and investment  bank Morgan Stanley have all reported that most of the President's  tariffs are being absorbed by American companies, small businesses, and  consumers.\n\nIndeed, our Nation's two largest auto manufacturers, General Motors  and Ford, have each reported billions of dollars in new tariff-related…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…been the leaders.\n\nBy weakening these rules, we open our markets to companies in  countries that manufacture low-efficiency products, like from China, at  the expense of American companies and American families. It is not  right.\n\nI heard Mr. Pallone say that he had a townhall. A lot of the  Democrats are having townhalls. I had a townhall back in the Tampa…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…tariff is a tax on the American people--plain  and simple. Trump's tariffs equate to the biggest tax hike on Americans  in decades, because the way tariffs work is this: American companies  will have to pay more to import goods, and in turn, the American people  will have to pay more to buy those products.\n\nDonald Trump knows this. It is not that he doesn't…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…that regard. The U.S. can       help a lot.''\n\n``Another sphere is our oil industry faces a lot of       problems because of a lack of experts,'' he added. ``The       American companies started the oil industry in the 50s, now       we have a lot of fields not explored yet. I think United       States companies have a big interest there. And it's not…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to  call on the President to enforce the law.\n\nTrump's stall tactics are allowing China to continue to collect  massive amounts of information on Americans. There are American  companies that want to buy TikTok. It is long past time for Trump to  get this done.\n\nThere is also still work to be done because network security does not  end at the water's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…fuel their data centers and AI tools? Why are  they putting the profits of Chinese technology companies over the well- being of American families and the success of our American companies?\n\nI have said this before, but it bears repeating. Republicans on the  Committee on Energy and Commerce have compared winning the AI race with  China to the importance…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…of  strengthening those relationships with our neighbors, Trump's tariffs  are making everything more expensive for us.\n\nWhat do we get in return? Absolutely nothing. American companies  didn't suddenly stop buying from Canada or Mexico. They just have to  pay more to do it. Meanwhile, those countries have hit back with their  own tariffs, hurting Americans…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689098/understanding-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…look over a 10-year period of time. Our Nation should  stand for free trade among free people, and that is what our trade with  Canada does. Imposing tariffs on North American companies already  struggling to compete with penny-wage labor abroad will drive our  economy backwards off a cliff. Why would anybody want to do that? It  makes no sense.\n\nTariffs…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…slashing our Federal workforce. If Republicans cared  about government efficiency, then they wouldn't be rescinding rules  that provide clear and consistent guidance for American companies. They  wouldn't look the other way when the DOE workforce is slashed without  evaluating the impacts.\n\nI don't think Republicans care about reducing costs for American…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that American manufacturers  support these water heater standards. Three out of four major water  heater manufacturers are against today's resolution, and all three are  American companies.\n\nThe manufacturers that are in favor of this resolution and against  the standards are foreign manufacturers.\n\nIf this resolution is successful, Republicans are giving…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…human exploration and the settlement of Mars, an  achievement that will truly define this century.\n\nThese are not science fiction novels. These are active projects by  American companies, American scientists, and American engineers  bringing in the golden age of American spaceflight.\n\nIn conclusion, Mr. Speaker, the urgency of action is now. America's…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…historic trade negotiations recognize that this  cannot continue, and nations across the globe need to reduce their  tariff barriers and their nontariff trade barriers to American  companies and American citizens.\n\nThe President's negotiations are bearing fruit. President Trump  already announced new trade deals with major trading partners,  including the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696441/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…administration must develop  additional strategies to work with Haiti to create a more sustainable  and self-reliant economy.\n\nA more stable Haitian economy supports American companies that seek  to do business there, creating a supply chain for those products as we  diversify away from China.\n\nOnshoring and nearshoring of critical industries cannot…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698849/haiti-economic-lift-program-extension-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…company recruit  the best and the brightest to their workforce.\n\nThe Empowering Employer Child and Elder Care Solutions Act lowers  costs, cuts red tape, and better serves American companies by making  profamily benefits achievable. Passing this legislation contributes to  our goal of returning affordability to the American people and the U.S.  workforce.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…from the United States, protecting  American taxpayers while keeping our alliances credible. It also  reinforces accountability in our own hemisphere by standing up for  American companies and the rule of law.\n\nJust as important, this bill cuts off funding pathways that could  benefit the Taliban and other terrorist organizations, and it continues  to shine…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…natural gas prices for Americans.\n\nThe Biden-Harris administration's action not only jeopardized our  European allies but it threatened the faith and credibility of American  companies' contracts. It emboldened Russia and other nefarious actors  and created uncertainty for domestic producers of natural gas.\n\nH.R. 1949, the Unlocking Our Domestic LNG…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…being used against us in every facet of  our lives?\n\nLoopholes currently available in U.S. export control allow the CCP  and others to gain a competitive advantage over American companies,  especially when it comes to cloud services for technologies that would  otherwise not be accessible in physical form. In other words, and in  plain English, you can't…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Less Regulation, More Freedom\n\nMr. MANN. Mr. Speaker, every year, small businesses spend nearly  $15,000 per employee to comply with Federal laws. American companies  spend over $3 trillion a year on compliance.\n\nI am sure this is not a shock to anyone in this Chamber, but we know  that some of that cost gets passed on to consumers.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…$1  million per acre every year.\n\nThe whole rule and the law was stacked against doing anything, and  that is exactly what has happened. We want to open this up where  American companies can invest in American fiber cables so that we can  communicate across the ocean and we can get away from all of this  consolidation in one area where it is easy to target.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Modernizing Our Workforce Programs\n\nMr. JOYCE of Pennsylvania. Madam Speaker, as President Trump bolsters  our domestic manufacturing, returning production to the U.S., American  companies need the workforce to support these industries.\n\nLast week, President Trump signed an executive order to modernize our  workforce programs to better prepare the American…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…by this thug and his cronies.\n\nGeorgian Dream has moved swiftly to criminalize the association with  America since the election of October 2026. It rejected bids by  American companies for construction of their strategic deep-sea port to  the Chinese Communist Party. Every major building contract, over $100  million in U.S. dollars, has been awarded…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…is where this piece of  legislation called outbound investment transparency comes in.\n\nOne of the ways that China has built its mammoth manufacturing  capacity is when American companies go into China and massively invest  in manufacturing capabilities there. There is plenty that has been  written on this topic. Apple, Tesla, and other major companies…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}]