[{"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…motion with an important amendment to this bill.\n\nMy amendment would extend the enhanced premium tax credits for 3  years to do what this Republican bill fails to do and help American  families afford their healthcare.\n\nMs. UNDERWOOD. Mr. Speaker, I hope my colleagues will join me in  voting for the motion to recommit.\n\nMs. UNDERWOOD. Mr. Speaker, I have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698394/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…search of a better life. This includes my mother, who  immigrated to the San Fernando Valley in the 1960s and worked multiple  jobs so that my sister and I could live out the American Dream.\n\nStories like mine are what make California great, and it is what has  made California special for the past 175 years. Generations of  immigrants, workers, dreamers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695175/happy-birthday-to-california"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…everyday  Americans, making them go without.\n\nAlso, billionaire donors and big corporations get tax breaks to make  them more wealthy.\n\nLet's get back to doing the work for the American people who need us  to do this work the most.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688092/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…call to  engage with one another, identify our commonalities, eschew clinging to  our differences, and help--how we can, where we can--feels vital to the  moral health of the American people and the long-term viability of our  global environment.\n\nOn behalf of the Eastern Orthodox Christian community of Southwestern  Connecticut, I would like to extend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695502/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…crisis. They should stop their political games and put  the bipartisan Jeffries bills on the floor today.\n\nMr. Speaker, we deserve better. My constituents deserve better. Every  American deserves better.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698384/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…decisions  are not rules subject to review, but House Republicans are ignoring the  law to try to set a precedent for drastically expanding what other  protections for the American people they can undermine with a CRA.\n\nAs if all this wasn't enough, Republicans wrapped up the week with an  attack on an endangered species of smelt in the San Francisco…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…humble beginnings. He came to this country  penniless and unable to speak English but with a dream. With hard work,  he started a number of businesses, and he achieved the American Dream.\n\nNow, Charlie is known throughout Orange County for supporting  education and the arts. Some of his most important contributions have  helped business and economics…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689745/recognizing-jessie-echaury"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…community has brokered. Wineries in my district built their  relationships across the border over decades, and in one day, President  Trump destroyed them.\n\nThese tariffs hurt American farmers and American consumers alike. We  must act and protect the American people from the volatile whims of the  petulant President.\n\nMr. Speaker, I urge an ``aye'' vote.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699966/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…votes, unfulfilled promises, and lie  after lie after lie.\n\nIn just over 3 months, ``King'' Donald's reign has rained down chaos  and corruption and cuts and crisis on the American people. And he is  counting on you not to pay attention. He is hoping you don't notice  that, every day, costs are rising, retirement savings are sinking, and  families are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…scale back services.  For what? To pay for tax breaks for the wealthiest people in this  country.\n\nAside from hospitals, there is also going to be a major consequence  on American energy. I commend to my colleagues and those who are  following this debate, in today's New York Times, an article by Thomas  Friedman. He talks about the impact on energy…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Union; disruption of programs; threats to  universities, law firms, State and local governments, the Federal  workforce, and the media; and threats to elected officials.\n\nThe American people gave the MAGA movement a narrow majority 6 months  ago, but now they are having second thoughts. There is no golden age  ahead, just a recession. Contrast this with…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to call attention to a crisis  in the American West and across the country. Extreme wildfires now  ravage my home State of Oregon every summer, and the threat is growing.  I am here today to speak out against cuts to programs…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to recognize an outstanding business and community  leader from Rochester, New York, Orlando Ortiz.\n\nServing as President, Orlando Ortiz has played a pivotal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…economy, and even for Republicans themselves. It rips  healthcare from 16 million people. It is the biggest cuts ever to food  funding. It raises energy prices and surrenders American energy  leadership to China. And it rewards the ultrarich.\n\nRepublicans should abandon these destructive policies. But, of  course, they aren't doing that. Instead of fixing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…has refused to comply  with the law.\n\nIt is time to honor those heroic officers. It is unconscionable. It  is unpatriotic. It is unfathomable. It is unacceptable. It is un- American. You need to honor those officers and treat them with the  dignity and respect that they deserve.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691256/parliamentary-inquiries"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…would provide these  improvements to other benefit programs in the Veterans Benefits  Administration.\n\nThis bill also includes Representative Edwards' bill, the Justice for  American Veterans and Survivors Act of 2025. Importantly, this  provision would require the VA to publish an annual report for the next  5 years on the cause and manner of death among…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, I rise today in support of H.R. 1549, the China  Financial Threat Mitigation Act.\n\nThe Chinese Communist Party's track record of interference and  aggression toward the American financial system is a serious and  growing threat. The CCP has a well-documented history of abusing  international financial norms, jeopardizing both our national and  economic…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…judge in Illinois court  history and an accredited leader within the Illinois law community. He  is a member of the Illinois State and McLean County Bar Associations,  the American Judicature Society, the Illinois Judges' Association, the  Appellate Lawyers Association, and is a fellow of the Illinois Bar  Foundation.\n\nOutside of the courtroom, Judge…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694150/congratulating-judge-jim-knecht-on-50-years-of-service"}, {"senator": "John Rose", "party": "Republican", "sentence": "…of Attorneys General  signed a letter supporting this bill.\n\nAdditionally, many organizations, some already mentioned, have come  out in support of this bill, including the American Bankers  Association, the Tennessee Bankers Association, America's Credit  Unions, the Broker Action Coalition, the Independent Community Bankers  of America, the Mortgage…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…children, 3 days without any food,  what action you might take if you can't properly feed them. We have  seen those sorts of revolutions in other countries.\n\nSo let's feed the American people with the bipartisan cooperation  they deserve and the bipartisan cooperation that has always been a part  of the Food Stamp Program because, over decades ago, two famous…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696506/government-funding"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…foreign adversaries like the Chinese Communist Party.\n\nI urge my colleagues to support this critical legislation, and I look  forward to continuing to work together to defend American sovereignty  and security.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…things, one of the things that is so  refreshing, that so many people tell me about back at home, is that the  President of the United States is finally talking directly to the  American public. He actually talks to the press. He takes questions. He  illuminates what he is working on and why he is pushing different  policies.\n\nThis is what is called open government.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthcare. It was the health of the population.\n\nWhat happens when your brothers and sisters have diabetes, when they  are crashing repeatedly? It turns out if 33 percent of all American  healthcare is just diabetes, if 47 percent of all American healthcare  is obesity, why wouldn't we take those on?\n\nYeah, it means doing some very difficult things. It means…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…I thank the gentlewoman for yielding  time.\n\nMr. Speaker, the Affordable HOMES Act is commonsense legislation that  cuts red tape and lowers housing costs for hardworking American  families.\n\nWe all recognize between 2021 and 2024 that interest rates went from  3 percent to 7 percent. In my home community, that meant we spent  $1,200 more a month for…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698636/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…confirmation as the next Under Secretary of Commerce for  International Trade. This is an outstanding appointment not just for  the Department of Commerce, but also for the American people.\n\nMr. Kimmitt's life has been defined by service, both of his own and  that of his family. His grandfather Stan Kimmitt, a decorated war  veteran who served in World…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "John Thune", "party": "Republican", "sentence": "…business to see savings from these  more expensive appliances.\n\nAnother rule sought to take gas water heaters off the market, raising  costs for homeowners and imperiling American manufacturing jobs.\n\nThen there were the Biden administration's proposed reporting and  certification requirements for everything from light bulbs and  dishwashers to dehumidifiers…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…championing equal rights and women's rights, and for being a       forceful speaker;\n\n[Whereas, during the Civil War, Douglass was a recruiter       for the first African-American army regiment;\n\n[Whereas Douglass met twice with President Lincoln, first       about the pay and treatment of Black soldiers and then to       discuss the President's desire…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…only as strong as a system that protects it. When one  single illegal vote is cast, a legal vote is diluted. When a foreign  national influences an election, the voice of an American citizen is  silenced. This isn't a hypothetical concern. It is a matter of  protecting the value of everyone's choice.\n\nThe SAVE America Act is guided by one simple principle:…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699946/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Member of this  august body, and as the son of a university professor who cares deeply  about higher education and a former State Department officer who cares  deeply about American national security, I am excited and proud to  sponsor this bill.\n\nIndeed, there are many wonderful things that happen on American  university campuses, but there are also…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…questions about  Social Security and its sustainability going forward. I can tell my  colleagues that Republicans want to ensure that the promises that have  been made to the American people will be kept.\n\nWe need to have that conversation that Ms. Moore talked about. We  need to make structural changes to the program. We have a math problem.  In 8 years,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697234/claiming-age-clarity-act"}]