[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…households  include a child, a senior, a disabled person, or a veteran. Let that  sink in.\n\nSNAP isn't a luxury. It is essential. It provides $6 a day in food  assistance to hungry Americans, just $6. It is a small amount, but it  is enough to lift up millions out of poverty and create a foundation of  health and well-being. Just $6 can create a pathway to opportunity.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…you that we are legislating. I can tell  you that we are standing with the lawyers who are litigating. We are  fighting to protect and pursue opportunities that give Black Americans  the same advantages that White Americans have enjoyed since our  Nation's founding.\n\nOur history is made stronger and more vibrant. Just when Black  Americans think that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…address one of the most  serious issues of our time, the risk of conflict with nuclear weapons.  It is a threat that challenges our conscience. It is a threat not just  for Americans but for all humanity. It is a threat not just to humans,  but to all species of life on our planet.\n\nWe raise this issue in the context of a series of important  anniversaries.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Minnesotans  if Congress does not act.\n\nIf the President and congressional Republicans do not extend the  healthcare tax credits, the health insurance premiums of millions of  Americans will double next year. This premium increase will be felt by  many, including families, small businesses and their employees, and  people living in rural communities. I am…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696995/hr-5371"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…massive layoffs of employees, contrary to  congressionally passed appropriations bills, massive slashing of  Federal spending programs, including those relied upon by everyday  Americans in contravention of congressionally appropriated spending  bills, and the waging of a tariff war against the entire planet.\n\nAnd as my colleagues have said, it is a tariff…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Mr. CONAWAY. Mr. Speaker, I rise today in strong opposition to the  SAVE Act. While everyday Americans are struggling from the fallout of  Trump's disastrous tariff policies, Republicans are pushing through a  bill that strips Americans' constitutional right to vote, a vote…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690014/safeguard-american-voter-eligibility-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…except  Canadian energy, which is taxed at 10 percent. Trump's tariffs will  make everything from gas to heating, to groceries, to lumber and more,  more expensive for everyday Americans.\n\nI think it bears repeating that tariffs are paid by consumers. They  are paid by Americans, not by other countries. And what the President  is doing amounts to a new tax…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…commitment to upholding and fostering that diversity, to protecting the  culture of communities that were here before us, and to ensuring the  stories of our country and the Americans who make it so great are told  in full.", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…to challenge in court if we  are detained and locked up. Without it, it means that any of us can be  locked up with no cause. It can only be suspended by Congress, by us.\n\nAmericans, please hear me: Who are we? Who are we if we let Trump  abandon our core principle that no one in this country will be  imprisoned unlawfully? This is about liberty, and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691378/suspending-the-writ-of-habeas-corpus"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Mrs. HAYES. Mr. Speaker, I rise today against the Republican  reconciliation bill, which would put 42 million Americans at risk of  losing their SNAP benefits.\n\nThese policies are untested, dangerous, and arbitrary. Congress did  not engage in a thoughtful process to make these changes to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693232/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…documents.\n\nThe IRS should not treat taxpayers who choose to file electronically  differently than those who file by mail. This bill would ensure the  same standard for all Americans regardless of how they file.\n\nMr. DAVIS of Illinois. Mr. Speaker, I have no further requests for  time so I am prepared to close.\n\nMr. Speaker, H.R. 1152 is a narrowly targeted…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689374/electronic-filing-and-payment-fairness-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…events of this weekend--the  good and the bad alike.\n\nOn one hand, this weekend we witnessed one of the largest peaceful  demonstrations in American history. Nearly 5 million Americans took to  the streets and made their voices heard against the rise of  authoritarianism on our shores. I was proud to be one of them. We  gathered in the streets. We gathered…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…other side of the aisle turned a blind eye as  Musk was handed the keys to the government, enabling him to disable or,  rather, dismantle--probably both--programs everyday Americans depend  on. The majority stood by Trump through everything he has done, and now  we will see if that support falters.\n\nThe American people deserve much better than the drama…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692030/elon-calls-it-quits"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…human rights crisis could be an emergency.\n\nCanada is none of those things. Canada isn't a threat. Canada is our  friend. Canada is our ally. Canadians have fought alongside Americans,  whether it was in World War II or the war in Afghanistan, where 165  Canadians gave their lives after our country was attacked. There is no  national emergency. There is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…across the aisle to extend the ACA tax credits.\n\nAs you know, they are set to expire at the end of the year and will  cause monthly health bills to skyrocket for millions of Americans. The  rising cost of healthcare goes beyond the individual. It affects Black  small business owners.\n\nA small business owner in my district owns several coffee shops and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…process work.\n\nMr. Speaker, I encourage all of my colleagues on both sides to  support this negotiated bill that provides the resources necessary to  secure our borders, protect Americans here at home, and ensure we are  being good stewards of taxpayer dollars.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…tax relief enacted through the  Working Families Tax Cuts Act.\n\nThis landmark legislation, passed by House Republicans last July,  delivers meaningful tax relief to working Americans by expanding the  child tax credit, allowing nonitemizers to claim charitable deductions,  eliminating taxes on tips and overtime, and more.\n\nAs much as my colleagues on…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…through its live, nonpartisan coverage. Our resolution  calls for television providers, including streaming services, to make  C-SPAN public affairs programming available to all Americans in  realtime on all platforms.\n\nFor tens of millions of Americans who have cut the cord and get their  content from streaming services, they should not be cut off from the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…HUD and USDA to develop a joint environmental  review process for rural housing projects, cutting red tape and making  rural housing easier to build.\n\nIf we are to help more Americans achieve the dream of homeownership,  we must make it easier to build new homes. That means getting  government out of the way and allowing developers to build faster and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697479/making-homes-affordable"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…parents, and they are being  crushed by the costly and out-of-touch policies from Washington.\n\nThere is no doubt EV mandates only add further financial strain to  hardworking Americans, especially in my district.\n\nHave you seen an electric tractor, baler, or plow? I haven't because  they  don't work on farms or in the real world. In fact, the heavy-duty…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…entrepreneur in Spartanburg, South Carolina, deserves  the same access to capital as an entrepreneur in Silicon Valley. This  bill democratizes venture capital by enabling more Americans to invest  in their own communities, drive innovation, and create good-paying  jobs. It is about expanding opportunity and fostering economic growth  in regions that are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697243/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…people of Louisville are grateful for the swift, lifesaving  efforts of our first responders, from local police, fire, and EMS. They  trust in the prayers of their fellow Americans.\n\nI want them to know that their representatives here in Washington are  making sure that every Federal resource they need is on the ground and  headed their way soon. I…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…in Missouri,  a point I have made in my travels to the regions going back to 2015  when I attended the AGOA forum in Gabon.\n\nAfter we take this step, we can build further. Americans would  benefit if African nations graduated into formal bilateral trade  agreements with the U.S.\n\nRight now, the nation of Mauritius is on track to graduate from AGOA  within…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "Mr. VALADAO. Mr. Speaker, I rise to urge support for my bill, the  Romance Scam Prevention Act. Every year, millions of Americans from all  ages and backgrounds use dating apps and websites to make connections.\n\nFor many, online dating has made it easier to build relationships.  Unfortunately, there…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692729/romance-scam-prevention-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…his time and talents to support numerous civic and  non-profit organizations.\n\nStewart's enduring commitment to various forms of service sets an  inspiring example for all Americans who strive to make a positive  impact on their community.\n\nOn behalf of everyone in Pennsylvania's 13th Congressional District,  I express gratitude to Stewart for his distinguished…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698643/recognizing-the-public-service-and-community-leadership-of-c-stewart-cleaf"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…scheduling fentanyl-related  substances as schedule I.\n\nWe owe it to our communities, our constituents, the families, and to  the victims. Cartels are quite literally killing Americans for ten  cents. Among teens, fentanyl poisoning accounted for an average of 22  deaths per week in 2022.\n\nFentanyl is the number one cause of death among adults 18 to 49,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the people who attacked us. When we were attacked  at Pearl Harbor, once again, the vote was virtually unanimous to go to  war.\n\nJames Wilson, one of the Founders, assured Americans at the  Pennsylvania Ratifying Convention that the proposed Constitution would  not allow one man or even one body of men to initiate hostilities.\n\nIn Federalist 69, Alexander…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…capabilities, support law  enforcement, and expand access to critical minerals. These policy  priorities are shared by President Trump, congressional Republicans,  and millions of Americans. Importantly, this appropriations package  ends Biden-era policies enacting a more conservative vision, all while  cutting fiscal year 2026 spending by nearly $2 billion,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…now who need someone to be a fighter.\n\nWe have a good group here in Washington on both sides of the aisle  who are championing the importance of renewable biofuels, giving  Americans the freedom to choose cleaner, more affordable, American-made  fuel at the pump.\n\nThat fuel is E15. E15 is simply gasoline blended with up to 15  percent ethanol, or corn.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…providers who do not custody consumer funds are  not considered money transmitters.\n\nImportantly, the CLARITY Act will help further decentralize our  financial system so that Americans can forgo intermediaries and  transact directly with each other.\n\nHaving this choice will fundamentally transform the digital economy  and unlock new opportunities for innovators,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}]