[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…the security of mobile networks and educate  consumers about cybersecurity vulnerabilities and risks. The FUTURE  Networks Act is yet another important step to support America's  leadership in a secure and reliable future.\n\nBy directing the FCC to engage in the exploration of 6G technology in  the early stages of development, the FUTURE Networks Act will…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…would be unprecedented Federal overreach. While I  disagree with California's timeline, I also disagree with misusing the  CRA to address it.\n\nIf we are serious about America's leadership, EVs must be in our  portfolio. I remain committed to protecting American jobs, expanding  consumer choice, and ensuring U.S. leadership in global automotive  innovation.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the World Bank's International Development Act.\n\nThe International Development Association, IDA, is an example of both  the value of our multilateral institutions and America's leadership in  these organizations. The IDA is the World Bank's lending arm, and it is  one of the most effective tools we have to combat poverty and  instability worldwide.\n\nThe…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…sure poorer schools can hire enough  teachers.\n\nIf Republicans were truly worried about national security, they would  look at how this administration is destroying America's leadership  abroad, from having Signal chats about our national security to  everything else they are doing.\n\nI will end with this Mr. Speaker: While Republicans' billionaire…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, since the start of his second term,  President Trump has upended the international world order and America's  leadership on the global stage. He and his allies are working  decisively to erode the values that are central to our Nation. Notably,  retired diplomats, military leaders, national…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…putting lives at risk around the world.\n\nUSAID is a cornerstone of our national security, advancing global  health, powering research across the country, and reinforcing America's  leadership on the world stage.\n\nSlashing this funding will be disastrous for our allies, destabilize  vulnerable regions, and hurt communities. We cannot stand for it.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692405/trump-rescissions-request-and-usaid-cuts"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Tuesday, the Senate Foreign Relations Committee Subcommittee on  East Asia, the Pacific, and International Cybersecurity Policy held a  hearing on China's challenge to America's leadership when it comes to  artificial intelligence. We heard expert testimony from four witnesses  on the challenges that the United States faces in staying ahead of  China in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…companies, American scientists, and American engineers  bringing in the golden age of American spaceflight.\n\nIn conclusion, Mr. Speaker, the urgency of action is now. America's  leadership in space is hard-earned, but it is not guaranteed. Our  economy, our technological future, and our national security all depend  on continued space investment.\n\nCongress…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…EV mandates eliminated; revoked DEI policies in the  military and government; affirming there are only two genders; no more  men playing in women's sports; restoring America's leadership on the  world stage; rebuilding our military; military recruitment up;  defending religious liberty; sending gang members back to their own  home countries; standing…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Throughout his career, Tom has been present in his community through  his charitable giving of time, talent and treasure as seen in his  involvement with Boy Scouts of America, Leadership Council, St.  Baldrick's Children's Cancer Research, Hope for Vision, and Serving HIM  (Healthcare International Ministries). A devoted man of faith, Tom  attends Holy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Select Committee on Intelligence, and our colleagues to give  the American people some perspective on the important action that  President Trump has taken that reasserts America's leadership in the  Western Hemisphere, counters our rivals for that Western Hemisphere  influence, Russia, Iran, China, and keep America safer by taking this  action.\n\nThe communist,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Haskell County, we talked about how the bill's generational  investment in national security will help secure our southern border,  strengthen our military, and restore America's leadership in the world.\n\nThe other message I heard over and over was this: Keep pressing  forward, unrelenting, undeterred, and unapologetic, to advance the  America First agenda.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…colleagues,  Representatives Kennedy and Stevens. This legislation passed the House  in the 118th Congress, and I am pleased that we are taking it up again  today.\n\nAmerica's leadership in science and technology is built on the  foundation of Federal investments and basic research. These investments  enhance our national security, strengthen our economy,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…cared about the American people's  safety and law enforcement officers' well-being.\n\nThankfully, we now have new leadership in the White House, strong,  forceful, America-first leadership, and I look forward to sending this  commonsense legislation to President Trump's desk to restore law and  order in our Nation's Capital and support our brave men…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…whose leadership chants ``Death to Israel, death to  America'' will be allowed to obtain a nuclear weapon ever. This is not  up for debate.\n\nPresident Trump is restoring America's leadership on the world stage  and fighting tirelessly to keep Americans safe, both at home and  abroad. This past week, President Trump showed that he is not willing  to let America…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…human landing system, and nuclear  thermal propulsion, for all of which Marshall Space Flight Center in  north Alabama plays a central role.\n\nThese investments reinforce America's leadership in space through  competition and innovation, while strengthening our national security,  protecting taxpayers' dollars, and ensuring NASA remains focused on  results.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…technology. Their efforts have  enhanced our technology, fueled our economy, and bolstered national  security. I applaud their successes and commitment to advancing  America's leadership in technology.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691716/recognizing-national-dram-day"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, this week marks 6 months of the America  First leadership under President Trump Donald Trump.\n\nHe has had innumerable accomplishments over the first half of this  year and has kicked off a new golden age for our country.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…mineral dominance or  mineral dependence. There isn't a third option, and it is long past  time for the Federal Government to act like it.\n\nOur global allies rely on America's leadership. If we are to remain a  leader in the global economy, then domestic mineral abundance is a  strategic necessity, not a political football.\n\nThe resolution before us…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…more  importantly, it is about the future of both the financial sector and  the technological sector.\n\nA vote for the CLARITY Act is a vote for America's future and  America's leadership. I urge all my colleagues to vote ``yes'' on the  CLARITY Act. I yield back the balance of my time.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}]