[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…ownership of  cryptocurrency.\n\nWhile cryptocurrency has tremendous economic potential, we  desperately need rules of the road to protect consumers, ensure the  success of American entrepreneurs, and ensure that America leads the  way, not other nations around the world, but that America leads the way  in this growing space.\n\nThe CLARITY Act takes commonsense…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…support.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this bill and  for the Senate to expeditiously take it up so we can unlock more of the  potential of American entrepreneurs.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.R. 2966, the American  Entrepreneurs First Act.\n\nIf we really wanted to put American entrepreneurs first, we would be  debating a bill to strengthen SBA lending and make it easier to access  capital,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…suggesting we eliminate this crucial  program? Why would you threaten to remove a way for veteran-owned small  businesses to access capital? What is your message to American  entrepreneurs looking to access that first loan that could help turn  their best ideas into a new small business?\n\nMr. Speaker, let's just take a step back here. Right now, small…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…for consideration of H.R. 2483, SUPPORT for Patients and  Communities Reauthorization Act of 2025; H.R. 2931, Save SBA from  Sanctuary Cities Act of 2025; H.R. 2966, American Entrepreneurs First  Act of 2025; and H.R. 2987, CEASE Act of 2025.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1692002/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…four decades of outsourcing of U.S. production.\n\nI am really shocked at what they have done. This impulsive decision  is a direct blow to family-owned businesses and American entrepreneurs  competing against Communist China, Mexico, and every other low-wage  haven in the world.\n\nThis decision delays critical upgrades, injects uncertainty into  local production…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698082/funding-manufacturing-extension-partnership-offices"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…what.  There is a lot of truth to that. The other is, there is a lack of  confidence on the administration about the capacity of the American  people, the American innovators, the American entrepreneurs to take  full advantage of solving the issue of climate change by building out  clean energy, by doing efficiency.\n\nThat really, really works. And a confident…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688164/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…toward identifying and  mitigating risks early, strengthening the long-term viability and  affordability of the 504 loan program and ensuring continued support  for American entrepreneurs.\n\nMadam Speaker, I urge my colleagues to vote ``yes'' on H.R.\n\nMr. WILLIAMS of Texas. Madam Speaker, I yield such time as he may  consume to the gentleman from Florida…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…framework  that has been missing for far too long, which is clear, consistent  rules for digital assets and the innovators building the future of  finance.\n\nFor years, American entrepreneurs and developers in the digital asset  space have been forced to navigate a regulatory maze marked by  conflicting guidance, shifting definitions, and enforcement actions…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Mr. Speaker, my colleagues and I are here today to debate the rule  providing for consideration of H.R. 2931, the Save SBA from Sanctuary  Cities Act; H.R. 2966, the American Entrepreneurs First Act; H.R. 2987,  the CEASE Act, which will be considered under a closed rule; and H.R.  2483, the SUPPORT for Patients and Communities Reauthorization Act to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…a straightforward solution to empower the SEC's  Office of the Advocate for Small Business Capital Formation, the  advocate, making it a more effective champion for American  entrepreneurs.\n\nMr. Speaker, I also rise today in support of my bill, H.R. 3382, the  Small Entity Update Act. I thank my colleagues across the aisle,  Congressmen Casten, Himes,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…other purposes, and ask for its immediate  consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. Speaker, I rise today in support of H.R. 2966, the American  Entrepreneurs First Act of 2025, introduced by Representative Van Duyne  from the great State of Texas.\n\nFor 4 years under the Biden-Harris administration, the SBA approved  loans…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…supply chains and finance to  healthcare and identity management, blockchain is transforming the way  our systems function.\n\nMr. Speaker, we are at a crossroads. While American entrepreneurs and  technologists are ready to lead, they are operating in an environment  filled with uncertainty. Too many innovators in this space face unclear  rules, inconsistent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "Mr. CLOUD. Mr. Speaker, today the House advances another pillar of  President Trump's America First agenda with the passage of the American  Entrepreneurs First Act of 2025.\n\nThis bill ensures that taxpayer-funded SBA loans are reserved for  American small businesses, not illegal aliens, certainly not children  or people…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…making sure that Federal taxpayer dollars are not  funneled into lawless sanctuary cities that put illegal aliens ahead of  their own citizens.\n\nWhy should hardworking American entrepreneurs in law-abiding  communities be second in line to support from their own government?  They shouldn't be.\n\nThis bill will relocate SBA regional offices from sanctuary…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…same firms are winning contracts year after  year.\n\nIf small businesses can't break into Federal contracting, innovation  is stifled, costs for taxpayers increase, and American entrepreneurs  lose out on opportunities to grow.\n\nMy bill, the SPUR Act, addresses this issue by requiring the SBA to  track and report the number of new small business participants…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}]