[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…is demanding red  States find him more seats in Congress.\n\nAll this for what? So Donald Trump can enrich himself and his  billionaire allies while everyday, hardworking Americans pay the bill.\n\nI just have to ask, Madam Speaker: Where are the so-called  constitutional conservatives? Will even one of my colleagues on the  other side of the aisle find…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…history, but it will  certainly mean a lot to ordinary people.\n\nIt will grow our debt by $4.6 trillion. It will lead to higher  interest rates and raising prices on goods that Americans pay for every  day. It will cut crucial government services that keep us safe,  healthy, and productive. It will strip healthcare and food assistance  from tens of millions…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…the only people  who would are fraudsters.\n\nWell, Mr. Lutnick's family might be able to afford to lose a payment  or two, but most Americans cannot. This is their money. Americans pay  for these programs. These are earned benefits. People are afraid, and  rightfully so. They are calling, texting, emailing, and stopping me on  the street.\n\nMr. Speaker,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689232/seniors-need-social-security"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…not only these organizations but the UN  Secretariat itself. By then, Donald Trump will be gone, but it will be  too late to reverse course, and future generations of Americans will  pay the price.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…nothing but rising prices,  stagnant wages, and bitter, bitter feelings about being left behind.\n\nFor too long, we have propped up the wealthy and forced middle-class  Americans to pay the bill. It is unacceptable, and if we have any hope  of getting our fiscal house in order, this needs to change.\n\nCongress is about to wrap up for the year, but when…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Trump's executive order for the most-favored-nation status on  drug pricing.\n\nMy legislation will codify President Trump's executive order, which  basically says that Americans should not pay more for drugs than people  in other countries and other parts of the world.\n\nRight now, we are paying two to three times more for our drugs than  people in other…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…costing  families $1,800 this year. The President has essentially claimed these  costs are a figment of our imagination, repeatedly claiming that  foreign companies--not Americans--pay his tariffs. But his claims don't  match Americans' reality or the economic data.\n\nA recent Goldman Sachs report found that foreign exporters have been  paying only about…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Let's do  something to help these people keep their health insurance. I have  spoken with my colleagues on both sides of the aisle and have made it  clear we want to help Americans pay for these bills. I want to join  them. It should be done on a bipartisan basis, and we should waste no  time.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…costs for the American people and show  precisely how Donald Trump and Republicans have made life far more  expensive for Americans.\n\nThis morning, a report came out that Americans will pay 13 percent  more on energy costs than they did last year. In part, why? Because  Donald Trump and his obeisant Republicans cut out the cheapest way to  get new power…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the administration canceled the  program.\n\nCutting emergency preparedness funding doesn't prevent disasters. It  just makes them harder to handle. Once again, it is Americans who will  pay the price.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693988/fema-cuts-and-hurricane-season"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…rental       assistance, increasing SNAP benefits to reflect rising       grocery prices and closing the Medicaid coverage gap.\n\nIf Congress focused on ensuring that wealthy Americans pay their fair  share rather than providing additional tax breaks, we could fund these  initiatives and so much more.\n\nThis is a group of groups that you will recognize or…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…Republican Congress authorize the imposition of even more excessive  overdraft fees which will cost American consumers another $5 billion.\n\nWhere is the action to help Americans pay their bills? Mr. Speaker,  you won't find it in any of these three measures. Instead, my  Republican colleagues seek to undermine waivers from Federal  regulations that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…tonight aren't going to make America healthy again. They are going to  make America hazy again. If we go down this road, the future is clear  even if our skies won't be.\n\nAmericans will pay for this nuclear option with more of their  paychecks on hospital bills. They will pay for it with fewer jobs, less  success in their communities, fewer years with their…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…afford because they have no health care?\n\nThe ugly consequences of this bill include tens of thousands of  premature deaths a year.\n\nThis bill will also force millions more Americans to pay higher  premiums, higher co-pays, and higher deductibles for the health care  they do receive. Republicans are voting to deliver bigger medical bills  to their constituents…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…mess of a healthcare  plan.\n\nUnder the Republicans' plan, millions of Americans will not be able  to afford health insurance because Republicans don't provide money for  Americans to pay for the healthcare under the Affordable Care Act.\n\nAmericans don't have an extra $1,000 or $2,000 in their pockets every  month to pay for health insurance. They shouldn't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698399/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…others' lives when deployed.\n\nTaking care of them is our sacred obligation. So while we keep  fighting for better healthcare, more affordable healthcare for all  Americans, my bill will pay our Armed Forces now.\n\nIt will pay Active-Duty, Reserves, National Guard, Coast Guard,  civilians at the Pentagon, and intelligence Agencies, and give those  who…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. Speaker, I rise in opposition to H.R. 2550. Americans pay several  hundred billion dollars in taxes each year to fund the salaries and  benefits of more than 2 million Federal civilian employees. These  workers are paid to carry…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…are for Americans.\n\nThe SAVE Act restores this vital principle by requiring proof of  citizenship and identity in the Federal elections that affect every  American. Americans should pay close attention to this vote, for it  will reveal those who would subvert their vote to foreign nationals.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…world.\n\nThe natural gas tax won't stop the use of all natural gas. It will  simply stop the use of American natural gas. This tax will make it  harder for hardworking Americans to pay for their soaring energy bills  and force us to utilize more natural gas and energy produced by foreign  adversarial nations  who have far inferior environmental and labor…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688187/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…time, for 2 years. That will give us the runway that we need  to work on a broader solution to the healthcare affordability crisis in  America without forcing millions of Americans to pay the price in the  meantime.\n\nMr. Speaker, importantly, our bill not only provides this temporary  extension, but it also includes reforms that pay for themselves. In…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]