[{"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, right now, millions of Americans are struggling  to afford healthcare. Millions of new and expecting mothers are seeing  their premiums skyrocket and they are being forced to go without health  insurance. Across…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699219/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "Mr. COSTA. Mr. Speaker, at a time when Americans are struggling to  afford groceries, housing, and gas, Congress should be focused on  lowering the cost of living that Americans care most about and not  renaming bodies of water.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Social Security Administration, guaranteeing that services for seniors  will suffer, or that the Trump Secretary of Agriculture just went on  television and told Americans who are struggling with food prices to  get a chicken.\n\nThat is why House Republicans want to talk about something else. That  is why we are here to debate and vote on this rule.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…House  Republicans are prioritizing Trump's vanity project, renaming the Gulf  of Mexico, like that is going to help Americans with their cost of  living.\n\nMillions of Americans are struggling because of Trump's policies that  are tanking our economy and raising the cost of living. The Republicans  in this Chamber have yet to put forth anything that addresses…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…as I mentioned, electricity prices are up 13 percent, and  natural gas prices are up 8 percent since the President took office.\n\nMr. Speaker, this holiday season, Americans are struggling to afford  record-high utility bills and skyrocketing grocery prices. Donald Trump  and the Republican Party were elected on their promise to bring prices  down. Instead,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…make it clear: Hands off Medicaid. Hands off  the healthcare of the United States of America. Hands off nutritional  assistance. Hands off veterans. Hands off everyday Americans struggling  to make ends meet.\n\nRepublicans do nothing to lower the high cost of living. In fact,  they are making the affordability crisis in America worse, not better.  Then,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…devastating 43-day shutdown, I will not support a bill that will  continue the Republican's assault on Americans and their pocketbooks.  At a time when Oregonians and Americans are already struggling with  rising costs, this bill locks in devastating cuts to health care and  drives up the cost of health insurance--in many cases significantly.\n\nJust a few months…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…flatter the whims of  erratic leaders with insane ideas like renaming the Gulf of Mexico,  invading Greenland, annexing Canada, or reinstituting Alcatraz.\n\nWhile many Americans are struggling just to get by, the last thing  they want is a Republican tax bill that guts their healthcare and  denies food and housing to children and seniors so that millionaires…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…getting a good education.\n\nRepublicans say they are eliminating waste. Do you want to talk about  waste? Waste is giving the wealthiest big tax cuts while regular  Americans are struggling to put food on the table.\n\nThe cost of groceries is increasing, wages continue to remain  stagnant, and too many families can't afford housing or childcare. The  Republican…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688036/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…benefits.  We know that the Washington Republicans continue to do the bidding of  Big Oil and Gas.\n\nThis resolution proves that Republicans are completely out of touch.  Americans are struggling to make ends meet and are facing the reality  that Republicans may soon strip them and their families not only of  healthcare but repealing commonsense energy efficiency…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…daylight  in Minnesota. Trump is entertaining entering another war with  Venezuela. Vaccines are being rolled back, which will make students and  communities sicker. Americans are struggling to afford basic goods.\n\nSpeaking of affordability, we are in the middle of an affordability  crisis that Republicans refused to address. Republicans chose to shut…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and the  Republican policies, and they should not be mocked for that. Even FOX  News reported last night that 76 percent of Americans view the economy  negatively.\n\nAmericans are struggling to afford basic necessities. A new report  from The Century Foundation found that utility prices are up 32 percent  since 2022. That is nearly three times the rate…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…designation of the first-ever Gulf of America Day. That  ingenious piece of legislation was introduced by Representative Mark  Alford of Missouri.\n\nAt a time when Americans are struggling to live paycheck to paycheck,  and when we are grappling with the high cost of living, don't worry  because Republicans have a solution. Congressman Brandon Gill of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…wage law to allow employers to treat almost any worker  as a tipped employee, even if they receive small or occasional tips.  This means lower wages for everyday Americans who are struggling daily  with higher costs.\n\nMr. Speaker, think of a restaurant worker who both waits tables and  covers with some back-of-the-house shifts. This legislation would…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698967/tipped-employee-protection-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…now 9 months into this administration and weeks away from the  end of the fiscal year, and the cost-of-living crisis has only gotten  worse under President Trump. Americans are struggling with rising costs  of everyday necessities. They are living paycheck to paycheck, but the  President and House Republicans are not laser focused on the cost-of- living…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…who create, traffic, and sell the deadly  fentanyl that takes the lives of so many Americans.\n\nThis week, we will be taking another step to further support our  fellow Americans struggling with the deadly cycle of addiction by  passing the SUPPORT Act. This legislation will ensure our brave first  responders can access and administer Narcan to save the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…down the value of our dollar, are now going to lecture us on  why groceries cost so much. Where the hell have they been for the last  4 years? Where were they when Americans were struggling with the cost  of their groceries because gas was up near $4 a gallon?\n\nTheir policies determined that when they ran all facets of the  government. Now, they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Members and their  spouses from owning or selling individual stocks.\n\nIt is simple. Public service should never be a pathway to private  wealth, especially when everyday Americans are struggling. This is  about rebuilding trust in what we do.\n\nCongress works for the people, not to enrich our bank account. I am  proud to join my colleagues tonight on the other…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…former ambassador to Luxembourg.\n\nMr. Chair, I rise because we have an opportunity here to make the  world's best capital markets even better. In a period of time when  Americans are struggling with higher costs, we have an opportunity to  lower costs, and the legislation before us tonight accomplishes both of  those goals.\n\nOutdated capital market rules…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697826/increasing-investor-opportunities-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…over that time period, the very people who were breaking  the law were actually getting free things, whether it be rent, phones,  cash cards, and other things that Americans were struggling to pay for  every single day.\n\nCleaning up this mess has become our responsibility, the new  majority, the new administration that has committed itself to actually…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}]