[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…violence, just like other immigrants living in  the United States at the time and today.\n\nItalians were wrongfully seen as unable to assimilate, dangerous, and  a threat to the American way of life, language which is also,  unfortunately, still familiar today.\n\nYet in the face of this hateful, dehumanizing rhetoric, Mother  Cabrini responded not with fear or…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Services;       Oceana, Inc.; ORourke Law; Outten & Golden LLP; Owner-      Attorney of Law Office.\n\nPathway for Immigrant Workers; Paul A. Nelson, PA; People       For the American Way; Perrin Law Office; Peter Romer-Friedman       Law PLLC; Planned Parenthood Federation of America; Prison       Law Office; Professional Corporation; Progressive State…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…of their own home  country.\n\nWe can't turn our back on Ukraine and the world, and we cannot expect  that the consequences of that decision will not reach our shores. The  American way of life is reliant on our global reputation and  interconnectivity. President Trump is doing his very best to tear that  all down.\n\nPresident Trump must reverse his dangerous…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…judgment,  but we need an accountability and a full hearing where Pete Hegseth  answers to the American people for what happened off the coast of  Venezuela.\n\nIt is not the American way of doing business of killing people who  are unarmed. That may be how Putin acts. That may be how Xi Jinping  acts. That is not how America acts. I know there are Republicans…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697796/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…National Association of Social Workers, National Education       Association, National Women's Law Center, NETWORK Lobby for       Catholic Social Justice, People For the American Way, People       Power United, Public Citizen, Seed the Vote Action, SEIU,       Stand Up America, The Workers Circle, Voices for Progress,       50501 Movement.\n\nTo learn…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…flood of extremism, the  likes of which have never before been seen in the United States of  America, has been unleashed on the American people, an all-out assault  on the American way of life.\n\nAn assault on small businesses is underway here in the United States  of America. We should all recognize that small businesses represent the  heart and soul of…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…these lands, and an iconic symbol  of American wilderness.\n\nI believe that, in this body, we must preach hope and possibility and  that we must defend our values and the American way of life that has  been meticulously built over centuries, and both parties must work  together to protect the things we love.\n\nThese two proposals before you are misguided.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…of Illinois. Mr. Speaker, I thank Congressman Fields for  the privilege of standing here beside him. I thank him for his  commitment to justice, for his commitment to the American way, and I  thank him for making America better.\n\nHis case right now before the United States Supreme Court, Louisiana  v. Callais, is taking into account, once again, the maxim…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Afghanistan, Iraq, Libya, Syria, and now potentially  Venezuela, the formula is always the same: Proclaim that the regime of  the targeted country poses such a threat to the American way of life  that the only thing we can do is go to war. Tell them that our  intervention is a noble effort, one that would bring security at home  and liberty to foreign lands.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…the problems  that they created. We have got to do this if we are going to survive  this thing.\n\nUnder this House majority and administration, it is just no longer  the American way. We promised the American people energy dominance. We  had that just 6 years ago. Can you imagine? We were energy dominant. We  set the price of a barrel of oil just 6 years…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…behind and the European Central Bank is doing  this, when have we in this country, the United States of America,  wanted to emulate Europe?\n\nThis is America. We do it the American way, not the European way, not  the Chinese way, and not the Communist, socialist way. We do it the  free enterprise way. We do it the limited government way. We do it the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…and the President may not  be quite the strange bedfellows they first appeared to be.\n\nI am confident that Norman was pleased with the President's muscular  defense of the American way of life upon his return to office and  especially pleased that Norman lived to watch America join with Israel  to devastate Iran's nuclear program on President Trump's watch.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Winston  Churchill 4 years earlier, left us with the great expression: jaw-jaw  is better than war-war.\n\nIt is because of our great power that our rivals seek to end the  American way of life through direct or gray zone war attacks or by  cyber or economic destruction, and we certainly should routinely jaw- jaw with those great powers about our possible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…administrative state. It protects  our values of privacy, individual freedom, and free market innovation  by prohibiting a CBDC surveillance tool that could be wielded against  the American way of life.\n\nI am proud to be a cosponsor of this important legislation, and I  thank Whip Emmer and Chairman Hill for their outstanding leadership on  this important issue.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693725/anti-cbdc-surveillance-state-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Mr. Speaker, Americans are preparing to celebrate the  250th birthday of the United States in 2026.\n\nHow do you properly celebrate 250 years of freedom? One very uniquely  American way is to spend time in what Wallace Stegner called ``the best  idea we ever had,'' our national parks.\n\nNational parks provide our connection to history, nature, and shared…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…on July 11, 1733, making Savannah the largest Jewish settlement in the  English colonies in North America at the time; and\n\nWhereas, the belief in the greatness of the American way of life, the  freedoms enshrined in American law and jurisprudence, and the  opportunities sustained by American democracy drew generations of  Jewish immigrants to America,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…and private--``private''  with a capital p--resembling cash, a government-issued CBDC is nothing  more than an Orwellian surveillance tool that will be used to erode the  American way of life.\n\nThe Federal Government has no business monitoring Americans' daily  financial lives. We don't need or want a state-run digital dollar with  Chinese Communist Party…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…given birth to a shallow morality of materialism that measures  values strictly in terms of consumption. This is a poisonous new idea,  utterly alien to the traditional American way of life.\n\nOur trade policy, like our foreign policy, failed to adapt to the new  reality of the world after the fall of the Berlin Wall. The  consequences were nothing short…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…and maintained some of the strongest air quality records in the Nation.\n\nWe can grow the economy, power the country, and steward the  environment all at once. That is the American Way, and that is  certainly the North Dakota way.\n\nThe Biden administration failed to recognize that and completely  ignored all of my State's concerns with the plan. If we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…nail to undo  the damage President Biden's radical agenda--maybe that is why they are  complaining, come to think about it--inflicted on our economy, our  freedoms, and the American way of life. It is just that simple.\n\nThis week, we are moving to overturn yet another reckless regulation  this time targeting the very backbone of our supply chain: American…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…empowering doctors. Our solution for  healthcare is empowering people. Our solution for healthcare is  spreading costs out among people who want to help each other out in the  American way.\n\nIt is why I started talking about Christmas.\n\nThe question for Republicans is: If not now, then when?\n\nWhen are we going to stand up and deliver for the American people?…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Ocasio-Cortez. I want to make  that very clear. She has the right to her opinion. She has the right to  try to have the socialists take over the Democratic Party. That is the  American way. Ironically, I think what she is doing is anti-American,  but she has the right as an American to do it, so I don't hate her.\n\nBut I judge her by her policy. She has her…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}]