[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…purchase the Trump coins for the express purpose of  influencing tariff policy in the United States of America.\n\nWhen Donald Trump negotiates tariffs, is he protecting American  consumers and small businesses? No, not so much. More likely, he is  cutting deals for his crypto friends. That is the essence of selling  public office, and it is corruption.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…won't  stop people around the world from driving EVs or using solar, but it  all but guarantees they will be using Chinese technologies.\n\nIf China is the big winner, American consumers are the big losers. If  these credits are functionally repealed, the average American could see  their utility bills rise by hundreds of dollars per year.\n\nThis is a…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692366/american-energy-jobs-at-risk"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…ability to claim to be a leader.\n\nWhat we did in this bill is, it says: What is the energy policy that  is necessary? What is the energy policy that is most helpful to  American consumers? That is what we set out to do. I am proud of the  legislation that Congressman Levin and I have written to do that.\n\nWith that, I yield back to the great gentleman from…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…our  society and drives rapid change, including in our communications  infrastructure.\n\nMr. Speaker, 6G networks will leverage AI to meet the connectivity  demand of American consumers and businesses. Mr. Speaker, 6G also can  support smart cities and supercharge augmented reality applications for  education, healthcare, and manufacturing.\n\nGiven such…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690227/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Texas to Mexico that carry natural gas to Mexican LNG facilities.\n\nThese provisions would facilitate increasing LNG exports, which have  been shown to drive up prices for American consumers.\n\nMr. Speaker, for the sake of our consumers, our national security  interests, and the future of our planet, I urge my colleagues to vote  ``no'' on H.R. 3062.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that all have too much power. Republican billionaires  and Big Oil companies are the real winners when resolutions like this  are passed and savings are ripped away from American consumers.\n\nMr. Speaker, let's stand up for the people for a change and not the  powerful special interests. Let's stand up for their pocketbooks and  vote ``no'' on this resolution.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…a massive job to protect  consumers from hazards associated with a vast array of consumer  products, from infant car seats to window blinds to home repair  equipment. American consumers deserve to have peace of mind that the  products we are bringing into our homes are safe.\n\nI hope my Republican colleagues will finally begin to speak up  against President…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…are talking about affordable appliances. Do you know what tariffs  have done to the cost of appliances? Tariffs have driven a steady rise  in appliance pricing, hitting American consumers with higher costs for  essentials like refrigerators, washers, dryers, and dishwashers.\n\nSince most appliances rely on imported steel, aluminum, and foreign- made components,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…north, Canada.\n\nThe administration has used that declaration as a pretext to impose  sweeping tariffs on a friend, on a neighbor, on an ally--which are  taxes, paid by American consumers and businesses, on Canadian imports.\n\nBack in April, this same resolution passed the Senate with bipartisan  support. Under the National Emergencies Act, Congress must…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…means that we will ensure that Trump's coin has no  oversight. Why would we want that? We will ensure that no consumer is  protected if we do nothing. We want to protect American consumers. That  is our job. This legislation does that.\n\nMr. Speaker, I urge my colleagues to support this critical  commonsense, bipartisan legislation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…about all Americans.\n\nNo. 26, fired the Director of the Consumer Financial Protection  Bureau because he favors the interests of his billionaire buddies over  those of American consumers.\n\nNo. 27, gutted Federal protections for worker safety.\n\nNo. 28, scrubbed the mention of climate change from any Federal  Agency in our country.\n\nNo. 29, froze $10 billion…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Congress should instead  consider a comprehensive regulatory framework for crypto that will  promote the responsible development of these digital assets while  protecting American consumers and investors. I urge my colleagues to  reject H.R. 3633, S. 1582, and H.R. 1919.", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…renewing the  challenge. We are here to say that what we said on the floor last  spring has happened, and we are seeing dramatic increases in the price  of energy for American consumers and businesses and the slashing of  American jobs so that Donald Trump can give an easy pass to the fossil  fuel industry.\n\nIt took a while for these effects to come…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Mr. Speaker, I rise today on behalf of nearly 44 million American  consumers who have invested in, traded, or used digital assets. That is  one in five Americans. The public interest in these markets is already  here, and it is not going away.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…but here is the  cold, hard truth: The American people are paying them.\n\nJust today, the nonpartisan Congressional Budget Office confirmed  what families already feel--American consumers are paying 95 percent of  these tariffs. They pay at the grocery store. They pay in higher energy  bills. They pay when small businesses shut their doors.\n\nThese blanket…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699977/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…suggested changes to the GENIUS Act. I appreciate her remarks on that.\n\nHere is the big picture, Mr. Speaker. These bills, the CLARITY and  GENIUS Acts, are about protecting American consumers, protecting  investments, bringing capital back to the United States, and making the  U.S. a fintech leader in payments and digital assets.\n\nConsumers are protected.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…for urban elites in warm-weather States who  have no concept of rural America.\n\nA government EV mandate is unjustifiable. Vehicle decisions should be  left up to the American consumers, not woke extreme climate activists.\n\nI urge the passage of this rule.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, a resolution of inquiry--Congress wants to know. Give us  some…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…regulations at an estimated cost of over $60  billion. This resolution would eliminate Biden-era energy conservation  certification and labeling regulations, ensuring that American  consumers, not Washington bureaucrats, decide which appliances best fit  their needs.\n\nEven the Biden-Harris Department of Energy acknowledges that this  rule will increase annual…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…clear. I don't think Iran gives one iota  of concern. I had to clean up my language, Mr. Speaker. I don't think  Iran cares about what kind of appliances the American consumer buys.  American consumers care, but I don't think Iran cares. By golly, we are  not going to war over appliances in Iran.\n\nThere are lots of other things we can talk about. I do believe…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…small business owners across  the country. With this bill, we are continuing to deliver on the  mandate of the American people to cut burdensome red tape and ensure  American consumers and small businesses can thrive.\n\nMr. Speaker, I urge my colleagues to support this underlying bill.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Speaker, these rules need to be  fit for purpose for the digital ecosystem. All of us on this House  floor know that the status quo is simply unacceptable. We all know  American consumers and innovators deserve this clarity. They deserve  better. They deserve rules of the road.\n\nThe choice before us is whether to lead in the financial markets of  the future…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…It is time that my colleagues and I codify President Trump's  deregulation agenda so that our energy producers can unleash domestic  production, lower costs for all American consumers, and further support  our allies abroad on our pathway to energy dominance.               Honoring Our Brave Border Patrol and ICE Agents\n\nMr. JOYCE of Pennsylvania.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…consumers are protected while reaping the  benefits of blockchain technology. The GENIUS Act will allow for  scalability to occur in the stablecoin marketplace, ensuring American  consumers and businesses have access to this innovative product.\n\nBoth banks and nonbanks can issue stablecoins under the GENIUS Act,  bringing together the best actors in both…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…everything from  groceries to smartphones, to washing machines, to prescription drugs.  Every dollar collected in tariff revenue comes straight out of the  pockets of American consumers.\n\nConservatives used to understand that tariffs are taxes on the  American people. Conservatives used to be uniformly opposed to raising  taxes because we wanted the…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Uyghur forced labor.\n\nIt ensures that Federal contracts, programs, and policies only go to  companies that can certify their supply chains are free from this  abuse.\n\nAmerican consumers should not be complicit in human rights  violations. American businesses should not profit from forced labor,  and our government, our tax dollars, must never enable…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…adversaries like Russia and Iran. In fact, during Biden's  LNG export ban, Russia overtook the U.S. as the lead supplier of gas to  Europe. In no world was this good for the American consumers or our  allies.\n\nMr. Speaker, I would like to say that Republicans and Democrats have  similar goals, but that is just not true. We had 4 years to study this.  We had…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Democrats' war on American energy strained our  grid, subsidized unreliable energy, and as a result, energy prices  spiked in their administration by 31 percent. That hit American  consumers, American manufacturers, American families; and it hurt our  economy.\n\nMeanwhile, what we know is that China is opening up two new coal- fired powerplants each and every…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "John Thune", "party": "Republican", "sentence": "…near an archaeological site. It was just another way to  slow down production and heap more costs on energy producers--costs  that would eventually have been paid by American consumers. Republicans  repealed that rule.\n\nThen there was Democrats' natural gas tax. In 2022, Democrats enacted  a tax on methane emissions from natural gas producers--a tax…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…between condensing  and noncondensing models in this assessment.\n\nOn top of expensive installation costs, industry stakeholders  estimate the actual cost increase for American consumers will range  between $450 to $665 per unit. This staggering increase is not cost- effective, as stipulated by EPCA, and is unattainable for many  families.\n\nThe Biden-Harris…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…showerhead, and ask for its immediate  consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. GUTHRIE.  4593.\n\nMr. Speaker, under the previous administration, American consumers  were subjected to Washington's constant micromanagement of appliances  and equipment in their homes and businesses.\n\nIn fact, the Biden-Harris administration finalized…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}]