[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…prices on  day one of his administration, but he has done  the exact opposite. His policies and his rhetoric are raising the cost  of living for hundreds of millions of Americans.\n\nTo make matters worse, he is simply lying about it. In fact, his top  trade adviser has gone on record promising Americans that we all must  just be confused and that the tariffs…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Native-American lands is something that is of the  utmost importance to Native-American Tribes, and all of us in this  country that represent Native-American lands and Native Americans make  a commitment regularly that we are going to help protect those rights.\n\nAllowing this veto to stand flies in the face of that, especially  because each of us, in both…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…commitment to upholding and fostering that diversity, to protecting the  culture of communities that were here before us, and to ensuring the  stories of our country and the Americans who make it so great are told  in full.", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…they needed to  get treatment.\n\nEvery year, 68,000 Americans die because they do not have health  insurance, and Republicans have chosen to turn their backs on these  Americans and make this crisis worse.\n\nNot only does their bill fail to extend the ACA tax credits,  something that helps 88,000 folks in my district afford health  insurance, it abandons…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698385/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…mortgage. That is unconscionable, and that is  most definitely un-American.\n\nWe must identify solutions to put the dream of homeownership back  into reality for young Americans, and we must make it less expensive  for Americans to get the skills necessary to provide a decent life for  themselves and for their families, but they can't do that if they are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…after the passage of the reconciliation bill:\n\nEPA plans to end a program that makes solar power available       to low-income Americans.\n\nWhy don't we punish low-income Americans and make their energy costs  go up? Why don't we do that? I mean, it is shameful for that thought to  cross your mind, much less for you to do it, but that is what the  reconciliation…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…commonsense legislation.\n\nMr. Speaker, I think this is a commonsense bill, and I am so happy  that our colleagues thought it appropriate to bring it forward to help  older Americans make better-informed decisions.\n\nAs I indicated, I have had friends who retired at age 62 and thought  that that would be a better time based on the misinterpretation of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697233/claiming-age-clarity-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…healthcare, what will happen to our schools  and our hospitals?\n\nWorkforce shortages also raise costs, and the policies of this  President will, once again, raise costs on Americans and make it harder  for them to access healthcare, mental health resources, or even get a  great education.\n\nThe next time we hear about workforce shortages or rising costs,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…healthcare and address the crisis that  they have caused.\n\nWhat did they do instead? They shut down the government and held food  assistance hostage from the most vulnerable Americans.\n\nMake no mistake, the consequences of inaction will be dire. If  Republicans  continue down this road, millions of Americans will be forced to go  without healthcare insurance,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…our men and women in uniform, our police  officers, our firefighters, and the people that are working everyday  jobs who keep America moving.\n\nWhat makes America tick? Americans make America tick. Healthy  Americans make America tick. People working together make America tick.  We must work together, side by side, with our Republican counterparts.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and I am grateful for the quality care they provide and for the  groundbreaking research happening at this facility.\n\nWhen a young person signs up to join the military, Americans make  them a promise that we will take care of them for the rest of their  lives because they have put on the uniform of this country and risked  their lives for all of us.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690327/cuts-to-va-benefits"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…paying for their rent or a  visit to the doctor that they need in order to survive. Unfortunately,  these are the decisions that this administration is forcing everyday  Americans to make. Republicans must work with House Democrats to bring  these costs down for families in the San Fernando Valley and across the  country.\n\nMr. Speaker, how much time do…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Too many Democrats show up on a job site seemingly from a sense of  noble obligation with wonky academic explanations about why everything  is fine, even when everyday Americans can't make ends meet. I had an  operating engineer tell me last week that he thinks that both parties  are pissing on his leg and telling him that it is raining.\n\nWe have to understand…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…fundraising site that collects  small-dollar donations from people across the country who fuel the  Democratic Party's fundraising. ActBlue is a vehicle for everyday  Americans to make small-dollar donations to the campaigns of people who  are standing up to Donald Trump and fighting back against this  administration. As a result of that, Donald Trump…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…known as the  SERV Act.\n\nVeteran entrepreneurs are powerful economic engines and job creators.  More than 1.6 million veteran businessowners employ nearly 3.3 million  Americans and make approximately $983.9 billion in sales.\n\nWith that said, one of the biggest challenges facing veteran-owned  small businesses is access to capital. Servicemembers report…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687886/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…globe, you find easily the most successful group is people who came  here from India, another group that didn't even necessarily know  English when they got here. Indian Americans make far more income than  the average American. Indeed, they make almost twice the income as the  average European American.\n\nOther groups that do tremendously well are the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…this is in  the proposal we are putting forth. That is not Elon Musk getting  breaks. That is not some rich billionaire getting a break. These are  everyday, working Americans who make this country operate every single  day.\n\nIt is a welcome change to what we saw over the last 4 years, when  they just kind of told people what they were doing behind…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…helped in this bill.\n\nThis is what the American Dream is all about, looking to Washington,  D.C., and finally seeing a Washington, D.C., that cares about the  everyday Americans who make America work every single day.\n\nFinally, I will say this about our President. My entire lifetime, I  have watched the chaos in the Middle East created by one nation,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}]