[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Supplemental Nutrition Assistance Program, or food stamps, from an  ongoing Republican assault.\n\nIn a few hours Republicans will meet to advance a bill that abandons  Americans who are struggling with the cost-of-living crisis. It guts  Medicaid, which covers health care for children, people with  disabilities, seniors, and low-income workers, and it cuts…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691427/supporting-the-democratic-womens-caucus-on-defending-snap-and-medicaid-cuts"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…things are very expensive. Our neighbors back  home are suffering a real affordability squeeze.\n\nEspecially when we are talking about energy, we know that 80 million  Americans are struggling to pay their utility bills right now. Look at  our home State of Florida, Mr. Speaker, where FPL and TECO were just  granted the largest rate hikes in history. That…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…running the show  and the agencies that have all too much influence here in the Halls of  Congress while electricity  prices are up well over 13 percent and 80 million Americans are  struggling to pay their electric bills. I say Americans deserve a whole  lot better. They deserve a whole lot better than what they are getting  from this Congress.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…continuing resolution. I will not support a bill that will continue the  Republicans' assault on Americans and their pocketbooks. At a time when  Oregonians and Americans are already struggling with rising costs, this  bill locks in devastating cuts to healthcare and drives up the cost, in  many cases, significantly.\n\nThe assault on healthcare and the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "Ms. POU. Mr. Speaker, across New Jersey and our country, Americans  are struggling with skyrocketing energy costs and are demanding relief.  Yet, that did not stop the congressional Republicans from repealing the  Energy Efficient Home Improvement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694884/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to take over Greenland, and selling  cryptocurrency out of the White House to enrich himself. None of this  creates jobs or lower costs for you or the millions of Americans who  are struggling. It is time for the President to focus on the real needs  of the American people.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699065/2025-economic-report-and-manufacturing-jobs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…as I mentioned, electricity prices are up 13 percent, and  natural gas prices are up 8 percent since the President took office.\n\nMr. Speaker, this holiday season, Americans are struggling to afford  record-high utility bills and skyrocketing grocery prices. Donald Trump  and the Republican Party were elected on their promise to bring prices  down. Instead,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…now, thanks to the congressional Republicans' backward energy  policies, electricity prices are climbing more than twice as fast as  inflation. More than 80 million Americans are struggling to pay their  utility bills, with many having to make the impossible choice of either  paying for medicine and food or keeping their lights on. I think it is  a disgrace…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…matters worse, this bill will  actually drive up monthly utility bills for American families.\n\nElectricity prices are up 13 percent across the country. Eighty  million Americans are struggling to pay their utility bills, and  Republicans want to make that financial pain even worse. Meanwhile,  grocery prices are surging, and, of course, monthly healthcare…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…promised to cut energy bills in half in  his first year, but that has not happened. In fact, electricity prices  are up by 13 percent across the Nation and 80 million Americans are  struggling to pay their utility bills.\n\nThese increases did not just happen. They were a direct result of the  Trump administration's disastrous policies, policies that have…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…millions of families.\n\nElectricity costs are now up 13 percent, as I mentioned. That figure  is even higher in some parts of the country, and more than 80 million  Americans are struggling to pay their utility bills. In fact, since  2023, household utility debt has risen over 30 percent.\n\nThis should be a red flag to President Trump and Republicans that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…eight Republican Senators.  These are Senators who may have had knowledge or even participated in  efforts to overturn the 2020 Presidential election.\n\nAt a time when Americans are struggling to get ahead, Republicans in  both the House and the Senate signed off on a deal that lines the  pockets of the very people who wrote it.\n\nIn every corner of my district,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…flatter the whims of  erratic leaders with insane ideas like renaming the Gulf of Mexico,  invading Greenland, annexing Canada, or reinstituting Alcatraz.\n\nWhile many Americans are struggling just to get by, the last thing  they want is a Republican tax bill that guts their healthcare and  denies food and housing to children and seniors so that millionaires…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "Mr. COSTA. Mr. Speaker, at a time when Americans are struggling to  afford groceries, housing, and gas, Congress should be focused on  lowering the cost of living that Americans care most about and not  renaming bodies of water.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Social Security Administration, guaranteeing that services for seniors  will suffer, or that the Trump Secretary of Agriculture just went on  television and told Americans who are struggling with food prices to  get a chicken.\n\nThat is why House Republicans want to talk about something else. That  is why we are here to debate and vote on this rule.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…34 percent more for their energy bills  than they were in 2010. Households simply cannot afford more expensive  mandates coming out of Washington.\n\nAt a time when Americans are struggling to pay their bills because of  inflation caused by the Biden-Harris administration's spending spree,  the Home Appliance Protection and Affordability Act takes important…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…former ambassador to Luxembourg.\n\nMr. Chair, I rise because we have an opportunity here to make the  world's best capital markets even better. In a period of time when  Americans are struggling with higher costs, we have an opportunity to  lower costs, and the legislation before us tonight accomplishes both of  those goals.\n\nOutdated capital market rules…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697826/increasing-investor-opportunities-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…down the value of our dollar, are now going to lecture us on  why groceries cost so much. Where the hell have they been for the last  4 years? Where were they when Americans were struggling with the cost  of their groceries because gas was up near $4 a gallon?\n\nTheir policies determined that when they ran all facets of the  government. Now, they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…who create, traffic, and sell the deadly  fentanyl that takes the lives of so many Americans.\n\nThis week, we will be taking another step to further support our  fellow Americans struggling with the deadly cycle of addiction by  passing the SUPPORT Act. This legislation will ensure our brave first  responders can access and administer Narcan to save the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…over that time period, the very people who were breaking  the law were actually getting free things, whether it be rent, phones,  cash cards, and other things that Americans were struggling to pay for  every single day.\n\nCleaning up this mess has become our responsibility, the new  majority, the new administration that has committed itself to actually…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Members and their  spouses from owning or selling individual stocks.\n\nIt is simple. Public service should never be a pathway to private  wealth, especially when everyday Americans are struggling. This is  about rebuilding trust in what we do.\n\nCongress works for the people, not to enrich our bank account. I am  proud to join my colleagues tonight on the other…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}]