[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…America's Health  Insurance Plans:\n\nMedicaid is indispensable to low-income people and working       families. If their Medicaid coverage is disrupted, these       Americans will lose access to primary care and be unable to       fill prescriptions for drugs to treat chronic illnesses. Many       will end up in the emergency room, the costliest site of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Madam Speaker, imagine being so ideologically  committed to destroying an imperfect healthcare bill that has helped  millions of Americans access care over the last 15 years that you would  block a vote--just a vote--to extend the lifesaving credits that help  keep millions of Americans on their healthcare.\n\nMadam…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698337/call-a-vote-on-healthcare-now"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…2010, the uninsured rate in  the United States was a staggering 18.2 percent. After the enactment of  the ACA, which significantly expanded coverage, around 45 million  Americans had access to either Medicaid or the ACA plans--and that is  that we actually cut by more than half the uninsured rate to an alltime  low in 2023 of 7 percent.\n\nNow, in my home…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…have seen extreme abortion bans enacted across the  country, including in North Carolina. Today, Republicans at all levels  of government are waging an all-out war on Americans' access to care,  pushing healthcare even further out of reach for millions of women.\n\nFirst they took away our right to choose, and then they took away our  healthcare coverage.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699244/womens-health"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…from the Department of  Veterans Affairs, undermining care for those who have served our  country.\n\nThe U.S. Forest Service is losing the very employees that provide  Americans access to our national treasures and public lands. These cuts  also threaten wildfire prevention as our State enters another critical  fire season.\n\nThe administration has fired…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…these critical programs to treat mental health and  substance abuse will be deprioritized or eliminated in favor of  Secretary RFK, Jr.'s, pet projects, like destroying Americans' access  to vaccines. He is going to prioritize that, and not SAMHSA and  substance abuse treatment.\n\nCongress has received zero information from the Trump administration  about…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…times, and stripping away healthcare for  political gimmicks only causes further harm. Therefore, we must  continue working to extend the ACA tax credits to ensure Americans have  access to affordable, reliable healthcare.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…prioritize their donors in  the oil and chemical business instead of protecting the health of their  own constituents.\n\nLet's not forget, while Republicans are attacking Americans' access  to clean air, they are also ramming through their big, ugly  reconciliation bill, which slashes funding for pollution reduction and  prevention programs, ends clean…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…election will get a  whole lot richer, and life will get more expensive for everyone else.\n\nThat is because this bill adds rocket fuel to Republicans' larger  assault on Americans' access to quality, affordable healthcare.\n\nRemember, Mr. Speaker, Republicans already slashed $1 trillion from  Medicaid, $500 billion from Medicare, and let Trump steal billions…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…worked  hard to try to extend them. We put forward a strong, compromised  proposal to extend the credits and keep health insurance affordable for  the close to 24 million Americans who access their healthcare through  the Marketplace.\n\nUnfortunately, time and again, Republicans voted against it, ensuring  that when the clock struck midnight on January 1,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…September, the Trump administration unveiled a more than $600  million bailout for coal plants to keep them online.\n\nIn October, while shutting down the government to deny Americans  access to affordable healthcare, the White House tried to claw back  billions in clean energy funds.\n\nThese actions are costly, and American families deserve better. We  should…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Original Colonies, allowing our  country to develop into one cohesive Nation. After the Colonies won  independence, the Post Office continued to grow, ensuring Americans  anywhere could have access to the information necessary to participate  in the democratic process.\n\nBut as the Post Office grew, there was one glaring gap in its  services. People living…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…have seen an increase of about $56 in their  monthly Social Security payments will be lucky to see $38 after premium  increases.\n\nThis administration continues to attack Americans' access to  healthcare and undermine affordability.\n\nThis is simply a disgrace.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697122/americans-access-to-healthcare-under-attack"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Lands Recreation Enhancement Act to provide free America the Beautiful  passes to law enforcement officers and firefighters.\n\nExpanding outdoor recreation and ensuring Americans can access and  enjoy our public lands is a shared bipartisan priority on the Natural  Resources Committee. Currently, the National Park Service offers free  national park and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…diagnosis, improving access to health care and  treatment, clinical trials, and funding for research for those battling  cancer. He is passionate about ensuring all Americans have access to  the medical care that could save their lives.\n\nWith this award, and all the hard work that came before it, Vince is  a shining example of why Ohio's 13th Congressional…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696703/recognizing-vince-marchetta-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…families and  businesses.\n\nThis legislation strengthens our posture. It gives us the visibility  we need  to stay ahead of threats, support domestic production, and ensure  Americans have access to secure, dispatchable, and reliable power.\n\nThe things that America makes are the things that make America great.  We do this with dispatchable power.\n\nMr. Chair,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697893/electric-supply-chain-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Our reforms to the  low-income housing tax credit are predicted to create 1.2 million  additional affordable housing units over the next decade, helping  millions more Americans access the high-quality affordable housing they  deserve. We have also passed legislation like the SPEED Act, clearing  away bureaucratic obstacles that are slowing down construction…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…insurance.\n\nA robust, well-regulated stablecoin market eliminates any  justification for a government controlled Central Bank Digital  Currency, or CBDC, which jeopardizes Americans' access to freedom,  privacy, and apolitical private capital.\n\nThis is an important point for all of my colleagues on my side of the  aisle who share my concern and opposition…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Premiums for All Americans Act is  our solution. It is the solution that the American people deserve.\n\nIt would lower healthcare premiums by 11 percent for all Americans,  increase healthcare access, expand choice in healthcare, and bring  about greater transparency to the healthcare system in the United  States.\n\nRepublicans are offering a clear, responsible,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…current process really makes no sense. It exacerbates check  fraud. It creates more bureaucratic hurdles for U.S. taxpayers and  ultimately makes it more difficult for Americans to access their hard- earned dollars. For many American families, a delay in getting their  tax refund has the potential to cause serious financial strain.\n\nThis bill, the Recovery…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…see this content online constantly? The answer is  Section 230.\n\nLet us stop pretending like the internet is new, novel, and worthy of  special treatment when 96 percent Americans access it. When the law  passed in 1996, the internet was in its early days long before the  average American spent nearly half the month online and nearly one in  six sales…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Democrat  shutdown is defunding important healthcare programs.\n\nAs chairman of the Health, Education, Labor, and Pensions Committee,  I led a bipartisan effort to protect Americans' access to affordable  over-the-counter drugs. The members of my committees worked together to  remodify the Over-the-counter Monograph Drug User Fee Program,  sometimes referred…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and that we do  not want to be like the Communists in Beijing. We must disintermediate  our banking system and allow for the creation of a CBDC. We must not  threaten Americans' access to privacy.\n\nThat is why I support this legislation, and I urge all of my  colleagues to do so, as well.\n\nIf my Republican colleagues really don't like a CBDC, then vote…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Congressional Review Act resolution, would overturn a  midnight rule issued by the Consumer Financial Protection Bureau, CFPB,  that undercuts the ability of lower-income Americans to access  liquidity.\n\nTo put it very simply, this CFPB's rule hurts the very consumers that  it purports to protect.\n\nOne of the likely outcomes of this rule being fully implemented…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…they are more affordable.\n\nWhile it took too many years for the Food and Drug Administration to  issue these regulations following my bipartisan 2017 law, I am glad  Americans now have access to safe, effective, and affordable hearing  aids over the counter.\n\nWhile we have known for years that hearing loss is a major factor in  a person getting dementia,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696431/national-audiology-awareness-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…manufacturing, strengthening our Nation's global leadership in advanced  technology. Furthermore, DRAM has led to the development of critical  devices that have improved Americans' access to technology, enhanced  our quality of life, and created millions of high-paying jobs,  including many in my home State of Idaho.\n\nIn the 57 years since this remarkable…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691716/recognizing-national-dram-day"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…lead agency in the  natural gas pipeline review process, empowering them to oversee  communication between agencies and streamline pipeline reviews and  approvals so Americans can access the energy they need on a daily  basis.\n\nMr. Speaker, the build-out of interstate natural gas pipeline  infrastructure is essential to ensuring domestic energy can be…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…insurance across State lines.\n\nAs we continue our efforts to lower costs for small business owners  and workers, this is just one step we can take to make sure that more  Americans can access high-quality, affordable healthcare.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on H.R. 6703.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…disastrous rule on overdraft fees.\n\nIn a time burdened by the 40-year-high inflation, when many middle-  and low-income households are living paycheck to paycheck, ensuring  Americans have access to affordable credit has never been more  important.\n\nOverdraft protection is an optional service that financial  institutions provide to help consumers avoid having…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}]