[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…be reform in the Insurrection  Act, not just to protect our citizens and our liberties at this  moment--this is our moment--but also the well-being and strength of the  American military.", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…``driving out the population.''\n\nThere is no mystery about what the agenda here is under the Netanyahu  government.\n\nYou know, we are here to debate a continuation of American military  weapons that are being used to implement the Israeli--Netanyahu-- Government policy. But we are doing it at a time when the horror of  starvation has become apparent…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…to  safeguard their investment is our decision, and I say it is not worth  risking the lives of our troops.\n\nThere are some deeply important questions as to the use of American  military power that are implicated in this debate--questions that  deserve answers.\n\nWill we see years of American gunships parked off of Venezuela as  part of some new, amorphous…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…realize that we have  servicemembers buried overseas in plots around the world.\n\nThe work of the American Battle Monuments Commission is broad,  reaching across 26 permanent American military cemeteries, over 30  memorials, monuments, and markers, in 17 different countries. I  encourage all those who have the opportunity to do so to visit one of  these cemeteries.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…communities of color?\n\nIn March 2025, the U.S. Army removed its web page honoring the 442nd  Regimental Combat Team, the all-nisei unit that became one of the most  decorated in American military history.\n\nThat is not a simple edit. It is not an accident. It is not an  oversight. It was an intentional action by this administration to push  a revisionist history…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Hegseth demands military leaders conform to his  interpretation of the law or be dismissed. This is profoundly  dangerous. It contradicts the ethic and the ethos of the American  military that is sworn to uphold the Constitution, sworn to obey the  laws of armed conflict. That dedication is to ensure that when our  personnel are disabled in the water,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Americans care about that?\n\nWell, first, it is this perpetuation of the same Bush-Cheney fantasy  that America can impose its will on a foreign nation through the power  of American military force.\n\nNow, for now, this looks and feels different than Iraq or Afghanistan  because there aren't hundreds of thousands of troops inside Venezuela,  but let's make…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…pro-military State in the United States. Our military bases,  our veteran population, our reservists, our Guard, our military  families, our DOD civilians--our map is a map of American military  history: Yorktown, Appomattox, the Wilderness, Fredericksburg, the 9/11  attack on the Pentagon. Everything about Virginia is connected to our  Nation's military mission.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…political debate; this is about the  institution of Congress and the congressional and constitutional limits  on Executive power. It is about insisting that before we commit  American military forces to combat operations, before we take lives in  America's name, we must have clear legal authority, credible  justification, and strategic coherence.\n\nIf this operation…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rise to introduce bipartisan legislation,  alongside my northwest Ohio colleague, Representative  Bob Latta.\n\nOur purpose is to honor a legendary Ohioan and pioneer of American  military history, Rear Admiral Alene B. Duerk.\n\nAdmiral Duerk was the first woman in the United States Navy to  achieve the rank of Rear Admiral. Our legislation would require…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697052/request-to-name-us-vessel-after-rear-admiral-duerk"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…reality.\n\nThe question before us is whether Congress will fulfill its  constitutional duty or whether we will abdicate our responsibility and  allow this President to commit American military resources,  credibility, and, potentially, American lives to an open-ended  entanglement without authorization or accountability.\n\nI urge my colleagues to support this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…while they were serving.\n\nNow, I would mention, in speaking of World War II, the Tuskegee  Airmen, and everybody would know about the Tuskegee Airmen, the first  African-American military aviators in the United States Armed Forces,  flying over 15,000 combat missions. They played a vital role in the  Allied victory in World War II.\n\nInstead of being defined…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…AI chips, which are crucial to the American economy.\n\nA war in this region would be a global catastrophe. Our Taiwanese  allies are already awaiting overdue delivery of American military  supplies.\n\nMr. McCORMICK. Mr. Chair, they are waiting for supplies they have  already paid for. This amendment sends the wrong signal at the worst  time. A withdrawal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…and I reserve the  balance of my time.\n\nMr. GILL of Texas. Mr. Speaker, I encourage my House colleagues to  support this bill naming a post office for Oscar Upham, an American  military hero.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…They are real. Our adversaries are evolving, and they  are not waiting for us to catch up.\n\nThis bill helps us stay ahead. It ensures that the American people  and the American military remain the arsenal of democracy. Above all,  it supports the men and women who wear our country's uniform and stand  ready to defend this Nation each and every day.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…accomplishments on the world stage.  President Trump restored American leadership and American strength. He  got rid of DEI woke ideology at the Pentagon. He focused on rebuilding  American military readiness and lethality and prioritizing the strength  of the American military over liberal leftwing politics. The result was  clear. He restored American leadership.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…deliberate and Member-driven approach of this process is a  testament to the leadership of my friend and fellow Oklahoman, Chairman\n\nTom Cole.\n\nThis package will strengthen American military superiority and fund  the E-7 Wedgetail program at Tinker Air Force Base. It also ends open- border policies of the Biden era, champions measures to make America  healthier,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699306/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…have worked so hard on and that came out of the committee with such  strong bipartisan support. It would provide a better quality of life to  the men and women of the American military and their families. It would  invest, in total, $852 billion in our national defense--expanding  shipyards, expanding munition production, creating stockpiles of  critical…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the       Islamic Republic of Iran . . . unless explicitly authorized       by a declaration of war.\n\nWith continuing threat from Iran against Israel, the dangers to  American military men and women in the region, and because of the  potential for terrorist acts upon U.S. interests within and without our  borders, I believe the President has the constitutional…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…begin with the Defense appropriations bill. Chairman Calvert  and his team have, once again, delivered a strong, thoughtful proposal  that makes  strategic investments in American military superiority, strengthens our  southern border, and, most importantly, takes care of our troops and  their families.\n\nI am especially proud that the rule makes in order…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…entrusted with. If we are to ask our young men and women to fight and  potentially give their lives, then we in this body can at least muster  the courage to debate if American military intervention is warranted.\n\nWashington's record of involvement in the Greater Middle East is  particularly abysmal, with dozens of campaigns costing thousands of  American…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}]