[{"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…standing up  to a President or to one's own party. Political courage can be hard;  regaining a freedom lost even harder.\n\nAnd above all else, here in the United States of America, we know  that we are not subjects to be ruled; we are citizens to be heard. This  is America. This is where freedom rings. And perhaps these sound like  lofty principles. Well,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…contributing positively to our society and to our economy, not people  like Nelson and Gladys Gonzalez.\n\nI am all for a secure border, but what we are seeing today is not the  America that I know.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690924/recognizing-gladys-and-nelson-gonzalez"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is join Democrats in voting for legislation that  expands the credits by 3 years. It will be done. It passed the House.  But mark my words, if Republicans don't do it, America will know, and  the political price they pay will be severe.\n\nAnd so to rectify this injustice, to rectify the fact that families  are deciding whether to even have healthcare…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…National Guard troops confronting peaceful  protesters--are a chilling reminder of how far we have strayed from my  democratic values that we claim to uphold.\n\nThis is not the America I know. This is not the America we aspire to  be. We are a nation built on justice, compassion, and the unwavering  belief that every person deserves dignity and respect. What…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692239/ice-raids-in-california"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…hear story after story. Tonight you  will hear Democrats standing up for the American people and staying  here tonight for however long it takes. That is because we want America  to know that we are standing up for Medicaid.\n\nI will not be silent. I will fight for lives like Sandra's and  Naomi's.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691412/sandras-story-why-medicaid-matters"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…seeing at this very moment. Together, we are using every  legislative tool at our disposal to fight back against these reckless  actions.\n\nMr. Speaker, I, once again, want America to know that the Democrats  and the Congressional Black Caucus and all of the other tri-caucuses  are fighting every single day for you. We are using our voices to speak  up and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…tens of millions of people have the ability to go see  a doctor when they need one in this great country of ours.\n\nWe have an affordability crisis in the United States of America. We  know that healthcare costs are out of control, housing costs are out of  control, and grocery costs are out of control. There is an  affordability crisis that needs to be…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698592/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is treating  average families--working families--in so many ways, and I know he  intends to hold the floor for a long time to make sure that that is the  case in letting America know how bad this is.\n\nNow, our healthcare is the main focus right now, and it is amazing, I  would say to my colleague: Isn't it incredible that all of these cuts  they are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…people getting kicked around because of  the countries they came from and color of their skin.\n\nI speak from personal experience having worked as a missionary in  Central America. And I know the kinds of people who come here, and I  know why they come here. They come for the same reason my great- grandparents came here from Ireland in the late 1840s--because…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…far-right government be in trouble--with $20 billion and maybe  $40 billion.\n\nThink of how much money that is. That is $100 for every single person  in the United States of America. You know, if I went door-to-door in  Oregon and personally asked everybody, ``Would you like to give $100 to  Argentina?'' do you know how many takers I would have?\n\nMr. MERKLEY.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…standing here and telling these stories? These are  stories that I am sure people in your district and your colleagues have  heard also.\n\nWell, we come tonight because we want America to know how important  our work is, but more importantly, we want America to know that  Democrats are standing up for them. We are united in this single cause  because it is our…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…think it will get them what  they want. That is why we are in the fight to stop unauthorized wars,  to stop the daily assault on our communities, and to restore the  America that we know and to save American lives.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699066/venezuela"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that prohibits them from selling to  markets they have had?\n\nThen the second thing I noticed--and I really am interested in this  because rural America is the heart of America, you know, with the  wonderful community values folks have--family values--  hard work, service. We have got a billionaire who is the Secretary of  the Treasury. In my understanding--I…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…households with more than $15 billion in  additional costs each month. This includes the tariffs on Brazil, one  of the main sources of coffee for the United States of America. And,  you know, we are just waiting for our constituents to roll up to their  Dunkin Donuts, if you are in Rhode Island, and order a small coffee:  That will be $15, please.\n\nThat…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…heard the stories of our parents. You have heard the stories  of our grandparents. We just don't come tonight for a Special Order to  tell you our stories, but we want America to know that we are  suffering. We want America to know that we stand with them in this time  when we are in trouble.\n\nJust last night, I was on a call with Win With Black Women…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…I will be watching  closely to ensure that rural America gets a fair shot--nothing more  than the law requires. When medical students have a chance to train in  rural America, we know that they are more likely to stay in rural  America.\n\nFinally, I want to applaud the University of Dubuque for announcing  the John and Alice Butler College of Osteopathic…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690631/medical-student-match-day-achievement"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…percent of what President Biden added to the debt over  the last 4 years. Yet, Democrats are saying that these savings are  cruel. They literally said this will destroy America as we know it. No  one outside of the beltway will take them seriously.\n\nHave my Democratic colleagues even looked at what is in this bill  before attacking? Is it cruel to suggest…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692542/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Soros funding, foreign funding, nation-states  all pouring into organizations, NGOs driving this agenda, the Marxist- Islamist red-green alliance that wants to destroy America as we know  it. I introduced legislation to take away CAIR's tax status.\n\nWhy are we giving them tax breaks to try to destroy America?\n\nThat brings me to the final point which I…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…are against this bill and all the things  that are in this bill for hardworking families, you would think the  last 4 years things have been going great for middle America. I don't  know what parallel universe they have been living in, Mr. Speaker, but  we heard the message that the voters sent who said they are sick and  tired of high inflation, of…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…appearance on the House floor  to push back against about this.\n\nAmericans should think about this. Democrats are pushing back on this  because they don't want the citizens of America to know what special  interest aliens, who participated in suspicious travel patterns, came  into our country illegally in 2021, '22, '23, and '24. Because you know  how many…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Constitution and our way of life.\n\nIn moments like these, we must all come together to reaffirm our  commitment to protecting the peace and civility that define the America  that I know and love.\n\nMr. COMER. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. COMER. Mr. Speaker, I join my House colleagues in offering my…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…share of  the debt. The average person or the average American in the budget  coming up this year will be spending about $20,000.\n\nMr. GROTHMAN. One more time, remember, America has to know that 26  percent of every Social Security dollar, 26 percent of every new tank,  20 percent of every new education dollar is borrowed, at a time where  interest costs…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688024/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…to examine international  economic data and represent small business interests in trade  negotiations, ensuring that our small business people are not left  behind.\n\nAmerica, as we know it, can't exist without small businesses, and  this bill will give them a leg up to make the American economy even  stronger.\n\nI urge my colleagues to support both of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}]