[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…research funding  rather than cut it. I am very thankful for that. I hope we will do the  same here in the House.\n\nMr. Speaker, I appreciate the commitment to investing in America's  future. We in the House should do the same. We need to invest in  science and not undercut it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…basic services have been attacked by the administration and defunded in  the Republicans' big, ugly bill.\n\nI said this to Secretary Hegseth in our hearing last month: America's  future servicemembers are learning in our public schools. They might  rely on Medicaid to see a doctor. They may only have a meal to eat  because of WIC or food stamps, or they…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…are at risk. Senior citizens, in  their golden era, could have Medicaid--the rug--pulled out from under  them, leaving them in dire straits. The investments that unlock  America's future now stand on the edge of a knife.\n\nWhy? Why? Why are Republicans doing this? Why are they being so  cruel? so callous? so thoughtless? Why are those in the billionaire…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…education, K-12, higher education, post grad, and lifetime learning for  our workers. They are cutting education to give tax breaks to the  richest people at the expense of America's future, the education of the  American people.\n\nThe Court's disregard for the authority of the legislative branch  empowers executive overreach at the expense of accountability…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693631/layoffs-at-the-department-of-education"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…energy is simply not  sustainable.\n\nThe majority party and the Department of Energy, meanwhile, under the  current administration, are rolling back energy investments in  America's future to help lower costs. I represent the most important  domestic solar manufacturer, First Solar. I don't take money from them,  and I don't own their stock. What they have…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700228/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…March 2024, spent more       than $81 million, about $67 million of which went to super       PACs.\n\nAnother major supporter of Trump's presidential bid was       Building America's Future, a 501(c)(4) nonprofit that       reportedly received funding from Musk. It contributed more       than $35 million to super PACs that spent heavily on       seemingly…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…scientists from the Federal  workforce but also defunding science and the scientific research at our  Nation's premier institutions. These are exactly the people who create  America's future.\n\nIn his skinny budget request, the President proposed a $5 billion cut  to the National Science Foundation, including $1 billion in STEM  education and workforce programs.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…efforts.\n\nLet's not forget small businesses are a cornerstone of this country.  The innovation we stimulate within this sector is not just important,  it is vital for America's future. This legislation does not simply  propose research collaboration. It carves a path for our small  businesses to lead the way.\n\nIt mandates a collaborative report within…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687907/doe-and-sba-research-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…middle class, that powers our  industries and continues to light the way toward a more prosperous and  inventive future.\n\nBy standing up for inventors, we stand up for America's future.  Because what America makes and grows, makes and grows America.\n\nI urge my colleagues to join myself and Congressman Thomas Massie in  supporting this vital legislation.", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696400/reintroduction-of-the-balancing-incentives-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise in fierce objection to the hasty,  ill-considered decisions made by the new administration that undermine  new investment in America's future energy and manufacturing systems.\n\nRather than enhancing new energy generation and bolstering good- paying jobs in the United States of America across all energy sectors,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I rise today to sound an alarm on  a crisis threatening America's future. I am talking about the Trump  brain drain.\n\nDonald Trump and Republicans in this House are launching a full scale  assault on our Nation's ability to think, learn, and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…September.\n\nThanks to computer science teacher Mike Leffler and Robotics Club  adviser John Stout for lighting the way for these bright, young minds  who are going to lead America into the future and beyond.\n\nMr. Speaker, I am just so proud of them.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699254/perkins-high-school-stem-achievement"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…its own, so I will leave it  down so it doesn't scare us all again.\n\nMr. Speaker, I thank my colleagues in the Western Caucus for leading  the charge to strengthen rural America's future.\n\nAs a fourth-generation North Dakotan, I have seen how the hard work  of our energy and agriculture producers fuels our economy, strengthens  our communities, and secures…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…plan is not only to take the  indicted leader of the country--who is a horrible person--and put him  in jail but to change the country in a way that doesn't threaten  America in the future, in that it will not, in the future, be a drug  haven for cocaine to be dumped into our country, and it will not be a  safe haven for Hezbollah and other drug cartels.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…environmental stewardship. May God continue to bestow his example as a  guide to defend religious freedom, choose cooperation over conflict,  and secure a healthier, safer America for future generations.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…a direct result of  our One Big Beautiful Bill Act. This will mean stronger borders, safer  Texas communities, and definitely greater peace of mind for our  families.\n\nAmerica's future is shining brighter than ever. With the economic  policies of the One Big Beautiful Bill Act to lower costs, increase  wages, and expand job opportunities, I know America's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…struggling with this, but more  importantly, it is about the future of both the financial sector and  the technological sector.\n\nA vote for the CLARITY Act is a vote for America's future and  America's leadership. I urge all my colleagues to vote ``yes'' on the  CLARITY Act. I yield back the balance of my time.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…Confucius Institutes and Chinese Entities of Concern  Act.\n\nMr. Speaker, this legislation is about one thing, and that is  protecting American students, American research, and America's future  from malign foreign influence, especially from the Chinese Communist  Party.\n\nThe CCP is engaged in a persistent strategic campaign to influence  every corner of American…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690829/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…our  lives, elevate our ideals, and deepen our tolerance and strengthen our  determination to make this world a better place. You couldn't make a  better investment in America's future.''\n\nInvesting in Arkansas' future, igniting that spark, starts here. This  is why programs like High Impact Movement are so important not only for  our young people, but…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with the provisions that Republicans enacted through  the reconciliation bill, this CRA will ensure that American energy  remains affordable, reliable, and abundant.\n\nAmerica's future is bright as we unleash responsible natural  resources development to meet our energy and mineral leads, to create  jobs, and to drive economic growth across the country.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…ensuring that Alaska's wealth stays in the ground, unavailable to the  people of one of America's most impoverished regions.\n\nThe plan also obstructs projects vital to America's future, such as  the Ambler Road, which will bring access to strategic and critical  minerals; and the Alaska LNG project, which is projected to deliver 3.5  billion cubic feet…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…American Dream, while we fought and  will continue to fight to protect it.\n\nThe One Big Beautiful Bill Act is an investment in America's  families, America's workers, and America's future. We are lifting up  the middle class, restoring fairness, and proving once again that,  under Republican leadership, the American Dream is alive and well.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694797/promises-made-promises-kept"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…police, abolish prisons, and give illegal  immigrants free healthcare. That is who the Democrats have chosen as  the mayor of New York City. That is the Democrats' vision of America's  future. It is a dangerous vision. It is a destructive vision.\n\nOne year ago, Americans chose a better path. They chose safety,  prosperity, and common sense. As a result, today,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…bipartisan legislation that I am proud to lead  alongside my colleague Representative Darren Soto.\n\nThis bill is about far more than emerging technology. It is about  securing America's future, economically, strategically, and  technologically, in an increasingly digital world.\n\nBlockchain technology is not a passing trend. It is a foundational  innovation that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…perfectly clear:  U.S. elections are for U.S. citizens only.\n\nThis is not extreme. It is common sense. Citizenship matters.  Sovereignty matters. Americans alone must decide America's future.\n\nYet radical Democrats have abandoned the standard. New York City has  allowed noncitizens to vote in local elections. Washington, D.C., has  done the same, granting…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…chamber, I recognize its vital role in  driving regional economic growth, fostering job creation, and  supporting businesses of all sizes as they innovate and invest in  America's future.\n\nMr. Speaker, I thank the board members, staff, membership, and  partners who have worked together to promote and improve our region.  They have fostered a commitment…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694122/recognizing-central-pennsylvania-chamber-of-commerce"}]