[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…delusional, diabolical, destructive, and dangerous. These have  been doozy policies and politics that are doing nothing but hurting  America, and especially Black Americans.\n\nWe are also going to be talking about so many of these policies that  seem uniquely targeted to focus on the place and the progress of Black  Americans. Make no mistake, if you are…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…to rise to talk about the serious  healthcare crisis and the affordability crisis that is affecting our  Nation. In just 2 days, on Saturday, November 1, millions of Americans  are going to go online to sign up for their 2026 Affordable Care Act  health insurance plan.\n\nAs we know, keeping healthcare affordable is a key priority, and I  see that the…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…KHANNA. Mr. Speaker, the stock market is decimated, almost 20  percent down, entering bear territory. At the same time, bond yields  are skyrocketing, meaning ordinary Americans are going to have higher  interest rates on their credit cards and their mortgages. It means we  are going to have to pay more on our debt.\n\nAt the same time, the dollar is declining…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the way up. Life is getting more expensive  for the American people.\n\nNothing in this reckless rescissions package is going to make life  more affordable for everyday Americans. It is going to complicate their  life even further just like what happened with the one big, ugly bill.\n\nMr. Speaker, we are strongly opposed to this legislation. This is  legislation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…it is working-class Americans and middle-class Americans who built the  country. The genius lies not with billionaires and technologists. It  lies with hardworking Americans. We are going to build this country  back from the bottom up. That is our belief.\n\nI appreciate Representative Deluzio's leadership on this.\n\nMy friend, Fareed Zakaria, had this…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…ranchers are getting  their healthcare this way. And then we think about the fact that this  issue is disproportionally affecting red States, not just blue States.\n\nAll Americans are going to be hurt. This is why your ringing the  alarm is so important. And I would ask a very simple question: Is there  a connection between the healthcare crisis that we…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…through the ACA marketplaces, but Republicans refuse to extend these  tax credits for middle-class Americans in their big, ugly bill.\n\nIf we don't act now, millions of Americans are going to be hit with  huge premiums for the upcoming year. The nonpartisan Congressional  Budget Office has estimated that these premium increases will lead to  4.2 million…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695820/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Godot never shows up. And this healthcare  solution that the Republicans have been promising for 15 years--it is  not going to show up tomorrow. As a result, 22 million Americans are  going to lose their coverage. They are going to have to pay  exorbitantly higher prices for their healthcare coverage than they have  to pay today.\n\nSo this week, Trump, in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…through hoops to  exempt noncontiguous States from these policies to pass cruel  legislation. That is why we are up here writing legislation on the fly  to protect some Americans while going after others.\n\nNo one should go hungry, whether they live in Connecticut, Alaska,  Hawaii, or anywhere. It should not matter where you live or what kind  of deal your…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693232/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…driving up costs for the average American.\n\nThe Republican Party let the Affordable Care Act enhanced premium tax  credit expire without any safety net, so millions of Americans are  going to lose their health insurance. Some have already decided not to  sign up because they can't afford it. They are going to lose their  health insurance. We will have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…legislation that it brings forward.\n\nThis is an alternate reality, this floor, when I am hearing from  Republican colleagues who are not talking at all about the millions of  Americans who are going to be harmed by these destructive bills.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691941/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…for a whole range of things.\n\nNow, I represent a State that makes up 1 out of every 10 Americans.  It is the fourth largest economy in the world. So 1 out of every 10  Americans is going to be deeply impacted, and, of course, if you add  all of the other States that have adopted this higher standard for  their citizens, it may be more like 1 out of every…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…tomorrow from their insurance carriers. Around 24  million people are going to get letters anytime from now until mid- November, and they are going to pay. Now, 24 million Americans are  going to be told that because of the last tax bill that was just  enacted by Trump and the Republicans, people are going to be paying an  average of 114 percent more per person…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Administration. Their job is to review,  among other things, medications that can provide life-enhancing,  lifesaving, life-extending, pain-relieving medications that Americans  are going to need and can benefit by. The sooner that work of  investigation gets done, the sooner that the approval decisions can be  made, the sooner cures get to market and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that our healthcare system is broken and  costs continue to spiral out of control.\n\nHowever, it is also true that suddenly withdrawing premium support  from 22 million Americans is going to force those folks into a terrible  dilemma: either paying hundreds or thousands of dollars more, so they  face hard trade-offs for their families, losing their insurance…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…fair.\n\nHowever, the good news is that with this new bill, there are  incentives to get back into the workplace. The latest numbers that came  out indicate 10 million Americans are going to be going back to work.  The odds are they will actually get health insurance paid for by their  employer or, because they are earning more money, they can afford…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…emergency room. And those wait times will get  longer and longer for all of us.\n\nNext month, we are going to find out how much health insurance  premiums go up. For some Americans, they are going to double. But for  all of us, they will go up.\n\nHealthcare is getting costlier, and Americans are getting sicker. So  why am I standing on this floor tonight saying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}]