[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…suggest we withdraw this amendment, with all due respect  to my friend from Texas, because surely he would not want to go against  the Constitution of the United States of America.\n\nMr. Chair, I also want to say that I am honored to serve as the  ranking member. I would rather be chairman. I am honored to serve as  the ranking member with the distinguished…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…colleagues to reject this resolution that  merely distracts and deflects and scapegoats instead of solving the  pressing challenges facing farmers and the rest of rural America.\n\nMr. Speaker, the question has been posed about whether this ESA  listing of the longfin smelt is supported by science. I guess this  Congress, in all of its infinite mastery…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…her  outstanding leadership, her indelible mark that she left on Walnut  Creek and the San Francisco Bay Area, the State of California, and,  indeed, the United States of America.\n\nMr. Speaker, I thank my friend, Gwen, for her service and incredible  personality.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697386/recognizing-gwen-regalia"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Subcommittee on  Health looks at but that every policy interconnects so that we are  looking at, studying, and funding research on how, holistically, we  improve health in America.\n\nMr. Speaker, I have heard time and time again that we don't have a  healthcare system. We have a sick care system. We need to get back to  the basics of making sure that we…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…resolution.\n\nWe will continue to stand on the side of the American people to solve  problems for hardworking American taxpayers to make life more  affordable and to ensure that in America, Mr. Speaker, when you work  hard and play by the rules, you should be able to provide a comfortable  living for yourself and for your family. You should be able to educate…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688227/solving-problems-for-the-american-people"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Ukraine to continue to valiantly  fight against Russian aggression.\n\nRussia is not our friend. They are our enemy. Vladimir Putin is a  sworn enemy of the United States of America.\n\nMr. Speaker, why is it Republicans in this bill are once again  undermining Ukraine?\n\nUkraine stands on the side of democracy. Ukraine stands on the side  of freedom. Ukraine…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…that have come out of this administration in just the  last 100 days. They are terrifying. Not only are they terrifying for  Black America, but they are terrifying for all America.\n\nMr. Speaker, I am going to happily close out this CBC Special Order  hour and remind America that we will be back again next week with more  information, more receipts, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans would game the  system is an insult to their service and sacrifices. This decision  abandons our values. It punishes the very people who kept their promise  to America.\n\nMr. Speaker, it is our turn to keep our promise to them. I urge my  colleagues to support the FAIR Act and send a clear message: We don't  let veterans fall through the cracks.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, I thank the distinguished gentlewoman from  Georgia for her extraordinary leadership for gun safety and public  safety in America.\n\nMr. Speaker, this bill would rip a dangerous new loophole in the Gun  Control Act by changing the definition of firearm throughout the entire  criminal code to exclude from…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…many constituents who are on Medicaid  and Medicare and who receive SNAP benefits. Yet, the savings will go to  the fat-cat executives and shareholders, the wealthiest in America.\n\nMr. Speaker, we are asking for the American people to be alert of the  Republican budget betrayal, that it is a life-or-death matter and puts  their lives in danger by denying…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…her passion, though. I only wish she had  the same passion to speak out against the Trump administration's mass  deportation of Venezuelans legally in the United States of America.\n\nMr. Speaker, if this truly was about addressing drugs, then tell me  why the administration pardoned Ross Ulbricht, who ran one of the  largest online drug marketplaces in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…No. 2310 be set aside so I may offer my amendment No. 2349,  which would stop the corruption in stablecoins for any elected Federal  official of the United States of America.\n\nMr. MERKLEY. Mr. President, I hear an objection from my friend and  colleague, the head of the Banking Committee. Would my friend and  colleague explain why we shouldn't, while we…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…a ``yes'' vote on this bipartisan motion so that we  can take a meaningful step forward in this Congress to address the  healthcare crisis in the United States of America.\n\nMr. JEFFRIES. Mr. Speaker, we have an opportunity in this Congress in  a bipartisan way to address the healthcare crisis in this country and  to make sure that tens of millions of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698592/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…hatred against any group, you are a danger  to American constitutional democracy, and we should not allow it to  gain a foothold in the Government of the United States of America.\n\nMr. Speaker, let us adhere to the spirit of President George  Washington, who said in his famous letter in 1790 to the Hebrew  Congregation of Newport, Rhode Island, that ``the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…many brilliant and beautiful ways.  Some people know about this movie ``Forest Gump.'' It kind of captures  in a lot of beautiful ways this plight of the 20th century America.\n\nNow, Mr. Speaker, I am a millennial. I was born in 1983, not 40 years  after the conclusion of World War II but almost. Of course, the  millennials, as we were closing out the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…projects indefinitely and stops us from bringing  critical energy sources online. It also deters investment in our  communities. Make no mistake: Permitting is holding back America.\n\nMr. Chair, H.R. 3898, the Promoting Efficient Review for Modern  Infrastructure Today Act, also known as the PERMIT Act, aims to unleash  the American economy. It is a package…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Boyhood,  Basketball, and Hometown Spirit.''\n\nThis book is not only a salute to Bessemer, but the tough, resilient  communities across Michigan's Upper Peninsula and middle America.\n\nMr. Speaker, 60 years ago this week, the Bessemer Speedboys  basketball team ended a 42-game losing streak, at the time, the longest  in Upper Peninsula high school basketball…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699192/recognizing-thomas-pelissero"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…building stronger fathers is building a stronger Spokane  and a brighter community for every child in our community.                        Honoring Scouts Across America\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to honor Scouts Across  America. Scouts Across America carries forward with a remarkable legacy  that began with Robert Baden-Powell, a British…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. I will do everything  I can to protect this program against the Governor and the  legislature's reckless policy.                         Supporting Teach For America\n\nMr. KILEY of California. Mr. Speaker, I will take a few moments today  to share with folks here in D.C. and across the country a little bit  about a program that I am an alumnus…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…dollars  and controlling the power of the purse. Through bipartisan, bicameral  negotiations, led by appropriators, we are turning priorities into  action and putting America first.\n\nMr. Speaker, this package demonstrates the value of Congress by  delivering results for communities in Utah and across the country.\n\nMr. Speaker, I urge my colleagues to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…over three-quarters of the American people.\n\nI want to see them try. I think if we do it, I think we will win, and  I think we will save this Republic, and we will save America.\n\nMr. ROY. Last year, we had five Democrats join with us and, this  year, four Democrats joined with us. I think there will be pressure for  a number of Democrats to join with…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…fundamental reforms to defense acquisition that started  in our committee and supports a fighting force that will stand against  those who threaten the United States of America.\n\nMr. Speaker, as the chair of the Subcommittee on Strategic Forces, I  am proud the compromise product builds on the subcommittee's work to  enhance our National Security Space…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…terrorism and best practices to prevent an act  of violence from happening in the first place.\n\nThis bipartisan bill is a much-needed step toward safer classrooms  across America.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, the reality is that school shootings and acts of  targeted violence continue to devastate towns and communities across  this country.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…drug addicted, and their families  are suffering. For every death, there is, in fact, a broken  relationship somewhere. That is not 100,000 in America. That is  millions in America.\n\nMr. Speaker, I don't know of an American that you talk to about  fentanyl who won't tell you that they know someone whose family, their  health, or their child has been destroyed…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…influential  leaders at the Arizona Capitol. She received the Family Champion award  from Focus on the Family and received the William Wilberforce Award  from Students for Life of America.\n\nMr. Speaker, I am grateful for the work of dedicated individuals like  Cathi who relentlessly strive to promote policies that protect the  dignity of every Arizonan. I wish…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690597/congratulating-cathi-herrod-on-retirement"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…violent gang  members, these MS-13 gang members. For some reason, some of our  colleagues want to go down and hug a thug or something and see these  folks down in Central America.\n\nMr. Knott was helping prosecute these folks, and I know the  prosecutors were very frustrated at the time with what they were seeing  with these open borders. I appreciate,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…business, or: It is creating a culture  war.\n\nThis is about the rule of law. This is about cities thumbing their  noses at taxpayers. You aren't entitled to Federal funds in America.\n\nMr. Speaker, there is a way to keep these offices in these cities:  Stop being sanctuary cities. Comply with the law.\n\nWhen did complying with the Federal law become something…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Deal at the expense of the  enhanced tax credits they talk about.\n\nWe want to solve it. Mr. Speaker, $39,000 is what is brought up for  healthcare. That is the problem in America. Mr. Speaker, $39,000 for  health insurance is what we have to fix.\n\nMr. GUTHRIE.\n\nMr. Speaker, we are here to solve the problem for all Americans. Mr.  Speaker, 20 million…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Federal Reserve of New York when they say that to cap this fee  to do price intervention here is to deny credit and deny this product  to the hardest working families in America.\n\nMr. Speaker, I urge a ``yes'' vote, and I yield back the balance of  my time.\n\nMr. HILL of Arkansas. Mr. Speaker, on that I demand the yeas and  nays.\n\nThe yeas and nays were…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Huntsville, Alabama. We are making America safe and secure again.\n\nThis is a responsible bill that supports law enforcement, strengthens  national security, and puts America first.\n\nMr. Speaker, I thank Chairman Cole, Ranking Member DeLauro, and  Chairman Rogers for their steady leadership throughout this process,  and I thank the subcommittee staff…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]