[{"senator": "Linda Sánchez", "party": "Democrat", "sentence": "I am here to stand up against a bill that kicks 17 million Americans  off of their healthcare, a bill that cuts school lunches and food  assistance to children who go to bed hungry every night, a bill that  includes billions of dollars for ICE, an already bloated agency that  has been upending due process and racially profiling people in my  district for weeks.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Instead of fighting for the American people, President Trump and  Republicans have spent the past year seeking to strip millions of  Americans of healthcare, food assistance, student loan support, and  much more that is vital to their quality of life and, for many of them,  their very survival.", "title": "Healthcare", "date": "2025-10-28"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Speaker, today, thanks to the persistence of the American people,  because millions of constituents have called their Members of Congress,  shown up at townhalls, shown up and marched in the streets, because of  parents who spoke out for their kids, for doctors who spoke out for  their patients, neighbors who mobilized together, today, Congress has a  chance to vote for Americans' healthcare.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "More than 20 million  Americans who get their healthcare on the ACA exchanges are going to  see their premiums skyrocket next year.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "The Republican big, bad betrayal bill is unpopular everywhere in the  country no matter how you spin it because Americans know that kicking  17 million Americans off of healthcare just so you can give a $7  trillion tax break to the wealthiest billionaire donors and giant  corporations is outrageous, and the American people want us to roll it  back.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "In 2 weeks, 22 million Americans will see their healthcare premiums  double, triple, or quadruple, costing them hundreds of additional  dollars a month, and more than 4 million Americans will lose their  coverage entirely.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Since the beginning of this year, Democrats have been trying to work  in good faith with Washington Republicans to extend these ACA enhanced  premium tax credits and protect Americans' healthcare coverage.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": null}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "Millions of Americans  are about to see their healthcare costs rise exponentially.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "It is a  healthcare monstrosity, which cut $1 trillion from Medicaid, cut out  premium subsidies for 22 million Americans for their healthcare  exchange plans, and now will suffocate the growth of our Nation's  caring professions.", "title": "Nursing Excluded As ``professional'' Degree By Department of Education", "date": "2025-12-01"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Late Sunday night, the House Budget Committee, on which I serve as  ranking member, passed out, with only Republican votes, a draconian tax  bill that cuts almost 14 million Americans off their healthcare and  ensures a few million more lose their food assistance.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Well, what is really happening out there is that we are in a  healthcare crisis, and that is because the big beautiful betrayal of a  bill will kick 15 million Americans off their healthcare, force  hospitals, health clinics, and nursing homes to close.", "title": "Healthcare", "date": null}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "My colleagues across the aisle who support this bill are voting to  cut 17 million Americans off from their healthcare--including 173,000  Minnesotans.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Yesterday, the Republican Study  Committee, which constitutes a majority of the House Republican  conference, released yet another new plan to unleash another set of  harmful partisan changes to Americans' healthcare.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Madam Speaker, imagine being so ideologically  committed to destroying an imperfect healthcare bill that has helped  millions of Americans access care over the last 15 years that you would  block a vote--just a vote--to extend the lifesaving credits that help  keep millions of Americans on their healthcare.", "title": "Call A Vote on Healthcare Now", "date": "2025-12-17"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "If they want to find a way forward that  reduces the harm to Americans and our healthcare, we can.", "title": "Government Funding", "date": null}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Hospital at home has been a proven success for getting more  Americans the healthcare that they need.", "title": "Hospital Inpatient Services Modernization Act", "date": "2025-12-01"}, {"senator": "John Thune", "party": "Republican", "sentence": "So you have got, in  the individual marketplace, which is the blue here, almost 50 percent  of Americans--that is about 150 million Americans--who get their  healthcare coverage through their employer.", "title": "Healthcare", "date": "2025-12-10"}]