[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Harris\n\nUnited States Senator\n\nRon Wyden\n\nUnited States Senator\n\nAmy Klobuchar\n\nUnited States Senator \n\nCory A."}, {"senator": "Kamala D. Harris", "party": "Democrat", "sentence": "Durbin (D-IL), Amy Klobuchar (D-MN), and Maria Cantwell (D-WA)."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "The bill is cosponsored by Senators Jack Reed (D-RI), Patty Murray (D-WA), Elizabeth Warren (D-MA), Mazie Hirono (D-HI), Ed Markey (D-MA), Tammy Duckworth (D-IL), Bernie Sanders (I-VT), Jon Tester (D-MT), Dick Durbin (D-IL), Sheldon Whitehouse (D-RI), Sherrod Brown, (D-OH), Tim Kaine (D-VA), Tammy Baldwin, (D-WI), Chris Van Hollen, (D-MD), Bob Menendez (D-NJ), Cory Booker, (D-NJ), Bob Casey (D-PA), Jeanne Shaheen, (D-NH), Amy Klobuchar (D-MN) and Richard Blumenthal (D-CT)."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senator Amy Klobuchar (D-MN), Ranking Member of the Senate Rules Committee with jurisdiction over federal elections, pushed back on the White House and Senate Republicans today following the decision to proceed with a Republican nominee to the Federal Election Commission while refusing to nominate a Democratic candidate."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "Durbin (D-IL), Jeanne Shaheen (D-NH), Richard Blumenthal (D-CT), Jacky Rosen (D-NV), Doug Jones (D-AL), Jack Reed (D-RI), Amy Klobuchar (D-MN), Edward J."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-MN) and Tina Smith (D-MN) announced that the U.S."}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Senators Tom Udall (D-N.M.), Doug Jones (D-Ala.), Patty Murray (D-Wash.), Dianne Feinstein (D-Calif.), Amy Klobuchar (D-Minn.), Ron Wyden (D-Ore.), Richard Blumenthal (D-Conn.), Elizabeth Warren (D-Mass.), Cory Booker (D-N.J.), Maria Cantwell (D-Wash.), Kamala Harris (D-Calif.), Gary Peters (D-Mich.), Jacky Rosen (D-Nev.), Catherine Cortez Masto (D-Nev.), Brian Schatz (D-Hawaii), and Michael Bennet (D-Colo.)."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "The legislation is co-sponsored by Senators Debbie Stabenow (D-MI), Patrick Leahy (D-VT), Sherrod Brown (D-OH), Amy Klobuchar (D-MN), Michael Bennet (D-CO), Kirsten Gillibrand (D-NY), Robert Casey (D-PA), Tina Smith (D-MN), and Charles Schumer (D-NY)."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-MN) and Lisa Murkowski (R-AK) introduced legislation to combat the rise of hate crimes."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Amy Klobuchar (D-MN), Brian Schatz (D-HI), Sherrod Brown (D-OH), Tom Carper (D-DE), Ed Markey (D-MA), Tammy Duckworth (D-IL), Richard Blumenthal (D-CT), and Chris Coons (D-DE)."}, {"senator": "James Lankford", "party": "Republican", "sentence": "I encourage my colleagues to support this amendment to encourage Americans to give more to non-profits in our communities as they continue to support our nation's vulnerable individuals and families in need.\"\n\nThe amendment was cosponsored by Senators Chris Coons (D-DE), Amy Klobuchar (D-MN), Mike Lee (R-UT), Tim Scott (R-SC), and Jeanne Shaheen (D-NH)."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "In April, Senator Casey led a letter with Senators Murkowski and Amy Klobuchar (D-MN) to Senate leadership and appropriators requesting an additional $100 million for FVPSA, an FVPSA set-aside for Tribes and Tribal organizations and at least $100 million for the Centers for Disease Control and Prevention to coordinate public outreach to hard-to-reach populations."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "Senators Ben Sasse (R-NE) and Amy Klobuchar (D-MN), along with Senators Cory Booker (D-NJ) and Tim Scott (R-SC), introduced legislation to help American workers attain the skills they need to compete as we confront the coronavirus pandemic."}, {"senator": "Roy Blunt", "party": "Republican", "sentence": "Senators Patty Murray (Wash.), Mitt Romney (Utah), Doug Jones (Ala.), Tina Smith (Minn.), Tammy Baldwin (Wis.), Jack Reed (R.I.), Amy Klobuchar (Minn.), and Richard Blumenthal (Conn.)."}, {"senator": "John Kennedy", "party": "Republican", "sentence": "He didn't ask for an investigation of Amy Klobuchar and Elizabeth Warren."}, {"senator": "James Lankford", "party": "Republican", "sentence": "The amendment was co-sponsored by Senators Chris Coons (D-DE), Mike Lee (R-UT), Amy Klobuchar (D-MN), Tim Scott (R-SC), and Jeanne Shaheen (D-NH)."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "Senators Patty Murray (D-WA), Mitt Romney (R-UT), Doug Jones (D-AL), Roy Blunt (R-MO), Tina Smith (D-MN), Tammy Baldwin (D-WI), Jack Reed (D-RI), Amy Klobuchar (D-MN), and Richard Blumenthal (D-CT)."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Senators Amy Klobuchar (D-MN) and Bill Cassidy, M.D."}, {"senator": "Roger F. Wicker", "party": "Republican", "sentence": "Gary Peters, D-Mich., John Thune, R-S.D., and Amy Klobuchar, D-Minn., introduced S."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Senator Tammy Duckworth joined Senators Amy Klobuchar (D-MN), Mike Rounds (R-SD) and Dan Sullivan (R-AK) in introducing legislation to ensure that servicemembers and veterans with previous exposure to burn pits receive the care they need during the COVID-19 pandemic."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), a relentless advocate for Iowa's biofuel community and member of the Senate Environment and Public Works Committee (EPW), is joining her fellow Iowan Senator Chuck Grassley (R-IA) and Senator Amy Klobuchar (D-MN) on bipartisan legislation to support biofuel producers negatively affected by the pandemic."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Harris (D-Calif.), Mazie Hirono (D-Hawaii), Tim Kaine (D-Va.), Angus King (I-Maine), Amy Klobuchar (D-Minn.), Jeff Merkley (D-Ore.), Jacky Rosen (D-Nev.), Bernard Sanders (I-Vt.), Chuck Schumer (D-N.Y.), Kyrsten Sinema (D-Ariz.), Debbie Stabenow (D-Mich.), Elizabeth Warren (D-Mass.), and Ron Wyden (D-Ore.)."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Chuck Grassley (R-Iowa) and Amy Klobuchar (D-Minn.) introduced legislation to support biofuel producers negatively affected by the pandemic."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Markey (D-MA), Patrick Leahy (D-VT), Bernie Sanders (I-VT), Bob Menendez (D-NJ), Sherrod Brown (D-OH), Joe Manchin (D-WV), Kirsten Gillibrand (D-NY), Chuck Grassley (R-IA), Amy Klobuchar (D-MN), Joni Ernst (R-IA), Elizabeth Warren (D-MA), Jerry Moran (R-KS), Tim Kaine (D-VA), and Tom Cotton (R-AR)."}]