[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…need them the least. This is not just bad economics. I  believe it is immoral.\n\nI would remind us that the Congressional Budget Office, just last  week, found in the final analysis of this bill, when all of its  component parts are summed together, that the bottom third of  households would be poorer, the middle of the country would be no  better off,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the  responsibilities of the National Telecommunications and Information  Administration, or NTIA, by codifying, renaming, and enhancing the work  of its Office of Policy Analysis and Development, which plays a  critical role in shaping our Nation's telecommunications and  information objectives.\n\nNTIA is already central to advancing market-driven strategies…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…sand, and  gravel on Federal lands.\n\nThis review will include descriptions of the Federal permitting  process for stone, sand, and gravel development. It will also include  an analysis of potential inefficiencies and recommendations for  administrative or legislative action, as well as a summary of economic  impacts associated with the current permitting…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694031/wabeno-economic-development-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…factually check that.\n\nWhile we are on the subject of facts, COVID played a little bit of a  role in our recruitment problem. I don't think anyone who is being fair  about analysis would dispute that. Again, here we hear: Oh, no, it  wasn't COVID. It was the fact that, where we advertised, we didn't  place it here.\n\nMadam Chair, come on. COVID is what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…about this. They care a lot about  consumer costs, but their rhetoric does not match their record.\n\nExample number one is the big, ugly bill. I will offer for the Record  an analysis by Energy Innovation of the big, ugly bill where they say,  ``The bill will reduce additions of new cost-effective electricity  capacity, raising power prices for consumers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…general population. Yet, for  too long, this body, Congress, has not done as much as we should to  tackle these issues that they face.\n\nThis bill requires the collection and analysis of critical data on  attacks on officers, injuries that they suffer, their mental health  challenges, and wellness program effectiveness. Without accurate data,  we are fighting…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…to  Medicaid in the history of this country, all to finance $96 billion a  year of tax breaks to the millionaires and billionaires. Those are the  facts.\n\nLook, CBO did an analysis, and they said that the top 10 percent in  America are going to benefit enormously from this bill. If you are in  the top 10 percent, if you make over a million dollars, over…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…nations and for all of us who care about maintaining democratic  values. I know that his passion for public service, his commitment to  internationalism, and his insightful analysis are ending here after his  time in Washington.\n\nIn closing, on behalf of my colleagues in the Senate, I extend my  profound thanks to Ambassador Rudd. I thank him for his…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…disruptions of critical supply chains that could  have a devastating impact on the U.S. economy. The bill charges the  Department of Commerce's Assistant Secretary for Industry and Analysis  with promoting the stability and resilience of critical supply chains.  It creates a new government-wide Supply Chain Resilience Working Group,  led by the Assistant Secretary,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692997/promoting-resilient-supply-chains-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…can end President Trump's crazy war on clean energy.\n\nSure, maybe we can have a few fiber optic cables running through  marine sanctuaries, but let's do it through proper analysis and siting.  Let's be careful in these very special places. We don't need this bill  to enable any of these shared objectives to move forward. Let us not  create sacrifice…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…special  message.'' But for these rescissions proposals, OMB flat out refused  ``to provide GAO with updated apportionment data that would permit GAO  to conduct the same analysis for the President's special message of  June 3, 2025.''\n\nThis is unacceptable, and it is unlawful. In the FY 2022 and FY 2023  Consolidated Appropriations Acts, when I was…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…extension of tax cuts, many of which are for the wealthy.  Some may be for the nonwealthy, but much of it is for the wealthy. It  is the wrong thing to do.\n\nEvery independent analysis says this will not lower the budget  deficit but will increase it. Mr. Speaker, if you don't believe me,  look at when we vote for the debt ceiling increase; $5 trillion to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689899/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…unable to meet growing power demand or to  compete with China.\n\nAll this doesn't factor in the enormous toll that Trump's tariffs  will take on America's energy bills. A recent analysis found that  Trump's tariffs will cost your average American family $2,300 each  year. That is $2,300 that families need to pay rent, to buy groceries,  and to afford clothes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…liberal arts lawyer is far from a high-rolling stock  broker, I am not shy to say that I knew McDonald's was going to be a  success. Not because of any sophisticated financial analysis or  detailed market research--I just knew the McDonald's in East St. Louis  was one of the few restaurants that always had a line.\n\nToday, McDonald's operates 36,000 restaurants…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…bill that will save  healthcare for 4 million people. Mr. Speaker, it is your turn to act.  Hold the vote to save healthcare now.\n\nIt is important to point out that the CBO analysis that my Republican  friends keep talking about says that it is going to cost 100,000 people  more every year for healthcare.\n\nHold the vote on the bill that will save healthcare.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698390/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…who have analyzed it--here is a Paragon  study, written by a Ph.D. It basically says that Medicaid reported  functionally half a trillion dollars over 10 years, but their analysis  when you do all of it is $1.1 trillion of improper payments.\n\nThink about that. If you just fix this, if you just fix this one  issue, that covers everything that is being…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Within one 1 year of enactment, the Secretary of  Commerce would be required to identify high-demand critical  infrastructure with manufacturing constraints, do a cost-benefit  analysis of domestic production, and determine the feasibility of such  production.\n\nBy supporting this bill, we are taking an important step toward  rebuilding American manufacturing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690289/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…viewed as balanced. BLM crafted a plan that was, as the Agency wrote at  the time, ``suitably specific for broad-scale management decisions. . .  . Additional site-specific analysis will occur when BLM receives an  application to approve an action on the ground. This will be done  through subsequent NEPA reviews and analysis, which will be conducted…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and such adoptive of legal guardianship       families struggle to meet children's needs.\n\n``(5) The plan includes, and shall update annually, a       report on the State's analysis of specific challenges or       barriers to recruiting, licensing, and utilizing families who       reflect the racial and ethnic background of children in       foster care…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Initiative Act       of 2025 has been issued and considered by the Taskforce,       containing--\n\n``(A) appropriate statistical information and full and       substantive analysis;\n\n``(B) a summary of recent trends and innovations that have       impacted the investment landscape for senior investors;\n\n``(C) a summary of regulatory initiatives that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Personnel.--In carrying       out the activities described in subsection (a), the Director       shall--\n\n(1) establish standards for the collection, maintenance,       and analysis of covert testing data, including the creation       of a comprehensive       and uniform method for documenting test outcomes, identifying       root causes of failures,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…accessed, or used, including any such restrictions       on desktop or server hardware, through a cloud service       provider, or on data ownership or access; and\n\n(5) an analysis addressing--\n\n(A) the accuracy and completeness of the comprehensive       assessment;\n\n(B) agency management of and compliance with all contracts       or other agreements…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…in paragraph (1), by striking ``and'' at the end;\n\n(3) by redesignating paragraph (2) as paragraph (3); and\n\n(4) by inserting after paragraph (1) the following:\n\n``(2) an analysis of any and all existing deficiencies in       the technology evaluation process and recommendations to       advance the efficiency, accuracy, and consistency of grain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…identifying potential opportunities that make more spectrum  available for commercial use, including reallocating and sharing  spectrum.\n\nComplex, technical engineering testing and analysis underpins these  important decisions on how best to maximize our airwaves for commercial  use while preserving essential Federal missions.\n\nThe Institute for Telecommunication…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…paragraph (1) should       be subject matter experts who have familiarity and technical       expertise regarding cybersecurity, digital forensics, or       threat intelligence analysis, or in-depth knowledge of the       tactics, techniques, and procedures (TTPs) commonly used by       State-sponsored cyber actors, including Volt Typhoon, of the       People's…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…initiating the process to revise the       1988 North Dakota RMP.\n\nOn January 8, 2025, following a comprehensive planning       process, including public scoping and comment, data analysis,       alternative development, environmental review, stakeholder       engagement, and selection of a preferred management approach,       BLM approved the North Dakota RMP…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…including the       type and cost of assistance received by each such community       and a summary of the outcomes associated with the provision       of such assistance.\n\n(3) An analysis of any duplication of covered technical       assistance available through multiple programs of the       Environmental Protection Agency.\n\n(4) An evaluation of how the provision…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…of appropriated funds.\n\nThe CBO staff contact for this estimate is Sean       Christensen. The estimate was reviewed by H. Samuel       Papenfuss, Deputy Director of Budget Analysis.                                                 Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. FITZGERALD. Mr. Speaker, I will…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…conveyance, including the       cost of--\n\n(i) a survey, if necessary, under subsection (b)(3);\n\n(ii) conducting the appraisal under subsection (d); and\n\n(iii) any environmental analysis or resource survey       required under Federal law.\n\n(d) Appraisal.--\n\n(1) In general.--Not later than 300 days after the date of       enactment of this Act, the Secretary…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…(a), the County shall pay all costs       associated with the conveyance, including the cost of--\n\n(1) a survey, if necessary, under subsection (b)(2);\n\n(2) any environmental analysis or resources survey required       under Federal law; and\n\n(3) any analysis required to comply with division A of       subtitle III of title 54, United States Code (commonly…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}]