[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…societal challenges  for 77 years, and I know that the Philadelphia community has benefited  immensely from this important work.\n\nFounder Joseph Newton Pew and his wife, Mary Anderson Pew initially  focused their philanthropic work on anonymously providing grants to  priorities such as cancer research, the Red Cross, and a pioneering  project to assist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Napoli, of Virginia,       to be Deputy Administrator for Defense Nuclear       Nonproliferation, National Nuclear Security Administration.\n\n13. Executive Calendar #153--Richard Anderson, of Virginia,       to be an Assistant Secretary of the Air Force.\n\n14. Executive Calendar #156--Tina Pierce, of Idaho, to be       Chief Financial Officer, Department of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695711/s-res-377"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…our  overall success, and I would like to thank the following Volunteer  JCCIC Ambassadors:\n\nAlthea Abbott, Sara Adams, Harley Adsit, Joey Aguilo, Nolan       Ahern, Joshua Anderson, Michael Appelbaum, Claudette       Archambault, Rebekah Armstrong, Benjamin Arquit, Abigail       Ashcraft, Alexander Attebery, Grant Auman, Sky Avants, Zehra       Bakirdan,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Worship Center International in  Albany, Georgia.\n\nBishop Williams was born in Dougherty County, Albany, Georgia, to the  late Roosevelt Williams and Evangelist Katie Mae Anderson. The youngest  of seven children--Johnny Bell, Patricia, Gloria Jean, Roosevelt, Jr.,  Larry, and Barbara--he was reared in a home firmly rooted in faith,  discipline, and…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Horvath; Joy Welan; Judith Sandalow; June Kress;       Katharine Mark; Kathryn Ferger; Katie Feioek; Katie       McConville; Kelli Coffman; Kezia Constantine; Lee Ann       Anderson, Esq.; Leonard Bailey; Lisa Cohen; Lisa Foster, Ward       2; Lisa Greenman; Madeline Bateman; Maxon Orchard; Margaret       J. Lyons; Margie Clark; Mark Randolph.\n\nMarta…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…individuals embody the  spirit of civic engagement and community service that strengthens the  social fabric of our region.\n\nThis year's distinguished honorees are Linda Hill Anderson, Sandra  Atkins, Timothy G. Curtin, Barbara Effman, Helena Friedman, Susan  Gilbert, Juanita Gray, Mona Malbranche, Melinda Montgomery, Dr. Irving  Rosenbaum, Zeff Ross, Reverend…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "I rise today in support of H.R. 1008. Sheriff Adrian Anderson was a  47-year veteran of the Dutchess County Sheriff's Office. In 1983, he  was elected mayor of Pawling and served as the village's mayor for 8  years. He received five…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697691/sheriff-adrian-butch-anderson-post-office-building"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…will also buy less.\n\nThe tariffs on Canada and Mexican goods that President Trump is  planning would cost American families an estimated up to $2,000 per  year. According to Anderson Economic Group, tariffs could raise the  price of a new car as much as $12,000. I am pretty sure nobody has  extra money for a new car.\n\nHousing costs--one of the biggest…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…State Football Playoffs,  the Avon Eagles overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Cincinnati Anderson Raptors to win their second straight state football  championship. The members of this very special team have shown that  their sport requires an individual effort for a team…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698001/recognizing-avon-high-school-on-winning-the-division-ii-state-football-championship"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to honor and thank Dale Anderson  for his service to the Fifth Congressional District of Colorado for  over 18 years.\n\nDale served my predecessor, Congressman Doug Lamborn, in several  roles, and he served…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693635/recognizing-dale-anderson"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the  interests of more than 13,000 Inupiat shareholders, echoed those  concerns. In testimony before the Alaska Legislature, ASRC Vice  President of External Affairs Bridget Anderson explained, ``despite our  sustained efforts and our willingness to work with the federal  government, our perspectives are often drowned out by entities who have  no ties…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…and pass  the bill (H.R. 1008) to designate the facility of the United States  Postal Service located at 298 Route 292 in Holmes, New York, as the  ``Sheriff Adrian `Butch' Anderson Post Office Building''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1008\n\nBe it enacted by the Senate…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697692/sheriff-adrian-butch-anderson-post-office-building"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Carolina and across the  Nation.\n\nFor South Carolina's Third District, it means good jobs for welders,  machinists, and engineers. It means new orders coming into counties  like Anderson, Greenwood, Newberry, and Oconee, and many other  hardworking blue-color communities all across the Nation.\n\nImportantly, it means America's best equipment reaching our allies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…massive copay or some other kind  of limitation on your ability to choose a doctor. For example, in my  case, as a cancer survivor, on ObamaCare, I can't go back to M.D.  Anderson, which saved my life, because ObamaCare doesn't have M.D.  Anderson as an option.\n\nThat is not coverage. That is fake. Democrats sold you fake coverage,  and now your premiums…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…News; Alvarez Jacobs, Gabriel: Washington Post; Amenabar,       Edwin: Washington Post; Amiri, Farnoush: Associated Press;       Anastacio, Nicholas: National Journal; Anderson, Zachary: USA       Today; Andrea, Lawrence: USA Today; Andrews, Natalie: Wall       Street Journal/Dow Jones; Anglin, Tara: New York Times;       Aoyama, Ryo: Asahi Shimbun;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Charles Anderson has made through his work with  United Way of Pasco County. Charles W. Anderson, recently retired  January 2025 as President & CEO of United Way of Pasco County (UWPC).  He…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, as chairman of the House Merit Caucus, I am  proud to recognize a Utah educator who embodies excellence, Ms. Lacey  Anderson.\n\nLacey is a special education teacher who refused to accept low  expectations for neurodivergent students. Instead, she founded Autism  Solutions Academy in West Jordan,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691347/recognizing-lacey-anderson"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…handful of doctors they can go to, what lousy deductible they get, what  ridiculous copay they have.\n\nI have a constituent who died from cancer last year who couldn't go  to MD Anderson because she was covered under ObamaCare. Think about  that, covered under ObamaCare, sick with cancer, can't go to the best  cancer hospital in the world 2 hours from her…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…say that I rise today to pay  respects to my friend, a colleague, a man I served with for many years  in the Minnesota legislature, and a kind and good man, Senator Bruce  Anderson.\n\nHe passed away unexpectedly leaving Minnesota and his family to mourn  the loss of a great man.\n\nA Navy veteran of the Vietnam war, he was an advocate for veterans  and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694029/paying-respects-to-senator-bruce-anderson"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I am honored to welcome Jared Anderson and  the Friends of Club 21 Choir here to Washington, D.C.\n\nThe choir, composed of talented individuals living with Down syndrome  and who are based in Colorado's Fifth Congressional…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699252/welcoming-jared-anderson-and-friends-of-club-21-choir-to-washington-dc"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…today in strong support of  legislation honoring a man whose life was defined by service,  leadership, and an unwavering commitment to his community.\n\nSheriff Adrian ``Butch'' Anderson dedicated more than five decades to  public safety and public service in Dutchess County, New York.\n\nSheriff Anderson's law enforcement career began in 1970, when he was…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697693/sheriff-adrian-butch-anderson-post-office-building"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…was meant to  be there. She wanted her presence and her voice to help shape our  policies and change our world for the better.\n\nWe got her into a joint clinical trial at MD Anderson and Texas  Children's Hospital, but, unfortunately, it was too late. She had to be  put on a ventilator 3 weeks after our summit, and she passed away.\n\nAs Congresswoman Dingell…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…continued  his studies at the University of California, Los Angeles--School of  Public Health where he received his Master of Public Health degree. He  also attended UCLA Anderson School of Management's Health Care  Executive Program.\n\nSince 1993, Jeffrey and his colleagues at the Association of Asian  Pacific Community Health Organizations have dedicated…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}]