[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…America we aspire to  be. We are a nation built on justice, compassion, and the unwavering  belief that every person deserves dignity and respect. What is  happening in Los Angeles betrays our core beliefs.\n\nThe Federal response to deploy more than 4,000 National Guard troops  and 700 marines without a local request is a troubling overreach. It  risks…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692239/ice-raids-in-california"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the 1930s and 1940s.\n\nDHS is now building databases of Americans, detaining and even  disappearing people off of corners in Minneapolis, Chicago, Portland,  Nashville, Los Angeles, and far too many communities across the Nation.\n\nThe Trump administration demanded that Republicans deliver a $170  billion taxpayer-funded slush fund for these misbegotten…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…injuries.  Some of these trials have not been restarted.\n\nIn Pittsburgh, a study for veterans struggling with opioid addiction  stalled out when a hiring freeze hit.\n\nIn Los Angeles, all chemotherapy treatments almost stopped entirely  before the VA reversed course.\n\nThese are not just numbers. These are people. These are veterans who  stepped up for…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…access  to long-term, fixed-rate financing to help them to expand operations,  purchase property, and make lasting investments in their local economy.\n\nIn Orange County and Los Angeles County alone, the 504 program has  injected more than $27 billion into local businesses and helped to  create over 175,000 jobs over the last 25 years.\n\nMy bipartisan bill,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…benefits and opportunities for DACA recipients, but now they  are threatening to arrest DACA participants as well. That is exactly  what has been happening in my hometown of Los Angeles when, last month,  masked immigration officials--unidentified and masked immigration  officials--carrying weapons, raided a carwash in Temple City. It was  there that they…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have refused to agree to extend those healthcare tax credits.\n\nBut maybe most alarmingly--most alarmingly--as is visible in the  streets of Oregon, California, Chicago, Los Angeles, is the deployment  of our military, our National Guard.\n\nThe Senator from Oregon has spoken so powerfully and eloquently to  bring a critical lens to this desecration of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…California's  five Nobel laureates for their achievements.\n\nFrederick J. Ramsdell, an alumnus of the University of California,  San Diego, and the University of California, Los Angeles, was one of  three scientists awarded the Nobel Prize in Physiology or Medicine for  their research to better understand and protect the human immune  system. Dr. Ramsdell's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…from Montana (Mr. Downing).\n\nI will point out that I am uniquely unqualified to address this bill  since my entire district is in an urban area, that of the great city of  Los Angeles. Yet, even I recognize the importance of getting capital to  our small businesses in rural areas.\n\nI strongly support this legislation, which would require the SEC's  Office…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…told me that they are not able to train because all of  that money is going to have our National Guard's members stay in hotel  rooms all around Washington, D.C.; Memphis; Los Angeles; and New  Orleans. That is something that shouldn't be happening. We should have  greater accountability.\n\nI am also concerned about this whole issue of merit. We have heard…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…These aren't just numbers. They are our children, our  parents, and our neighbors. Please allow California to enforce stronger  clean air protections.''\n\nTia Triplett from Los Angeles wrote to EPA that heavy truck pollution  threatens the health of her community, and she urges stronger  protections.\n\nHouse Republicans want to silence these voices.\n\nOur…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690469/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, I rise in opposition to this extremely partisan  resolution that seeks to legitimize President Trump's baseless attacks  on Los Angeles and our elected leaders, including Governor Newsom and  Mayor Bass.\n\nThis administration's mass ICE raids by masked agents who will not  identify themselves have trampled…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693142/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Treasure, Gold and Silver Rays, for 35 years of supporting the U.S.- Japanese relationship.\n\nThroughout her career, Makiko served more than 90,000 Japanese  nationals in the Los Angeles area, and she played a large role in the  Consulate's emergency response to the 1994 Northridge earthquake and  again during the attacks of 9/11 on our country.\n\nI thank my…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690737/recognizing-makiko-shirai"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "Mr. GOMEZ. Mr. Speaker, Trump's unhinged immigration raids started in  downtown Los Angeles, in my congressional district, not targeting the  ``criminal'' immigrants that he promised he would go after, but  targeting anybody that looked like me, looked like my colleagues,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…our  military, trying to blur the lines between our servicemembers and law  enforcement. We saw it when he sent the National Guard to intimidate  peaceful protesters in Los Angeles or when he similarly threatened  Chicago and Portland before he was stopped by the courts. We have even  seen it in this Capital City, where I am speaking today, when  he…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that behavioral  health--very tough challenge, particularly with the fentanyl epidemic  in our country.\n\nI met with representatives of Peninsula Behavioral Health in Port  Angeles, WA, and Sound Health in King County, who told me that clinics  are already operating on narrow margins and have already sustained a 1- percent budget cut this year at the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…later than 1       year after the date of enactment of this Act, the Commandant       shall implement the November 2021 proposed plan of the Vessel       Traffic Service Los Angeles-Long Beach for restructuring the       Federal anchorages in San Pedro Bay described on page 54 of       the Report of the National Transportation Safety Board titled…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…defense, while  needlessly undercutting innovation and economic progress.\n\nThe need to rein the commission in has now become urgent as we face  the challenge of rebuilding Los Angeles following the fires, and that  will not be possible if the commission is allowed to continue operating  as it has been.\n\nJust to give you a couple of examples of some of its…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. Mr. Speaker, I have asked Attorney General  Pam Bondi to open an investigation into the  FireAid concert that took place in the aftermath of the devastating Los  Angeles fires.\n\nWhat we have learned has happened is absolutely beyond belief. In the  aftermath of these fires, which destroyed 18,000 homes and tragically  killed 30 people, there…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694134/investigation-into-the-fireaid-concert-in-los-angeles"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, I thank Representative Kiley for yielding.\n\nMr. Speaker, I rise in strong support of H. Res. 516 to condemn the  violent riots in Los Angeles this month, and I thank our brave law  enforcement officers for keeping us safe.\n\nI appreciate the heated debate and the conversation. I thank my  colleague (Mr. Kiley) for…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…others.\n\nMy subcommittee receives notifications every time there is a suicide  on VA property. Over the last year, Mr. Chairman, we received suicide  notices from Asheville, Los Angeles, McAllen, Minneapolis, Las Vegas,  south Texas, Puget Sound, and many, many more. Every single veteran  committed suicide with a firearm. Every single one.\n\nWith all of these…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…vandalized and  looted local shops.\n\nThe Democratic vice mayor of Cudahy has called on criminal street  gangs to attack Federal law enforcement.\n\nThe Democratic mayor of Los Angeles said that for the riots to stop,  the Federal Government had to stop enforcing Federal immigration law.  You just heard the same sentiment expressed on this floor a few minutes…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…lives  we lost by doing everything possible to prevent and mitigate future  attacks. With major events on the horizon, including America250, the  FIFA World Cup, and the Los Angeles Olympics, we must ensure every  necessary security measure is in place to protect the millions of  visitors and attendees these events will bring.\n\nMadam Speaker, I urge my…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…House of Representatives called the PATH Caucus. It was formed  about 3 years ago.\n\nI happen to be the Republican lead and my dear friend and colleague  Lou Correa from Los Angeles is the Democrat lead. We call it the Noah's  Ark Caucus, where one Democrat and one Republican come together and  join it, but the whole goal as the PATH Caucus--the title…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…that inflicts our body politic  today. I think that phrase is actually far too generous.\n\nThese radicals on the streets of Minneapolis and their comrades in  cities like Los Angeles, Chicago, and Portland are not driven by  ``empathy'' in any meaningful sense of the term. These are not  bleeding-heart humanitarians paralyzed by an overwhelming concern…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and what the people who  lived in Montana and Alaska thought.\n\nAll they cared about was what their NGO and environmentalist friends  in Washington, D.C., New York, and Los Angeles thought about lands in  faraway rural places and how they wanted to impose their will on what  happens in these rural areas where our resources abound.\n\nIsn't it ironic that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…thrown to the ground,  and handcuffed after identifying himself as Senator Alex Padilla and  attempting to ask a question of Secretary of Homeland Security Kristi  Noem in Los Angeles, I am shaken, I am angry, and I am gravely  concerned about our path forward in this body and our Nation.\n\nDemocracy is a gift hard won and hard earned by the sacrifice of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…organized the hearing. The high- speed rail authority can't manage to complete anything on time, even  its own reports to the legislature, let alone a high-speed train from  Los Angeles to San Francisco or even that very first segment from  Bakersfield to Merced, which is now projected to miss the 2033  deadline.\n\nListen to the bipartisan pushback that this…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize Jennifer Sevilla  Korn for her public service and leadership.\n\nA native of East Los Angeles and a proud Marine Corps spouse,  Jennifer is a national conservative leader, policy expert, and  political strategist whose faith has guided her throughout a  distinguished…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…very unlikely  to actually be reached--is, it is to go from Palmdale to Gilroy. Where  are these places?\n\nRemember, the initial project was supposed to ultimately go from Los  Angeles to San Francisco, the two main population hubs of California.\n\nWell, Palmdale is a ways away from L.A. It is about 37 miles  northeast of Los Angeles, so if traffic is good,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…beginning of the end of high-speed rail, the biggest public  infrastructure disaster in U.S. history.\n\nA few months ago, I joined Secretary of Transportation Sean Duffy in  Los Angeles to announce an investigation and compliance review into the  State's high-speed rail project. Today, the results are in.\n\nThe State, with respect to $4 billion in grants that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691937/high-speed-rail-in-california"}]