[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…equality. Her famous ``Ain't I a Woman?'' speech challenged  the exclusion of Black women from the suffrage movement, leaving a  legacy that continues to inspire generations.\n\nAnna Howard Shaw was a trailblazer in every sense of the word,  becoming one of the first female ordained ministers in the United  States and later a physician. She dedicated decades…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…University  of Georgia School of Social Work for its 60th anniversary and to Deans  Charles A. Stewart (1964-1995), Bonnie Yegidis (1995-2003), Maurice  Daniels (2005-2016), Anna Scheyett (2016-2021), and its current dean,  Philip Hong (2022-present).\n\nFor six decades, the School of Social Work has advanced the  University of Georgia's teaching, research,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Lee, Leonard Kim, Aria Kwon, Kevin       Kim, Irene Kang, Han June Lee, Veronica Patton, Luke An, and       Genevieve An.\n\nI would also like to give special recognition to Ms. Anna Ko, whose  tireless work as KORUS coordinator and Master of Ceremonies helped make  this amazing event possible.\n\nMr. Speaker, festivals like KORUS are a wonderful example of…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696020/recognizing-the-korean-american-association-of-the-washington-metropolitan-area-and-the-2025-korus-festival-volunteers"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…constitutional  authority as it relates to tariffs and trade in the best interest of  the American people, no, Republicans have a different approach.\n\nHere is a gem from Representative Anna Paulina Luna from the great  State of Florida. She has introduced legislation to arrange for the  carving of the figure of President Donald J. Trump on Mount Rushmore.\n\nAre…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…compassionate, and just society. A proud daughter of the Bronx, Anita  was raised in a working-class Greek Jewish household by her parents,  Jack and Sarah, and her grandparents Anna and Zadick Coffino, who  emigrated from the Ottoman Empire and made their home on the Lower East  Side. From these deep roots, Anita cultivated a lifelong commitment to  public…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Anna Roessner, a senior at  Fort Recovery High School, has represented her school ably on her way  to achieving the Division III State Title for the 100 Meter Dash at the  State…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693404/special-recognition-of-anna-roessner-for-winning-the-division-iii-state-track-and-field-title-for-the-100-meter-dash"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…director; and Renate Pullen, compliance director.\n\nMembers of the CDC Board of Directors are: Bryce Row, president;  Michelle Larsen, vice president; Patricia Cloud, treasurer; Anna Birch  DeWitt; Tayla Trujillo; Ally Orr; Nikki Hawley; Scott Wells; Tony  Hager; Bobby Pickle; Brad Diller; and Fleur Tremel.\n\nThose serving on the CDC Foundation Board include:…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Earle, Geoffrey: DailyMail.com; Eaton, Sabrina: Cleveland       Plain Dealer; Echigo, Ayako: Jiji Press; Eddings, Erin: Kyodo       News; Edmondson, Catie: New York Times; Edney, Anna:       Bloomberg News; Egbame, Assima: Bloomberg News; Egger,       Andrew: Bulwark; Eichelberger, Curtis: MLEX US; Eino, Atsuo:       Jiji Press; Eisler, Peter: Thomson Reuters;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…represented her school ably on her way to  achieving three Division III State Titles for the 200 Meter Dash, 400  Meter Dash, and Girls Long Jump at the State Track and Field Meet. Anna  overcame the challenges posed by intense competition in her effort to  win the title.\n\nIn pursuing the State Championship, Anna defeated her opponents with  an impressive time…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693373/special-recognition-of-isabella-zahn-for-winning-the-division-iii-state-track-and-field-title-for-the-200-meter-dash-400-meter-dash-and-long-jump"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Evaluation event, Manor FFA  students evaluated live poultry, graded carcasses and eggs, and  completed a written exam. The Manor FFA team won a gold ranking, and  the students--Anna Frey, Jozie Gilger, Leanna Kneisley, and Misty  Railing--each earned silver.\n\nThe Dairy Cattle Evaluation and Management event saw students assess  pedigrees, herd records,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…every moment. Ella  certainly took advantage of every moment she had with us here on Earth.\n\nShe grew up in Mountain Brook, AL--a suburb of Birmingham--with two  loving parents, Anna and Richard, and two siblings, Hooker and Mary  Hamner.\n\nElla loved to play piano, dance, and travel. She was studying French  at Brown University. She also loved kids and spent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…tell you that. A, because it  would require math; B, it would require facts; and C, it might actually  mean someone has to do something.\n\nThere is an economist at Bloomberg, Anna Wong, who is truly freaky  smart. I have had the opportunity and the honor. She came and spent  part of a day with my Joint Economic Committee economists. She has been  at the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Bryan: SINCLAIR       BROADCAST GROUP; Barr, Jennifer: CBC (CANADIAN BROADCASTING       CORPORATION); Barr, John: WJLA-TV/NEWSCHANNEL 8; Barr, Luke:       ABC NEWS; Barrera, Anna: WRC-TV/NBC-4; Barrett, Calvin: FOX       NEWS; Barrett, III., Edward: CNN; Barrett, Maura: NBC NEWS;       Barrett, Maura: SCRIPPS NEWS; Barringer, Reginald: CBS NEWS;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…done. They include Adam Barker, Kristina Belcourt, Jonathan  Bowen, Leah Brewer, Levi Brunt, Luke Chaney, Glen Diehl, Cody Emerson,  Marty Fromuth, Megan Galindo, Mike Gerhart, Anna Given, Meredith  Gravatte, Madeline Guenther, Isaac Jalkanen, Lauren Johnson, Katie  Karam, Greg Lilly, Eric Lofgren, Katie Magnus, Jonathan Moore, Katie  Stanton, Sophie Schloegel,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Willis Elementary School; Suzanne Theiss, Southeast High       School; Dilcia Navarro, State College of Florida Collegiate       school.\n\nTeacher Award: Laura Redeker, Anna Maria Elementary School;       Susan Nova, Harvey Elementary School; Katharine Kimbrell,       Braden River Middle School; Jessica Mynatt, Braden River       Middle School;…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Zachary Curtis, Alessandro Fabbri,       Amy Gao, Mahi Mehta, Spencer Peesel, Gavin James Schmidt\n\nCT: Daniel Babashak, Bradford Benton, Pahal Bhasin,       Alexander Etergino, Anna Leventon, Bruce Matos, Samuel Peck,       Abigail Phelan, Cooper Taylor, Gavin Villepigue\n\nDC: Sowmya Natarajan, Jordan Williams\n\nDE: Gabriella Bourantas, Emily Geldreich, Michaela…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…thank the committee staff on both  sides of the aisle who worked tirelessly over the past month to  negotiate the product before us. On the majority side are Paul Anstine,  Anna Lanier Fischer, Fern Gibbons, Alessandra Ramirez, Ashley Truluck,  and Nkosi Thomas. On the minority side are Shannon McCully, Jamie Wise,  and Jim Ellsworth.\n\nIt was not cool…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Rescue, and the Sun City Center Emergency Squad.\n\nPreservation of Life Award: Firefighter/Paramedic Jacob       Campbell, Fire Captain Clifford Davis, Firefighter/Paramedic       Anna Inman, and Firefighter Maurice Swan of Hillsborough       County Fire Rescue, Charge Paramedic Peterson Gustave,       District Chief William Thayer, and District Chief Beth…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I rise today to honor Anna  Kathleen Cummins Kennedy of Poplar Bluff, Missouri, whose life  exemplified service to country, devotion to family, and tireless  commitment to community. Born on January 1,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Pictures; Lamarque, Kevin: Reuters News       Pictures; Lamkey, Jr., Rodney Arthur: Freelance; Laurent,       Olivier: Washington Post; Lawidjaja, Rudy: Freelance; Layden,       Anna: Freelance.\n\nLee, Eric: New York Times; Lewis, Roy: Washington Informer;       Loeb, Saul: Agence France-Presse; LoScalzo, James: European       Pressphoto Agency; Lott, Joshua:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}]