[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Caroline Donlon, Kelsie Donovan, Jonathan Downing, Sarah       Drake, John Draxler, Benjamin Driscoll, Samanta Dunford,       Elizabeth Dunlap, Darin Durand, James Durham, Anne Earthman,       Benjamin Easter, Flannery Egner, Manik Elahi, Margaret       Elliott, Ross Elston, William Emerson, Alyssa Erdel, Benjamin       Esposito, Carley Esser, Samantha…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…recognized for his distinguished  service and exemplary performance of duty, reflecting the highest  tradition of the United States of America.\n\nColonel Dinh is married to Ashlie Anne Dinh, and they have two  daughters, Quintessa and Montelena.\n\nIn his civilian career, Colonel Dinh continues to serve honorably,  keeping our communities safe as an Orange County…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Morrissey and Fritz Falanka, Port Chester,  Rye Brook, Rye Town; Gina Proia and Nancy White, Larchmont; Marcy  Berman-Goldstein and Ken Giddon, Scarsdale Business Alliance; Anne Gold  and Marc Jerome, New Rochelle Business Improvement District.\n\nMr. Speaker, in future speeches, I will recognize leaders in the  Bronx and along the Hudson River communities…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693116/recognizing-local-chambers-of-commerce"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…I am proud to rise here today on behalf of  the 2026 National School Counselor of the Year, Ms. Danielle Crankfield  of Annapolis.\n\nMs. Crankfield of Crofton High School in Anne Arundel County is the  first Marylander to earn this national distinction for going above and  beyond and inspiring young minds.\n\nWhen she first arrived at Crofton, she found…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697970/national-school-counselor-of-the-year-danielle-crankfield"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…improved the  lives of countless families across Orlando: Admiral David Brewer, Alvin  J. Cowans, Jennifer Desir Hilaire, Chet Glover,  Florida Supreme Court Justice James Perry, Anne Piervil, Lisa Williams,  the late great State Senator Geraldine Thompson, and the late  Eatonville Mayor Eddie Cole.\n\nToday and always, we celebrate their achievements and continue…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700051/black-history-month"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…his  retirement from Congress.\n\nHe still has another year. He still has another year, and I know a  lot will come.\n\nI join the gentleman in saluting Elaine, Stefany, Susan, Anne, and  Judy. Judy--we loved Judy when she was here, and now we rejoice in the  gentleman's happiness with Elaine.\n\nMy colleagues, we all know that Steny Hoyer has been a pillar…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…after the 19th Amendment guaranteed  women's suffrage, 400 women founded the Town & County Club as  Hartford's first private women's club. The club's first President, Miss  Anne Eliot Trumbull, helped draft their Articles of Association. The  Articles state that the club was formed with the purposes of ``creating  an organized center for women's work,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…family-owned manufacturing company, has been based  in Schiller Park since 1957. The company was built on the core values  of quality and customer service, founded by Erv and Anne Basler,  children of immigrants. Now in its third generation of family  leadership, E.J. Basler Co. is run by Dennis and Brian Basler. Their  ongoing commitment to responsive…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692550/recognizing-ej-basler-co"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…US       Ambassador, retired; John Beyrle, US Ambassador, retired;       James Bishop, US Ambassador, retired; Charles Blaha, Senior       Foreign Service Officer, retired; Anne Bodine, Senior Foreign       Service Officer, retired; Avis Bohlen, US Ambassador,       retired, Former Assistant Secretary of State; Michele Bond,       US Ambassador, retired,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Minnesota's Third Congressional District. Their  dedication to promoting democracy is to be commended. I recognize  Sharon Billings, Caitlin Cahill, Keith Engel, Aditi Ginuga, Anne  Leland, Cathy Olson, Dave Olson, Paula Ramaley, Cole Roepke, Adaline  Shinkle, Brad Shinkle, Diane Sjolander, and Anita Smithson.\n\nThe people of Minnesota's Third Congressional…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689743/recognizing-constituents-of-minnesotas-third-congressional-district-for-their-work-in-promoting-democracy"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…has borne much of the burden of my service. I  ask them to stand.\n\nTo my late wife, Judy, who died too young and gave so much.\n\nTo my beloved daughters, Susan, Stefany, and Anne, who paid a price  for Dad's absences.\n\nTo my grandchildren and great-grandchildren, for giving me great joy.\n\nTo my mother, who thankfully lived to see her son become the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…bigger tax break.\n\nThe other side claims to be fiscally responsible, but they are  blowing a $5 trillion hole in our national debt to do it.\n\nWhat am I supposed to say to Mary Anne from Morrison, Illinois, who  says she can't feed her kids without SNAP, or a veteran like Mike, who  stopped in for his one meal a day at the veteran drop-in center in  Rockford?…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691481/gop-tax-scam-hurts-women-and-families"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Medicaid,  he probably wouldn't be alive today. Without this assistance, we likely  wouldn't be where we are now, and I doubt that there would be a happy  ending to this story.''\n\nAnne lives in Colorado's Sixth Congressional District, a district  represented by our colleague, Congressman Jason Crow, who is also  fighting hard to protect your interests, as…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise to recognize Sister Teresa Lynch, who  will be retiring from Santa Ana's Saint Anne School.\n\nShe served as a teacher for 31 years and principal for 19 years at  Saint Genevieve and Saint Anne School. She also worked to improve the  lives of incarcerated prisoners…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693061/recognizing-sister-teresa-lynch"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…wife Susan was 6 months pregnant with our oldest daughter  Caroline, and all I could think about was getting home to my family.  But Caroline and her two sisters, Halina and Anne, like millions of  other American kids, have grown up in the shadow of Columbine. They  have borne witness to an endless onslaught of mass shootings. Each  tragedy is piled…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Mr. Brandon Dell'Orto for his significant  contributions to Roseville Joint Union High School District and to the  students of the Roseville community.             Recognizing Anne Jones for Teacher Appreciation Week\n\nMr. KILEY of California. Mr. Speaker, in the spirit of National  Teacher Appreciation Week, I wish to take a moment to recognize a  teacher…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to celebrate the birth of  Reese Patricia Fritsch.\n\nReese was born on October 7, 2025 at 2:45 P.M. at Luminis Health Anne  Arundel Medical Center weighing seven pounds, two ounces and measuring  21 inches long to loving parents Taylor and Kristin Flukey Fritsch, who  serves as a valuable member…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696399/recognizing-reese-patricia-fritsch"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Goodwin, Elizabeth: Washington Post; Gordon, Michael:       Wall Street Journal/Dow Jones; Gorzynski, Oskar: Polish Press       Agency; Goudsward, Andrew: Thomson Reuters; Grady, Anne: CQ       Roll Call; Graf, Alex: S & P Global; Grandoni, Dino:       Washington Post; Grazado, Emma: Washington Post; Green,       Joshua: Bloomberg News.\n\nGreen, Lauren: Washington…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Han,       Jin Han, Cory Haynos, Stephanie Haynos, Roger Haynos,       Alexander ``Alex'' Gordon Huffman, Asra Hussain-Raza, Steve       Johnson, Julia Kay, Sean Kay, Elizabeth Anne Keys, Alexandr       ``Sasha'' Kirsanov, Spencer Lane, Christine Conrad Lane,       Samuel ``Sam'' Walter Lilley, Alydia Steele Livingston,       Everly Pearl Livingston, Donna…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Township, St. Louis County,       MN--Don Carlson; Northeast Technical Services; Grand Itasca       Clinic and Hospital; Lakehead Constructors; Ely Public School       District--Anne Oelke; Fight for Mining Minnesota; Road       Machinery & Supplies Co.; Feeley Township, Itasca County,       MN--Deb Langanki; Lake Country Power; Encampment Minerals,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Ronald ``Ron''  Reitz, an Army veteran and longtime barber. Together, they raised two  children, Cheryl and Joan, who, in turn, blessed them with five  grandchildren: Emma, Anne, Raegan, Kassidy, and Quinn. But Diane's  sense of duty has never stopped at her own front door.\n\nService is not just something Diane does--it is the essence of who  she is.…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…NEXSTAR MEDIA GROUP; Bruer, Wesley: CNN; Brulard, Maude:       AGENCE FRANCE PRESSE (AFP-TV); Bruns, David:       WASHINGTONPOST.COM; Bryant, Aubrey: WUSA-TV; Bryson, Anne:       CBS NEWS; Buck, Andrew: CNN; Buck, Kenneth: C-SPAN; Buckhorn,       Burke: CNN; Buckley, Katheryn: FOX NEWS.\n\nBuhre, Maea: PBS NewsHour; Bull, Haley: SCRIPPS NEWS;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Texas, USA. He is joined today in the Chamber gallery by his  wife, Shannon Aycock Powell, and their three children: Lila, Charyssa,  and Adam; and his niece, Chloe.\n\nMy wife, Anne, and I have been blessed beyond measure to be a part of  the Westminster community, and we are exceedingly grateful for the  prayers, support, and friendship of our fellow parishioners.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695810/welcoming-rev-elliott-j-powell"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Notes; Paun-      Dejesus, Carmen: Politico; Pavlich, Catherine: Townhall;       Pawlyk, Oriana: Politico; Pazanowski, Bernard: Bloomberg       Industry Group; Pazanowski, Mary Anne: Bloomberg Industry       Group; Pecquet, Julian: The Africa Report; Pedersen, Brendan:       Punchbowl News; Pekow, Charles: Beeriodicals; Perez, Juan:       Politico; Perine,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Kominski, Andrew Li, Angelina Li, Sarah Liu, Eric       Perkins, Theodore Tedesco, Daksh Tiwari, Adam Wyatt\n\nPR: Ashley Barlow\n\nRI: Felicity Kushner\n\nSC: Brooke Dillingham, Sarah Anne Ward\n\nTN : Iiyana Bachmann, Isabel Hyatt, Kylie Katelyn Patterson\n\nTX: Wyatt Allen, Shaktivel Anand, Surya Anand, Jenna       Barker, Terrence Bell, Luca Campbell, Kaye Chen,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and continues to provide life- changing educational opportunities. He retired from the Wisconsin  Department of Corrections in 2024 and returned to Michigan with his  wife, Anne, to enjoy traveling and cheering for the Detroit Lions.\n\nMr. Speaker, Chief Warrant Officer 4 James McInnis' lifetime of  service reflects steadfast dedication to our Nation…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}]