[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…that matter most to the  people of Ohio's 13th. That is why I have reintroduced the Mental  Health Improvement Act, a bipartisan bill to provide tens of millions  of dollars annually to expand our behavioral health workforce, helping  to train, recruit, and retain mental health professionals across the  country.\n\nIt is a commonsense solution that will…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690847/mental-health-solutions"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…more than $1 trillion from Medicaid,  Medicare, and the Affordable Care Act. These deep cuts will allow the  richest Americans to receive, on average, an additional $30,000  annually, while the poorest Americans will lose approximately $700  annually.\n\nThis legislation is a complete betrayal of the American people,  extending additional tax breaks to the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693211/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…changes in their lives like household appliances, medical equipment,  clothing, and nutritional supplements.\n\nSenior Santa & Friends has been able to deliver 2,100 gifts annually  to seniors in need in our community.\n\nPlease join me in thanking Senior Santa & Friends for their  dedication to helping our community make life much better during the  holidays…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689745/recognizing-jessie-echaury"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…protections for the watershed of the Boundary Waters Canoe       Area Wilderness, a world-class fishing and hunting       destination averaging over 150,000 visitors annually, and       overturn existing precedent for the management of our       nation's public lands.\n\nThe Boundary Waters and downstream Voyageurs National Park       are currently…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Mr. Chair, data centers are sucking up our most precious resource:  water.\n\nLarger data centers can each drink up to 5 million gallons per day or  about 1.8 billion gallons annually, usage equivalent to a town of  10,000 to 50,000 people.\n\nAt a time when the climate crisis is driving water scarcity even in  places not used to shortages, we cannot afford…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694860/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…standardized procedures, ensuring transparency and enabling us to track  progress with annual reports to Congress and the public. Furthermore,  it authorizes $15 million annually from Fiscal Year 2025 through 2029,  aligning with current FWS investment levels to support ongoing  initiatives.\n\nThis legislation is a crucial step forward in protecting…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693136/introduction-of-the-invasive-species-response-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Bureau of Labor Statistics.\n\nGoldman Sachs has estimated the United States will need roughly  510,000 new workers just to meet rising power demand over the next  decade. Annually, we have more than 200,000 servicemembers who  transition out of the military, many with exactly the same technical  skills, discipline, and mission-focused mindset that our…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…million cut to victim services in fiscal year 2024. Deposits  into the fund have dropped dramatically since 2018. From 2008 to 2017,  deposits were, on average, $2.56 billion annually. From 2008 through  2023, annual deposits averaged only $737 million.\n\nSo that is much greater than a 50 percent drop. There are different  reasons for this that we need to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698843/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…them into a garbage can, lighting them on fire because  they are struggling to keep the lights on. If you are a TECO customer,  you are going to be paying about $939 more annually than you were 5  years ago.\n\nMadam Speaker, folks back home are really wondering: Can Congress get  its act together to help lower the cost of living and work on  solutions?…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…additional entities with ties to  China, Russia, North Korea, and Iran no later than 1 year after the new  rules are adopted. The FCC would also  need to update this entity list annually.\n\nThis bill is particularly important since we know our communications  networks carry Americans' most sensitive personal and government data  on a daily basis, so we must…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…action plan for outreach and  promotion of the many programs available to veterans transitioning into  the small business world. It will ensure that the task force reports  annually to Congress on its outreach efforts for programs available to  veterans, service-disabled veterans, reservists, and their spouses.\n\nFor many of our Nation's veterans, transitioning…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…is supported by data and economic analysis.\n\nEconomic experts estimate that the 2025 tariffs will raise overall  prices by 2.3 percent, costing the average household $3,800 annually,  with even greater burdens on working-class families. Clothing prices  are expected to jump by 33 percent, and food prices by 4.5 percent.  These are not abstract numbers,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…have seen this  Republican majority capitulate to the largest sales tax in U.S. history  in the form of Trump tariffs, costing the average American family  perhaps $4,900 annually at the checkout counter. I have seen this  Republican Congress authorize the imposition of even more excessive  overdraft fees which will cost American consumers another $5…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…oversaw the old St. Boniface Church's transition into  the new Germantown Neighborhood Center in Quincy. Kathy then went on to  lead the center, which serves over 2,000 people annually, including  hundreds of young people.\n\nUnder Kathy's leadership, the Neighborhood Center became a beacon of  hope for the Germantown community. Today, the center is home to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…shelter, rehabilitation programs, and  youth development initiatives in local communities across the United  States.\n\nThe Salvation Army serves more than 27 million Americans annually,  offering compassion, hope, and support to the most vulnerable  populations, including individuals experiencing homelessness, veterans,  seniors, human trafficking survivors,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690965/national-salvation-army-week"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…administrations weaponized the National Labor  Relations Board to target the franchise model, creating a scheme that  cost the franchising sector an estimated $33 billion annually. By  codifying that an employer must exercise direct, actual, and immediate  control over workers, we restore the certainty that small business  owners, contractors, and franchisees…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…first, the state-owned Myanma Oil and Gas  Enterprise, also known as MOGE. This is the junta's single largest  source of foreign revenue, reportedly generating over $1 billion  annually.\n\nSecond, the bill requires sanctions on the state-owned Myanma  Economic Bank, also known as the MEB, which is operated by junta  cronies and processes weapons transactions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…County Adult  Services Office, which coordinates with the Centre County food pantries  to identify needy children and to distribute toys.\n\nThe Nittany Leathernecks campaign annually provides a Christmas gift  experience to more than 9,000 children.\n\nMr. Speaker, I thank these selfless Marines for their service to our  country and their dedication to uplifting…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698118/recognizing-nittany-leathernecks"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…pillar of our national defense, Rock Island  Arsenal supports more than 15,000 jobs. Nearly one-half of those  workers live in Iowa. It also contributes over $1.2 billion annually to  the economy of the Quad Cities region. These are good-paying jobs that  support families, grow our communities, and, most importantly, provide  the backbone of our military…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…country overwhelmingly  voted to unleash America's energy potential, and this legislation  fulfills that mandate.\n\nThis legislation requires the Department of the Interior to annually  report on the dollar value of the overall economic impact of each  mineral commodity for which our country is import-reliant.\n\nThis legislation requires the Department of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…aisle didn't  understand why we have immigration laws.\n\nFirst of all, it is a complete insult to the over 800,000 people who  are sworn in as new citizens in this country annually. Secondly, we  have to make sure the next generation of Americans here think like  Americans and fit in our culture, which means they are law-abiding.\n\nJust in general, the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690016/this-country-has-immigration-laws"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…Farabaugh and his brother-in- law purchased the dealership and now share ownership and  responsibilities at D-Patrick.\n\nD-Patrick has invested hundreds of thousands of dollars annually in  an array of local Indiana organizations, such as Ark Crisis Children's  Center, Boone County Cancer Society, Boys & Girls Club of Evansville,  Evansville Philharmonic…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, this bill represents a tiny fraction of the  total we are spending annually. It is a tiny fraction, 0.2 percent,  one-fifth of a percent of what President Biden added to the debt over  the last 4 years. Yet, Democrats are saying that these savings…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692542/rescissions-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…human cell and tissue products from       the Tissue Reference Group.\n\n(2) Public information.--Not later than 1 year after the       date of the enactment of this Act, and annually for the       subsequent 3 years, the Secretary, acting through the       Commissioner of Food and Drugs, shall publish on the public       website of the Food and Drug Administration--…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…end the following:\n\n``(e) Report.--\n\n``(1) In general.--Not later than one year after the date       of the enactment of this subsection, and not less frequently       than annually thereafter, the Secretary, shall, subject to       the availability of appropriations, submit to the appropriate       congressional committees a report on end-use checks…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…findings from covert testing       data, emerging threats, and best practices.\n\n(c) Report to Congress.--Upon completion of the activities       described in subsection (b), and annually thereafter, the       Director shall submit to the Committee on Transportation and       Infrastructure of the House of Representatives and the       Committee on Homeland…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…35.2 miles of premier hiking and biking trails in the  Allegheny National Forest. This is a significant regional asset that  has an economic impact of more than $10 million annually.\n\nThrough Jim's efforts, Warren County has hosted major events,  including the United States Canoe Association's national championships,  Cabela's 3D Archery and Walleye championships,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Endeavors Incorporated, a Texas-based NGO, received a  $1.3 billion contract from the Federal Government in a single year.  Meanwhile their top executives are paid over $600,000 annually, and the  group spends more than $700,000 on lobbyists all to keep the money  flowing.\n\nContrast that with the conditions our military servicemembers faced  during the same…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…you drive down the road: a  cornfield where every third row goes toward helping to fuel this  Nation.\n\nPermanent E15 could boost corn demand by up to 2.4 billion bushels  annually. It would increase our domestic market access for corn farmers  and support viability for farmers, manufacturers, and our community.\n\nE15 clearly saves up to 30 cents per…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Organ Procurement and Transplantation Network system and       failed to be transplanted, and other appropriate statistics,       which should be updated more frequently than annually.''; and\n\n(2) by adding at the end the following:\n\n``(d) Registration Fees.--\n\n``(1) In general.--The Secretary may collect registration       fees from any member of the Organ…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}]