[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…and go on  to do great things, but his heroism lay that in a time of crisis, he  stood up.\n\nI know there are veterans in this body--I admire them so much--who  have answered that call to serve our country and put their lives in  sacrifice.\n\nThere are people I admire that are heroes of mine that were  suffragettes. There were people who fought as abolitionists.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…battle: fighting abroad in defense of  country and fighting at home for opportunity, change, and their rights  as American citizens.\n\nMillions of Black Americans have answered the call to serve and  protect the American people from all threats, both foreign and  domestic. Today, 350,000 Black men and women serve in the United States  military, and there…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…her participation in National History Day, Ms. Green has  worked with her students to preserve the stories of Delaware's silent  heroes, everyday individuals who answered the call to serve our Nation.\n\nThis past school year, Ms. Green and her students chose to research  two Korean war veterans. They researched the lives that these veterans  led before…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694007/recognizing-emily-green"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…true American hero, a man of the law. Rex embodied the very best of  our Nation: honor, respect, bravery, duty, and unwavering courage.\n\nBorn in east Toledo, Rex answered the call to serve early, joining  the United States Air Force and serving as an air policeman and sentry  dog handler around the globe. He later dedicated over four decades to  the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Purple  Heart for his dedication and service to our country.\n\nMatthew Fisher was born in Livonia and is a proud graduate of  Stevenson High School. In 2004, Matthew answered the call to serve  others by becoming a firefighter in one of our counties. In 2007, he  made the decision to serve our Nation by joining the U.S. Army. He was  deployed to Kuwait…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Sergeant Major Black's journey began in Louisville, Kentucky, where  the values of duty, discipline, and perseverance were instilled early  in his life. In July 1988, he answered the call to serve and reported  to Marine Corps Recruit Depot Parris Island. There, he began a journey  that would span nearly four decades and see him rise to the highest  enlisted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Mr. Ray Fletcher of Cooke County, Texas, for a lifetime of devoted  service to our nation, The Great State of Texas, and his local  community.\n\nMr. Fletcher first answered the call to serve when he joined the  United States Air Force in 1981, where he trained and served as a  Nuclear Weapons Specialist. Over the course of an honorable 22-year  military…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…trillions of dollars,  the United States is not in a better strategic position thanks to our  interventions.\n\nAfter September 11, a generation of brave Americans answered the call  to  serve, many enduring multiple deployments in the region. Some 7,000  U.S. servicemembers paid the ultimate sacrifice in the War on Terror.  Tens of thousands more carry…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Speaker, I rise today to honor the life of Alfred  ``Al'' Magnatta, who passed away just a week before what would have  been his 101st birthday.\n\nAt a young age, Al answered the call to serve his country during  World War II, enlisting in the U.S. Air Force. Serving as a B-17 aerial  gunner with the Eighth Air Force was an experience that forever shaped…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, today, I come to the floor ahead of next  Tuesday, which is Veterans Day, to recognize and share my gratitude to  those who have all answered the call to serve the United States of  America.\n\nNovember 11 is the Federal holiday that we observe today as Veterans  Day. It has not always been referred to as Veterans Day. Its…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…District. His exceptional  military career and steadfast commitment to innovation, leadership, and  mentorship embody the very best of American service.\n\nScott Gatto answered the call to serve his country after he completed  high school when he enlisted in the United States Marine Corps. He  reported to the 3rd Marine Division on September 11, 2001, just…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Americans whose courage, resilience, and unwavering  commitment to freedom helped shape the course of history. At the age of  18, in the midst of World War II, Lewis answered the call to serve his  country. On September 8, 1944, he enlisted in the United States Navy,  where he served honorably as a Seaman First Class.\n\nDuring his military service, Lewis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694998/recognizing-lewis-m-unterman"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Congressional District. His lifelong commitment to  duty, both in uniform and beyond, exemplifies the highest ideals of  service, sacrifice, and community.\n\nRobert Longo answered the call to serve his country in July 1968,  enlisting in the United States Air Force at the height of the Vietnam  War. Over the next four years, he attained the rank of Buck Sergeant…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvanian whose bravery is etched in history is Private  First  Class Foster Sayers, a 20-year-old infantryman from my hometown of  Howard, Pennsylvania, who answered the call to serve during World War  II.\n\nOn November 12, 1944, while fighting near Thionville, France, Private  Sayers singlehandedly charged enemy positions, drawing fire away from…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…scene, he played  a critical role in one of the largest rescue efforts in recent Coast  Guard history.\n\nScott grew up in Warren County, attended Rider University, and  answered the call to serve by enlisting in the U.S. Coast Guard, where  he trained as a rescue swimmer before deploying into action with  courage far beyond his experience.\n\nI am grateful to…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693983/recognizing-uscg-petty-officer-scott-ruskan"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…connected for decades. In fact, those remaining from his  class gathered in 2023 to celebrate their 75th reunion--an  extraordinary milestone.\n\nFollowing graduation, Dick answered the call to serve his country by  joining the United States Navy. From 1948 to 1949, he served aboard the  USS Buck 761 Destroyer, supporting efforts during the Chinese  Revolution.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…career and steadfast commitment to duty,  excellence, and patriotism embody the very best of American service.\n\nMaster Sergeant King is a native of Houston, Texas, who answered the  call to serve his country in February of 1994 at the young age of 18.  He completed basic training at Fort Jackson, South Carolina, followed  by Advanced Individual Training at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "French Hill", "party": "Republican", "sentence": "…recognize the remarkable service of Mr. John Mass, a proud  veteran of World War II, the Korean conflict, and the Vietnam war.\n\nLike so many of his generation, John answered the call to serve,  devoting over 26 years to the defense of our country. He began his  service in 1943 with the U.S. Army Air Corps and concluded with his  honorable retirement from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…District. His  exceptional military career and steadfast commitment to duty,  excellence, and patriotism embody the very best of American service.\n\nTimothy Babcock answered the call to serve his country after his high  school graduation, when he enlisted in the United States Marine Corps.  He reported to Marine Combat Training at the School of Infantry…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…tragedies like this remind us that the cost of our  freedom is not free. None of these men and women were drafted or forced  to put on the uniform they wear. They boldly answered the call to serve  in defense of our freedom and safety, and we are eternally grateful for  the sacrifice that they and all the Armed Forces make every day in  service to our country.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Today, we recognize an institution  that has been a pillar of compassion and service for over 140 years.\n\nFounded by Clara Barton in 1881, the American Red Cross has answered  the call to serve on battlefields, after natural disasters, and in our  local communities. From its earliest days, it has brought comfort and  relief to those facing life's most difficult…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691605/american-red-cross-founding-day"}]