[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I thank Ranking Member Meeks for yielding.\n\nMr. Speaker, may I answer that question for Mr. Meeks?\n\nThe answer is that this is not about drugs. This is about regime  change. We also have the White House Chief of Staff on record saying  that this is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698240/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…from New York complain about same-day authority. In this bill, the  Republicans put in same-day authority to be able to jam this tax scam  through.\n\nThe gentleman didn't answer my question. I guess he is basically  saying that, no, the Republicans will not commit to a CBO score for  people to be able to know what, in fact, the bill will do and the  impacts…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…greatly.\n\nThe President put a lot of emphasis on this. He was just obsessed  with the tariffs. We have to ask ourselves why was he obsessed with the  tariffs. I am going to answer this question, and I am going to answer  this question as it relates to the President's obsession and how it  will impact you. It is important for you to understand how this  obsession…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…are hiring other people from the community are concerned.\n\nEveryone asks, ``What are Republicans doing? Why aren't they standing  up for us, too?''\n\nI don't have an answer to that question. I want an answer to that  question because when you are silent, it means you are complicit or  apathetic. I would hope that there would be no one here who would want…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…how we can       help countries to finance their own health needs. Instead, we       are asking if lifesaving foreign assistance is of benefit to       the U.S. The answer to that question is and always has been a       resounding ``yes.'' We have so much to be proud of. But with       the recent program terminations, we are turning our backs on…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…enforcement norm is for people to  know who police officers are so that they know they have to submit to  their authority? I would inquire if my colleague would like to answer  the question.\n\nMr. Speaker, there are masked agents in unmarked cars sent out,  violating people's due process rights, as the courts have found. This  includes all the way up to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…That is all people are asking for right now, and we are going to  fight to make sure that every single American can go to bed at night  not having to worry about the answer to that question.\n\nMr. Speaker, I thank you for your attention tonight. I ask you to  come together to find a solution to this crisis.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…think about it, the state is an agent for the       federal government in elections. I don't know why the federal       government doesn't do `em anyway.\n\nWell, let me answer that question for the President. It is really  simple.\n\nIt is because the Constitution says otherwise. The Constitution  clearly entrusts elections to the States and to Congress,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…their Christian faith, there is no refugee path  for them. What is the difference between an Afrikaner and a Nigerian  subject to persecution? I think we all know the answer to the question.\n\nSo if you support President Trump's immigration policies, I think you  have to look in the mirror and grapple with the fact that his  motivation is about fundamentally…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the only  way that they could come to this Earth, and thank God they did. To  think that this man who is seeking this lifetime appointment to the  bench would not even answer the question on IVF is troubling.\n\nJoshua Divine is too inexperienced to serve as a district court  judge, and his radical views, I think, disqualify him.\n\nI am also troubled by…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…will enforce section 2 of the Voting Rights Act, which the Supreme  Court of the United States, a conservative Supreme Court, just  reaffirmed 2 years ago. She didn't answer the question.\n\nIt is clear why she didn't answer--because she never planned on  enforcing it. In fact, it has been reported that the Department's  lawyers in the voting rights section…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…incredibly important to save our Republic.\n\nMr. MERKLEY. I note that my colleague from Oregon, following proper  protocol here, has arrived on the floor. I would be happy to answer a  question, should you have one.\n\n(Mr. SHEEHY assumed the Chair.)\n\nMr. MERKLEY. I would be happy to yield for a question.\n\nMr. MERKLEY. Thank you so much to my colleague from Oregon…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…President should be able to launch a preemptive  nuclear war without congressional authorization. That is nuts.\n\nMr. McGOVERN.\n\nMr. Speaker, I have still not gotten an answer to the only question  that matters today: Why did we strike Venezuela, spending taxpayer  money and putting American troops in harm's way to replace Maduro with  his own Vice President,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…were skyrocketing and the stock market  was plunging; when pension funds, 401(k)s were going down; when  Americans were hurting and looking up; when the resounding answer to  this question was no--are you better off economically than you were 71  days ago?--where were you?\n\nDid you speak up at a time when the President of the United States  was launching…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…admit he lost the 2020 election. Why are they afraid of  it? It is a fact. They are afraid because it will make him angry. He  may dump their nominations because of the answer to that question.\n\nThe fact that she is willing to condone President Trump's false  claims further demonstrates a level of partisanship and deference to  this President that is unacceptable…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "John Thune", "party": "Republican", "sentence": "…address the northern border  component of this crisis? Will the cartels simply shift tactics and  expand their operations to the north? I think we can be confident the  answer to that question is yes.\n\nWe have already seen some illegal immigrants attempt that shift when  faced with stricter security measures at the southern border. And last  week, the FBI…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…years of what many viewed as America last policies that  left families struggling, dreams deferred, and our Nation asking  itself: Are we on the rise or decline?\n\nTo answer that question, we need to look at where we have been for  the last year. We need to look at the results that this President,  President Trump, and where the House Republican leadership…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the Chair       or designated Member overrules the objection, these Members       may refer the matter to the Subcommittee or may order and       direct the witness to answer the question, but the       Subcommittee shall not initiate procedures leading to civil       or criminal enforcement unless the witness refuses to testify       after being ordered…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…predictor is the world economy--that if we have a strong world economy,  the carbon footprint is going to be less. So we think about: Well, why  is that? And we should answer the question: Why is that so? If there is  a strong world economy, then the infrastructure can be built for energy  production with a smaller carbon footprint.\n\nI think of building…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…these Halls serves  as a constant reminder that our charge is not to serve ourselves, but  to serve a greater good.\n\nAt the close of each day, may we too be able to answer that question  with certainty, having served with purpose, led with integrity, and  upheld the ideals that Franklin and our Founders entrusted to us.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…about how much the premiums are skyrocketing, do you know  why? What is the underlying law? The underlying law is the Affordable  Care Act.\n\nMr. Speaker, I wish I could answer the question. I wish I would get  an answer to the question of why did they set them to expire and why is  the Affordable Care Act not working.\n\nMr. Speaker, I am prepared to close,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…of the other issues. We will find that when we do this, we  probably have solved some problems, and we will discover additional  problems. Sometimes when you get an answer to a question, it raises  more questions. That is what this bill is supposed to do. It is  supposed to start us down the path.\n\nIf we find that there are other issues that Congress…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Senator from Virginia if the vetting  process should be strengthened after the shooting. Now, that is exactly  what President Trump is doing. The Senator refused to answer that  question. Instead, he told a national television audience that having  the National Guard in Washington, DC, was a ``political stunt.'' He  blamed President Trump.\n\n``Political…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…there seems to be a pattern of malicious lying and fiction  when it comes to conservatives. So I asked the AI model ``Has Marsha  Blackburn been accused of rape?'' The answer to this question, of  course, is an unequivocal no. I never have. Yet, Gemma fabricated an  entire outlandish criminal allegation against me. It had a massive  story about a rape in…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…after Biden commuted his sentence in the  killing of two FBI agents. Is that who my colleagues on the other side  of the aisle think they ought to be defending?\n\nCan they answer the question of commuting the sentences of these  violent criminals and putting them out on the streets, just as they  voted against every measure we put forward to defend our borders…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Federal law.\n\nAgain, it is not me saying this. This is a unanimous panel of Trump- appointed and Biden-appointed judges who came to that determination.\n\nI will happily answer the question of my friend from Maryland (Mr.  Raskin) about what is the question when it comes to agriculture. Here  is what the law says. The law says that coming into this country…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]