[{"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…about. It has not changed. So  until the actions change, words don't matter.\n\nNow, Michiganders have been clear with me that there need to be  consequences for this kind of anti-American behavior, and that starts  with leadership. We have a cast of characters who are in charge of  policy related to immigration.\n\nLet's start with Secretary Kristi Noem. She…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…themselves: Do you want to stand on the side of voter  suppression or do you want to stand on the side of democracy? I choose  democracy and will vote ``no'' on this dangerous anti-American bill.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690014/safeguard-american-voter-eligibility-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…targeted mentions of slavery, Native American history, Chicano  history, AAPI history, LGBTQ+ history, climate change, and other topics  which they claimed were divisive, anti-American, and created ``national  shame,'' thereby erasing the history of tens of millions of Americans.\n\nSecretarial orders, including those at the Department of the  Interior,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…bills like the Freedom to Vote Act, the John R.  Lewis Voting Rights Advancement Act, and the Native American Voting  Rights Act, not the SAVE Act.\n\nI fiercely oppose this anti-American bill. I urge every one of my  colleagues, Republicans and Democrats alike, to defeat this extremist,  antivoter SAVE Act.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "Mr. WARNER. Madam President, I come to the floor today to condemn the  heartbreaking and anti-American rise in religious discrimination and  hate-fueled extremism and to call particular attention to the ways this  administration has fueled the flames of Islamophobia and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…rose 912 percent.\n\nMy fear is that a similar study would show that in between the issues  that we do think are legitimate businesses on TikTok, that there is a  bias and anti-American content being pushed about even the current  hostilities now in Iran. That is why I would like to submit for the  Record a report by Rutgers University entitled ``A Tik-Tok-ing…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…smart thing to do for the United States. I want to read a quote  from someone who I think understands that. ``It is going to be a lot  harder to recruit someone to anti-Americanism, anti-American terrorism,  if the United States of America was the reason why they are even alive  today.'' This quote, Mr. Speaker, is from our own Secretary of State,  Marco…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…right to her opinion. She has the right to  try to have the socialists take over the Democratic Party. That is the  American way. Ironically, I think what she is doing is anti-American,  but she has the right as an American to do it, so I don't hate her.\n\nBut I judge her by her policy. She has her opinion, and I have mine.  I have to judge her, candidly,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…mere weeks before the transition to the Trump  administration.\n\nLast Congress I was proud to introduce the Alaska's Right to Produce  Act which reversed many of these same anti-American energy policies of  the Biden administration and passed the House with bipartisan support.\n\nAlaska is blessed with a tremendous wealth of natural resources. In  fact, when…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…propaganda.\n\nMr. Speaker, we have the opportunity this week to rescind a billion  dollars that is in the pipeline right now for NPR and PBS, two outlets  that routinely spew anti-American and anti-Christian propaganda. They  sow racial division in this country, and they promote weird, woke  values that most Americans find disgusting.\n\nMr. Speaker, this is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692310/ending-taxpayer-funded-propaganda"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…who fell on hard times and needed a helping  hand, but today my Democrat colleagues are defending them as a final  destination. That is not right, Mr. Speaker, and it is anti-American.\n\nEven former President Biden once said: The culture of welfare must be  replaced with the culture of work. The culture of dependence must be  replaced with the culture…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…taxpayer dollars under the previous  administration. And we saw a lot of corruption in our institutions.  With these programs, the Biden administration pushed a radical anti- American agenda, and now, with the Trump administration, we are  restoring common sense and putting the American citizens first.\n\nOn the economy, the President's pro-growth and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "John Rose", "party": "Republican", "sentence": "…the art of following through.\n\nIf elected again, President Trump said he would put a stop to men  competing in women's sports. He did.\n\nHe said he would end divisive and anti-American DEI policies in  schools across the country. He did that, too.\n\nThe President told us that this country would once again be respected  on the world stage. Mr. Speaker,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…that seek to teach students Chinese language and culture. However, they  are often used as tools by the CCP to steal American knowledge and/or  indoctrinate children with anti-American ideas.\n\nLastly, H.R. 1049, the Transparency in Reporting of Adversarial  Contributions to Education Act, led by Representative Bean from  Florida, empowers parents by giving…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…land access  to critical minerals in Central Asia, which, additionally, want to be  friends of America and friends of Western civilization. The regime  peddles in daily anti-American propaganda accusing top officials of the  United States Government, including President Trump and the very  appreciated Senate Foreign Affairs Committee Chairman Jim Risch,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…are becoming more and  more apparent. No. 1, third world foreigners from predominantly Muslim  countries are coming here and stealing American tax dollars while they  spew anti-American rhetoric. No. 2, Democratic elected officials seem  to be complicit in helping foreigners who hate this country steal from  their own constituents, their own people who…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…whatever psychological reason, they want that  purpose to be hostile to the West in general.\n\nIf they are in the United States, they frequently want that purpose  to be anti-American. Of course, when Greta Thunberg wants to get  involved in foreign affairs, it is not surprising that she picks global  warming because then her enemy is the West and the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…families across America.\n\nIt is time to unleash our domestic resources to put this money back  into the pockets of American families by repealing the Biden  administration's anti-American energy policies. What is more, instead  of working with the State, the Biden administration blatantly ignored  local opposition at every stage of this process and rammed…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…Secretary of Education with the name and country of  origin, the amount of funds that are being put into our public schools,  and any terms of that contract.\n\nThe CCP is anti-American to its core. We stand for freedom of speech,  expression, and religion. They stand for none of our values. Confucius  classrooms are propaganda, and they are often set…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…projects to continue through the  regulatory and environmental review process, allowing them to fight  another day.\n\nMost importantly, these resolutions will prevent future anti-American  energy administrations from taking similar actions in the future.\n\nMr. Speaker, I thank my colleagues from Alaska, North Dakota, and  Montana for introducing these important…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694892/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…production. We are blessed with abundant resources. We have the  brightest minds, and we maintain the most rigorous and clean production  standards in the world. Yet, the anti-American energy policies pursued  by radical environmentalists in the previous administration crippled  communities reliant on energy jobs, weakened us on the global stage,  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Venezuela was strained when  they named strongman Hugo Chavez as their leader. Maduro was a leader  in the Chavez government, Mr. Speaker, and was a full partner in the  anti-American policies and the growing partnership with Cuba, China,  and Russia.\n\nIn 2013, Maduro became the president of Venezuela after Chavez'  death. He continued those communist…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}]