[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…I did yesterday, I also just have to acknowledge what it means for  families throughout the State. You see, as the parents of three growing  boys--they are not little kids anymore; they are growing--through the  course of their upbringing, we have been able to control certain  things, like how we feed our kids. We go to the grocery store, and you  are…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…toddlers, like my 3-year-old, they can have their  body weight reduced to be as low as an infant's.\n\nWhen they suffer from extreme malnutrition, they can't be fed  traditional food anymore. In order to save their lives and to cure  their malnutrition, they need this: Plumpy'Nut. It is a packet of  fortified paste. They take one of these per day. After a month,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…expertise.'' As a former head of ERS said in 2021, ``The agencies have  been decimated. Their ability to perform the functions they were  created to perform--it doesn't exist anymore.''\n\nEmployees in the headquarters for the agencies located in the NCR  perform the indispensable work of keeping Congress informed of agency  activities. Congress cannot write…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688344/introduction-of-the-protecting-federal-agencies-and-employees-from-political-interference-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…impacted people in the United  States of America. The idea that this has no impact on our citizens  doesn't matter. It just fails to recognize that it is not the 19th  century anymore. It is a globally connected world that impacts us.\n\nThe last argument I would make, Make America Great Again: We are  supposed to be the most compassionate nation. As we run…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…advance not only through committee but  all the way through to the House floor for a final vote, it is getting  a little bit harder to laugh. That is because it is not a joke anymore.  It is a case study in misplaced priorities.\n\nMr. Speaker, when you start erasing or changing phrases like  ``climate change,'' ``equity,'' or ``disadvantaged communities''…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…customers.\n\nWe lose relationship banking, community involvement, and a personal  touch from your neighborhood bank. When these big bank mergers come in,  you don't have tellers anymore. As a matter of fact, when they close  down the branches, you try to get them on the telephone.\n\nHave you tried to talk with a bank manager on the telephone with  these menus…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…violence in our communities. Trump would have taken  this office in a different direction, but he didn't. He just shuttered  it. There is no Office of Gun Violence Prevention anymore in the  Federal Government.\n\nOn March 20, the administration announced that they are going to  start a process of restoring firearms rights to individuals who have  had them…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…people didn't offer amendments to all of these bills, I think people  are getting to understand what is going on here. My Republican friends  don't even ask for amendments anymore. They don't give people time to  write them. Everybody kind of knows that the system is rigged. It is  take it or leave it.\n\nPeople have had it. Every single Member here has…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…voted for  because of that promise, is out the window. No one is even paying any  attention to it. Donald Trump really is not paying attention to it.\n\nPeople don't believe it anymore. They don't believe any of the  promises that Donald Trump has made. Donald Trump has broken faith with  the very same people he promised to fight for, and I have felt that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…refrigerators. How out of touch are Republicans  with the American people? Like literally, I know Republicans are not  holding townhalls and meeting with their constituents anymore, but do  they think that the American people voted for them to waste our time on  refrigeration standards? That is what they think they were elected to  do?\n\nLiterally, how…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…other governments  to make them work is a deep, dangerous, and expensive hole that is  being dug by this administration. The American people don't want to go  down this path anymore.\n\nOur primary job must be to defend our country against all enemies,  foreign and domestic. That means being strong inside our own borders.  It means abiding by the rule of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…jobs,  like one of my constituents who I spoke to during a press conference  after we passed the big, ugly bill, who worked as a contractor, got  injured, and could not work anymore but also was trying to get workers'  comp and was caught in that process.\n\nI was a State legislator when we expanded Medicaid in Virginia. Part  of why we did it was because…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…corruption and illegality in the regime; if companies start being  mouthpieces for the regime as a price of doing business--if all that  happens, then we are not a real democracy anymore; we are a fake  democracy. Elections still happen, like in Turkiye, like in Hungary,  like in Venezuela, but the rules are going to be tilted, and dissent  will be suppressed…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…crisis created entirely by the President of the  United States and his Republican Party.\n\nLet me say this clearly to the American people. If you cannot afford  health insurance anymore, you have one person and one party to blame:  Donald Trump and the Republican Party. It is the same party that cut  taxes for billionaires and cut Medicaid for working-class…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…afraid to go to court.\n\nHow does that possibly make our country more safe? People are  skipping hearings, risking automatic deportation, because they don't  trust the system anymore. How is anyone supposed to follow the legal  steps if even those are now a risk?\n\nRepublicans claim over and over again in committees that this is only  about illegal immigration.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…cares about us getting our act together and doing things  better, if you are a Member of Congress, I know doing big things around  here is terrifying. We don't have a choice anymore.\n\nIf anyone actually read the Moody's report that was put out last  Thursday, they make a couple points that should scare the crap out of  us.\n\nIn 9 budget years, they believe…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…We don't mine like we used to.\n\nIn Montana we have Virginia City. They took a paddleboard up the  river stream, took everything, turned it around. We don't mine like  that anymore.\n\nWe use science now, and when you look at the science and  documentation on this mine, it uses the best technology.\n\nOh, by the way, water, it is a closed-circuit. What does…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…excessive?\n\nI didn't use those words, but that was how the question was postured.\n\nThe response to that was the President said: That is why Thom is not  running for office anymore.\n\nHe went on to say very nice things, that he likes me and we work  together. I like the President. As a matter of fact, I know many people  would be shocked to hear this,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…a great piece of  public policy that has worked so well in 46, 47, 48 States at this  point, and there is no reason why the Federal Government should lag  behind the States anymore in crafting a very good, commonsense piece of  legislation.\n\nThis bill is victim-centered. It is law enforcement-focused, as well.  It checks all the boxes of good public…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…that wanted to stay here found themselves  struggling to stay alive in conditions where they couldn't compete.\n\nNow, some might argue that Americans don't want to make shoes  anymore, but we did a generation ago. The American workers of that age  knew that there was something meaningful in creating and producing.\n\nToday, we have been taken by the idea…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "James Risch", "party": "Republican", "sentence": "…in Chief of our Armed  Forces to defend this country. And he took an oath to do so.\n\nSo why are we here today? We are looking at a resolution saying that  he can't do this anymore. This is nonsense. It is unreasonable. It is  why the American people look at Congress and say: Are you people crazy?  You have the President of the United States trying to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "James Risch", "party": "Republican", "sentence": "…process of doing this. And the  resolution says that he should stop it. He is not doing it.\n\nNow, if the resolution were drawn to say, ``Mr. President, you can't  do this  anymore,'' that would actually have some effect or attempt to have some  effect. It would be unconstitutional, unenforceable. But to tell him  not to do something or to stop doing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…single-State issue; this is a national issue. In fact, it would now  affect 40 percent of all the vehicles sold in America. This just  shifted. This is not about one State anymore. This is almost half the  vehicles sold in America now are going to have a new set of rules.\n\nThe Biden administration sat on that request. They didn't move on it.  They have…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…what we are doing, and  they didn't send anything back. Now they have.\n\nSo the bottom line is, Mr. President, this provision was a result of  ``We are not going to take it anymore.'' The law was flagrantly  violated, I believe, but he has already made a decision--Senator Peters  has--that Jack Smith was lawfully in the right here. Have a hearing. He…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…abandoned the middle class for the liberal elite class a long time ago.  The election last November should have been a wake-up call that the  American people don't believe them anymore, nor should they.\n\nThe Democrats are desperate for attention and for power. Don't give  it to them.\n\nLet's set the record straight about what this budget resolution  actually…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in misallocations and fraud and these things, and you could fix it by  just having the databases talk to each other and know this is a  fraudster, this person isn't with us anymore, they have gone on to  their reward, but somehow they are out here asking for an SBA loan, is  that Republican or Democrat? It is just technology. Yet you have  protesters…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Waters Canoe Area. They are not inside the buffer zone to the Boundary  Waters Canoe Area. They are out in the forest that the Biden  administration said can't be developed anymore, even after Congress had  already said this was the case.\n\nI think what we are doing today is we are exercising our Article I  power where an administration abused it and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…monstrosity.\n\nMrs. McCLAIN. Mr. Speaker, that was fear-mongering at its best.\n\nI yield 1 minute to the gentleman from Ohio (Mr. Davidson).\n\nI can't take the fear-mongering anymore. Let me correct the truth  with the other half of the truth. We are talking about PEPFAR: $4.4  billion, and we are talking about cutting less than 1 percent from that  whole…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…home, and they were told: By the  way, your allotment that you are supposed to be able to get, that you  wanted your whole life, that allotment changed, and you can't do it  anymore. Huge injustice.\n\nSo during the first Trump administration, I introduced legislation  called the Alaska Native Vietnam Veterans Land Allotment Act. And it  said: Hey, if you…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…anybody that might have got caught snoozing for a few seconds here or  there, we don't want to be too hard on them since it was an all- nighter, and we are not in college anymore.\n\nIt is significant what we have accomplished. The Energy and Commerce  Committee just finished up, and the House Ways and Means Committee  earlier. We have got 11 or so committees…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}]