[{"senator": "Brad Schneider", "party": "Democrat", "sentence": "…lines, unable to conceal my Star of David, and because of it,       I was cursed as a ``dirty Jew.'' From our window, we saw       other families being pulled from their apartments and hauled       away in trucks.\n\nIn August 1943, grandmother decided we had to flee Paris.       We obtained false identity papers with new names and equally       false…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…When rents are sky high and there  literally is not a single place in the country where someone can afford  rent on minimum wage, private equity is coming in to buy up the  apartments and colluding to drive up the rents so it is even more  unaffordable to keep a roof over your head.\n\nIt wasn't always this way.\n\nFrom World War II to the late 1970s, we actually…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…organization's volunteer program, revamped annual community and  fundraising events and led the effort to turn part of their West St.  Paul space into affordable senior apartments. When the pandemic hit in  2020, Ann ensured her team and volunteers were positioned to continue  engagement with seniors in a safe way. DARTS also provided support to  organizations…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…names: granny flats, backyard cottages, or  accessory dwelling units, but all expand our affordable housing supply.\n\nWhen I was mayor of San Jose, we made building backyard apartments  easier by enabling thousands of homeowners to be able to get their  permits online in a single day. The problem, though, is that many  homeowners of modest means could never…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693705/america-faces-a-housing-crisis"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…he was able to bring  those wins to communities, including the development of 100 units of  affordable housing in the heart of Logan Square in the Lucy Gonzalez  Parsons Apartments.\n\nOn behalf of Illinois' Third Congressional District, it is my  privilege and my honor to commend Carlos Ramirez-Rosa for his  commitment to a fair, safe, and dignified…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…communities.\n\nIn 1989, following the tragic shooting at Cleveland Elementary School  in Stockton, Ms. Koeurt joined with 34 Southeast Asian refugee families  at Park Village Apartments to co-found the Asian Pacific Self- Development and Residential Association, or APSARA. The organization  was founded on the belief that communities must come together to…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694721/recognizing-sovanna-koeurt"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…we have seen time and time again, being nearby an unstable       micromobility device can lead to injury or even death. Often,       these fires impact multiple homes or apartments, causing       damage or injury to close by neighbors and their adjacent       property.\n\nWe humbly ask that you support H.R. 973, the Setting       Consumer Standards for…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…but they did not arrest a single  member from that gang.\n\nI visited that apartment building and saw firsthand the destruction  those agents left. Doors to people's homes or apartments were kicked  down. Belongings, including little kids' toys, were strewn about in the  hallway. That raid and so many others shook our community, not just  immigrants, but…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…from Canada and steel from Canada, the price of your  house goes up.\n\nLook, people already can't buy a house because interest rates are so  high. Young people are living in apartments. More and more, people feel  stuck in their life, and we are going to add to the price of lumber and  steel to make homes even harder to purchase? It is a terrible idea.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "French Hill", "party": "Republican", "sentence": "…including       prefabricated construction.\n\n``(N) Reducing or eliminating minimum unit square footage       requirements.\n\n``(O) Allowing the conversion of office units to       apartments.\n\n``(P) Allowing the subdivision of single-family homes into       duplexes.\n\n``(Q) Allowing accessory dwelling units, including detached       accessory dwelling units,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…of the cost  of their housing.\n\nWorse, because it is new housing, I had a staffer looking for a new  apartment building with her new husband, and they found out the best  apartments in town were the low-income housing.\n\nIn order to be eligible for low-income housing, you almost certainly  can't be married. In order to be eligible, you can't be working…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689925/perverse-incentives-of-our-welfare-state"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…veterans, especially those who have faced homelessness.\n\nIn 2013, Lisa and Burlington Capital partnered with the U.S.  Department of Veterans Affairs to create Victory I Apartments, a  community built on part of the former St. Joseph Hospital site. It  provides 90 permanent, supportive housing units for formerly homeless  veterans. This project was…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…great-grandchildren and later helped at the Senior Center until she  retired at 90 years old.\n\nOn March 13, 2011, her daughter passed away. In December, she moved  into the Oxford House Apartments. She has made many friends in the past  14 years. She enjoys playing dominoes and exercising. Helen is a woman  of faith and loves her family deeply.\n\nMr. Speaker, please…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692887/recognizing-the-100th-birthday-of-helen-dramer-jarrell"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…out what a person working for me once found out.\n\nShe got married, and she and her new husband were looking for a new  apartment. They found what they felt were the nicest apartments in  Madison, Wisconsin, were the low-income apartments. Not only do you get  a free apartment, but it is superior to the apartments that other  people are paying for.\n\nWith…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…derailing their plans.\n\nFor millions of hardworking Americans, especially young people,  renting has become a painful burden, and homeownership has become a  near impossibility. Apartments in cities should not be reserved only  for those who can afford luxury units. They should be accessible to all  working Americans who  keep our cities running and keep them…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…developed that way.\n\nI had always wondered before hearing about these things why sometimes  low-income housing developments look nicer or more elaborate than  regular old apartments. Part of that is they are newer, and, of course,  newer buildings are usually nicer. A lot of it is we are paying these  developers 70 percent of the cost of their building.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the housing  available in low-income housing.\n\nThe programs are set up in a way that the owners of the low-income  housing are encouraged to build very modern, very upscale apartments  that maybe some of the average people cannot afford. As a matter of  fact, a lot of the average people may still be living with their  parents for a while even after they…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…something called low-income tax credits.\n\nThese low-income tax credits are given to property developers that  are equal to 10 percent of the value of what they spend on new  apartments for 9 years in a row. Now, there is a time value of money,  but even given the time value of money, it means that the government is  paying for 70 percent of some people's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}]