[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…spread lies and  indoctrinate people about what China, Iran, and Russia want Americans  to believe about our own country, about our own government. This is  alarming when an app is the top news source of Americans under the age  of 30. Let me give some examples of these practices.\n\nIn December 2023, Rutgers University found that TikTok's algorithm…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…wake up  and see that this technology is fixing prices and increasing costs for  our families.\n\nTarget, for example, charged higher prices to consumers who were  using their app when they were inside their stores, assuming that the  consumer either wouldn't notice or was unlikely to go anywhere else.\n\nMr. Speaker, this is outrageous and wrong. Companies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Institute, and the National  Partnership for Women and Families; one letter from SEIU; and one  letter from the U.S. Sustainable Investment Forum. The link is: https:/ /house.app.box.com/s/xpixugm5qpckl4kxrc4h4u55i3to8roy\n\nMr. Speaker, right now across the country, workers are struggling to  pay their bills and meet basic needs, let alone save for retirement.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…booklet.\n\nOther efforts abound. Rhode Island's secretary of state       offers free Gaspee posters on demand. A Brown University       instructor created a virtual reality app that allows users to       be immersed in a reenactment of the story. A license plate       depicting the burning of the Gaspee became available to state       drivers this…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…contact with that banned  person on the service. This will help to reduce the number of people  who fall victim to identified fraudsters looking to extort money from  dating app users.\n\nMr. Speaker, this bill is an important first step in addressing harm  in the online dating space. However, there is a lot more to be done,  and vulnerable consumers…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Speaker, last week I visited Perkins High School in  Sandusky, Ohio. My role: to celebrate excellence in STEM education.\n\nThis year, Kia Preston won the Ninth Congressional District App  Challenge for a project titled ``Light Teachings.''\n\nKia's interactive app helps users understand fundamentals of ray  tracing, a computer graphics technique that simulates…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699254/perkins-high-school-stem-achievement"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize and applaud  Aariv Arora of Broomfield, Colorado, for earning the Rookie of the Year  Award in the 2025 Congressional App Challenge.\n\nAariv built an interactive app called WayBuddy, a community safety  app that allows students to report roadway hazards for fellow  pedestrians and bicyclists on…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698764/recognizing-aariv-arora"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize and applaud Amy  Zhang of Morrison, Colorado, for winning Best in Show in the 2025  Congressional App Challenge.\n\nAmy built EnAct: AI Guides, Vision-Impaired Act, an assistive  technology app for seeing impaired individuals that describes the  user's environment, helping them…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698677/recognizing-amy-zhang"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…issue. In fact, both the chair and ranking  member of the Senate Armed Services Committee, in a bipartisan manner,  requested that the Pentagon investigate the use of the Signal app to  share classified information.\n\nWe can all agree that no government employee, let alone a Cabinet  member, should be sharing classified information in a Signal chat and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the floor to  recognize Aarit's talents, nor is it the second. This is actually the  third time Aarit has been recognized before this body.\n\nIn 2023, he was the Congressional App Challenge Winner for Ohio's  13th District when he was in middle school. His app, Care Civics, was  designed to encourage young people to become civically engaged. He was  inspired…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…checking it, making       sure you're where you need to be.''\n\nWhen she was first diagnosed, Abby had to give herself       injections, and didn't have the insulin pump, phone app and       other devices she has now to help her monitor her blood       sugar. ``I didn't have the easiest time with it, so if I get       the chance to maybe help other kids…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…done by  an unelected billionaire who is intent on changing this government in  ways that make it look like a dictatorship.\n\nNotably, this resolution will shield Elon Musk's X app, which will  soon get into the payments business, from supervision and oversight by  the CFPB.\n\nThe CFPB oversees the largest banks and the services they provide to  consumers,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to honor Kaxten McGrew,  Bastian Nowak, and Luke Hinkelman as the winners of the 2025  Congressional App Challenge for our district and name them as Ohio's  13th Congressional District's champions of the week.\n\nTheir app, Eagle Express, is an innovative system that allows  students…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698016/champions-of-the-week-kaxten-mcgrew-bastain-nowak-and-luke-hinkelman"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Over the years, Kathryn earned a strong reputation as a thoughtful,  responsive, and reliable member of my team. She coordinated the  office's participation in the Congressional App Challenge, engaging  with high school students across the district as they learned to code  and develop their first apps. Kathryn was also deeply involved in the  office's congressional…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…UNITED''and inserting ``OF       UNITED''.\n\n(7) Section 70052(e)(1) is amended by striking ``section       4197 of the Revised Statutes of the United States (46 U.S.C.       App. 91)'' and inserting ``section 60105''.\n\n(g) Oil Pollution Act of 1990.--The Oil Pollution Act of       1990 (33 U.S.C. 2701 et seq.) is amended as follows:\n\n(1) Section 1001…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I rise today to recognize the  Congressional App Challenge winners for Indiana's Third District: Ishan  Ramrakhiani and Rikhin Kavuru.\n\nTogether, these two students identified a gap in AI services and  decided to provide a…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699627/recognizing-congressional-app-challenge-winners-for-indianas-third-district"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…SCHWEIKERT. Mr. Speaker, for everyone's sanity, I hope not to go  60 minutes. I might go 40.\n\nMr. Speaker, first, the good news. If anyone else is a geek out  there, there is this app put out by the Atlanta Fed, Atlanta Federal  Reserve, and what they do is they do certain samples in trying to  constantly estimate what the gross national product, GDP, will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…225 displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…225 displaced individuals who  remained in shelters, demonstrating their unparalleled ability to adapt  and respond under pressure. The team leveraged the Human Services Needs  app to streamline disaster case management, supporting 1,351 residents.  Their follow-up system, in partnership with other agencies, ensured  personalized service for every individual.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…meet online often take their conversations to other  communication platforms and might not know that they are talking to  someone who has been removed from the original dating app.\n\nThis bill requires dating platforms to issue fraud ban notifications  to users who have interacted with an account who has been removed for  fraudulent activity.\n\nAs criminals…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692729/romance-scam-prevention-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…AI  to prescribe.\n\nThis August, with the wearables, I am going to do an experiment with  this Oura Ring. I am buying some Dexcoms to manage my glucose. Have we  all seen the app where we can take a picture of food and it calculates  glucose and calories?\n\nHow can we create the incentives? Maybe we should look at the ACA.  Instead of just smoking in…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…protest and seek redress from your government.\n\nMr. PERRY. But protesting does not mean impeding law enforcement. It  does not mean blocking streets. It does not mean getting on an app on  your phone--that is supported by George Soros--to track Immigration and  Customs Enforcement, law enforcement officers, the law enforcement  police, and track them down…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…225 displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…225 displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the  elderly. Just in February--and this is a case in point--there was a  lady in Massachusetts. She was allegedly raped after ordering an Uber  Eats delivery to her home. The app indicated that a woman would be  delivering her order. Instead, an illegal alien with horrific  intentions is who showed up on her doorstep.\n\nLast week, I sent a letter to Meta…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…225 displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…225 displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services. Needs app to  streamline disaster case management, supporting 1,351 residents. Their  follow-up system, in partnership with other agencies, ensured  personalized service for every individual.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}]