[{"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…freedoms, and it is Putin who wants to  destroy another European democracy. It is Putin who is a cancer on the  world, a liar, a torturer, a murderer, and a war criminal.\n\nIt is appalling to see our President of these United States, expected  to be a reliable standard-bearer of democracy, align himself and as a  result ourselves so closely with our adversaries,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Ms. JAYAPAL. Mr. Speaker, I rise in strong support of this measure to  rein in President Trump's unlawful boat strikes.\n\nThese strikes and Trump's naval blockade represent appalling  violations of international law and Congress' constitutional authority  to authorize the use of military force.\n\nDrug trafficking is a serious offense. Communities across…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…disagree with that. But when it is the  situation that we are going to pay for it by taking away nursing home  beds from Vermonters, from folks in the Carolinas, that is really  appalling. We should not do it.\n\nI am here with my colleagues to defend our commitment to good  scientific research, to good cancer research, to good healthcare access  for poor kids…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…seniors, 52 percent of Latino seniors, and 41 percent  of Asian-American seniors rely mostly or only on Social Security for  income. This effort to gut Social Security is an appalling illustration  of the highest level of greed, where billionaires rob from hard-working  Americans to augment their wealth.\n\nBy slashing staff, closing 6 out of 10 regional…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…election because they  are going to vote you guys right out of office. The economy stinks  under this administration. I mean, the rhetoric coming out of this  White House is appalling. Enough.\n\nMr. McGOVERN. Mr. Speaker, I am not going to respond to the gentleman  who characterized January 6 as a normal day of tourism here.\n\nMr. McGOVERN. Mr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…their time. I will close with this.\n\nKing said: ``We are going to be made to repent in this generation not  just for the vitriolic words and deeds of bad people but for the  appalling silence of good people.''\n\nMr. Speaker, I say to my friends on the other side of the aisle who  have  been silent all day that they may live to regret that silence.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I have been listening to this  debate, and I am struck by the appalling ability of the Members of the  other side who are so afraid of this President. They are willing to lie  to the American people because they fear the tweet of a President…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693208/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…less protected and crime victims less supported. The list       could go on.\n\nAs for its treatment of its employees, the current       leadership's behavior has been appalling. This       administration's lies about the ``deep state'' and       exaggerations about government inefficiency have eroded the       respect our country once held for public…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…earlier this month, I joined my neighbors  across Delaware in celebrating the freedoms that define our Nation,  freedoms made possible by those who have worn the uniform.\n\nIt is appalling that while families gathered under fireworks to honor  that sacrifice, the Trump administration was all too quietly forcing  thousands of patriots from military service.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…marriage, increasing sexual  violence and the risk of pregnancy-related deaths.\n\nThis administration's ideologically driven disregard for global  public health worldwide is appalling. Contraceptives are legal and  widely used in America. They prevent unwanted pregnancies and  abortions. They enable women to choose when to have a child and grow  their…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…can't trust  us.\n\nThis is not good governance. It is not reform.\n\nMr. Speaker, history will not be kind to those who enable this  President through words or through their appalling silence.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…among the 120,000 forced to leave  their homes and their businesses.\n\nThey were sent by their own government, our government, to a camp in  Poston, Arizona. They lived in appalling conditions, surrounded by  barbed wire and armed guards, solely because of who they were.\n\nI was born in that internment camp, and that history lives with me  every day.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699717/rewriting-history"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…everyone here: Under no circumstances should  the power entrusted to us as Members of Congress be used to line your  own pockets, period, full stop. Anyone who voted for this appalling  provision, including all but two House Republicans just last week,  should feel ashamed of themselves.\n\nAs these Republican Senators and House Members know, phone records…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…another assailant beat Hodges in the face with a stolen  baton. U.S. District Judge Trevor McFadden described McCaughey as the  poster child of all that was dangerous and appalling about January 6.\n\nPeter Francis Stager, sentenced to 4 years and 4 months, wielded a  flagpole and repeatedly struck a defenseless officer who was lying face  down.\n\nI would…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…of time than the  people of good will.\n\nThen he closed saying that we are going to be made to repent not just  for the vitriolic words and actions of bad people but for the appalling  silence of good people.\n\nThere is a lot going on in our country today for which we need to  speak up about. If we remain silent, we are going to be made to repent,  and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…chains. Alaska, our 49th State, has rich deposits of 49 out of  the 50 minerals on the critical minerals list.\n\nWith such abundant resources in our own backyard, it should be  appalling to  every American that the United States relies 100 percent on imports for  12 of the 50 critical minerals on the critical minerals list. What is  more, our Nation is 50…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…from Federal forests in the Western United States plummeted  by 80 percent.\n\nThe economic and societal costs of timber-dependent States and their  timber-reliant counties was appalling. Demand for SNAP and Medicaid  shot up. Alcoholism and meth addictions became routine. County tax  revenues were decimated.\n\nA belated but needed response was the Secure…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697659/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…we were going to  hear. We were going to hear these outrageous claims that are simply not  true.\n\nThe fact is that the rhetoric coming from the other side has reached  an appalling level. We have heard the scare tactics for weeks now, but  it has taken a dark turn, Mr. Speaker, that is literally instilling  fear into the hearts of blameless, everyday…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…work goes far  beyond the legislation before us today. We are committed to  accountability, transparency, and justice for the American people and  for the survivors of these appalling crimes.\n\nTo date, the Oversight Committee has released more than 65,000 pages  of documents, issued 13 subpoenas, and conducted interviews with two  key witnesses, both of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…universities  before spreading to tech companies throughout our broader culture and  into the government itself.\n\nOf course we saw most vividly on university campuses the absolutely  appalling scenes of anti-Semitism that sadly also became part of our  broader problem for the rest of the country over the last few years and  even before that.\n\nAmerica's adversaries,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…allegedly       paid a fee to craigslist who never rejected or removed any       posts.\n\nAlthough the Court explained that ``some of her allegations       demonstrate craigslist's appalling lack of diligence in       preventing trafficking, not a single one establishes that       craigslist created or developed the trafficking content.''       After an extensive…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}]