[{"senator": "Al Green", "party": "Democrat", "sentence": "…was George Wallace. I saw him when he fought desegregation in this  country. I saw him. He metamorphoses. He changes. He is a shape- shifter. He changes his makeup, his appearance.\n\nNow, there are those who are going to take that literally and say,  gosh, he thinks that Donald Trump was George Wallace, but there are  other people who understand that…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…serious deprivation of liberty is       justified. This legislation would significantly change the       system D.C. has had in place since 1992, that has produced       higher appearance rates than the national average without       wealth-based pretrial detention. Between 1990 and 2009 the       number of people charged with an offense who received cash…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the negotiations with the Gaza conflict.\n\nHow is this going to be beneficial to the United States to create  these levels of conflict?\n\nEven if he can rise above them, the appearance of the conflicts is  ridiculous, it is astonishing, and it is unacceptable. The National  Review, not exactly a liberal rag and not exactly a liberal bastion,  has said that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…people to get the benefits that they have earned.\n\nOr here is another:\n\nI've had Medicare medication coverage for around 20 years,       and all of [a] sudden, with Musk's appearance, I've had to       fight to keep it.\n\nHere is someone who has a legal right--a benefit--and now, thanks to  Elon Musk, has to be in the fight in order to keep what this person…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…dropped by 7 percent and property       crime by 14 percent. New Jersey's reforms led to a 20 percent       reduction in violent crime while maintaining high court       appearance rates. In Harris County, Texas, ending cash bail       for most misdemeanors did not increase crime. A nationwide       study by the Brennan Center for Justice found the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…not-so-sincere apologies to my good  friend and colleague, Emanuel Cleaver.\n\nThe Bulldogs finished the season 10-3 and claimed their second  Celebration Bowl title and third appearance in the classic over the  past 5 years.\n\nIt was also a great honor for the city and county of Orangeburg. The  State of South Carolina showed its appreciation by flying the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699194/south-carolina-state-university-football-team-2025-hbcu-national-champions"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…masked agents into American neighborhoods. They are  beating people in the streets. They are breaking into homes without a  judicial warrant, profiling people based on their appearance or their  accent, and detaining them if they don't have their citizenship papers  on them.\n\nMr. Speaker, is this what we have become, a country where everyone  has to carry…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699355/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…truth.\n\nYet, even if we adopted such a ban, the GENIUS Act, sent over by the  Senate and apparently unable to be amended, is still bad public policy.  S. 1582 creates the appearance of a Federal framework for stablecoins,  but it does not provide the Federal Government with the full authority  it needs to ensure that all stablecoin issuers comply with…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…complete chaos across the  country.\n\nInstead of holding this administration accountable for all of that,  House Republicans are urgently tinkering,  trying to create the appearance that my colleagues across the aisle are  busy doing something here in Congress on a minor rule that simply  requires scientific standards for underwater surveys.\n\nRepublican…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…system that relies on regular check-ins,       targeted social-service referrals, and text message reminders       consistently outperforms cash bail systems at securing       appearance and protecting public safety. Maintaining housing,       employment, child-care, and medical care substantially       reduces recidivism and promotes community safety. D.C.'s…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…you to put lie(s) out there,'' Khalif said.\n\nReichert told the Union-Tribune she had not contacted any       of the providers; she said she ``didn't want to give any       appearance of harassment.''\n\nThe child care subsidy system has several procedures in       place to protect against fraud, McDougal said. Her       organization and Child Development…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…foreign governments are influencing  our policies now, and how foreign leaders, wealthy people, and wealthy  corporations can easily buy some of our policymaking. That is  the appearance, and that is the reality in some cases. That needs to  stop. We need to do something about it. We need to do something now.\n\nAgain, we are all committed to making sure that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…people to       jail custody if people are not meeting their supervision       conditions. These factors prioritize safety. For three       decades, DC's approach has kept appearance rates high and new       offenses low.\n\nLike Americans around the country, DC residents do not want       violent crime in their community. But risk-based detention…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the American people.\n\nThe Supreme Court created this dual system, saying: You know, a cap  on money to the candidate--well, that could produce a conflict of  interest or appearance of corruption, so you can cap it. But if you  give it to the friend of the candidate to run a parallel campaign,  well, that is suddenly whitewashed or washed clean and no…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…the playoffs, the Braves became a different team and dominated  their way to the CIF Division 11 championship game.\n\nThis was the first CIF Southern Section championship appearance for  Baldwin Park since 1991. Unfortunately for the Braves, the goal of a  championship would end when their opponent kicked the game-winning  field goal with 8 seconds left…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…time, adds expense, and clogs an  already full docket. Other Article I and Article III courts already  allow documents to be submitted, at times, without requiring physical  appearance. This bill, likewise, gives the Tax Court the same  commonsense flexibility, allowing judges to decide when someone truly  needs to appear in person.\n\nSecond, the bill helps…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the       Coast Guard, or any member of the armed forces, to carry out       any responsibility or duty in a fair and objective manner;\n\n``(B) compromise the integrity or appearance of integrity       of any program of the Coast Guard, or any individual involved       in any such program; or\n\n``(C) include the participation of any cadet of the Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…the Democrats take a big stand? This is the former chairman  of Homeland Security and current ranking member, who has been on the  committee for a long time. This is a rare appearance on the House floor  to push back against about this.\n\nAmericans should think about this. Democrats are pushing back on this  because they don't want the citizens of America…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…executive overreach, we are rendering  impotent our branch of government.\n\nThomas Paine said in 1776: ``A long habit of not thinking a thing  wrong gives it a superficial appearance of being right.''\n\nSome of my Republican colleagues may feel obligated to acquiesce  because it is our party occupying the White House. It is our party who  is the Commander…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…enforcement. It  has teeth with substantial penalties for violations. As public  servants, we should hold ourselves to a higher standard, Mr. Speaker,  and avoid the mere appearance of corruption and impropriety.\n\nUnfortunately, too many Members of Congress are engaging in  suspicious stock trades based on nonpublic information to enrich  themselves.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…who is to appear before the Committee       in any hearing shall file with the clerk of the Committee at       least three business days before the date of his or her       appearance, a written statement of his or her proposed       testimony and an executive summary thereof, in such form as       the Chair may direct, unless the Chair and the Ranking…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…files underscore why former President Bill Clinton must appear  for his deposition. We have subpoenaed him. To date, the Democrats have  done nothing to help us secure his appearance.\n\nI support full transparency. The Committee on Oversight and  Government Reform will continue to work to get the truth to the  American people and to get justice for the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…collars worn in their 18th-  and 19th-century uniforms, which protected against sword slashes and  encouraged good posture; ``jarheads,'' which was initially due to the  appearance of their high-collared dress uniforms that made their heads  look like a mason jar in the early 1900's and has since evolved to also  reference the popular ``high and tight''…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…unable to       obtain counsel may inform the Committee of such fact. If the       witness informs the Committee of this fact at least 24 hours       prior to his or her appearance before the Committee, the       Committee shall then endeavor to obtain voluntary counsel for       the witness. Failure to obtain such counsel will not excuse       the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…is a commonsense measure that the overwhelming majority of  Americans support. The notion that someone should be able to profit  from their government service or even the appearance of that undermines  trust in government, which is so essential to the representative form  of democracy that we have here in the United States.\n\nI am hopeful that this legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…witness who is to appear before the committee in       any hearing shall file with the clerk of the committee at       least three business days before the date of their       appearance, a written statement of their proposed testimony       and an executive summary thereof, in such form as the Chair       may direct, unless the Chair waived such a requirement…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Texas. Mr. Speaker, I rise today to recognize the  Gordon Longhorns baseball team on a hard-fought season.\n\nThis year, the Longhorns made school history with their first-ever  appearance in the UIL Class 1A State championship game. Their road to  the championship was made even more remarkable by the challenges they  overcame this season.\n\nOn May 18, 2025,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "James Risch", "party": "Republican", "sentence": "…committee, or any subcommittee thereof, shall submit an       electronic copy of the written statement of his proposed       testimony at least 24 hours prior to his appearance, unless       this requirement is waived by the chairman and the ranking       member following their determination that there is good cause       for failure to file such…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…maybe say something  they shouldn't, what I saw and what I worry about what her students saw  last night was a continued premeditated attack, and some might even say  the appearance of a violent and threatening action with the cane.\n\nThat may not have been the intent, but I worry that those students  perceived what I saw as I watched was a scene that…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688495/raising-a-question-of-the-privileges-of-the-house"}]