[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…this. They are sick and  tired of watching politicians come to Washington to get rich while  everyday Americans suffer through an affordability crisis that  Republicans don't appear interested in confronting.\n\nThey are sick and tired of watching Republicans block a tax credit  that will lower health insurance costs for millions of Americans after  passing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…except for  Eleanor Holmes Norton's district, polled every single one of them, I  promise you that trying to overturn the laws that the D.C. Council has  voted for will not appear in the top 10 issues that their constituents  are dealing with.\n\nActually, I will go a little further. I don't think it would appear  in the top 100 issues that their constituents…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…priorities of this majority  have been crystal clear.\n\nWhen billionaires, CEOs, and corporate special interests need  something, Republicans move with lightning speed. Loopholes appear out  of nowhere. Regulations vanish into thin air while Big Oil, Big Tech,  and big banks get what they want.\n\nRepublicans have no problem handing out massive tax giveaways…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…support for the changes we demand. It  will take continued outrage that we bring to the American people  through the stories that we will tell and the faces and voices that  will appear before them. They are the most moving and powerful  advocates: everyday Americans assaulted and brutalized by their own  government, financed by our taxpayer dollars.\n\nBut…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…``Access to cheap goods  is not the essence of the American Dream.''\n\nClearly, Mr. Trump and Mr. Bessent have never struggled to make ends  meet from paycheck to paycheck and appear to view those who do with  disdain.\n\nWith our Nation's economy in such a precarious state and 2 weeks of  session left before a 2-week recess, is the Republican majority taking…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…country, to bring decency back to this country.\n\nThere was a time when American public life was guided by a genuine  sense of duty and a converse fear of shame, but today neither appear to  hold much sway.\n\nInstead, we have a White House filled with charlatans, con men, snake  oil salesmen, grifters, billionaires, and criminals, all using the  power of the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Many New Yorkers,       including numerous delivery workers, rely on these devices as       a convenient mode of transportation. However, as these       devices continue to appear, the number of fire incidents has       rapidly increased. Whereas a fire incident relating to a       lithium-ion battery was uncommon in 2019 with only 30       incidents,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Seventh Circuit, United States v.  Howard, threatens to significantly limit prosecutors' ability to hold  some of the worst child predators to account legally. The question may  appear to be technical, but the human consequences are grave and  brutally simple.\n\nTitle 18 of the United States Code, section 2251(a), criminalizes the  production of child sex…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump has offered precisely zero explanations-- zero--to the American people for what he is trying to accomplish in the  Caribbean.\n\nMost Senate Republicans, meanwhile, appear to have no interest in  doing any congressional oversight in a serious way of the  administration's military buildup. We have had no serious public  congressional hearings…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…savings.\n\nThere is no way to do that when doing the math without cutting  Medicaid. That is just a fact. The math is undefeated here.\n\nI am sorry that my friends don't want to appear like Republicans are  insensitive to the plight of those who are struggling in the lower  income brackets and who need Medicaid and for whom it is a lifeline. It  is just the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…explicit, deepfake  images continues to spread. With the push of a button, generative AI  can swap someone's face onto another person's body, remove that  person's clothing so they appear nude, or undress someone to show them  in lingerie or other exposed positions.\n\nRecent reporting details how users of X, the social media platform  formerly known as Twitter,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…they actually were injured, seven of them.\n\nThe U.S. military is being used against Venezuela without  congressional authorization, without transparency, and in ways that  appear only designed to benefit the very powerful amongst us--the oil  companies--and not the Venezuelan people, and certainly not our  American people to whom we are obligated to…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…States of an alien       who applies for permanent resident status on a conditional       basis under this section shall not terminate when the alien       is served a notice to appear under section 239(a) of the       Immigration and Nationality Act (8 U.S.C. 1229(a)).\n\n(2) Treatment of certain breaks in presence.--\n\n(A) In general.--Except as provided in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…accountability for the  horrific crimes by revealing Epstein's client list and other  information, but recently backtracked and refused to release any  further information.\n\nThere appear to be only two explanations for this about-face. Either  the Epstein files did not contain the explosive information that Trump  and his allies claimed during his campaign,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…grid, giving them a fair shot to do it.\n\nWe had a committee meeting in the Energy Subcommittee this week, and  we had the acting general counsel from the Department of Energy appear  before us. Just to show you the fast-pass that polluters and gas  companies are getting, we asked him about the Energy Secretary's trip  overseas to try to sell more natural…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…consider any nomination until 5 business       days after it has been formally submitted to the Senate.\n\n(b) Public Consideration.--Nominees for any post who are       invited to appear before the committee shall be heard in       public session, unless a majority of the committee decrees       otherwise, consistent with Rule 3(f).\n\n(c) Required Data.--No…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…times, without requiring physical  appearance. This bill, likewise, gives the Tax Court the same  commonsense flexibility, allowing judges to decide when someone truly  needs to appear in person.\n\nSecond, the bill helps the court address its growing case backlog. It  does this by allowing special trial judges, who are experienced legal  professionals who…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…are undermining healthcare access and threatening the existence  of eye care practices in all of our districts.\n\nIt is concerning that some VBM patient and doctor mandates appear to  be aimed solely at benefiting the optical products labs, patient data  gathering, and mass retail operations built around them.\n\nThe growing VBM acquisition and control…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693946/addressing-the-growing-abuses-of-vision-benefit-managers"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…deposition shall be in private. The       Subcommittee shall not initiate procedures leading to       criminal or civil enforcement proceedings for a witness's       failure to appear unless the deposition notice was       accompanied by a Subcommittee subpoena.\n\n9.2 Counsel. Witnesses may be accompanied at a deposition       by counsel to advise them of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…coming in.\n\nThere is way more fentanyl being seized at their border now. By some  estimates, there has been a 97 percent reduction in fentanyl going over  the border. It would appear that if the tariffs were designed to  encourage Canada to take this issue of fentanyl crossing the border  more seriously, they have been very effective in that respect. As…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…more dollars.\n\nWhat about the Washington Post? This is yesterday's Washington Post:  ``Obamacare subsidies make it too easy to scam the system.''\n\nThat is what the Democrats appear to be wanting to do, continuing to  put money--$83 billion--into a system that even the Washington Post  said is easy to scam.\n\nIs that what the American people want? That…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…solemn contemplation, and to recommend to your frequent  review, some sentiments which are the result of much reflection, of no  than inconsiderable observation, and which appear to me all important  to the permanency of your felicity as a people. These will be offered  to you with the more freedom as you can only see in them the  disinterested warnings…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…released  from prison. He assaulted his sister, and now that guy is roaming the  public.\n\nHis release from this incident was conditioned on a written promise  that he would appear for his next hearing, only for him to be charged  with murdering this young woman.\n\nWhy would North Carolina officeholders, politicians, and judges not  confine or institutionalize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…work, and protection from  discrimination and retaliation.\n\nMore specifically, this bill requires information to be emailed to  students at least once each academic year and appear in student  handbooks at orientation, at student health or counseling centers, and  on the institution's website. When students know their rights, they are  empowered to stay…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…of all  sorts of backgrounds. I know parents who have done a fantastic job of  raising children in all backgrounds, and sometimes beyond their fault,  there are families who appear to be doing a perfect job of raising  their children, but nevertheless have a problem.\n\nI think most Americans, though, with common sense would say it is  more difficult for,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…disappears. It  is someone who is insured who has never made a claim, even though they  may have been 100 percent subsidized. Now, we are finding out huge  portions of that appear to be fraud. Last year, over 41 percent of the  ACA population, which is 7 percent of healthcare, so ACA, the ObamaCare  population, 41 percent paid no premiums. If you are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to act in a way that  they don't want to act and that goes against their own interests. That  is precisely what has happened here.\n\nWe now have the actual language that will appear on the ballot for  California voters. If this were an honest description, it would simply  say that we are tearing up the map drawn by California's independent  redistricting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…one day in advance of all meetings. This does not preclude       any member of the committee from raising appropriate non-      agenda topics.\n\n(e) Any witness who is to appear before the committee in       any hearing shall file with the clerk of the committee at       least three business days before the date of their       appearance, a written…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of Housing and Urban       Development Act (42 U.S.C. 3535) is amended by adding at the       end the following new subsection:\n\n``(u) Annual Testimony.--The Secretary shall appear before       the Committee on Financial Services of the House of       Representatives and the Committee on Banking, Housing, and       Urban Affairs of the Senate at an annual…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…New York.\n\nMr. Speaker, I thank the gentleman for answering.\n\nAccording to reporting this morning, the other previous obligation  that the gentleman from Colorado had was to appear at a political  campaign conference of the Speaker here in Washington, D.C., with three  other Members who flipped districts.\n\nMr. Speaker, I am sure it was essential for the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}]