[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…unions through       its examination, supervision, and enforcement programs. NCUA       ``is authorized to examine any insured credit union or any       credit union making application for insurance of its       accounts,'' which may include ``all records, reports,       contracts to which the credit union is a party, and       information concerning the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…dollars could have been used to create jobs, revitalize  communities, and to help those businesses stay open and thrive.  Instead, these fraudsters took advantage of the lax application  screenings, which we believe may have resulted in them receiving at  least 17 percent of the total Small Business Administration assistance.\n\nMs. SIMON. Mr. Speaker, the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…views and analysis       of preemption waivers under the Clean Air Act that may be       helpful as Congress considers how to treat these Notices of       Decision and the application of CRA procedures.\n\nAs background to these issues, we issued a legal decision       concluding that a Clean Air Act preemption waiver was not a       rule subject to CRA…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Federal jobs. California is a State with the second  largest number of Federal workers. These are workers who have been  answering the phones when you call, checking on your application when  you submit it, and getting back to you about your benefits. Those folks  are being terminated, but this is the President who is all about  workers first, which is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…a changing world and evolving economy. This  movement featured professional educators and engaged families and  communities. It was about general knowledge and practical application.\n\nThis movement launched the United States as a world economic power.  It was essential to our national defense, and it created the conditions  for the success of the largest…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…things  stand on a particular project.\n\nThis bill helps to bring more transparency to the process. It  requires an annual report to Congress on the status of each license  application and outstanding actions that are required of regulatory  agencies or the applicants themselves. This is particularly important  now because 15 percent of the electric capacity…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693477/hydropower-licensing-transparency-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…important step toward remedying this problem by calling for the  Commerce Department's Bureau of Industry and Security, BIS, to conduct  greater transparency around license application, information, and  conduct checks for problematic companies in arms-embargoed nations.\n\nThis bill will also enable Congress to conduct better oversight to  ensure that BIS…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…only did they rehearse every step for every guest, but they also  made sure to document it in ``PILLARS''--the Presidential Inauguration  Line-by-Line and Relevant Seating application developed by the expert  software development team at the Senate Sergeant at Arms--so staff and  volunteers would have real-time access to the most up-to-date plan.\n\nMaggie…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Assimilation Grant  Program furthers this mission by providing grant funding to  organizations that support eligible, lawful permanent residents with  the U.S. citizenship application process, civics instruction, and other  services to help prepare for naturalization.\n\nIf my colleagues haven't been to a naturalization ceremony, I  encourage everyone to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…scientific information.\n\nI had planned to apply for a federal grant in 2025 to       further my research, but with the current uncertainty, I am       deeply concerned about my application's future.\n\nHere is another scientist:\n\nMy 5-year NIH grant is in its second year; and although my       first-year budget ended and I submitted all the required       documents,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Guides, Vision-Impaired Act, an assistive  technology app for seeing impaired individuals that describes the  user's environment, helping them avoid pathway collisions. Her  application uses multiple AI platforms, and was inspired in part by  Amy's experience with a friend who is seeing impaired.\n\nThis accomplishment is an impressive example of Amy's determination,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698677/recognizing-amy-zhang"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Attorney for the VA's Office of General Counsel,  Maryam was in charge of giving legal advice about research agreements,  intellectual property licensing and smart phone application  submissions.\n\nAfter her first five years at the VA, Maryam saw an emerging need to  create a legal team devoted to health research and innovation. Maryam  was entrusted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…approach to address the shortage. It  streamlines and modernizes the healthcare apprenticeship approval  process, requiring Federal and State labor agencies to act on the  application within 45 days, and directs the Department of Labor to  digitize and update  the apprenticeship agreement forms to make them more accessible.\n\nThese changes will help aspiring…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697515/supporting-healthcare-apprenticeships"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…it more difficult on a State level for people to  register to vote: S. 226 dealt with absentee ballots, and it required  you to put your mother's maiden name on your voter application or your  vote would be thrown out. S. 218 prohibits individuals from assisting  elderly people in registering to vote.\n\nI say to you, Mr. Speaker, Congress should advance…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689340/fighting-voter-suppression"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…U.S. Department of Agriculture       actions establishing four new financial assistance programs.       The actions prescribed each program's eligibility       requirements, application requirements, calculation and       distribution of funds, and, in some cases, reporting       requirements and limitations on how funds could be used.       Although participation…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…challenges designed by the United  States' finest special operations forces, Ms. Subba, Mr. Thomas, and  Mr. Clare secured two first-place wins. Their hard work as a team and  application of their classroom lessons gartered them their victory.  This achievement marked the second year in a row a Penn Manor High  School team placed in the top two positions.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694803/recognizing-penn-manor-high-school-students-for-their-achievement-in-the-sea-air-and-land-challenge"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the same manner as       under section 2264 of title 18, United States Code.\n\n``(9) Rule of construction.--Nothing in this subsection       shall be construed to limit the application of any other       relevant law, including section 2252 of title 18, United       States Code.''.\n\n(b) Defenses.--Section 223(e)(1) of the Communications Act       of 1934…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the ongoing Hamas attack, the alleged terrorists  gathered a group of fighters and stormed into Israel to join the  barbarism. Less than a year later, he submitted a visa application,  which the Biden administration quickly approved, and he was allowed to  enter the United States.\n\nAfter the October 7 attacks, Director Wray warned us that the FBI  ``cannot,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…creating wealth, creating jobs, putting more money into people's  pockets, and trying to deliver on the spending cuts, reversal and  termination of the green new scam, and the application of Medicaid work  requirements to make sure that people aren't getting benefits when they  should be working.\n\nMr. Speaker, I believe it is a good bill.\n\nMr. ROY. Mr. Speaker,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…BEGICH. Mr. Speaker, I appreciate the opportunity to speak on  H.R. 410, the Alaska Native Vietnam Era Veterans Land Allotment  Extension Act of 2025.\n\nThis bill extends the application period for the Alaska Native  Vietnam-era Veterans Land Allotment Program by 5 years, ensuring  eligible veterans can claim the land that they were promised.\n\nFor decades,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693473/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…reject permits and retroactively take away  permits.\n\nIn a country of due process, it is absurd that a government can  dictate whether a project is good or bad even before an application is  filed. The fact that the government can waltz in and shut down years of  hard work is staggering.\n\nThis section of H.R. 3898 is not a dramatic departure from the status…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…for decisions       for all other applications for such exports. The timelines so       established shall provide that, to the maximum extent       practicable--\n\n(1) an application to export defense articles or defense       services to a listed country or end-user shall be approved,       returned, or denied not later than 45 days after the date on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…command and       control operations. The final end-items are L3Harris AN/PRC-      160 multi-channel manpack radios with a Micro Global       Positioning System (GPS) receiver application module       (MicroGRAM) receiver card and SAASM.\n\n7. The AN/PRC-167 is a multi-domain, multi-channel,       tactical, narrow and wide-band dual transceiver radio system…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…180 days after the       date of the enactment of this section, the Secretary shall       establish a program of research, development, demonstration,       and commercial application of advanced tools, technologies,       and methods for advanced production and use of low-emissions       cement, concrete, and asphalt in order to accomplish the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…registration serves as the mechanism by which ATF  accounts for the tax paid on each firearm, identified by its serial  number. The tax stamp affixed by the ATF on an NFA application reflects  both the firearm's serial number and the amount of tax paid for the  transfer.\n\nMoreover, the NFA's criminal provisions pertain exclusively to the  failure to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…continuously adapting and embracing new tools, technologies, and  practices.\n\nThe success of U.S. agriculture has been built through the ingenuity,  hard work, and the strategic application of science and technology.\n\nI was proud to help open the 110th Farm Show on Saturday. It is  always an honor to meet farmers from across the Commonwealth and learn  about…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…confidential by Government officers and employees; or\n\n(ii) the information has been obtained by the Government on       a confidential basis, other than through an application by       such person for a specific Government financial or other       benefit, and is required to be kept secret in order to       prevent undue injury to the benefit,…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 1152) to amend the Internal Revenue Code of 1986 to  provide for  the application of the mailbox rule to documents and payments  electronically submitted to the Internal Revenue Service, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689373/electronic-filing-and-payment-fairness-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…guidelines for point-access block buildings. Sec. 104. Unlocking Housing Supply Through Streamlined and Modernized                Reviews. Sec. 105. Federal Housing Agency Application of Environmental Reviews. Sec. 106. Multifamily loan limits. Sec. 107. GAO study on workforce housing.     TITLE II--MODERNIZING LOCAL DEVELOPMENT AND RURAL HOUSING PROGRAMS…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…responsibility       under Senate Rule XXVI.8(a)(2), which provides that ``. . . .       each standing committee . . . shall review and study, on a       continuing basis, the application, administration, and       execution of those laws or parts of laws, the subject matter       of which is within the jurisdiction of the committee.''\n\n(c) ``Advice and Consent''…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}]