[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…crime in the last       two years.\n\nAnd the bills to abolish the Judicial Nominations       Commission and to convert the elected DC Attorney General to       a Presidentially appointed legal officer for the District are       both less democratic and untenable for District operations.       The Judicial Nomination Commission, with seven members       appointed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…City of Chowchilla, California.\n\nIn 2014, Mr. Varney came to Madera and was elected to serve as the  Madera County Sheriff. In 2020, the Madera County Board of Supervisors  appointed Mr. Varney as County Administrative Officer, overseeing 25  county departments and a half-billion-dollar budget.\n\nCOVID hit almost as soon as he was hired, and Mr. Varney…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…worked with a refinery and oil companies for many years. I was one of  those regulators. I represented the Bay Area on the California Air  Resources Board for 10 years. I was appointed by two Republicans, by  the way, and one Democrat.\n\nWhat we have done is, we are transitioning. Twenty-five percent of  the cars in northern California last  year were EVs.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…foundation for  future innovation.\n\nAs a longtime CASA Kane County volunteer, he has dedicated his  efforts to protecting the community's most vulnerable, serving as a  Court-Appointed Special Advocate and Guardian Ad Litem. In these roles,  he has been a steadfast voice for children in abuse and neglect cases,  offering critical guidance and advocacy.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, today, the 12th Congressional District  celebrates Reverend Dr. Perrico Robinson, Sr., as the newly appointed  Pastor to the Womack Temple Christian Methodist Episcopal Church of  Inkster, Michigan.\n\nReverend Robinson is a passionate figure in the ministry and began  preaching at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695372/recognizing-reverend-dr-perrico-j-robinson-sr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…crime in the last       two years.\n\nAnd the bills to abolish the Judicial Nominations       Commission and to convert the elected DC Attorney General to       a Presidentially appointed legal officer for the District are       both less democratic and untenable for District operations.       The Judicial Nomination Commission, with seven members       appointed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…BEYER. Mr. Speaker, I rise today to congratulate Ambassador Dame  Karen Pierce, who served nearly 5 years as the British Ambassador to  the United States and was recently appointed as the United Kingdom's  Special Envoy to the Western Balkans.\n\nDuring Ambassador Pierce's time in the United States, she happily  embraced her role as the guardian of the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…judges. Well, two of the ones who  struck it down were Democratic appointees, one by President Obama and  one by President Biden. The other two were Republican appointees, one  appointed by President Bush and one appointed by President Reagan, who  said that in his four decades on the bench he had never seen a more  unconstitutional law than that one. He…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Police Department. He worked his way up to officer, sergeant,  lieutenant, and then chief of police.\n\nTom retired from the Orange Police Department in 2021 and was then  appointed to become the interim city manager for the City of Orange.  Under his leadership, the city's economy boomed and community outreach  grew.\n\nMr. Speaker, I thank Tom for always…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694968/recognizing-tom-kiesla"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…of the federal government regarding diplomacy  and engagements with international indigenous peoples. The office would  be headed by a Coordinator for Indigenous Affairs, appointed by the  President with the advice and consent of the Senate. The coordinator  will be tasked with establishing a comprehensive international strategy  for promoting diplomacy…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…How does he deal with the judiciary? He is openly and brazenly  criticizing  and attacking judicial rulings that he doesn't like--including a number  issued by Republican-appointed judges, including his own--and is openly  defying court orders including Supreme Court orders.\n\nThe President and some of my Republican colleagues are threatening  judges.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Trump's unconstitutional  Executive order that purports to end birthright citizenship. This  Executive order has been blocked by every judge who has considered it.  One judge--appointed by President Ronald Reagan, I might add--said:\n\nI've been on the bench for over four decades. I can't       remember another case where the question presented was as…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…coming to Congress, I was a CEO of an energy company. We  raised a couple hundred million dollars to build that business, and I  was understandably accountable to a board appointed by those investors.\n\nI am trying to imagine a world where I showed up at a board meeting  and told the owners of the company that I was leading that they were  not allowed…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…group of equal educational opportunities, even  though the physical facilities and tangible factors may be equal.  Regrettably President Trump, during his last administration, appointed  dozens of judges who, during their confirmation hearings, refused to  say whether Brown v. Board was properly decided.\n\nLast week, the President signed an executive order…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…down, as is the norm.\n\nThe Trump administration then elevated in the Eastern District of  Virginia an individual by the name of Erik Siebert. First, the  Department of Justice appointed him for 120 days, and then that was  followed by an appointment by the judges of the court. But his initial  appointment into the role was by the Trump administration.\n\nMr.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and ask for its immediate consideration.\n\nThe Clerk read the resolution, as follows:                                H. Res. 974\n\nResolved, That a committee of two Members be appointed by       the Speaker to notify the President of the United States that       a quorum of the House has assembled and that the House is       ready to receive any communication…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698500/providing-for-a-committee-to-notify-the-president-of-the-assembly-of-the-house-of-representatives"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…enforcement  professionals. His service extended further when he was called upon to  serve as Interim Police Chief in Bellmead (2019) and Robinson (2020),  Texas. In 2023, he was appointed as the full-time Police Chief of  Robinson, where he later retired in August 2025.\n\nSpanning over 54 years, Danny's career reflects a lifetime of  selfless service, from…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…years of service to Jackson Township, York County, Pennsylvania.\n\nJon has dedicated his life to serving the great People of Jackson  Township. He began in 1990 after being appointed as an alternate to the  Township Zoning Hearing Board, where he served for almost two years. In  1992, he became a full member of the Zoning Hearing Board. In April  2003,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Homeland Security.\n\n(H) The United States Secret Service.\n\n(I) The Department of State.\n\n(J) The Office of the Director of National Intelligence.\n\n(3) At least five individuals appointed by the Under       Secretary for Terrorism and Financial Crimes to represent the       following:\n\n(A) Financial technology companies.\n\n(B) Blockchain intelligence companies.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…first graduating class.\n\nMr. Greer's service has extended beyond Cullman as well. He served as  Past President of the Economic Development Association of Alabama and  was appointed to the Alabama Workforce Council, where he served as  Chairman. He also represented Alabama through the Southern Economic  Development Council and was later named an Honorary…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…held for 19 years, earning the respect of  colleagues and residents alike through his steady leadership and deep  knowledge of county operations. In March 2017, Phillip was appointed  Avery County Manager, where he continued to demonstrate exceptional  dedication to the people he served.\n\nMost notably, Phillip's leadership during and after Hurricane Helene…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the House Ways and Means Committee and  twice chaired the Republican Study Committee. He also served as  chairman of the National Prayer Breakfast. President Ronald Reagan  appointed Congressman Schulze to the Presidential Advisory Committee on  Federalism, an honor that Dick deeply valued.\n\nDick's lifelong interest in conservation and wildlife issues…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…opened a Pandora's box  that threatens the fundamental constitutional order.\n\nThe Congress is elected to make law, and the President is elected to  enforce it. The judiciary is appointed for the sole purpose of  resolving cases and controversies brought to it by individual injured  parties. Traditionally, that means an injured party seeks redress  through…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize the  newly appointed Georgia State and Superior Court judges. These judges  are all accomplished attorneys and legal professionals who are stepping  into vital roles within Georgia's judicial…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699982/governor-kemp-appoints-new-judges-to-superior-and-state-courts-in-georgia"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…decision to invade on June 6, 1944, as the most       significant actions ensuring the Allied victory on D-Day.\n\n(11) Following World War II, Second Lieutenant Lomell was       appointed as the First Director of the newly organized Ocean       County Veteran's Service Bureau, serving from 1946 until       1948, before he attended law school on the G.I. Bill.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the `Taskforce').\n\n``(2) Director of the taskforce.--The head of the Taskforce       shall be the Director, who shall--\n\n``(A) report directly to the Chairman; and\n\n``(B) be appointed by the Chairman, in consultation with       the Commission, from among individuals--\n\n``(i) currently employed by the Commission or from outside       of the Commission;…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…of  Saugerties, his 16 years of service as a volunteer firefighter, and his  continuous work to raise awareness and support for those living with  autism.\n\nIn 2023, he was appointed to the New York State Council on  Developmental Disabilities because of his advocacy and dedication,  which embody the spirit of community involvement and empowerment.  Vincent's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690169/autism-awareness-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…improvement, it is because Newsom's own policies have been reversed.\n\nThis includes in L.A., as well, where the rogue district attorney,  George Gascon, who Newsom himself initially appointed, was  overwhelmingly voted out by voters last year.\n\nThere has been a modest improvement in public safety in California,  thanks to the fact that Newsom's policies are being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…criminal matters,  including firearm offenses, drug trafficking, and fraud.\n\nIn recent years, Mr. Tung has focused on civil litigation and appeals  in private practice. He was appointed by the chief justice of the  California Supreme Court to serve as the sole civil appellate  practitioner on the Appellate Indigent Defense Oversight Advisory  Committee.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…`Office').\n\n``(b) Head of Office.--(1) The head of the Office shall be       the Chief Veterans Experience Officer.\n\n``(2) The Chief Veterans Experience Officer shall--\n\n``(A) be appointed by the Secretary from among individuals       the Secretary considers qualified to perform the duties of       the position;\n\n``(B) report directly to the Secretary; and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}]