[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I thank the ranking member for yielding. I  also want to thank all the Defense Appropriations Subcommittee staff on  both sides of the aisle. In particular, I want to shout out Jennifer  Chartrand, Jason Gray, and Ed Etzkorn.\n\nThrough this bill, we have the solemn responsibility…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…yield 5 minutes to the gentlewoman from  Florida (Ms. Wasserman Schultz), my very good friend and author of H.R.  2701. She serves as ranking member on the House Appropriations  Subcommittee on Military Construction, Veterans Affairs, and Related  Agencies.\n\nMs. WASSERMAN SCHULTZ. Madam Speaker, I thank the ranking member for  his indulgence in yielding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…partner in organizing this group of Senators,  Senator Reed, who is not only the ranking member of the Armed Services  Committee but is the ranking member of the Appropriations subcommittee  overseeing funding for this space.\n\nI rise today, with my colleagues, out of grave concern for the future  of our democracy.\n\nI currently serve as the ranking member…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Chair, as the senior member on the Defense  Appropriations Subcommittee, I am deeply concerned and disappointed by  this legislation. This bill was written before the  Department of Defense submitted its budgetary needs for fiscal year…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…change. She asked me  to fight.\n\nIt is a painful truth that the administration has moved to eliminate  funding for this critical program. As a member of the House  Appropriations Subcommittee that funds the Department of Justice, I  believe that our Nation's values and policies are shown by how we  direct funds. Turning our backs on children survivors…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690872/supporting-casa"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…multiple members of the North Atlantic  Treaty Organization (NATO), that we condemn the domestic political  process within their nations. As Ranking Member of the House  Appropriations Subcommittee on Defense, I know just how crucial it is  to maintain relationships with our NATO allies who have come to our  aid. This resolution is an insult to them.\n\nMr. Speaker,…", "date": "2025-11-28", "source_url": "https://justfacts.votesmart.org/public-statement/1697166/denouncing-the-horrors-of-socialism"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…should be a non-starter for the Appropriations Committee. This  provision must be rescinded in the Defense Appropriations Act.\n\nAs the Ranking Member of the House Appropriations Subcommittee on  Defense, I completely agree that the United States must maintain a  strong military force that can deter wars and win them if necessary. I  appreciate the work…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, as a member of the House Homeland Security  Appropriations Subcommittee, I stand today in opposition to this  Homeland Security appropriations bill.\n\nI want to be very clear. The bill that passed out of committee had  protections for…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699352/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…the President.\n\nNow this renovation begins to look less like infrastructure work and  more like a cover story for institutional failure.\n\nAs the top Democrat of the Appropriations Subcommittee that oversees  the Kennedy Center's funding, I can tell you this: We have repeatedly  asked for financial information, for meetings, for transparency about  what…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…our elections because only their participation will  ensure that the government is truly accountable to the people it  represents. And as the ranking member of the Appropriations  Subcommittee that handles election funding, I hope my colleagues will  join me in restoring funding for election security grants to the States  to the total of $75 million. If…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I want to thank all of the Energy and Water  appropriations subcommittee staff for their hard work, in particular  Scott McKee, Anisha Singh, and Adam Wilson.\n\nI am opposed to this bill. Not only will it raise energy costs for  American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the congressional notice, not 3 years later.\n\nLet me point out another, in my opinion, falsehood about this  legislation. I am the ranking member of the Defense Appropriations  Subcommittee. There is no immediate national security interest that  would be advanced by mining in this watershed.\n\nHow do we know this? We know this because Antofagasta, as…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…team, for their cooperation. I thank our ranking  member of the Appropriations Committee, Rosa DeLauro, and her team, for  her leadership. I especially thank our Appropriations subcommittee  staff, Bob Bonner, Jamie Wise, Nora Faye, and Faye Cobb, for their  tireless work on this, and also Tom Dinegar and Rebecca Lee from my  individual office, as well.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698751/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…roads safe. My State is doing its part, but States cannot do this  alone. The Federal Government must close these loopholes and enforce  the law.\n\nAs chair of the Appropriations Subcommittee on Transportation,  Housing, and Urban Development, I successfully included language in the  fiscal year 2026 bill and report that builds upon the President's  Executive…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…transform  our aviation system to make it safer for everyone, but that work is now  significantly hindered without having an open and functioning  government. The Senate Appropriations subcommittee, of which I am a  member--the Transportation, Housing and Urban Development  Subcommittee--has done its job. I joined my colleagues in advancing the  fiscal year…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…motion to  reconsider be considered made and laid upon the table.\n\nMr. COONS. Mr. President, I want to convey my thanks, my gratitude to  the chair of the Defense Appropriations Subcommittee, my colleague and  friend from Kentucky. We and our staffs have had a genuinely  constructive and positive process in appropriations this year.\n\nFrankly, overall,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…servicemembers and civilian DOD employees  is to simply turn government funding back on and pass full-year  appropriations.\n\nI know my counterpart on the Defense Appropriations Subcommittee, of  all people, understands this. He knows what would really help our Armed  Forces because he and I worked closely together on a full-year bill for  Defense that…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696491/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…would also like to address the eligibility of Congress disapproving  rules. A few weeks ago, I questioned the Government Accountability  Office Comptroller during an Appropriations subcommittee hearing. The  Comptroller explicitly stated that GAO's role is just an advisory one  and that it is up to us--it is up to Congress--to determine what  constitutes…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…in support of the appropriations package  that is currently before the U.S. Senate, which happens to include  funding for Commerce, Justice, Science.\n\nI chair the Appropriations Subcommittee on Commerce, Justice,  Science, and I am pleased that this legislation provides significant  and important resources to support our Nation's Federal, State, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…and Ranking Member McCollum in saluting the hard  work of the Defense Subcommittee staff, and of course, Chairman Cole. I  thank my colleagues on the Senate Defense Appropriations Subcommittee  for working with this body.\n\nAs of today, the Biden-era CRs, numbers, and policies will come to an  end, and we will pass a bill that addresses the needs of now…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699327/consolidated-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…of the Appropriations Committee.\n\nMr. CARTER of Texas. Mr. Chair, I yield 2 minutes to the gentleman  from California (Mr. Calvert), the chairman of the Defense  Appropriations Subcommittee.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I yield 2 minutes to the  gentleman from Indiana (Mr. Mrvan), a member of the Appropriations  Committee. He just joined us,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]