[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…specific activities  that pose the greatest risk, or if FSOC should take a broader, entity- wide view of the firm's risk profile. Both activities-based and entity- based approaches can be appropriate, depending on circumstances.\n\nAs someone who was present on the Financial Services Committee during  the global financial crisis, I recall vividly Fed…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…you to stop crafting policies based on stigma, false       narratives, and political loyalty, and most of all, stop       using our dead children to justify these failed approaches.       Harsher penalties for drugs, like those for the HALT Fentanyl       Act, do not deter drug use. They only push people into       riskier behaviors, increase the likelihood…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…provide  evidence-based reading instruction by fully funding title I, increasing  funding for the Comprehensive Literacy Development State Grant Program  and for Innovative Approaches to Literacy grants.\n\nWe should double the Pell grant and restore its purchasing power so  students do not have to rely mostly on loans to pay for college.\n\nSadly, none of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…It stayed about  the same until demand got bigger. If you get up to 50 megawatts, 60  megawatts, then it starts to spike here, and it hits $75 per megawatt  hour once it approaches 70 gigawatts of load.\n\nSo what is important here is the comparison. In 2018, these were the  prices in August for that increment of load during August. This, the  yellow…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…including to the city's many small businesses, promoting year-round  stability in a city that receives a third of its tourism revenue in 1  month.\n\nAs America's 250th anniversary approaches, we should expand Salem  Maritime's capacity to share our region's rich history with visitors  from across Massachusetts and the country.\n\nMr. Speaker, I urge support of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691013/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…had suggested to their text that would strengthen the functions of VEO  so that it serves as an office truly focused on improving the veteran  experience with data-driven approaches.\n\nAdditionally, in the Honoring our PACT Act, Congress authorized VA to  utilize critical skills incentives to attract and retain the workforce  it needed to implement the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…hearing on  Representative Waters' bill, H.R. 4551, the Employee Paycheck and Small  Business Protection Act. We have had a good discussion on the pros and  cons of different approaches.\n\nAfter Silicon Valley Bank's failure, community banks watched small  businesses move their deposits to the biggest banks to make sure that  they could pay their workers…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…available to  our officers, there is still so much more that we can and should be  doing to ensure their wellness and, most definitely, their safety.\n\nBy prioritizing data-driven approaches to officer safety and  wellness, we can address systemic risks, reduce preventable tragedies,  and build a stronger, more resilient law enforcement system.\n\nThe goal is that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Washington. It will give the  people of the District of Columbia the right to elect their own city  officials and to govern themselves in local affairs. As the Nation  approaches the 200th anniversary of its founding, it is particularly  appropriate to assure those persons who live in our Capital City rights  and privileges which have long been enjoyed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…can control. There are  many things in life that we cannot. There are many problems that we  contemplate, that we debate, and that we search for answers. We have  different approaches, and we all believe that we have the right answer.  None of us may be right, but we have the opportunity to debate it, and,  hopefully, through debate and exchange we come…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…colleagues to listen to  me deliver such an address, Mr. Speaker, I do  dare say, Mr. Speaker, that this is something that we can all agree on,  that we can all work on, and that approaches, sentiments, and certainly  emotions that run high in politics, of course, might differ.\n\nThe idea that America should and must win and must continue to propel  and to inspire…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Marlene is  among the first to volunteer for community events, including Caribbean  American Heritage Month celebrations, Mother's Day initiatives, and  cultural festivals. She approaches every act of service with humility,  never seeking recognition, but always delivering excellence.\n\nMarlene's impact is also felt through her efforts to pass on cultural…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692569/recognizing-marlene-henry"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…waste treatment plant's technical problems. His framework for tank  waste cleanup--including sending some waste to New Mexico and a partial  treatment within the tanks--were approaches that essentially abandoned  the original cleanup strategy without demonstrating the alternatives  would be faster and cheaper. I am sure there were people over at OMB  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…separated America from  other nations around the world is the right to vote. It is a right that  everybody in this body cherishes, as do the American people. Every  person who approaches the ballot box generally has confidence that  their votes are going to be counted and their voice will be heard.\n\nBut, as we stand here, this cherished right is coming under…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washington. It will give the people  of the District of Columbia the right to elect their own city officials  and to govern themselves in local affairs.\n\n``As the Nation approaches the 200th anniversary of its founding, it  is particularly appropriate to assure those persons who live in our  Capital City rights and privileges which have long been enjoyed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…excellence,  compassion, and innovation. Their remarkable achievements during  Hurricanes Helene and Milton, coupled with their dedication to long- term recovery and cutting-edge approaches to disaster management, have  left an indelible mark on Pasco County.\n\nIt is clear Kyle Smith has made a profoundly positive impact on our  community with his work as part…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…excellence, compassion, and innovation.  Their remarkable achievements during Hurricanes Helene and Milton,  coupled with their dedication to long-term recovery and cutting-edge  approaches to disaster management, have left an indelible mark on Pasco  County.\n\nIt is clear Fernando Serrano has made a profoundly positive impact on  our community this his work…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…to the jurisdiction of the United States.\n\n``(C) Migrant interdiction.--Engage in maritime air       surveillance or maritime interdiction of the maritime border       and approaches to enforce or assist in the enforcement of       laws of the United States, including the immigration laws of       the United States on, under, and over the high seas and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…recovery       units to capture methane emissions from higher-emitting       equipment like tanks and compressors. In addition to       traditional ground-based monitoring approaches using optical       gas imaging (OGI) technologies, companies are also       implementing the use of laser absorption spectroscopy and       sensors technologies on the surface,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…during the Vietnam era, Floyd once again put on the  uniform, this time in the Air National Guard, giving another 10 years  to his country. He retired as a colonel.\n\nAs Floyd approaches a century of life, I have never met a more  active, positive person. In all, Colonel Brantley devoted more than 23  years to the defense of our Nation. He is a shining example…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…volunteered with the U.S. Forest Service in the Bridgeport Ranger  District, helping maintain campgrounds for the benefit of residents and  visitors alike.\n\nRemarkably, even as he approaches his 100th birthday, he continues to  harvest and donate firewood each winter to neighbors in need, quiet  acts of kindness that say as much about his character as any medal…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…projects.\n\nIt is almost laughable. We have got modern agencies. We have multiple  agencies that will look at the same project using different data  standards, using different approaches, and different systems. Believe  it or not, they are still trading old, outdated, mostly static PDFs.\n\nPerhaps not surprisingly, this creates confusion, delay, and a lack…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…incorporate industry expertise;\n\n(2) collaborate with private sector stakeholders to       identify prioritized, flexible, repeatable, performance-      based, and cost-effective approaches to the deployment of       blockchain technology or other distributed ledger technology,       applications built on blockchain technology or other       distributed ledger…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…dangerous and demanding conditions, is a testament to  the sense of courage, duty, and selflessness embodying the very best of  New Jersey's first responders. As June 14th approaches, the community  comes together to reflect on this special milestone and honor the  dedication of the men and women who have spent decades working to keep  West Amwell safe.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690621/recognizing-the-west-amwell-volunteer-fire-department-on-their-75th-anniversary"}, {"senator": "French Hill", "party": "Republican", "sentence": "…President Trump in his Executive Order 14178.\n\nMr. Speaker, through multiple versions of stablecoin legislation, the  House and Senate have shared ideas and crafted workable approaches. Our  joint efforts before us helped enhance the legislation on the floor  this morning.\n\nI recognize the hard work of my friends in the Senate to get the core  fundamentals…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…their timeline. This zero-dollar issue and then not capping  it, so it is only targeted towards lower-income individuals, had to go  away. Even in compromise and bipartisan approaches to deal with this  expiration, those aspects had to go away. Those are things that were on  the chopping block.\n\nAgain, I think when folks understand, the subsidies aren't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…overall energy efficiency of low-      emissions cement, concrete, and asphalt production processes,       including through life cycle assessments.\n\n``(5) Technologies and approaches to reduce greenhouse gas       or directly related copollutant emissions from the advanced       production of cement, concrete, and asphalt.\n\n``(6) High-performance computing…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…excellence,  compassion, and innovation. Their remarkable achievements during  Hurricanes Helene and Milton, coupled with their dedication to long- term recovery and cutting-edge approaches to disaster management, have  left an indelible mark on Pasco County.\n\nIt is clear Maria Wilkinson has made a profoundly positive impact on  our community through her work…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…excellence, compassion, and innovation.  Their remarkable achievements during Hurricanes Helene and Milton,  coupled with their dedication to long-term recovery and cutting-edge  approaches to disaster management, have left an indelible mark on Pasco  County.\n\nIt is clear Rebecca Seils has made a profoundly positive impact on  our community through her work…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…distinguished career marked by integrity, compassion, and an unwavering  commitment to financial empowerment. As CEO of Trumark Credit Union,  she has championed innovative approaches to serve the underserved and  underbanked, expanding access to fair, transparent, and affordable  financial services for families and small businesses alike. Her  leadership…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}]