[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…promise a floor vote on  the one bipartisan joint committee House bill that comprehensively  addresses all of the issues.\n\nMr. LARSEN of Washington. Mr. Speaker, I appreciate this opportunity  to speak on the ROTOR Act and on the ALERT Act. I really appreciate the  bipartisan work and joint committee work done here in the U.S. House to  produce the ALERT…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700110/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…league.\n\nThat makes no sense. They could fall down. They could miss a pass on  purpose. There are all kinds of things they could do that are wrong.\n\nMr. Speaker, I appreciate very much the opportunity to be just a tiny  voice in what is going on because this is right and not doing it is  wrong.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691222/stock-trading-ban-for-members-of-congress"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…counterparts, to reauthorize the Fox Grant Program in a  responsible way and ensure it is as effective and robust as our  Nation's veterans deserve.\n\nMr. Speaker, I appreciate the opportunity to share my position on  H.R. 1969, the No Wrong Door for Veterans Act, as amended. I will  always be supportive of efforts to prevent veteran suicide, but I  remain…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…contributions of the Haitian       community in Massachusetts.                                __________\n\nMy name is Reina Reyes, resident of East Boston. I       appreciate the opportunity to present my testimony to       Congresswoman Ayanna Presley and Senator Ed Markey.\n\nDuring the crisis at Terminal ``E'' of Logan International       Airport, I…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, I appreciate the opportunity to appear here.\n\nIn Memphis, one of our great leaders in the State of Tennessee, in  the United States of America, and the world, in fact, was Frederick W.  Smith,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…conformity is ultimately       required. Most important is the increased safety that will       accrue to consumers when this legislation becomes law.\n\nMr. Speaker, we appreciate the opportunity to provide       feedback on this important issue. Should you have any       questions, please don't hesitate to contact me.            Sincerely,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I rise to speak today on important  public policy issues related to my State's economy and appreciate the  opportunity to follow our senior Senator, Senator Murray, who is  articulating the impact of some of these so important public policy  issues on the State of Washington.\n\nTrade…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…colleagues who have joined me in leading  this bill, Congressman Alford of Missouri, Congressman Mfume of  Maryland, and Congresswoman Goodlander of New Hampshire. I appreciate  the opportunity to work together and to highlight why this important  legislation is needed.\n\nSmall business owners are often resource constrained. Every day,  these individuals…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I am grateful to be here. I appreciate the  opportunity from my colleague from California (Mr. Garamendi).\n\nI rise today to join my Democratic colleagues in voicing our  unwavering commitment to protecting the vital programs…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688236/democratic-proposals"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Veteran  Commendation to recognize the heroic wartime sacrifices and admirable  peacetime community involvement of my constituents. These are  exceptional Americans. I appreciate the opportunity to honor them for  their service to the Nation and community.\n\nAn independent panel reviewed several nominations and chose the  following nineteen veterans for their…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mr. BEGICH. Mr. Speaker, I appreciate the opportunity to speak on  H.R. 410, the Alaska Native Vietnam Era Veterans Land Allotment  Extension Act of 2025.\n\nThis bill extends the application period for the Alaska Native…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693473/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, I appreciate the opportunity to  address the floor this evening and to give that opportunity to some of  my colleagues also, if their schedule permits.\n\nWe don't get enough opportunities to speak…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I appreciate the opportunity to talk on  such an important issue that faces our country.\n\nOur country has been ailing since 2020, but, thankfully, President  Trump is back, along with Republicans…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…General Farm Commodities, Risk  Management, and Credit Subcommittee and vice chair of the full  Agriculture Committee.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I appreciate the  opportunity to speak in support of H.R. 4550. This legislation  reauthorizes the United States Grain Standards Act, a cornerstone of  American agriculture and trade for nearly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…review or any  review for a  cross-border project approved by FERC or the State Department is just  not accurate. That is not what the bill does.\n\nMr. Speaker, I appreciate the opportunity to be here and be here with  my friend. Hopefully, we are going to be able to work on a lot of  issues because we do care about the cost of electricity. I know they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…is still a high number, but  over the last 4 years, the monthly average was over 150,000. It is  astonishing.\n\nThis is something that has been delivered. I would appreciate any  opportunity to codify this into law. I do not like ruling by executive  order all the time. This is stuff we need to codify.\n\nI hope that we can learn from the good experience…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…this critical  juncture is not an option. This clock is ticking. The President and the  American people are waiting.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I appreciate the  opportunity to address the American citizens for just a couple of  minutes.\n\nI know many of our citizens are concerned about some of the language  in the bill, and I think maybe…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…dignified transfer ceremony  at Dover Air Force Base to receive the remains of the two Iowa National  Guard servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.\n\nHad I been present for the rollcall vote No. 651, on the motion to  invoke Cloture on the Nomination of Douglas Weaver, of Maryland, to be…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I appreciate the opportunity to be here.  This little podium seems to have a mind of its own, so I will leave it  down so it doesn't scare us all again.\n\nMr. Speaker, I thank my colleagues in…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "Mr. TILLIS. Mr. President, I appreciate the opportunity to come to  the floor and talk about a couple of things.\n\nEarlier today, we had a classified briefing on the situation in  Venezuela. I have to say that I am very…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Madam Speaker, I appreciate the opportunity, as always, to  be here in the House Chamber and try to be a voice for the people  across this country.\n\nThe people that I represent, of course, as does the Speaker…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Madam Speaker, I thank the lead of this bill, the  gentleman from California (Mr. Tran), for his work on this bill.\n\nI appreciate the opportunity to serve as co-lead on this legislation.  The SBA's 504 program helps small businesses to grow, create jobs, and  invest in their communities. Since this program…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699185/504-program-risk-oversight-act"}]