[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…danger to the community       would be held in jail solely because they cannot afford to       pay. Meanwhile, wealthier defendants could simply buy their       freedom. This approach would displace and worsen DC's current       system, which, as detailed below, has been effective and       focused on public safety. Congress should, on a bipartisan…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…We don't need any more problems. We have been fighting global  competition now for half a century, and it is rough. Instead of a blunt  Trump instrument, we need a targeted approach that brings real  investment to American manufacturing and in the communities hollowed  out by decades of bad and broken trade deals and outsourcing.\n\nI call on this administration.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…isolated concern. My  constituents, as well as economists, academicians, and policy experts  across the country have echoed the same worries. The Administration's  recent approach to tariffs has created serious uncertainty for U.S.  businesses, workers, and consumers. This is not just a matter of  opinion, it is supported by data and economic analysis.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of Tess  Kuenning, president and CEO of Bi-State Primary Care Association. Her  community-based approach to public health and exceptional leadership  have significantly improved both the quality and accessibility of  health care in New Hampshire, Vermont, and the rest of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…opportunity for DC students. However, my support has always       been contingent on parity among all three education sectors--      public, private, and charter--and this approach is working.       We will not support changes that tip the scales away from       this core principle of fairness for DC families. As the       fastest improving urban school…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Trump's and Elon  Musk's reckless destruction of USAID and cuts to foreign aid.\n\nSeeking to destroy safe, lifesaving contraceptives is emblematic of  the Trump administration's approach to foreign aid. Destroying these  birth control products would exacerbate an already dire problem and  would lead to more unwanted and high-risk pregnancies, unsafe  abortions,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…politics by making sure that  neighbors and constituents had power over land use, development, and  zoning. In doing so, Carlos modeled what a collaborative co-governance  approach to community development could look like and work.\n\nIt is how we resulted in tangible wins and how he was able to bring  those wins to communities, including the development…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…From Arkansas to Colorado to Minnesota  and everywhere in between, more coal is their prescription, Mr.  Speaker.\n\nIn Colorado, we certainly don't think that is a prudent approach. I  will say I regret that the Speaker didn't indulge me in the colloquy  that I had hoped I could engage in with the chairman whom, of course, I  greatly respect. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…from  September 15 to 17, 2025.\n\nOn behalf of the State of New Hampshire, I recognize His All- Holiness' efforts to strengthen humanity's relationship with nature  through an approach that combines science and spirituality, for which  he has been awarded the 2025 Templeton Prize.\n\nHis All-Holiness inspires millions of Orthodox Christians around the  world…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…include heightened volatility, less  transparency, difficulty obtaining accurate pricing, long lockup  periods, and limited liquidity.\n\nUltimately, industry argued for a simpler approach, so the SEC  adopted the current definition, which is based around income and  wealth. Today, to be an accredited investor, the investor must have a  net worth, either individually…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…nature of warfare. The idea that protecting our immediate  surroundings will keep the American people safe is a dated, 19th  century idea that long ago became irrelevant.\n\nThis approach also risks taking our eye off the ball on other  critical challenges--like the one posed by China--while opening further  feuds with critical allies and partners.\n\nJust look…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Education.\n\nThe bill also mandates a public database of faculty contracts and  donations, raising privacy concerns and exposing researchers to  potential harassment. This approach does not strengthen security--it  creates red tape that harms academic collaboration. That is why I  oppose it, along with major higher education groups and research  institutions.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689203/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…information, to quality care that they need to  live longer, healthier lives.\n\nAs chair, I am committed to continuing this important work and  encouraging men to take a proactive approach to their health not just  during June but every month of the year.\n\nThe caucus focuses on key areas like mental health care, prostate  cancer screening, traumatic brain injury,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Nation's history but  in the global pursuit of democracy and self-governance. The work  remains unfinished, and each generation has been tasked with carrying  it forward.\n\nAs we approach the 250th anniversary of that moment, Congress has a  responsibility to reflect honestly on where we have been and what we  will choose to pass on.\n\nThis legislation authorizes…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…President said that this bill  wouldn't take away benefits or close rural hospitals. Well, they were  wrong. We don't need more broken promises. What we need is a different  approach, a one big, beautiful repeal instead.\n\nLet's pass the Protecting Healthcare and Lowering Costs Act, which  will restore people's benefits and access to care, ensuring that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695373/one-big-beautiful-repeal"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…critical energy resource  supply chains and eliminating our dependence on foreign adversaries  like we have been talking about, Communist Red China.\n\nThis bill takes a holistic approach, Mr. Speaker, in ensuring  vulnerable supply chains, impacting absolutely every single corner of  the United States' energy sector, are addressed by the Department of  Energy,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…CBO scored in 2024 with a de-      minimus score.\n\nThe bill is a companion bill with HR 2189 (Fitzgerald/      Correa) and ensures a consistent and harmonious federal       approach to the Department of Treasury & the DOJ updating and       maintaining clear compliance guidance for less-than-lethal       projectile devices.\n\nThe legislation corrects a…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…United States, and we do not need overly restrictive  regulations to continue this.\n\nGiving our private sector the ability to innovate on a sensible  timeline is a different approach than the inflexible, top-down mandate  that became accustom over the past 4 years.\n\nThe good news is, every Member of this Chamber now has the  opportunity to right this wrong…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Tiananmen Square massacre or the ongoing genocide of Uyghur Muslims.  Students don't learn about these despicable crimes because the CCP  doesn't want them to. This one-sided approach extends beyond K-12  classrooms.\n\nWhile the CCP operates programs in U.S. schools, American educators  are not allowed to expose Chinese students to American culture. The…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…problems to solve. Adding  qualified mental health providers will only help.\n\nI can appreciate the fact that the Senate has a different  perspective. However, I find their approach to be business as usual for  Congress and VA. Their bill would simply reauthorize the program for  longer and with more money. It would also oblige VA to provide more  vague…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…lead sponsor of this bill.\n\nMr. WESTERMAN. Mr. Speaker, this bill by Representative Stefanik  acknowledges a significant site for its pivotal role in American  history as we approach our Nation's 250th anniversary.\n\nI urge the adoption of the bill, and I yield back the balance of my  time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…That is something we can all try to do better, especially those of us  in elected office.\n\nI ask every Member of this House, myself included, to think hard  about how we can approach our work here with a greater spirit of  collegiality and conciliation. In this terrible moment, that has to be  the path forward for our country.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…chosen for them by the government.\n\nFinally, with this resolution, we can restore a paradigm of dynamic  innovation rather than command and control mandates. It is an odd  approach to innovation that says we are going to force innovation by  banning any and all available alternatives. I believe in the future of  clean energy. I believe that it is upon…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…including public scoping and comment, data analysis,       alternative development, environmental review, stakeholder       engagement, and selection of a preferred management approach,       BLM approved the North Dakota RMP through a Record of       Decision (ROD) incorporated into the document.\\13\\ The ROD       states that it represents the agency's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…buildings. Crucially, it also protects Americans from a  supercharged IRS by cutting enforcement and redirecting resources to  customer service. This is especially important as we approach tax- filing season and implement the working families tax cut, allowing  families to keep more of what they earn.\n\nJust as this package strengthens economic security and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…strong emphasis on collaboration  between borough council, local businesses, residents, and public safety  officials. His leadership reflected a practical, community-first  approach, focused on maintaining New Hope's unique identity while  addressing the everyday needs of its residents and visitors alike.\n\nUnder his leadership, New Hope continued to strengthen…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to drive that, to potentially  control it, to issue it, for individuals to bank at the Fed and be  subject to these risks to privacy or surveillance. Let's stick with the  approach of private-sector solutions.\n\nWe have already seen small glimpses of this possibility under the  prior administration. The chair of the House Financial Services  Subcommittee…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…what all criminal laws should  achieve, protecting Americans, punishing illegal activity, and to deter  repeat offenses, this is a needed step to accompany the legitimate  approach that the President has been implementing over the past few  years.\n\nMadam Speaker, I urge my colleagues to vote in favor of this  legislation.\n\nMadam Speaker, I yield back…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual. This innovative approach epitomized their  ability to harness technology and partnerships for meaningful impact.  Beyond immediate relief, the team worked with individuals and families  who would…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Asia  and can be a counterbalance to Iranian and Russian influence in the  region.\n\nI support this bipartisan bill introduced by Mr. Wilson because it  takes an America-first approach to the Republic of Georgia. This bill  will impose sanctions on regime officials for their roles in  undermining Georgia's sovereignty and pro-Western trajectory, as well…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]