[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Mr. SUBRAMANYAM. Mr. Speaker, the concentration of political power  has often led to the concentration of wealth in this country.\n\nMr. SUBRAMANYAM. Mr. Speaker, I appreciate the gentleman's remarks.\n\nIt is the cycle and the concentration of wealth because of Citizens  United that has led to the concentration of political power that you  can see even…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…insurance under this legislation, and no amount of rationalizing on  your part is going to change that.\n\nMr. PALLONE. Mr. Chair, I yield myself 1 minute.\n\nMr. Chair, I appreciate what the gentleman from California is saying.  The bottom line is, if these programs are successful under the SUPPORT  for Patients and Communities Act, and I agree they have been,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…voices in Congress.\n\nI also want to recommend his op-ed. It is the best piece written on  trade policy in the last 30 years of any that I have read.\n\nMr. Speaker, I appreciate the gentleman's leadership, and I  appreciate his convening this.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…me, but at some point, we have to do what we are  doing now and let people know that we have respect for each other  notwithstanding these differences.\n\nI really appreciate the way the gentleman has called for regular  order. That means something to me. So while I have not been on the  floor with the gentleman when he has done it, I want him to know that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693109/tax-cuts-and-spending"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…several great conversations with on this issue. He has  introduced a bill that would put a congressional stock trading ban into  effect.\n\nMr. MAGAZINER. Mr. Speaker, I appreciate the gentleman.\n\nMr. Speaker, I now recognize the gentleman from California (Mr.  Levin), who has been an outspoken champion for this reform for many  years.\n\nMr. MAGAZINER. Mr.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…gentleman from Minnesota, personally, from the  Secretary of the Interior. Maybe there is a misunderstanding there, but  we have the receipts on that one.\n\nMcCollum).\n\nI appreciate that the gentleman from Montana is suddenly so  forthcoming about all of the analysis that has gone into this  particular mining project because that wasn't always the case. When…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…respect and dignity that they  deserved throughout America's history and stop penalizing them for  trying to serve their residents the best way they can.\n\nAgain, I appreciate the gentleman for yielding.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…billionaires?\n\nIt just makes no sense to me. All we are asking for--and I think some  Republicans may agree with me on this--is before you bring the bill to  the floor--and I appreciate the gentleman saying that there will be a  CBO score by the time it gets through the Senate--don't House Members  deserve to know what the hell they are voting on before they vote…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…interrupting Joe Biden time and time again. The  majority talks about lack of decorum. Go back and look at the tapes.\n\nThere was silence on the Republican side. I appreciate the  gentleman's selective outrage, but he would have more credibility had  he expressed outrage when his colleagues were heckling Joe Biden.\n\nMr. McGOVERN. Mr. Speaker, with all…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. GARCIA of California. Mr. Speaker, I thank the Congressman for  yielding. I appreciate the gentleman having this opportunity for us to  speak.\n\nMr. Speaker, we all know that the Hatch Act is here to keep partisan  politics out of our government. It has been in place…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…having to push my father's car to  get gasoline. At the time, everybody said we were going to run out of  crude oil. That was the thing, running out of crude oil.\n\nI appreciate the gentleman bringing up the crude oil issue. It is  actually because of the ingenuity of the American people that we have  an abundance of crude oil. The issue isn't crude oil.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and to let that American spirit continue to grow.\n\nThese are the kinds of things that we need to be doing. These are the  kinds of things that we are doing, and I appreciate the gentleman  yielding me time.\n\nMr. Speaker, I thank the gentleman for his excellent comments. I  think another important point that needs to be made in the context of  this resolution…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I appreciate the gentleman yielding.\n\nMr. Speaker, on July Fourth, President Trump signed the One Big  Beautiful Bill Act into law. This historic legislation delivered the  largest tax cuts…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694172/benefits-of-one-big-beautiful-bill"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…weapon.  I think they probably figured that out by now.\n\nMr. Chair, I will end by saying kudos to the Energy and Water  appropriations bill under this committee. We appreciate the gentleman  from Tennessee (Mr. Fleischmann).\n\nMr. Chair, I encourage my colleagues to support this bill as we  continue along the path of making America great once again.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…our community, and I could go county by county  and talk about them. Their sacrifice is very much appreciated, and they  do the good work that is needed in Utah.\n\nI appreciate the gentleman from Colorado for highlighting the Capitol  Police, as well as the D.C. Metropolitan Police, as we spend a lot of  our time back here, as well. They do an exceptional…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…fiduciary responsibilities of  professionals. This is the right thing to do and the right direction to  go.\n\nMr. HUIZENGA. Mr. Speaker, I will close with this. I appreciate where  the gentleman is coming from. This has been a long debate regarding  some of these issues surrounding what I believe is the core issue. I  believe the core issue, Mr. Speaker,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker, I thank the gentleman from South Carolina. I  thank him for bringing forward this important resolution before the  body.\n\nMr. Speaker, I do want to say that I appreciate the gentleman from  Maryland, his commentary about the vote on removal, and his considered  judgment with respect to Santos. I agreed with him at the time and made  the same points.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…issues. It is so  important to call up the reality of it.\n\nMadam Speaker, I yield to the gentleman from Georgia (Mr.  Loudermilk).\n\nMr. MOORE of Utah. Madam Speaker, I appreciate the gentleman's  remarks.\n\nMadam Speaker, I yield to the gentleman from Mississippi (Mr. Guest).\n\nMr. MOORE of Utah. Madam Speaker, I yield to the gentleman from  Wisconsin (Mr.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…What we are doing is releasing the shackles off of energy production  so that we can provide the things that our country and our economy  need.\n\nThat is why I really appreciate the gentleman from Mississippi (Mr.  Ezell) for bringing this bill forward.\n\nMr. Speaker, our country is at a point where we need more energy and  every form of energy when we look…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…If we are having such bad  outcomes holistically, why not take a look and try to do something  differently. We can't just keep doing the same thing.\n\nMr. Speaker, I appreciate the gentleman's commentary on that issue,  and I look forward to being a part of this change. I am actually very  confident that, when Utah is given more opportunities in the space…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…gentleman from Massachusetts is  using a whole set of leftwing talking points himself, but I am curious  and, rather, we should probably check the transcripts. I do appreciate  the gentleman from Massachusetts for applauding Federal law  enforcement's efforts to apprehend and prosecute and subject to our  system of justice some of the worst criminals…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]