[{"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…Just today, in the House Judiciary Committee, as the Judiciary  Committee was marking up the reconciliation package, which,  unfortunately, many Republicans will just blindly approve, Judiciary  Committee Republicans refused to protect U.S. citizens from  deportation.\n\nIt is shocking, I know.\n\nHere is the thing: We can have strong border security and a…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…in the National Defense Authorization Act is making  the airspace less safe. I don't even know how this got in the bill  because I guarantee you, Senator Cruz and I didn't approve of this  being in the bill. I am pretty sure my colleagues in the House,  Congressmen Larson and Graves, didn't approve of this being in the  bill. So how is it that this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…does nothing to ensure a reliable grid,  which is so vitally important at a time of more extreme events.\n\nThe Federal Energy Regulatory Commission has the power already to  approve changes to the interconnection queue process. That is a funny  term for how we bring sources of energy onto the grid, this disjointed  grid across the country. FERC can prioritize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…apology. Right now, Elon  Musk is giving veterans the middle finger. Veterans won't stand for it.\n\nSo, Mr. President, I am introducing a resolution today and asking  that we approve it to uphold the contract, to uphold the promise, to  uphold the commitment we made to our veterans when they raised their  right hands and promised to serve and sacrifice…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…assistance for  many households, businesses, and the public.\n\nWe are still trying to put this all together and figure out how to  pay for this. I urge our President to immediately approve Governor  Evers' request for a Federal disaster declaration, a request supported  by the entire delegation on both sides of the aisle.\n\nMr. Speaker, this just shows us the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695324/recognizing-milwaukees-severe-flooding"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…their healthcare as a result of Donald Trump's one big, ugly bill.  On Staten Island and in New York's 11th Congressional District--I don't  think that the Wu-Tang Clan would approve of that.\n\nIt is incredible to me. In district after district after district,  Mr. Speaker, represented by my Republican colleagues, so many Americans  will stand to lose their…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…military in the event of a claimed rebellion or insurrection for a  limited amount of time, require the President then to come to Congress  and make the case, and Congress to approve a set of reforms that would  protect the American people against misuse of the military in the event  that he could not deploy the National Guard in this way.\n\nI want to ask…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Mr. Speaker, I strongly oppose H.R. 4090. This bill hands the mining  industry the power to gut its own regulations. It directs the Secretary  of the Interior to expedite and approve any mine that the  administration deems a priority, and it tells the Department of the  Interior and the Forest Service to identify any public lands that  should be a priority…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…interagency agreements, where they are  trying to outsource all of these programs to other agencies that don't  have the staff, don't have the expertise, and Congress didn't approve  it.\n\nI am here with you today, Representative Hayes, to say: We need the  Department of Education. The Republican majority cannot abolish that.  The Trump administration…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…ramp up gas exports that will make life even more  expensive. It wasn't even 1 year ago that the Department of Energy  released its study that made it clear, continuing to approve gas  exports would raise costs on U.S. households and businesses.\n\nDon't just take it from me, Mr. Speaker.\n\nMr. Speaker, I include in the Record a letter from the Industrial…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…also can't support  a bill that paves the road to VA privatization. Perish that thought.\n\nWhile I have the time, it is long overdue for the Department of  Veterans Affairs to approve the request from northwest Ohio to expedite  the dual affiliation of the University of Toledo Medical Center and the  VA Ann Arbor Health Care System. Our VA community clinic…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…on track to obliterate their previous record of the most closed  rules in a single Congress. That is 86 times that this Chamber was kept  from even considering amendments to approve bills. There is no debate,  no votes, nothing. That is what an authoritarian dictatorship is like.\n\nRepublicans have blocked nearly 8 out of every 10 amendments  submitted…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…one of the most important tools we have to support the  long-term success and economic mobility of veterans. With that comes a  responsibility to ensure that the programs we approve for GI Bill  funding are high quality and accountable and lead to meaningful  employment.\n\nH.R. 1458, while well intentioned, opens the door for a surge in non- degree-granting,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…delivered to Speaker Mike Johnson's  office on December 10, 2025.\n\nI ask that funding for our military not be linked to funding Israel's  military. I support our military. I do not approve of attaching my  support for our military to Israel's military. We, who support our  military should be allowed to do so without having to fund Israel's  military. Those who…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698049/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…since January, HHS has cut 20,000 of its employees.  That is over a quarter of its workforce. These are people who inspect  nursing homes to ensure that they are safe. They approve diagnostic and  treatment services for children. They regulate health insurance to make  sure that they are not discriminating against you based on your health  conditions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…energy dominance.\n\nThat is why I introduced the Promoting Cross-Border Energy  Infrastructure Act. This legislation will help fix this problem. This  bill requires Congress to approve the reversal of a cross-border  project, no more unilateral decisions based on politics.\n\nThis bill would also replace the outdated Presidential permitting  process with a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…getting  care. Hospital at home has been a proven success for getting more  Americans the healthcare that they need.\n\nMr. SMITH of Missouri. Mr. Speaker, I urge my colleagues to approve  this legislation, and I yield back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…endangered species and guide the conservation of over 12,000 species in  the greatest conservation need.\n\nCurrently, there is no deadline for the U.S. Fish and Wildlife  Service to approve a State-submitted wildlife action plan, with most  taking over 18 months to simply get an approval. This is something that  is unacceptable, and my legislation seeks to change…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…wilderness area, but that is not the case.\n\nMr. Speaker, I ask and I urge my colleagues to support this. It is a  good mine. It is a good project.\n\nBy the way, it doesn't approve anything. You still have to go through  the process. So approving this act today you are not going to start the  mine tomorrow. They still have to go through the process.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…instead, made a change after  the House completed its work. That delay on the part of the Senate  caused the government to shut down.\n\nNow, what the Senate should have done was approve the six-bill  appropriations package that was negotiated in good faith. This process  should have been over and done with by now. We don't have time to be  playing games,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…session.    delegation of authority to committee chair and ranking minority member\n\nRule 23. The Chair and Ranking Minority Member, acting       jointly, are authorized to approve on behalf of the Committee       any rule or regulation for which the Committees approval is       required, provided advance notice of their intention to do so       is given…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…in passing their resolution that is under  consideration, we are setting the stage for failure. We are setting up  our economy and future generations for failure. Voting to approve the  resolution is a vote for an unstable energy supply, higher energy  costs, and more.\n\nI urge my colleagues to vote no against the resolution that is  brought by my colleague…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…relief, fiscal sanity, and  basic fairness. It secures the future of our economy and our safety  net.\n\nLet's choose the path that has been tested and proven to work. Let's  approve this rule. Let's pass the One Big Beautiful Bill Act, and let's  get this country back on track.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 981) to amend title 38, United States Code, to improve the  processes to approve programs of education for purposes of the  educational assistance programs of the Department of Veterans Affairs,  and for other purposes.\n\nThe Clerk read the title of the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…They threatened the employees.  They said: If you cut off our money--they sent them an email, and they  did it by phone. They told the State agency that failing to promptly  approve new applicants from minority-owned businesses would result in a  lawsuit--a lawsuit--feeding accusations of racism that would be  scrawled across the news--scrawled across…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…companies.\n\nMr. Speaker, here is just a crazy thought experiment. Ozempic goes  off patent in Canada in January. States like Florida and Colorado have  already gotten the FDA to approve reimportation. We actually have a  chart that is looking at the potential of generic manufacturers  producing it from $60 to $120 a month.\n\nThis is a crazy thought. We know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…couple  days.\n\nThe bill is $58 billion. That is less than the current budget. I am  very proud of that. I said at the very beginning of this process that I  was not going to approve a budget that did anything but spend less. We  have done that. Nominally, it is a $27 million reduction. Non- nominally, which means if you factor in inflation, it is a 2.8-percent…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Committee on Foreign       Relations or its staff shall travel abroad on committee       business unless specifically authorized by the chairman, who       is required by law to approve vouchers and report       expenditures of foreign currencies, and the ranking member.       Requests for authorization of such travel shall state the       purpose and, when…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Congress approves the  authorization of the expenditure of DC local funds, which are paid for  by DC tax revenues.\n\nThe first CR that we enacted last year included language to approve  the DC's fiscal year 2025 budget, and that language was continued in  the second CR. However, the House did not extend this anomaly in the  yearlong CR. As a result, unless…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688849/district-of-columbia-local-funds-act-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…while my distinguished  colleague speaks with his usual passion on many subjects, the only  subject before us today is whether or not this body is going to pass,  to enact, to approve H.R. 2243, the LEOSA Reform Act. That is the sole  question in front of us.\n\nThat measure is critically important to the safety of many law  enforcement officers retired to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}]