[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…their  oath of office.\n\nAnd even with a majority party bending to his will, the Trump  administration is still floating proposals to blow up the bipartisan  Defense appropriations process altogether and pursue a party-line  reconciliation bill instead.\n\nColleagues, this is the President doing everything he can to build  unquestioned power over our military…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…in  folks back home and make sure Congress and our constituents have a say  in Federal spending. The way, of course, to ensure that happens is  through a bipartisan appropriations process.\n\nSo I am very glad that, thanks to the senior Senator from Georgia,  working across the aisle with his partner, the senior Senator from  Arkansas, we were able to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Transportation.\n\nMore than 30 people in the United States die every day in drunk  driving crashes, and more than 12,000 people a year suffer these  preventable deaths.\n\nUsing the appropriations process to delay or in any way impede the  development of technology to prevent drunk driving is inappropriate and  reckless.\n\nWhat we have before us today is a bipartisan,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republican leader is talking a bit out of both  sides of his mouth. On the one hand, he talks about bipartisanship and  wanting to see both parties come up with an appropriations process. On  the other, he is putting on the floor rescission packages with cuts  demanded by Donald Trump and Russell Vought that retract many of the  bipartisan agreements,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…not live up to that promise.\n\nMr. Speaker, Republicans need to stop taking photographs with  veterans and then vote against their healthcare.\n\nThose who lead in the appropriations process here believe in the  constitutional power of the purse. Over the past month, President Trump  has been firing Federal workers en masse. When his administration has…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Republicans have already thrown so many norms out the window.  Republicans have already disregarded Democrats in all of their  legislation and have started this radical appropriations process, where  it is party line, Republican only. So many norms are being trashed, and  now, for the first time, they are going to do this using the CRA on  resource management…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…continuing resolutions, or CRs, and government shutdowns. We say  we want to bring appropriations bills to the floor. This isn't a  pipedream, and I reject the idea that the appropriations process can't  work anymore. More often than not, we pass appropriations bills within  the first few months of the new fiscal year--not ideal but workable. We  certainly need…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…this denunciation of what is happening in Gaza  and the West Bank.                           Funding Meals on Wheels\n\nMr. POCAN. Madam Speaker, the Republicans in the appropriations  process  are leaving seniors to starve, underfunding the Meals on Wheels food  assistance program by $600 million, a move that is likely to cost 1.9  million needy people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…major pieces of legislation through the House, and  House leadership hasn't pressed him to do it, even though we are  supposed to be doing these things through the appropriations process.\n\nAs a matter of fact, the Constitution gave us the obligation to move  these bills through the appropriations process, but the Republican  leadership in the House…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…to address an issue to  be debated in this Chamber under the cover of darkness.\n\nFinally, Mr. Speaker, the challenge that we have with this  legislation is that the appropriations process has historically and  traditionally been bipartisan. It means Democrats and Republicans will  work and try to come together to reach a spending agreement that meets…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…package for an administration that has been rife with abuse  since the day they took office. I understand their concerns, and I  share them. However, abandoning the appropriations process only  empowers the President and the Office of Management and Budget to  continue manipulating Federal spending as a partisan weapon. If we give  up on appropriations,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…package that guts foreign aid and public broadcasting.\n\nJust this morning, the OMB Director suggested that he was just  getting started and didn't care whether or not the appropriations  process proceeded as our Founding Fathers and the Constitution imagined  it. He said it should be more partisan and that he would continue to  send rescissions packages like…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693677/department-of-defense-appropriations-act-2026"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…immigration agents,  force them to abide by the local law enforcement standards for use of  force and use warrants.\n\nMr. HOYER. Mr. Speaker, throughout this year's appropriations  process, we have seen Donald Trump and Russell Vought trample on this  Congress' power of the purse. Some will admit that. Some will say it  silently.\n\nIf there were ever…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Congress's Article I power. Allowing any  Administration to erase duly enacted funding through procedural delays  that amount to unlawful impoundment would destabilize the  appropriations process and corrode the separation of powers that the  Impoundment Control Act was enacted to defend.\n\nI remind my colleagues that Congress alone holds the power of the  purse.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…one party can simply rip up  those bipartisan funding agreements by enacting one-sided decisions  like what my Republican colleagues are going to be doing here, the  appropriations process will simply break down.\n\nHow can we be assured that these bipartisan agreements are being made  in good faith if Republicans are just going to turn their backs on them…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…with consideration of this rule and its two underlying  measures, the House stands firmly upon the 1-yard line. We are, indeed,  ready to move forward and complete the appropriations process. We are  ready to lock in the final components of our 12 fiscal year 2026  appropriations bills.\n\nAdditionally, we are ready to further cement our long-overdue return…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…money, not the President. So, for  instance, in Venezuela, if you don't want any American boots on the  ground, I think you could come forward and pass through the  appropriations process a prohibition of funds to be used to have  American ground forces in Venezuela. If you don't like the seizing of  the oil for the mutual benefit of Venezuela and the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…get control over waste, fraud, and abuse. We started it  in the One Big Beautiful Bill Act. We are continuing it here, and we  are going to continue it through the appropriations process.\n\nIf Democrats want to vote ``no,'' that is their prerogative. They  have become the party of socialists. Let them vote that way.\n\nWe are going to fight for those hardworking…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Collins of Maine, who has led the Appropriations  Committee, has done an outstanding job working with Republicans and  Democrats on that committee, building out this appropriations process,  making certain that bills moved out of the Appropriations Committee and  that they are making their way to the floor.\n\nOne of the things that is so interesting is…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…dysfunction that we are  undergoing stops before we see dramatic and damaging consequences.\n\nMy point is that the continuing resolution is standing in the way of  the appropriations process. We have a majority leader who is willing to  bring appropriations bills to the floor. They deserve the Senate's  consideration of those appropriations bills. The challenge…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Shutdowns are political games.  Political acts are choices.\n\nCongress has the tools to avoid this chaos. It requires, however,  cooperation from the Democrats.\n\nThe appropriations process, it exists. It exists for a reason. It is  how Congress fulfills its basic mission--the power of the purse. That  is our duty, and that is what Republicans are doing.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…upon the appropriations measure that is under consideration.\n\nTo make the record crystal clear, not once did the people's House  court a government shutdown during the appropriations process. The  various subcommittees of the Appropriations Committee did their jobs.  They worked collaboratively to deliver to the full House their  recommendations.\n\nAs Chairman…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…team.\n\nMr. WOMACK. Madam Speaker, I am going to take that 30 seconds and  brag on this guy right here,   Tom Cole. He has reengineered, somewhat  reinvented a lost appropriations process, and I am eternally grateful.  I know I speak for the American people in thanking Mr. Cole for his  leadership.\n\nI thank my colleagues for this bipartisanship that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, the appropriations process is officially  underway here in the Senate.\n\nLast week, the Appropriations Committee held its first markup of  appropriations bills for fiscal year 2026, and I am pleased…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…programs, therefore we are not going to vote to  reauthorize them because we don't believe they are going to be carried  out. It is our job to authorize them, to work the appropriations  process, and then to do the oversight to make sure these are  implemented.\n\nIf the White House and the President can do this more efficiently, I  am all about doing it more…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…and deliver results  for the American people--reliable and affordable energy, strong  national security, safe communities, and long-term fiscal  responsibility. The appropriations process works for America.\n\nI also highlight the provisions important to my community and, as a  result, the security of our Nation. This bill ensures continued  American dominance…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…America first.\n\nNow that the shameful charade is over, House Republicans will  continue our work on behalf of the American people. We will restore  regular order to the appropriations process. We will continue to  fulfill the mandate of the American people, and we will keep delivering  results for American people because that is what we are here to do and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…advancing funding bills through what we call regular order.\n\nWe are restoring transparency. We are restoring accountability, and  we are restoring deliberation to the appropriations process. I am  grateful to Leader Thune for bringing these bills to the floor, and I  look forward to continuing our work to pass the remaining measure and  responsibly fund…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "John Thune", "party": "Republican", "sentence": "…government open.\n\nRight here--24 pages. Not partisan. Not complicated. Simple.  Straightforward. Clean. Nonpartisan. Short term. Until November 21 so  we can finish the appropriations process--something, I might add, that  never happened when the Democrats were in the majority.\n\nLast year, we never considered an appropriations bills on the floor  even though…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…colleagues are  going to have the opportunity to vote for a clean, nonpartisan  continuing resolution that would open the government and allow us to  continue working on the appropriations process.\n\nJust to kind of give a little perspective on that, here are the  statistics showing all of the Biden-era clean CRs that were passed.  There were 13 of them--13 of…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}]