[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, last night, law enforcement apprehended  the man suspected in the assassination of Minnesota State  Representative Melissa Hortman and her husband and the shootings of  State Senator John Hoffman and his wife.…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692586/minnesota-lawmakers-shootings"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…individuals with orders of deportation, and those individuals who  came in, in the last 2 years.\n\nThat is the minority, the smallest number, of the people who are  actually being apprehended. I say that because the President came out  last week and said that we don't want to go after farmworkers, dairy  farm workers, and hospitality workers. The President said…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Operation  Metro Surge costing our Minnesota economy an estimated $80 million per  week, all for the shock and awe, where such a small percentage of the  people that they apprehended were involved in violent crime.\n\nAt its peak, one study showed that the surge cost Federal, State, and  local governments at least $18 million every single week. The fact…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…Donald Trump has set us careening down. Even if the administration  can actually give us proof that those killed on board were all  criminals, well, then they should have been apprehended by law  enforcement and tried in the judicial system. That is how ``law and  order'' works.\n\nBut Trump doesn't seem to care. In his world, he is a judge, jury,  and executioner.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…not  going after violent criminals. They are going after peaceful, law- abiding immigrants. As the rightwing Cato Institute recently found, 93  percent of the people being apprehended by ICE have had no convictions  for violent crime.\n\nICE is not going after MS-13 or murderers or rapists. They are going  after innocent people, including a woman in Tennessee…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…alleged assailant continued to fire shots from inside the apartment  building.\n\nIn the end, without discharging their firearms, the Canton Regional  SWAT Team successfully apprehended the suspected shooter.\n\nMr. Speaker, on October 9, before many of us had left the comfort of  our homes or checked our emails or even had a cup of coffee, Sergeant  Dollinger,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697308/champions-of-the-week-north-canton-first-responders"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…have uncertainty as to the facts involved here. ICE has  claimed that there were a number of undocumented immigrants. President  Trump has claimed that the people who were apprehended and detained all  came into this country illegally. At the same time, the Korean  Government has maintained that of the 300-some-odd Korean nationals who  were arrested…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…her to smithereens.\n\nAway sped the raiders into the dark,\n\nLeaving in the embers freedom's spark.\n\n``I want their names!'' King George demanded,\n\nAnd ordered the Raiders be apprehended.\n\nBut his call for hangings came to naught:\n\nHis nooses hung empty; no charge was brought;\n\nBecause never a traitorous tale was told.\n\nRhode Island stood steady, silent,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…the  Government of Panama in 1989. Without prior congressional approval, he  ordered 12,000 American troops into that country. We toppled Panama's  illegitimate regime. We apprehended the country's dictator, and he  spent the rest of his life in foreign custody.\n\nLet's compare these two cases. In both cases, you had the leader of a  country who is indicted…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…man with a firearm in a grocery store. The  murderer fled the scene and led law enforcement on a multicounty chase.  The brave men from multiple law enforcement agencies apprehended the  suspect on Interstate 40.\n\nOfficer Horan was a reservist in the U.S. Coast Guard, where he  earned multiple awards, including the Coast Guard Enlisted Person of  the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…occurred on August 1, 2024, on the Lower East Side of Manhattan.  On that night, Sergeant Leap, along with Sergeant Carl Johnson,  responded to reports of an armed robbery and apprehended a suspect  after pursuing him on foot through busy traffic. During the struggle to  detain the suspect, the assailant fired a shot, wounding both  sergeants. Additional…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691041/recognizing-nypd-sergeant-christopher-e-leap"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…reentry. He had been  deported three times before. When he was arrested, he carried an  illegal firearm and more than 9,000 fentanyl pills.\n\nIn May, ICE officers in Utah apprehended and removed an illegal  immigrant from Guatemala who was facing charges of aggravated sexual  assault of a child under the age of 14, after previously being caught  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…down 95 percent from the last  administration. I understand that this past weekend, they had the  lowest number ever--a 99-percent reduction. They had three people who  were apprehended.\n\nWhen you look at deportations, the Trump administration has already  removed more than 100,000 criminal illegal aliens. This number has  included suspected terrorists,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…passionate speech from the gentleman from  Massachusetts, but I wonder aloud if the gentleman has such passion for  some of the criminals who our Federal law enforcement have apprehended  in Minnesota during their most recent operations.\n\nFor instance, our Federal law enforcement arrested a criminal illegal  alien from Somalia with a record of multiple counts…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…to get a felony conviction. There is no compulsion to charge  the most serious layers of this offense. There is prosecutorial  discretion.\n\nUnder this law, if someone is apprehended, they can be deported  without any charging, and that is where the misconception and the  mischaracterization is.\n\nIf someone is convicted of illegal reentry and deported…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…full month in office, there were only 8,326 apprehensions at our  Nation's borders. Compare that to President Biden's failed leadership  where 8,000 illegal immigrants were apprehended in one day. It is  amazing. Deploying common sense and actually enforcing the law goes a  long way.\n\nHouse Republicans passed legislation like the Laken Riley Act and the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…full and speedy recovery;\n\n(4) honors the courageous law enforcement officers who       saved additional lives with their rapid response to the       attack and successfully apprehended and charged the suspected       perpetrator on June 15, 2025;\n\n(5) calls on all community leaders and elected officials to       publicly and unequivocally denounce acts…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…dismantled nearly every meaningful safeguard at the southern  border. Their administration presided over a record surge in illegal  immigration, over 700,000 illegal aliens were apprehended at the border  from October through December of 2023 alone. That was more than any  full year during the Obama Presidency when President Obama famously  stated that over…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Maduro regime.'' It sounds like a call for regime change to  me, just like Joe Biden's decision to increase the bounty on Maduro's  head seems like a call for Maduro to be apprehended and brought to  justice. Yet when President Trump did exactly that last weekend,  Senator Schumer said this is ``reckless.''\n\nAlso, consider Senator Murphy, who said, in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…pursuit of  criminal suspects. This has resulted in less justice for victims of  crime in Washington, D.C., and more opportunities for criminals, who  would otherwise be apprehended, to continue harming D.C. and  surrounding communities.\n\nThis bill replaces subtitle S with policies that allow for vehicular  pursuit of a suspect fleeing in a motor vehicle…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695642/district-of-columbia-policing-protection-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…stolen vehicles.\n\nWith President Trump and AG Bondi and Kash Patel, and the commitment  that they have made to Memphis, this is what you are seeing. Criminals  are being apprehended, and the citizens in Memphis feel safe to go out  and about. The crime rate has been cut in half. President Trump is  replicating the success we are seeing in Memphis. He…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}]