[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…track or the wrong track, believe that we are on the wrong  track.\n\nThis administration has prioritized costly foreign entanglements  without transparency or congressional approval while working families  pay the price at home.\n\nInstead of protecting the economic well-being of Americans, we are  seeing the following: Tariff policies are increasing the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…practice that allows certain mergers to be  automatically approved just 15 days after the closing of the public  comment period.\n\nThis resolution would reinstitute automatic approval just as Elon  Musk's, his DOGE, guts the very staff that are reviewing these bank  merger applications. It is a dangerous combination to actually say: We  are going to do…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…350,000 homes in Rhode Island  and Connecticut, but now that is at risk, so they are facing much  higher bills.\n\nJust last week, the Interior Department asked a judge to cancel  approval of the Maryland Offshore Wind project, a project over a decade  in the making that had received all of its final permits from multiple  Federal agencies and was expected to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Policy Notice on subgrantees as part of the BEAD       Program.'' According to the Policy Notice, ``Each Eligible       Entity must comply with this Policy Notice to gain approval       of its Final Proposal from the Assistant Secretary.'' The       Policy Notice also rescinded two previously issued Policy       Notices for the BEAD Program.\n\nThe Policy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…It is Congress which declares a war, which raises  an army and a navy and pays for the financial cost of defense and war.\n\nAnd keep in mind that the need for congressional approval of  warmaking was not hypothetical to the Founders. The United States had  just fought a war against a King, and the Founders did not want to put  the power to start another…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Congressional District of Virginia.\n\nAs a 25-year Army veteran, former Army JAG prosecutor, and National  Security Council staff adviser, I can say this: Imminent strike  approval and mission launch times are highly classified.\n\nSharing specific launch and strike times 31 minutes before the  mission begins and 2 hours before our forces were over enemy…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689155/pete-hegseth-must-go"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…sending troops off  to war and combat and then sending them home to live in squalor.\n\nWith regard to standing up to China, I introduced an amendment  requiring congressional approval before advanced AI chips, critical to  our most sophisticated weapons and intelligence systems, could be  exported to Beijing. It was blocked.\n\nI also proposed raising the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…has been orchestrating a reckless, vindictive  assault on new energy projects.\n\nOn July 15, the Interior Department began requiring Secretary  Burgum's personal review and approval of every single wind and solar  project on public lands, not to mention things as trivial as rights of  way. What this really turned out to be was a de facto moratorium on…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…accounts of  appropriated funds including the: Military Construction, Operations and  Maintenance, and Research, Development, Test, and Evaluation accounts,  without seeking approval from Congress. I understand that the intent is  to expedite the construction of the new headquarters for U.S. Space  Command, but the authority provided by this provision…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…of governance,  especially when it comes to putting boots on the ground.\n\nThis War Powers Resolution would not only prevent that in Venezuela  without further congressional approval, it will also demonstrate that  this Congress can actually act like a coequal branch of government and  fulfill our responsibilities under the United States Constitution.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699363/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Missouri's legal  challenge against mifepristone. The science is clear: Mifepristone is  safe. Yet Mr. Divine and Ms. Lanahan didn't hesitate--not at all--to  challenge its approval. And their court filing cited two research  studies, mere weeks after he filed the complaint, that were retracted  due to a lack of scientific rigor, problematic methodology,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…resources.\n\nThat is what they are blowing up with these CRAs, not to mention that  if these CRAs are signed into law, the validity of every single permit,  lease, and Federal approval that has been issued based on these RMPs  would suddenly be called into question and subject to litigation.\n\nI remind my colleagues once again that they don't have to go down…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…country.\n\nSince President Trump took office, his administration has canceled  more than 70 NIH study sections and advisory council meetings that are  the final step in grant approval. This means that more than $1.5  billion in funding has been withheld so far--illegally and in blatant  defiance of court orders--by this administration. The impact is already…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…is going to run Venezuela remains a mystery. My  concern remains how much is this going to cost the taxpayers of our  country. He has already expended billions, without the approval of  Congress, to decapitate the corrupt leaders of Venezuela; but the White  House can't even tell Congress how much has been expended, nor which  accounts their budget director,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…up. They even had their Justice Department's two highest officials try  to coerce a House Member to take their name off the discharge petition  that finally triggered the approval of this legislation.\n\nIt was only because of the actions of courageous survivors coming  forward, coming to the Capitol, and speaking truth to power that we are  able to advance…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696954/release-of-epstein-files"}, {"senator": "John Rose", "party": "Republican", "sentence": "…That information, which is referred to as a trigger  lead, is then often sold by the credit bureaus to data brokers and  other lenders without the consumer's knowledge or approval. Consumers  are then often bombarded with hundreds of unwanted solicitations.\n\nThe Homebuyers Privacy Protection Act would dramatically reduce the  number of unwanted calls…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the Fair  and Accountable IRS Reviews Act.\n\nFor decades, Federal laws required that before the IRS can impose  penalties on a taxpayer, an agent must first receive written approval  from that agent's immediate supervisor.\n\nCongress put this safeguard in place to ensure that penalties are  imposed fairly, consistently, and with appropriate oversight.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "Mr. ROUNDS. Mr. President, I rise in opposition to S.J. Res. 86. This  resolution would repeal the Environmental Protection Agency's approval  of South Dakota's Regional Haze Implementation Plan.\n\nSouth Dakota has made substantial progress toward meeting EPA's  ambitious 2064 visibility goals and has determined…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698625/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…we should deal with that  fully here.\n\nOn March 8, 2023, in a dialogue with Chairman Hill, Federal Reserve  Chairman Jerome Powell said that they would need congressional approval  for a retail CBDC, but he went on to explain that you could have a  layered CBDC. They are building just that at the Federal Reserve.\n\nWe should completely turn that off,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Jersey, to implement and run a Clean Water Act section 404 Permitting  program.\n\nThese State-run programs reduce duplicative requirements, reduce  costs, and expedite permit approval times exactly as Congress intended.\n\nThroughout the State-administered review process, Federal agencies  maintained robust oversight to ensure Florida's 404 permitting program…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…tremendous work and leadership in  proactively building support for this renewal effort.\n\nI urge my colleagues to support this extension of AGOA, which  received strong bipartisan approval in the Ways and Means Committee. I  look forward to continuing to work across the aisle to further  strengthen this critical program.\n\nMr. SMITH of Missouri. Madam Speaker,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…leading producer of  dairy products in the country, Pennsylvania dairymen know just how  important food additives are for the safety of our food supply.  However, the FDA's approval process for these additives has resulted in  a decades-long approval process that stifles innovation and leaves  American farmers falling behind their international competitors.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of  importance can be undertaken until after they shall have deliberated  upon the subject, and authorized such a measure.'' No offensive  expedition without congressional approval.\n\nSt. George Tucker, a Revolutionary War-era law professor, wrote in  1803 of how our Constitution diverged from the English tradition.\n\nHe wrote:\n\nIn England the right of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…enforcement. Sec. 5. Extension of authority to issue priority review vouchers to                encourage treatments for rare pediatric diseases. Sec. 6. Limitations on exclusive approval or licensure of orphan drugs. Sec. 7. Program for pediatric studies of drugs. Sec. 8. Organ Procurement and Transplantation Network. Sec. 9. Establishment of Abraham Accords…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…don't think politicians should  draw their own district lines.\n\nTo solve this problem, that is to say, the public overwhelmingly  opposing his plan which does require voter approval, the Governor has  come up with a two-pronged strategy which is to disenfranchise voters  and to defraud them.\n\nFirst, while the previous votes to establish the independent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…employee.\n\n``(e) Immunity From Liability.--Members and private       individuals are not liable for the obligations of the       corporation.\n\n``(f) Claim of Governmental Approval or Authority.--The       corporation--\n\n``(1) may not claim congressional approval or the authority       of the United States Government for any of its activities;…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697185/foundation-of-the-federal-bar-association-charter-amendments-act-of-2025"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…Why in the world are we not moving on? Why in the world  do we continue to waste more and more and more time? Is it any wonder  why we earn the badge of courage--14 percent approval rating--and we  still won't do anything about it.\n\nWe need to do things. We need to really get stuff done here. We need  to help our farmers, and I am sure my colleague from…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…lessons learned since 2007; promotes  equivalency and flexibility among mitigation options, providing  builders additional options beyond mitigation bank credits; speeds the  approval of mitigation banks, including through the interagency review  process, which provides numerous duplicative opportunities for the Army  Corps offices to raise the same concerns;…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the       impacts of mineral import reliance, find and map federal       lands that are well-suited to domestic mineral production,       ensure identification and prompt approval of high priority       mineral projects, and remove unnecessary barriers to opening       a mine in the United States. The Critical Mineral Dominance       Act represents…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…primary care to go to a doctor, have that doctor's  cell phone number, have a relationship with that doctor and not be put  into some complicated scheme where you have to get approval for  somebody who is in network or not in network and who may or may not be  within 100 miles of your house.\n\nWe want the American people to be empowered. We want them to…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}]