[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…came to Congress as an intern for Senator Hatfield, we  were celebrating our 200th anniversary. That is so long ago, 49 years  ago. And Senator Hatfield had a saying about appropriators, and that  was that appropriators--that is, those Members of the Senate who served  on the spending committee--they were first appropriators, and then they  were Republicans…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bipartisan fiscal year 2026  conference agreement for National Security, the Department of State,  and Related Programs that was published earlier this week, House and  Senate appropriators recommend continued funding for most UN  organizations and programs, as in past years.\n\nAccording to their bylaws, no UN member state, including the United  States, can…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…ban assault weapons in the United States of America to  prevent these weapons of war from continuing to destroy the lives of  everyday Americans.\n\nLed by our distinguished appropriators like Rosa DeLauro, we are  continuing to fight for robust funding for community violence  intervention programs and appropriate funding for the ATF and gun  violence research.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…infrastructure law provided $2.25 billion in advanced appropriations  for PIDP.\n\nI welcome the increase to the program in the fiscal year 2026 budget  request and hope the appropriators follow suit.\n\nH.R. 2390 continues the work of President Biden to replace Chinese  cranes and bolster the cybersecurity of U.S. ports. For that reason, I  urge my colleagues…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692199/maritime-supply-chain-security-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Mr. Speaker, may I inquire as to the time remaining.\n\nMr. Speaker, as I mentioned earlier in the debate, I deeply respect  the sponsor of this resolution. We are fellow appropriators, and I  observe firsthand the energy and commitment she brings to serving the  people of southwest Washington.\n\nThis resolution is wrong. It shouldn't be before us. The…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "Mrs. TORRES of California. Mr. Speaker, I rise today to speak on a  matter that is critical to the functioning of our government.\n\nAs House appropriators, we are tasked with ensuring that our Federal  agencies are properly funded so they can serve the American people.  However, we are being asked to perform this vital duty…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688338/stopping-appropriation-work"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…health, by stopping the  funding for the World Health Organization.\n\nI gave praise to President Bush when he put forth PEPFAR. We worked  closely with him to fund it as appropriators. There were 25 million  people's lives saved, but we are saying the alleviation of poverty and  the eradication of disease is no longer the point. They did this in the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693708/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and you need willing partners to  participate in that effort.\n\nI believe that what we have done here is to show the naysayers that  by entrusting appropriations bills to appropriators, we could get the  job done. That is what we are doing with six bills already passed and  signed and two bills that we will pass today. That is 8 of the 12  appropriations…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…consistent,  consecutive appropriations products that deliver upon the Nation's  highest priorities.\n\nI applaud Chairman Cole and Ranking Member DeLauro, as well as other  appropriators, and especially their staff, for the time they have  invested in these 12 appropriations bills. It is time to get them  across the finish line and stamp our seal of approval…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "John Thune", "party": "Republican", "sentence": "…bills on the floor  even though 11 of them were reported out of the Appropriations  Committee--not a single one on the floor.\n\nWe want to fund the government to give our appropriators, Democrat  and Republican, a chance to work on bills that have been coming out of  the Appropriations Committee with big bipartisan margins--a pretty  novel concept, right?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…I thank my friend from Oklahoma (Mr. Cole),  the chairman of the Committee on Appropriations, for not only yielding  but bringing this important bill to the floor.\n\nOur appropriators worked tirelessly to negotiate a multi-bill package  that  is part of this bill to reopen the government. We never should have  been here, Mr. Speaker. Over a month ago,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…do our  most basic, essential function, which is spending government dollars  and controlling the power of the purse. Through bipartisan, bicameral  negotiations, led by appropriators, we are turning priorities into  action and putting America first.\n\nMr. Speaker, this package demonstrates the value of Congress by  delivering results for communities…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Speaker, I continue to reserve the balance of my time.\n\nMr. COLE. Mr. Speaker, I continue to reserve the balance of my time.\n\nI want to begin by thanking two outstanding appropriators: Mr.  Amodei, the chairman of the Homeland Security Subcommittee of  Appropriations, and his working partner and colleague, the ranking  member, the gentleman from Texas…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…priorities, and it actually spends  less than if we just expended Biden-era spending levels for these same  Agencies.\n\nOnce we finish this package, we have more work to do. Appropriators  are working to finish the remaining bills for fiscal year 2026. One of  those is the Defense appropriations bill--which is an especially  important priority--to ensure…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Committee did their jobs.  They worked collaboratively to deliver to the full House their  recommendations.\n\nAs Chairman Cole said more than once in the Rules Committee, these  appropriators knew their subject matter better than anyone else and  presented to the rest of us their best effort.\n\nThen the House did its job. We passed all 12 appropriations bills…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…was encouraged to hear Secretary Hegseth proclaim a ``Trump  buildup'' in the mold of the Reagan buildup that helped end the Cold  War. For the record, my fellow defense appropriators and I have been  ready to deliver such a buildup since day one, and our bipartisan bill  speaks for itself in putting money where our mouth is.\n\nAh, but here is the rub:…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Management Agency, Agencies that we cannot leave behind. We need to  give these Agencies the security of a full-year funding bill without  delay.\n\nI, once again, thank Senate appropriators for helping us to get to  this point, and I look forward to finishing our 2026 appropriations  work in the coming days.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…passed the appropriations bill for the VA.\n\nThis would not have come about without the work of so many people-- too numerous to mention. But I do want to thank my fellow  appropriators, particularly the chairs of the three committees--Senator  Boozman, Senator Hoeven, and Senator Mullin--for their hard work.\n\nI want to thank our House counterparts, particularly…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}]