[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Tripoli-based Government of National       Unity that controls much of Libya's northwest involves       seeking U.S. support in pressuring countries--namely Russia,       the United Arab Emirates and Egypt--accused of aiding the       rival Government of National Stability that controls much of       the rest of the nation, including Libya's second city of…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…certification.\n\nFinally, the GENIUS Act is a missed opportunity to limit foreign  influence. We know that, recently, a convicted money launderer wrote  the code so that the United Arab Emirates could buy $2 billion of  Trump's stablecoin, which allowed President Trump to earn $30 million  on the transaction.\n\nNow, this convicted felon--\n\nMr. CASTEN. Mr. Speaker,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693832/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…with the Nuclear Nonproliferation Treaty, was that the regime may have  decided to do exactly that.\n\nI just returned from visiting Saudi Arabia, Bahrain, and the United  Arab Emirates with colleagues, both Democrat and Republican. All these  countries recognize that a nuclear-armed Iran poses an existential  threat to their futures, and of course to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…business deals with the UAE, Saudi Arabia, Oman, and others, including  Serbia.\n\nOn May 1, Trump's cryptocurrency firm announced that an investment  fund backed by the United Arab Emirates would be using President  Trump's digital coins to complete a $2 billion transaction. Through  this deal, President Trump and his family stand to gain hundreds of  millions…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…give you a crypto token that you can  use in international transactions.\n\nThen there was a transaction involving--I believe; I hope I still  have this right--the United Arab Emirates. They basically bought  several billion dollars of these coins. What happens then is that the  President can hold those dollars until the coins are redeemed and  benefit…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…the Senate to take up and pass S.  Res. 598.\n\nLast May, President Trump announced a deal to green-light several  billion dollars' worth of advanced AI chips to the United Arab  Emirates. The deal alarmed national security officials.\n\nWhy in the world was Donald Trump rolling back critical national  security safeguards in order to hand over sophisticated…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…foreign policy.\n\nThe Senate will take a vote in just a moment to deny the President  the ability to move forward with two arms sales--one to Qatar and one  to the United Arab Emirates.\n\nI believe that this Senate should join Republicans and Democrats  together in saying that any country that is willing to pay the  President personally, to enrich our…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…pin American warships in the Persian Gulf. Commanders put       American troops on high alert at military bases throughout       the region, including in the United Arab Emirates, Jordan and       Saudi Arabia. The United States has more than 40,000 troops       deployed in the Middle East.\n\nI met the father of an Apache helicopter pilot currently…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…not all. There is another type of Trump coin-- cryptocoin--that is inducing these corrupt practices. It is called a  stablecoin. And a company associated with the United Arab Emirates  said: You know, we are going to buy $2 billion of your coins. And guess  what. You get to keep the value of everything earned on that $2 billion  deposit.\n\nEven at 4 percent,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the FIGHT, FIGHT, FIGHT  meme coin. World Liberty Financial, on May 1--literally, this month-- World Liberty Financial announced an investment fund backed by the  United Arab Emirates. The government of that country, using Trump's  digital coins, is completing a $2 billion transaction that, once again,  puts money in his pocket. From this deal, Donald…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…and  every one of them was rejected, which brings me to a final point: Do  you know who really benefits from crypto? Corrupt politicians do.\n\nJust last week, the United Arab Emirates sent $2 billion to convicted  money launderer Changpeng Zhao, using coins issued by Donald Trump's  family. That is $2 billion in their bank account. The Trump family will…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…investment in  Binance, essentially giving Trump a cut of the deal. The firm is  chaired by someone who is referred to in the industry as the ``spy  sheikh'' of the United Arab Emirates and co-owned by G42, a firm with  extensive ties to the Chinese Government.\n\nI do not think that some of my colleagues fully comprehend the scale  of this corruption. Donald…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Concerning crypto industry data also shows that many investors in  World Liberty's crypto are based abroad in countries like Singapore,  South Korea, Hong Kong, and the United Arab Emirates. Because this  company was launched during Trump's campaign, it gave him an avenue to  possibly circumvent Federal laws that make it illegal for foreigners to  donate to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "James Risch", "party": "Republican", "sentence": "…amended, we are forwarding herewith Transmittal No. 25-25       concerning the Air Force's proposed Letter(s) of Offer and       Acceptance to the Government of the United Arab Emirates for       defense services estimated to cost $130 million. We will       issue a news release to notify the public of this proposed       sale upon delivery of this letter…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691103/arms-sales-notification"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…America competitive with the Chinese Communist Party.\n\nJust a few months later, President Trump announced a historic $1.4  trillion investment into our economy from the United Arab Emirates.  This investment will support American artificial intelligence  infrastructure. It will support semiconductors made in America. It will  support energy production from…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…States and allied naval and commercial ships, which have killed at  least 3 people. These terrorists have also targeted our friends in  Israel, Saudi Arabia, and the United Arab Emirates--mostly civilians,  for that matter.\n\nSo if the Democrats had their way, President Trump would not be able  to, for example, strike a secret meeting of senior Houthi leaders;…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}]