[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…increase due to its low costs and faster permitting       processes.\n\n``In addition to growth in established markets, solar is       set to surge in economies such as Saudi Arabia, Pakistan and       several Southeast Asian countries,'' Executive Director Fatih       Birol said. ``As renewables' role in electricity systems       rises in many countries,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…It may  be in trust. He maybe figured out some technical legal way to seem to  insulate or isolate himself from it. But that organization is doing  business deals with Saudi Arabia, with Qatar, and with Oman and Serbia.\n\nLIV Golf, backed by the Saudi Arabian Government, hosted a tournament  at Trump National Doral in April--April--of this year. The Trump…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…declaring Iran was no longer in compliance  with the Nuclear Nonproliferation Treaty, was that the regime may have  decided to do exactly that.\n\nI just returned from visiting Saudi Arabia, Bahrain, and the United  Arab Emirates with colleagues, both Democrat and Republican. All these  countries recognize that a nuclear-armed Iran poses an existential  threat…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…plane created by the dictator, the theocratic monster of Qatar, while  they are collecting billions of dollars. His son-in-law, Jared Kushner,  has gotten $2 billion from Saudi Arabia.\n\nThis is totally in violation of the Constitution. Article I, Section  9, Clause 8 says that nobody holding an office of trust under the  United States shall, without the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…billionaire friends, Trump  went further to undermine our national security by loosening President  Biden's export controls on advanced chip sales to build data centers in  Saudi Arabia and the UAE. He is auctioning off our chips to the highest  bidder without a care for the national security implications. Without  strong guardrails in place, this puts American…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the region his Secretary of State. Instead, he dispensed to  the region his business partners. Just before the President made his  first major foreign trip to the UAE, Saudi Arabia, and to Qatar, he  sent his son and their business partner--who, not coincidentally,  happens to be the son of Trump's Middle East Envoy--to the United Arab  Emirates.\n\nTheir…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…three decades,  she would shape readiness and emergency response both at home and  abroad through five major operational deployments, including missions  in Honduras, Saudi Arabia during Operation Desert Storm, Afghanistan  during Operation Enduring Freedom, Joint Task Force Panama, and the  Hungarian Stabilization Force. As a senior commander in the…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Persian Gulf. Commanders put       American troops on high alert at military bases throughout       the region, including in the United Arab Emirates, Jordan and       Saudi Arabia. The United States has more than 40,000 troops       deployed in the Middle East.\n\nI met the father of an Apache helicopter pilot currently deployed in  Syria yesterday.\n\nFinally,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…which provides advocacy,  support, education, services, and resources to veterans and their  families.\n\nIn 1982, Tim joined the U.S. Air Force, where he was deployed to  Saudi Arabia during Desert Storm. There, he was exposed to toxic burn  pits and oil well fires purposely set by Iraqi forces.\n\nThe Department of Defense estimates 3.5 million service members…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Kenneth Singleton has dedicated decades of service to our  community. From serving in the U.S. Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned him the Meritorious Service Award five times.\n\nFor Mr. Singleton, public service didn't end after the uniform came  off, though. His second…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…complete with Trump-branded beach side  villas and an 18-hole golf course.\n\nAnd it is not just Qatar. President Trump has also pursued new  business deals with the UAE, Saudi Arabia, Oman, and others, including  Serbia.\n\nOn May 1, Trump's cryptocurrency firm announced that an investment  fund backed by the United Arab Emirates would be using President…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…investors over the last 10 years.\n\nLet's be clear: If this budget passes, kids are going to go to bed  hungry so that we can give more money to Elon Musk and investors from  Saudi Arabia, China, and Russia. This is immoral. It is wrong.\n\nMadam Chair, I urge my colleagues to oppose this horrible budget  measure.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688058/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…United States,  with nearly $2.9 trillion annually in economic activity. The U.S. ranks  behind Spain and France in global competition for travel. China, India,  and Saudi Arabia are gaining on us. Our market share is 9.1 percent,  but we can generate 127 million new additional visitors over the next  decade and $478 billion in additional revenue, which…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…going to continue to live in fear?\n\nThere are things that we can do, things that we must do, and things  that I will be working here to make happen.\n\nWe must join Egypt, Saudi Arabia, the UAE, and Bahrain and declare  the Muslim Brotherhood and all of its affiliates the terrorist  organization that it is.\n\nWe must tackle the anti-Semitism that we have seen…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…quiet down all of their defense systems so we could  arrest them?\n\nWe had intelligence reports in our country that reported that, per  our intelligence, the leader of Saudi Arabia was guilty of or was  involved with killing an American journalist. What if a President  decided they wanted to arrest him? Can they do that without a  congressional vote or…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…SU-7/17, becoming the only wing commander to  record an aerial victory during Operation Desert Storm.\n\nHis life of service included two tours in Vietnam, one tour in Saudi  Arabia, and he logged over 5,000 hours of flight time. Rick earned the  rank of colonel in the United States Air Force.\n\nRick went on to lead another successful career as a financial…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…sheriff with the Dane County  Sheriff's Office in Wisconsin. He also served our country for 12 years  in the United States Army, a tenure which included a combat tour in  Saudi Arabia and Iraq with the 101st Airborne Division.\n\nHis military roles included criminal investigator, patrol supervisor,  SWAT/sniper team lead, SWAT/police sniper instructor, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Act, as       amended, we are forwarding herewith Transmittal No. 24-124,       concerning the Navy's proposed Letter(s) of Offer and       Acceptance to the Kingdom of Saudi Arabia for defense       articles and services estimated to cost $100 million. We will       issue a news release to notify the public of this proposed       sale upon delivery of…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…encouraging that Boeing Aircraft Company in Charleston is  doubling its size. It has already been announced that there was the  sale of $39 billion of 787-10 jets to Saudi, Arabia, as Saudi Arabia is  developing a new airline, Riyadh Airways, which we know will be  successful for our friends and allies of Saudi Arabia.\n\nIt is additionally encouraging,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…victim to the previous  administration's regulatory regime designed specifically to kill the  industry. Then, once he kills it, he goes overseas and asks countries  like Saudi Arabia and Venezuela to fill in the difference. These are  countries that cannot produce energy as cleanly as we can and do, and  yet he would rather get the energy from them to placate…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…attacks against the United  States and allied naval and commercial ships, which have killed at  least 3 people. These terrorists have also targeted our friends in  Israel, Saudi Arabia, and the United Arab Emirates--mostly civilians,  for that matter.\n\nSo if the Democrats had their way, President Trump would not be able  to, for example, strike a secret meeting…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Act, as amended,       we are forwarding herewith Transmittal No. 25-77, concerning       the Army's proposed Letter(s) of Offer and Acceptance to the       Kingdom of Saudi Arabia for defense articles and services       estimated to cost $500 million. We will issue a news release       to notify the public of this proposed sale upon delivery of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Falahi, Mohanad: AL TAGHIER TV; Al Falahi,       Sam: AL TAGHIER TV; Alfarone, Debra: GRAY TELEVISION;       Alhazeem, Ahmed: AL JAZEERA INTERNATIONAL ali, majeed: SKY       NEWS ARABIA; Ali, Ammar: NATIONAL PUBLIC RADIO (NPR); Ali,       Ayesha: ABC NEWS; Ali, Inshara: NBC NEWS; Aljasheme,       Mohaimen: C-SPAN; Al Juboori, Haitham: AL JAZEERA       INTERNATIONAL;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "James Risch", "party": "Republican", "sentence": "First of all, this couldn't come at a more inappropriate time. I  think my good friend knows that there is a very large delegation from  Saudi Arabia visiting Washington, DC, right now. They are a long, long- term ally of the United States going back almost 100 years. We have had  a long relationship with them.\n\nCertainly,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697011/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…about. It is all about religion.\n\nA fanatical string of Shi'ism is now in charge of Iran, and they have  three goals: to purify Islam--about 80 percent of Islam is Sunni; Saudi  Arabia is the center of that part of the religion--to purify Islam in  the image of the Ayatollah, to destroy the Jewish State, to drive us  out of the Mideast because we are infidels.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}]