[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…liquor licensing rules, helped create regulations for  recreational marijuana, and designed the licensing structure for pedal  cabs in the city. His work with the American Arbitration Association  has helped further its mission for more equitable and accessible  conflict resolution.\n\nTom also gives back to the legal community by serving as a guest  lecturer…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696277/recognizing-tom-downey"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the creation       of a public misconduct database, and required timely release       of body-worn camera footage following deaths or serious uses       of force. It closed arbitration loopholes that previously       reinstated officers fired for serious misconduct. In an 18-      month period, the District paid $5.6 million in back pay to       just ten…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…despite being previously       terminated for police misconduct or criminal conduct.       Specifically:\n\n1. H.R. 2096 would reinstate the ineffective, slow, and       costly arbitration process for handling cases where officers       are accused of crimes or police misconduct and face       termination of employment.\n\n2. H.R. 2096 would place a 90-day limit…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Secretary. Sec. 11. Reporting requirements; disclosure of information. Sec. 12. Closed Area stowage requirements. Sec. 13. Observers. Sec. 14. Technical assistance. Sec. 15. Arbitration. Sec. 16. Disposition of fees, penalties, forfeitures, and other moneys. Sec. 17. Additional agreements.       SEC. 2. AMENDMENT OF SOUTH PACIFIC TUNA ACT OF 1988.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}]