[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…constituents who call  the Massachusetts 7th Congressional District home and the more than 300  million followers worldwide, it is an honor to host the longest serving  Archbishop of Constantinople in the Church's history and a humbling  opportunity to say thank you for his efforts on behalf of the entire  human family. Since being elevated to primus inter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "Mr. KEATING. Mr. Speaker, I rise today in honor of His All-Holiness  Bartholomew, Archbishop of Constantinople and Ecumenical Patriarch, as  he visits the United States to receive the Templeton Prize.\n\nBorn Demetrios Arhondonis on the island of Imvros, known today as  Gokceada,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I rise to recognize and welcome His All- Holiness Ecumenical Patriarch Bartholomew, Archbishop of  Constantinople-New Rome and Ecumenical Patriarch, who visits the United  States this week to receive the prestigious Templeton Prize. As the  spiritual leader of 300 million Orthodox…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…Bartholomew to Washington, D.C.\n\nThe Ecumenical Patriarch is the spiritual leader of over 300 million  Orthodox Christians worldwide. Since 1991, he has served as the  Archbishop of Constantinople--New Rome and Ecumenical Patriarch, a role  that traces its lineage to the earliest days of Christianity. As the  ``first among equals'' among Orthodox Christian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today with great honor to welcome to  our Nation's Capital His All-Holiness Ecumenical Patriarch Bartholomew,  Archbishop of Constantinople-New Rome and Ecumenical Patriarch. He is  the Spiritual Head of the Orthodox Christian Church worldwide and  shepherd to over 300 million faithful. For Orthodox…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "Ms. KELLY of Illinois. Mr. Speaker, I include in the Record the  following proclamation recognizing Ecumenical Patriarch Bartholomew I,  Archbishop of Constantinople-New Rome.\n\nWhereas, on September 15, we will welcome His All-Holiness       Ecumenical Patriarch Bartholomew I, Archbishop of       Constantinople-New Rome to Washington,…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694760/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew-i-archbishop-of-constantinople-new-rome"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…to warmly  welcome the spiritual head of the Eastern Orthodox Church, His All- Holiness Ecumenical Patriarch Bartholomew, to Washington, D.C.\n\nThe longest-serving Archbishop of Constantinople in the history of  Christianity, the Ecumenical Patriarch will arrive in the United States  this month to receive the distinguished Templeton Prize. This  prestigious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Theological School of Halki and completed  graduate studies at three universities in Italy, Switzerland, and  Germany. He was elected in October 1991 as the 270th Archbishop of  Constantinople-New Rome, a Church of 300 million individuals worldwide,  including many of my constituents in New Jersey's 8th Congressional  District. He has devoted his life…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695648/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Bartholomew, is the spiritual leader of 300 million Orthodox Christians  worldwide, including thousands living in Western Pennsylvania. Since  his election as the 270th Archbishop of Constantinople-New Rome in  1991, His All-Holiness has continuously worked to promote religious  freedoms, human rights, and stronger environmental protections.\n\nThrough the tireless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695410/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, today, I rise to recognize Archbishop of  Constantinople-New Rome and Ecumenical Patriarch, His All-Holiness  Bartholomew.\n\nBorn Demetrios Arhondonis in 1940 on the island of Imvros (today,  Gokceada, Turkey), His All-Holiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "Ms. LEE of Pennsylvania. Mr. Speaker, I rise today to welcome His  All-Holiness Ecumenical Patriarch Bartholomew, Archbishop of  Constantinople-New Rome and spiritual leader of more than 300 million  Orthodox Christians worldwide, to Washington, D.C.\n\nThis week, His All-Holiness is visiting our Nation's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…island of Imvros was elected in October 1991 as the 270th  Archbishop of the 2000-year-old Church founded by the Apostle Andrew.  He holds the historic title of Archbishop of Constantinople-New Rome  and Ecumenical Patriarch, a position that dates back to the sixth  century. A citizen of Turkey, he studied in Imvros, Istanbul, Rome,  Switzerland, Munich,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "John Fetterman", "party": "Democrat", "sentence": "…welcome the Ecumenical  Patriarch of Constantinople, His All Holiness Bartholomew, to the  United States.\n\nEcumenical Patriarch Bartholomew is the longest serving Archbishop of  Constantinople in the two millennia history of Christianity. As the  highest spiritual authority for nearly 300 million Eastern Orthodox  Christians, he has cosponsored international…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697378/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "Ms. GOODLANDER. Mr. Speaker, I rise today to recognize the Ecumenical  Patriarch of Constantinople, His All-Holiness Bartholomew, the longest- serving Archbishop of Constantinople in the two-thousand-year history  of Christianity and the spiritual leader of a church of 300 million  people, including more than 4,800 Orthodox Christians living…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695371/recognizing-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…religion and  science. He joins a distinguished group of past recipients, including  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nAs the longest-serving Archbishop of Constantinople in over two  millennia, All-Holiness Ecumenical Patriarch Bartholomew embodies the  values of faith, service, and moral leadership. His life's work is a  testament…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…have justly placed him at the  forefront of global visionaries as an apostle of love, peace, and  reconciliation.\n\nWe are privileged to host the longest-serving Archbishop of  Constantinople in history here in our Nation's Capital, as he meets  with the President, Secretary of State, and Congress. His visit to the  United States serves as a testament…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Mr. Speaker, I would like to recognize and welcome to  Washington, His All-Holiness Bartholomew Archbishop of Constantinople- New Rome and Ecumenical Patriarch, the spiritual leader of Orthodox  Christianity worldwide. As the Archbishop of Constantinople-New Rome,  His All-Holiness serves…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…warm  welcome to His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of 300 million Orthodox Christians throughout the  world and the current Archbishop of Constantinople, serving in one of  the oldest sees in Christendom. This month, Patriarch Bartholomew will  visit Washington, D.C., where he will be recognized as this year's  recipient…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Speaker, I rise today to welcome to Washington,  D.C., His All-Holiness Ecumenical Patriarch Bartholomew, the spiritual  leader of Orthodox Christianity worldwide. As Archbishop of  Constantinople--New Rome, His All-Holiness is recognized as the ``first  among equals'' of Orthodox Primates and shepherds more than 300 million  faithful across the globe.\n\nSince…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…among Equals) of more  than 300 million Orthodox Christians worldwide. For decades. he has  been a tireless voice for religious freedom, and as the longest serving  Archbishop of Constantinople in two millennia of Christian history, he  stands as a symbol of faith and resolve. His visit comes as he receives  the distinguished Templeton Prize in New York,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…to our Nation's Capital. Ecumenical Patriarch Bartholomew has been on  the forefront of religious freedom for his entire ministry, and now as  the longest serving Archbishop of Constantinople in the two millennia  history of Christianity, he has worked to bring people together for the  purpose of advancing greater cooperation and mutual understanding.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695570/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, I rise today to extend a warm welcome to  His All-Holiness Bartholomew, Archbishop of Constantinople, New Rome,  and Ecumenical Patriarch, on the occasion of his official visit to the  United States. His All-Holiness is a respected spiritual leader whose  presence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695423/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…His All-Holiness Ecumenical Patriarch Bartholomew, the  Spiritual Head of the second-largest Christian Church in the world. His  All-Holiness serves as the current Archbishop of Constantinople and  leads over 300 million Orthodox Christians worldwide.\n\nHis All-Holiness is visiting Washington, DC, from September 15  through September 17 and will meet with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}]