[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…purpose is to promote all aspects of healthy growth and  development of individuals, families, and the community of African  descent in Akron, Summit County, and surrounding areas.\n\nFive years ago, the Akron Rites of Passage Institute introduced a  community initiative called the Legacy Building Project to support the  ongoing growth, development, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…want to participate in  agritourism.\n\nThese resources will attract private investment not only in  agritourism but also support tourism and hospitality industries in  rural areas, which will keep our farms and rural communities strong,  resilient, and thriving.\n\nI also plan to relaunch the bipartisan Agritourism Caucus with  Congressman David Rouzer…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…This bill also mandates in-person visits to register to vote,  disenfranchising potentially tens of thousands of deployed  servicemembers, as well as Native Americans in rural areas like  northern Arizona. This is a shocking act of voter suppression.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690056/opposing-legislative-voter-suppression"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…mom was waiting for her in  Minnesota.\n\nThese are just a few of the stories. As our local police have  repeatedly made clear in the cities and in the suburbs and in the rural  areas, ICE's actions have not made us safer. They have made us so much  less safe. They have taken taxpayer money--at some estimates, $18  million a week--and spent it on hotel rooms…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the--I call it the big, ugly bill, we  put millions of Americans at risk of losing their health insurance  through cuts to Medicaid. We saw a list of over 300 hospitals in rural  areas identified as being at risk of closing.\n\nDuring the August recess, I traveled all over Virginia not just to  talk to my constituents, but as one of only two members of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…to $1 trillion by FY 2026.\n\nFailing to address our mounting debt and deficits has severe  implications. It crowds out other critical spending in both defense and  non-defense areas; reduces fiscal flexibility especially in times of  crisis; contributes to inflationary pressures; slows economic growth;  increases pressure to raise interest rates; creates…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…an administration that is antiscience and antiprogress.\n\nJust as we have made investments in projects that are pivotal in  artificial intelligence, quantum, and other leading areas at NIH, NOAA,  NASA, the CDC, EPA, and, tragically, the National Science Foundation,  now is not the time that we stop investing in our future. This is what  the Trump administration…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…congregate meals.\n\nWorker protection agencies would likely furlough Federal staff who  are responsible for investigating wage theft and safety and health  hazards in high-risk areas.\n\nThat is just a small smattering of the impact of the failure to pass  these five bipartisan bills, where we had 341 ``yes'' votes in this  Chamber not 3 weeks ago.\n\nNow,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…narcotics trafficking in their community.\n\nThe police department said that the additional detective would build  trust with community members, increase patrols in hot spot areas,  enhance crime prevention, and sustain a reduction in violent crime in  narcotics-related crime. This is just one of the hundreds of rural  police departments and other agencies…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…about the farm bill. I regret that it wasn't  a bipartisan path through reconciliation for farm bill provisions, but  I am optimistic that we can work together in many other areas.\n\nWhile I wait to see what the gentleman has in store for us for farm  programs left behind, I, too, agree that rural development is  incredibly important, Mr. Speaker. I hope…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…health-harming emissions  and pollution.\n\nOne such Clean Air Act program, the Regional Haze Program, addresses  haze and visibility impairment in national parks and wilderness areas.  Unsurprisingly, coal plants are the Nation's most significant source of  haze. The same coal pollutants that drive severe health issues and  deaths nationwide, including…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…individuals who are ages 13 to 24 to  set and achieve personal goals at their own pace.\n\nIt encourages them to engage with their communities and strive for  excellence in all areas of life. By providing this recognition, we give  young people the motivation and push they need to realize their  potential, reminding them that they are the future of this…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698223/congressional-award-program-reauthorization-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…potential threats. However, its reliance on the annual Urban Area  Security Initiative, or UASI, designations creates uncertainty for  local governments, as the designated high-risk areas can change, and  they usually do.\n\nThis bill aims to improve the program's stability and strengthen  partnerships with at-risk cities by allowing the Countering Weapons of…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…should not  fund the Department of Homeland Security\n\nThis measure also funds 70 percent of our Federal Government, rather  than shut it down again. I will focus on just a few areas where this is  critical. Let's start with defense, half of our total budget.\n\nIt is a time when it is critical to our national security that our  Defense Department be fully…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…National Marine Sanctuary, current  law requires operators and installers of deep-sea fiber-optic cables to  obtain a permit from NOAA and pay fair market fees for use of these  areas.\n\nI and many others here today believe we need secure and reliable  telecommunications infrastructure. I understand that the 5-year time  limits on permits cause concern for…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and rugged trails.\n\nRestricting off-highway vehicles also disproportionately affects  disabled individuals, who often rely on ATVs or side-by-sides to gain  access to remote areas of our public lands. The State of Utah compared  the decision to limit off-highway vehicles while still allowing for  conventional vehicles as akin to designating parts of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Cape Fox parcels and  honor a promise made decades ago.\n\nThis bill also paves the way for a renewable energy corridor and  year-round access to vital subsistence and tourism areas. It enables  local development, supports energy independence, and strengthens  southeast Alaska's economy, all while respecting Tribal sovereignty and  the original intent…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698208/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Minister has  suggested that a larger U.S. military presence in Greenland--if that is  what we are looking for, let's talk about it.\n\nAnd we could pursue that as we pursue other areas of cooperation.  Whether it has to do with trade or tourism or the other economic ties  that bind, that is what we should be doing, but we are not doing it.\n\nInstead, at least…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…under LEOSA to carry concealed firearms in national parks,  certain Federal facilities that are open to the public, on public  transportation, in school zones, and in other areas.\n\nThe bill also reduces the frequency that qualified retired law  enforcement officers are required to meet certain qualification  standards.\n\nMany States allow State licensed…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Month.\n\nAs a former AG like myself, this is really important to me and my  State. I come down on the floor a lot to brag about the great State of  Alaska in so many different areas, but this is one area where I don't  like to brag about Alaska because there is not much to brag about. We  have some of the highest rates of domestic violence and sexual assault…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…mentors are       identified, evaluated, and approved to provide guidance and       advice to new or underperforming supervisors to--\n\n``(i) transfer knowledge and advice in areas such as       communication, critical thinking, responsibility,       flexibility, motivating and engaging employees, teamwork,       leadership, and professional development;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…strengthens coordination between Federal, State,  and local governments and the private sector to better safeguard public  gatherings, critical infrastructure, and high-density urban areas.\n\nI thank Congressman Troy Carter, who represents the community  devastated by the New Year's Day attack, for his partnership and  leadership on this effort.\n\nThis practical…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…in current day.\n\nBut Putin even echoes the likes of Adolf Hitler. Putin routinely  talks about ``liberating'' the Russian-speaking Ukrainians living in  the Donbas and other areas of Ukraine. This is the same vile, absurd  pretext that Adolf Hitler used when he invaded the German-speaking  regions of neighboring countries in Europe, including Poland.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…elaborate attempt to save face. Well, it  is not working, and, more importantly, Americans are suffering. I  repeat: Reopen the government, then let's have a conversation about the  areas in healthcare we can address to actually lower premium costs and  out-of-pocket costs for middle-income Americans.\n\nBy the way, the Democrats' current plan will only affect…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…to leave the negative behind us.\n\nThere are different therapies, group therapy, individual therapy,  there could be potentially in some cases, as we advance therapies in  new areas, and not taking a pill--here, take a pill for this. This will  make you feel better. If that pill doesn't make you feel better, take  two of these pills type of thing. We have…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…reflect a name change because the  SAVE Act explicitly directs States to establish a process for them to  register to vote, irrespective of those discrepancies.\n\nLike other areas of the law, citizens will be able to use  combinations of existing identification documents in order to register  to vote. I urge my colleagues to support this important legislation.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…services.\n\nWith the support from the Burleson Police Officers Association and  dedicated community stakeholders, this initiative has expanded,  reaching neighboring cities, rural areas, and locations across this  great country.\n\nI thank the City of Burleson Police Department. Their leadership and  innovation have created a vital lifeline, bringing safety…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…of the United States, in a manner that will ensure a fair and       reasonable participation of commercial vessels of the United       States in those cargoes by geographic areas.''.\n\nMr. EZELL.  2035.\n\nMr. Speaker, I rise in support of H.R. 2035, the American Cargo for  American Ships Act.\n\nThis measure focuses on strengthening the United States maritime…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of restrictions against accessory       dwelling units;\n\n(iv) increasing by-right uses, including duplex, triplex,       or quadplex buildings, across cities or metropolitan areas;\n\n(v) mechanisms, including proximity to transit, to       determine the appropriate scope for rezoning and ensure       development that does not disproportionately burden…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…amount of attention from the  philanthropic space where Michael and Susan Dell have announced a  commitment of over $6 billion that will help children ages 1 through 10  in areas that aren't as economically advantaged. That will help those  kids take advantage of this program and also create those accounts to  watch those grow over time. It is a game…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}]