[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…different than anywhere else in the country.\n\nCalifornia was granted these waivers because California, as a whole,  and Los Angeles, in particular--the southern California area, the Los  Angeles Basin--is uniquely situated to produce some of the most  dangerous air pollution in the Nation. So it means that we had to work  harder than other States and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…my colleagues: Mr. Stauber, for sharing his  story, for acting on behalf of his son and so many Americans with  disabilities; Ms. Simon for her passion and her work in this area; and  Mr. Alford and Mr. Pappas for their bipartisan work on improving  entrepreneurship and employment opportunities for people with  disabilities.\n\nEvery individual, no matter…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…with Trump  reentering office in 2025.\n\nAnd finally, in October 2017, Trump attacked NBC and other       networks by threatening to ``challenge their license.''\n\nThere was one area in which the Trump administration went       beyond threats to try to use the machinery of government to       punish critics. During his first week in office, President…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…the Apex Project, Nevada Land Transfer and  Authorization Act, directing the sale of 21,000 acres of Federal land  to Clark County for the establishment of the Apex Industrial Area.\n\nThis law permits only the Bureau of Land Management and Clark County  to issue utility and transportation rights-of-way.\n\nOriginally, Clark County had this authorization in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691122/apex-area-technical-corrections-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…hospitals that are also highly dependent or have a very high  percentage of Medicaid-dependent patients.\n\nWe are already seeing cuts in hundreds of employees in the Seattle  area because of these impending cuts to Medicaid. I want to just be  crystal clear; this is absolutely true. We are hearing this across the  board that when Medicaid gets cut, we…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…many American businesses are just like this. They are one or two  employees. They are somebody who even has another gig, maybe as an  artist, and they are moonlighting in some area where they can make just  enough to afford to buy health insurance on the exchange, if we don't  crush them with high premiums and if we don't make the paperwork  burdens so…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…and the  service of an extremely dedicated Member of Congress, Doug LaMalfa.\n\nI served northern California alongside Doug from the day that he was  sworn in to this body. His area was an area that I represented when I  was in the State senate. In Congress, we represented neighboring  regions of our State. We shared many of the same challenges and worked…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698743/9999"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…contributions to the Virginia  Association of Commonwealth's Attorneys.\n\nShe played a pivotal role in establishing a regional behavioral  health docket in the Fredericksburg area. This initiative helps connect  individuals with serious mental health illness and substance abuse  disorders to treatment and support through evidence-based practices and…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699136/constituent-of-the-week-alexandra-vakos"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…tariffs and other economic uncertainty. Even  Trump's fans sometimes grimace at his plans to remake the world  economy, worried about higher costs in a politically competitive area  still scattered with lawn signs that read: `Trump Low Prices Kamala  High Prices.' ''\n\nHe had these signs all over America, promising low prices.\n\n``Almost two-thirds of Americans…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…the door to unwanted       development.\n\nDiane from Taos writes:\n\nPlease vote to stop the plan to rescind the Roadless Rule.       I lead herb identification walks in the Taos area . . . so       many people come to this state to enjoy the beauty of       untrammeled forest. We need to . . . stop Trump and his abuse       of our public lands.\n\nHannah writes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…penalties greater       than those recommended by the board investigating the       allegations made against an officer. Stripping MPD management       of its authority in this area would greatly undermine both       MPD and public safety. A 2022 D.C. Auditor's report       catalogued cases where MPD was barred from firing officers       who had committed…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…administration. We can work on it in the next budget. We can make some  changes. I support permitting reform--all kinds of things that we could  do.\n\nBut these mass firings in the area of medical research? This makes no  sense.\n\nThe Department of Health and Human Services is also tasked with  implementing Medicare drug price negotiation, which I fought for…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…churches, and people are so frightened to death that they  carry their passports with them. They are American citizens, and they  are frightened.\n\nWhat have we proposed in this area? This is when we were doing the  appropriations bill: Prohibition on detaining or deporting U.S.  citizens, reducing funding for ICE, prohibition on the use of Border  Patrol…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…trust the Trump administration. It is as if Trump  doesn't control the CFPB.\n\nMr. Speaker, the regulation we are considering now is just a  regulation that says that this is an area we are going to look at.  Republicans are afraid the Trump administration will look at it. It  doesn't do anything except begin a process.\n\nMr. Speaker, as to both of these…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize the 50th  anniversary of the Conifer Area Chamber of Commerce.\n\nThe Conifer Area Chamber of Commerce is a crucial support system for  businesses and the community of Conifer, offering workshops on  marketing, managing…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694715/recognizing-the-conifer-area-chamber-of-commerce"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Record of       Decision was signed. As of that date, according to BLM, the       North Dakota RMP will guide management of BLM-managed public       lands in the planning area for the next 15 to 20 years for       the benefit of current and future generations. Therefore, the       North Dakota RMP has future effect.\n\nFinally, the North Dakota RMP…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…agencies, would have a central       voice in decisions about our homeland.\n\nFor decades, KIC has participated constructively in every       federal process affecting the 1002 Area. We have consistently       supported responsible, science-based resource development       because we live here, we understand this place better than       anyone, and our…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…chapter 8 of title 5, United States Code, of the rule submitted  by the Environmental Protection Agency relating to ``Review of Final  Rule Reclassification of Major Sources as Area Sources Under Section  112 of the Clean Air Act'', and ask for its immediate consideration in  the House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. WEBER of Texas.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…relating to terrorism threats to the       United States posed by the use of generative artificial       intelligence for terrorism that is gathered by State and       major urban area fusion centers and the National Network of       Fusion Centers, and incorporate such information, as       appropriate, into the Department of Homeland Security's own…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Texas Realtor association committees and three statewide  committees before retiring from active participation. During a hiatus  from real estate, he also served as a law firm area manager for eleven  years, overseeing operations across three West Texas counties.  Throughout his life, Tom has demonstrated a consistent dedication to  improving the communities…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…including North Tustin in my district.\n\nNorth Tustin has been a pillar of our Orange County community and a  census-designated place. However, its status as an unincorporated area  has caused confusion for the Postal Service and for tax purposes.\n\nFor example, North Tustin residents are subject to the city of Santa  Ana's sales tax, despite not being…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693903/single-unique-zip-codes-for-certain-communities"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…former chief of staff or  communications director for both Jerry Brown and, I think, Dianne  Feinstein used those very words in the aftermath of this indictment to  describe the area that he had worked for many, many years, a culture of  corruption. He referred to Governor Newsom's chief of staff who has now  been indicted as a ``Mafia boss.''\n\nSo I think…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…worked for NPR for over 20 years, decided  NPR had lost its way and asked a basic question: What is the political  affiliation of the editors for NPR in the Washington, D.C., area? Guess  what he found? Eighty-seven editors' political affiliation was 87  Democrats, zero Republicans--not 44-43, not 50-37, not 60-27. It was  87-0.\n\nThis bill simply says…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692525/rescissions-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…bit. It is actually some of the most humane  things we can do.\n\nI still remember the 30-plus immigrants who were basically killed in  the back of that truck in the San Antonio area. The only reason that  that type of thing happens is because the cartels don't care for human  life. The cartels that were running the border over the last 4 years do  not care…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with deep respect and  heartfelt appreciation to recognize the Orion Area Chamber of Commerce  on the occasion of its 75th anniversary. For three-quarters of a  century, the Chamber has played a vital role in advancing the economic  well-being of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692437/recognizing-the-75th-anniversary-of-the-orion-area-chamber-of-commerce"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Apex Area Technical       Corrections Act''.       SEC. 2. APEX PROJECT, NEVADA LAND TRANSFER AND AUTHORIZATION                     ACT OF 1989.\n\nThe Apex Project, Nevada Land Transfer…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…supervisory and leadership roles across  multiple Texas stations, including as OIC Postmaster.\n\nIn 2022, Mrs. Maddalena was appointed Manager of Consumer Affairs for  the Southern Area, Texas One. In this role, she excels at overseeing  customer policies, managing interactions with government offices,  analyzing surveys and CRM systems, while fostering cooperative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…demographically, if we  don't have an explosion of productivity, we can't make wages go up.\n\nIf you are a working person in this country today--particularly like  in my Phoenix-Scottsdale area, if you are a working person today and  you haven't had about a 28 percent pay hike in the last 4 years, you  are poorer today.\n\nIt is called inflation. The biggest tax in modern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…does good. Does it  do perfectly? No. Does it solve everything that everybody might think  of? No. Does it solve problems we have yet to think of? No.\n\nIt is a good start in an area where there is no guidance currently,  where the NCAA has lost control of our college athletics completely,  and where it is, in fact, a Wild Wild West where the vast majority…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…County  Sheriff's Emergency Operation Center, working as a dispatcher,  operations officer, reserve deputy, and canine deputy.\n\nIn 2005, Paul continued his calling at MEMA as an area coordinator,  serving for 11 years in that role. During that time, he and his wife,  Traci, whom he married in 1999, welcomed their son, Caleb, through  adoption in 2010 and…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697326/recognizing-paul-sheffield"}]