[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…this administration is  doing with ICE is not enforcement. It is lawlessness. It is cruelty.  They have turned ICE into a force of masked thugs. In my community in  the Houston area, people are paying the price.\n\nLuis Gustavo Nunez Caceres died in ICE custody near Houston. DHS  claims it was heart failure, but this administration has shown such  contempt…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699665/horrific-ice-abuses"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…penalties greater       than those recommended by the board investigating the       allegations made against an officer. Stripping MPD management       of its authority in this area would       greatly undermine both MPD and public safety. A 2022 D.C.       Auditor's report catalogued cases where MPD was barred from       firing officers who had committed…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…his way up to give his speech, and I  continued to stand silently, holding my signage. My signage was my  means of silently protesting.\n\nThere were other persons over in this area who were protesting, and  they were doing it peacefully. They had on signage. It was displayed on  a cap--that is what I saw on one person, a cap--and it had language on  it.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Metro Detroit has extended their animal  rescue, adoption, and education services over the past 27 years to  serve people and animals within and beyond the Detroit Metropolitan  Area. We extend our deepest gratitude to the staff and volunteers who  make the MaryAnn Wright Animal Adoption and Education Center work every  day.\n\nOur district and community recognize…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694353/recognizing-the-maryann-wright-animal-adoption-and-education-center"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…want to thank Captain Patton, the inaugural task force, the  National Guard, and the entire law enforcement and security partnership  which makes up the Washington Metropolitan Area's National Special  Security Event Executive Steering Committee.\n\nI also want to acknowledge JCCIC's important partnership with Mayor  Bowser's District of Columbia Presidential…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…plumbers, electricians,  and machinists so we can actually have a workforce that builds the new  factories we need.\n\nWe need to say that we are going to have housing in this area to have  economic revitalization. We need a national economic development  strategy, and Senator Rubio and I actually coauthored a bill on that.\n\nThat is not what the White…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…join the discussion about nuclear weapons and  ask what we could do to strengthen global nuclear security and maintain  U.S. leadership in trying to prevent nuclear war.\n\nOne area where we were always in violent agreement was to stop  wasting money on Star Wars, which was then rebranded as the SDI, the  Strategic Defense Initiative, and has now been rebranded…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…undercover employees in the various protest crowds, or at  the Capitol, on January 6. No FBI CHS [confidential human source] was  authorized to enter the Capitol or restricted area, or to otherwise  break the law on January 6.''\n\nI am under no illusion. I know this speech is not going to talk any  of those conspiracy theorists out of their deep-seated…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Gold and Silver Rays, for 35 years of supporting the U.S.- Japanese relationship.\n\nThroughout her career, Makiko served more than 90,000 Japanese  nationals in the Los Angeles area, and she played a large role in the  Consulate's emergency response to the 1994 Northridge earthquake and  again during the attacks of 9/11 on our country.\n\nI thank my good…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690737/recognizing-makiko-shirai"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…longstanding commitment to helping support women  and families through policy.\n\nAfter working as a policy analyst for the Louisiana Budget Project,  Alison returned to the D.C. area and began working as a Legislative  Assistant for Congresswoman Elaine Luria (D-VA). In 2023, I was lucky  to have her join my Washington, D.C. Office as a Legislative Assistant.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Madam President, I can make it fast or slow.\n\nI am joining all of my colleagues to advocate for this bill.\n\nOne-third of the Virginia population is a resident of the DC metro  area and enjoys this Capital, and 150,000 Virginians come to work in DC  every day. They want DC police and services to be well funded. Please  support this bill. Thank you.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688852/district-of-columbia-local-funds-act-2025"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…sweeping away homes, debris, and people. The flooding claimed the lives  of three people already, including two children. Rescue missions are  currently underway. The same area was also ravaged by a wildfire just  last year. Our first responders are working around the clock to protect  their neighbors and ensure help arrives when every second counts.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the Village of  Larchmont, the Village of Mamaroneck, and the town of Mamaroneck,  providing a complete menu of services and programs for those 60-plus  years of age in our area.\n\nI congratulate them on 15 great years. The best is yet to come.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691311/recognizing-at-home-on-the-sound"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…say ``redundantly'' because the Trump administration has already  overturned this management plan. The Republicans in Congress have  already  passed legislation requiring this area--a national wildlife refuge-- requiring it to be drilled for oil, despite a complete lack of interest  by legitimate industry players.\n\nNow, we could be discussing ways to lower…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…of H.R. 1612, the Flatside Wilderness  Additions Act, introduced by my colleague from Arkansas (Mr. Hill).\n\nThis bill would expand the boundaries of the Flatside Wilderness Area  in the Ouachita National Forest by approximately 2,212 acres and  redesignate the area as the Flatside-Bethune Wilderness.\n\nRepresentative Bethune represented Arkansas here…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Record of       Decision was signed. As of that date, according to BLM, the       North Dakota RMP will guide management of BLM-managed public       lands in the planning area for the next 15 to 20 years for       the benefit of current and future generations. Therefore, the       North Dakota RMP has future effect.\n\nFinally, the North Dakota RMP…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…WORK.\n\n``(a) Site.--Notwithstanding section 8908(c) of title 40,       United States Code, and subject to subsection (b), the Adams       Memorial shall be located within the area generally depicted       as `Adams Memorial: Eligible Additional Area' on the map       titled `Adams Memorial: Eligible Additional Area' prepared by       the Adams Memorial…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…He is a reminder that the success of our school  depends not just on what happens in the classroom but on the selfless  dedication of those who support our students in every area of their  lives.                         Congratulating Brock Nelson\n\nMrs. FISCHBACH. Mr. Speaker, I rise today to congratulate Brock  Nelson from Warroad, Minnesota, on his…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…was in North Tulsa. That  community was burned to the ground and destroyed in a race massacre. It  is a scar on our Nation's history and on my State's history, but it is  an area that we remember for a reason because we know how far we have  come.\n\nThe community in North Tulsa and Greenwood--they are turning tragedy  into triumph. They are starting new…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691673/historic-greenwood-district-black-wall-street-national-monument-establishment-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…patrons of the bill, the same is fairly much true in the State of  Kentucky.\n\nMr. Speaker, if you use a draft or a check, and I know not a lot of  people do that, but in the rural area I represent, they are still used  frequently particularly by my senior citizens. Mr. Speaker, if you use  a draft or a check to pay a merchant for something and that check comes…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…chapter 8 of title 5, United States Code, of the rule submitted  by the Environmental Protection Agency relating to ``Review of Final  Rule Reclassification of Major Sources as Area Sources Under Section  112 of the Clean Air Act'', and ask for its immediate consideration in  the House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. WEBER of Texas.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…a fellow, liaison, counsel, or       administrative staff for the Coast Guard Office of       Congressional and Governmental Affairs or as any Coast Guard       district or area governmental affairs officer.\n\n``(2) Course subject matter.--\n\n``(A) In general.--The training course required under this       section shall provide an overview and introduction…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Health First Hospital, Gator  Automotive, Frog Bones-Family Shooting Center, Z88.3FM, All Digital All  Day, Grifols Plasma Distribution Center, Toys for Tots North and South  Area, Al Dia Today Newspaper, Martin's Famous Potato Rolls, and  Premiere Oaks 10 Cinema, the mission of this event is simple but  powerful: to create a welcoming place where families…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…managed Lawson's Grocery, Stan Lawson's  Palace, and multiple residential and commercial real estate  enterprises. In 2006, he became the President of the Greater Harrisburg  Area NAACP, where he served for over 10 years. In 2009, he was ordained  as a Deacon at the First Spirit Filled Missionary Baptist Church.\n\nOver the course of his life, Stan earned…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…II authorized by section 702 of division DD of the       Consolidated Appropriations Act, 2023 (40 U.S.C. 8903 note;       Public Law 117-328), may be located within--\n\n(1) Area I, as depicted on the map entitled ``Commemorative       Areas Washington, DC and Environs'', numbered 869/86501 B,       and dated June 24, 2003; or\n\n(2) the Reserve.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697726/world-war-ii-womens-memorial-location-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…there was pretty much flat population growth.\n\nThen there is this. I'm trying to help folks understand the reality  of what your Federal Government is.\n\nDo you see the blue area? This is defense and nondefense. In a couple  of days, we are actually going to get an update, and my team actually  thinks that this number will go from 26 percent of being,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I rise to congratulate Mechatronics Team  3133, the Alexandria Area High School's robotics team, on winning the  Impact Award.\n\nThis prestigious award will send the team to the world championship  in Houston, Texas. This is their third Impact…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689758/congratulating-alexandria-high-school-robotics-team"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 972) to amend the Sloan Canyon National Conservation Area  Act to adjust the boundary of the Sloan Canyon National Conservation  Area, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Amusement Park in New Jersey'' and  the ``Number One Amusement Park in New Jersey.''\n\nThe Land of Make Believe has provided lasting entertainment and fun  in the Northern New Jersey area for over seven decades. Since its  founding in 1954 by Herman Maier, the park has remained family-owned  and operated, with the Maier family upholding the same high standards…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694756/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…22 years of service to the City  of Carver and surrounding areas.\n\nFounded in the late 1800's, the Carver Fire Department provides fire  safety and prevention services to an area of 32 square miles, including  the City of Carver and Dahlgren and San Francisco townships, and  employs 32 paid on-call firefighters who respond to nearly 300 calls  per year.…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}]