[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…about  requiring that the price of goods should include the cost of producing  and disposing of them without damage to the environment.\n\nHe went on:\n\nNow, I realize that the argument is often made that there       is a fundamental contradiction between economic growth and       the quality of life, so that to have one we must forsake the       other.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…at the top are not honorable people. That has an  impact on morale. Don't you think for one second that someone in the  military will not at some point in time use the same argument that you  are using. They are going to mention how this very incident occurred  and how people just walked away from it unscathed. That is what they  will do. People are not…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…first time, I think, in possibly my lifetime--send  troops without a request from the Governor into a State because people  were protesting.\n\nAnd, sure, some could make an argument that maybe a few protesters  got over somebody's perceived line, but they were largely peaceful  protests.\n\nWhat the President did is beyond his authority. It is illegal.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…role in dismissing the case against  Eric Adams, the mayor of New York. I am not going to go through all the  details except to say that Danielle Sassoon refused to make the  argument in favor of dismissing those charges in exchange for  concessions on immigration policy. She said it was ``an improper offer  of immigration enforcement assistance in exchange…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…of the House.  He was quoted yesterday saying: ``Many respected constitutional experts  argue that the War Powers Act is itself unconstitutional.\n\n``I'm persuaded by that argument. They think it's a violation of the  Article II Powers of the Commander in Chief. I think that's right.''\n\nThat is the leader of Congress saying that Article I, Section 8…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…boundary; and you are knocking out the neutral police  officer who is supposed to keep us living by the rules. This does not  end well.\n\nBy the way, I have heard it said that the argument from the other  side is going to be they are not overruling the Parliamentarian; they  are overruling the Government Accountability Office. Well, if that is  what they wanted…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…particular weapons from the definition of firearm under  Federal law, and as a result, the various protections and safeguards  that exist under Federal law. They can make the argument that in  certain States there may be protections. That is not true of every  State.\n\nIn any event, the larger question that every American who is watching  C-SPAN now ought…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Mr. Speaker, this argument is about universal access. For years, the  Republican leadership in this institution has attempted to avert this  very moment. For us this is not to be about spiking the football.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…I am saying is--this is, obviously, a fait accompli--I just don't  want my colleague to walk away thinking this is some kind of stunt.  This is my attempt to take away an argument for us to do the work on  Thursday. Clearly, it has been objected to. I am going to go back and  try my hardest on Thursday to do something more.\n\nThe one prediction--I don't…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Korea to work closer with the United States. But the  Trump tariffs are chasing allies into the arms of adversaries. How  foolish is that?\n\nAnd then we end up with the chaos argument that my colleagues had  mentioned before. From the New York Times last week: ``With Only Bad  Options, Businesses Scramble for a Tariff Chaos Playbook.''\n\nA tariff chaos playbook.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…reality of what this tax bill is about.\n\nWe could also say in the next breath, if you made a million dollars  last year, you are going to get $96,000. This is a fact-free argument.  They are making this argument that the person at the bottom is going to  do well in contrast to the person at the top. There is simply no  factual basis to that.\n\nBy the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…or lose them'' alert. Given the long record of       false alarms, such hypervigilance is a possible tripwire for       an accidental apocalypse.\n\n``Getting trapped in an argument about the cheapest way to       keep ICBMs operational in their silos is ultimately no-win,''       Daniel Ellsberg and I wrote for The Nation in autumn 2021. We       added:…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…had 79 percent of his amendments blocked.\n\nI could go right down the list. These are all Republicans who just  routinely get blocked.\n\nEnough. Enough. This is a ridiculous argument. The bottom line is a  lot of words to justify the most closed Congress in history.\n\nLeger Fernandez).\n\nMs. LEGER FERNANDEZ. Mr. Speaker, I rise today to speak up against…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…everybody that the budget bill  that the gentlewoman and the sponsor of this amendment voted for added  $4 trillion to the debt. Why don't we start there?\n\nThere is a basic argument here: Why does the U.S. engage in foreign  aid? There are four real arguments for that.\n\nNumber one, economics: Again, we are the most economically powerful  nation in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…Hamas  used it to fund their October 7 attack. Fentanyl traffickers use it to  get paid. All, 100 percent, of ransomware attacks get paid in crypto.\n\nThat is a really good argument for legislation, and if the crypto  industry did not want to hang out with criminals, then they would have  welcomed good legislation. These bills are not that.\n\nThe CLARITY…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…American people have had enough, which is why we are in the new  age of the golden age.\n\nMr. Speaker, I thank the gentlewoman for allowing me to speak and for  putting this argument up.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…supporting the Pregnant Students' Rights Act and stand up for the  dignity, opportunity, and educational success of every student.\n\nMr. Speaker, I just have to go back to the same argument that we had  in committee.\n\nWe don't prohibit schools from giving a full panoply of information.  Our concern is that they haven't been.\n\nPregnant students have been left…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…DOJ's recent brief in a lawsuit involving NFA  registration defends the draconian NFA firearm registration and ignores  congressional intent.\n\nFirst and foremost, the legal argument to defend and keep the NFA  registration simply isn't there, plain and simple. When the One Big  Beautiful Bill Act eliminated the tax on a broad class of firearms  regulated…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…and you try to  undercut what I am doing, then you can meet the same fate as Maduro.\n\nMaduro was an indicted drug guy. He had indictments for being a drug  trafficker. The argument is that this operation was to enforce the  warrant. It was more of a law enforcement activity because he was the  President of the country--not legitimate, by the way, and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…and  National Guard lands cannot be arbitrarily designated as critical  habitat if the Department of War deems them essential for national  defense.\n\nI want to take the same argument that was used on the last bill when  Mr. Cisneros of California said, good grief, our adversaries don't care  about this question of censorship. I am telling you, Madam Chair,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…whether Congress needs to act either by  statute or constitutional amendment.\n\nTo call this a constitutional crisis is the kind of absurd and  juvenile hyperbole that passes for argument these days by the woke  left. I look forward to returning to a society someday when we can have  civil discussions over high principles as our Founders envisioned.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…budget by 20 percent. Nowhere in the Constitution does it  stipulate the amount of money that should be put----\n\nMr. ROY. Mr. Chair, at some point we might be able to get an argument  out in some sort of fashion where the American people can see it. I  would appreciate being able to engage somebody on the House floor.\n\nMr. Chair, the fact of the matter…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699058/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Service. We would simply go back  to the rule that was in place that was working fine before the Biden  administration came in and put this onerous rule in place.\n\nAlso, the argument has been made that only 24 out of 388 miles have  been restricted to off-road vehicle use, but as we all know, roads are  networks. For instance, there is a half-mile section…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Committee last night.\n\nLet me be crystal clear. I encourage all Members to support the rule  before us today. My comments last night were lacking in context.  Democrats made the argument throughout the hearing that this process is  somehow another vote on H.R. 1. That is false.\n\nThe resolution today makes purely technical changes to protect the  privilege…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…morality of  learning to get up, building an attachment, learning skills, and moving  up in an organization.\n\nThere was a time when it was actually the left's ethos, that the  argument of work is moral. Somehow that left the Democratic Party.\n\nLet's walk through a couple things. I have used this board for months  now. It will probably be the last time I…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…officers.\n\nMr. SCHMIDT. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. SCHMIDT. Mr. Speaker, I thank the distinguished ranking member  for his argument and advocacy today.\n\nI would just point out to the body that while my distinguished  colleague speaks with his usual passion on many subjects, the only  subject before us…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…economics. As the cost of inputs in doing  business increases, a restaurant's or grocer's prices also must  increase to make enough of a profit to stay in business.\n\nThe other argument you can make is that if you buy this, you are  going to be more efficient. The other side has said that then you can  make more profit. If that is the case, believe me, our…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "John Thune", "party": "Republican", "sentence": "…I am offering here would clarify, in the form of a  resolution, that it would apply to the Senate.\n\nBy the way, this only applies to the Senate. Frankly, there is a good  argument that, if I am a Member of the House of Representatives, I  would want the same protections included here. That wasn't the case.  When we drafted this, it was in response to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…too many. Keeping  the withdrawal revocations for Alaska native Vietnam-era veterans and  adding new withdrawal revocations would be entirely consistent with the  CRA. The argument is ironic coming from my colleagues on the other side  of the aisle as Secretary Haaland unnecessarily delayed the  implementation of this program for years, despite strong…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…don't want people deported because they are importing a voter  base that they think will give them power. They are not even hiding  behind this anymore. They have lost the argument with American  citizens, and they think that if they flood this country with illegal  immigrants--and by the way, you shouldn't have to prove you are an  American citizen…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}]