[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…been responsible for providing free pro bono work in support of  disenfranchised communities for decades.\n\nMr. Speaker, Trump is doing this to stop them from successfully  arguing against his executive orders and the harms and effects they may  have on America.\n\nIn addition, many of our colleagues across the aisle have introduced  at least seven bills…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the stability of that region,'' Sahad       said. ``If Libya is stable, then there are big advantages for       Northern Africa, for Africa.''\n\nAlftise reiterated this point, arguing that, while the       Government of National Unity has so far been able to keep the       threat of Islamist militant resurgence in the west at bay,       the lack of control…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…praise nuclear       systems with components produced in their state or district.\n\nEven well-informed and dedicated advocates of halting the       arms race are often reduced to arguing for fiscal       responsibility. Within the narrow confines of regular       ``national security'' debates, the wisest lobbying tactic       appears to be a focus on exorbitant…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…of this important bureau.\n\nMr. Speaker, after one of Trump's latest crackdowns on scientific  research at universities, Harvard filed a lawsuit against the  administration, arguing that its freezing of research funding is  unconstitutional and flatly unlawful.\n\nThough undocumented families and small businesses were explicitly  encouraged for decades…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…That is why House Republicans want to talk about something else. That  is why we are here to debate and vote on this rule.\n\nMr. Speaker, my colleagues across the aisle are arguing that the rule  is duplicative and that the offshore drilling industry is already doing  these surveys.\n\nMr. Speaker, that is kind of the point. The fact that these surveys…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…penalties.\n\nMr. PALLONE. Mr. Speaker, I continue to reserve the balance of my  time.\n\nMr. Speaker, I listened to what the chairman of our Health  Subcommittee said, and I am not arguing with him that we have to look  at the fentanyl crisis in many ways, particularly at the border, and  prevent it from coming into the country from China and other places  that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…by: We can't be bothered with that. That is not where our  priorities are.\n\nMaybe they don't write big enough checks for their campaigns.\n\nThe bottom line is that we are here arguing that people in this  country shouldn't lose their healthcare because they can't afford it.  We could do something right this instant to fix that. Republicans are  blocking…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…pardons  continues to grow.\n\nTwo weeks ago, a Justice Department prosecutor struggled in court to  explain the administration's view of the scope of Trump's mass pardons,  arguing that the relief should apply to separate criminal conduct  committed by Capitol rioter Dan Wilson, in Kentucky in 2023.\n\nU.S. District Judge Dabney L. Friedrich, a Trump appointee,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…such military action is justified  because he himself, in his ultimate wisdom, has deemed these civilians  to be criminals, which leaves us to ask: What is to stop him from  arguing that anyone he dislikes deserves the same treatment? What is to  stop him from naming any of his enemies as a terrorist, then  unilaterally deciding to use the military to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Republicans--House and Senate--signed into  law. They are illegally blocking authorized funds from being  distributed.\n\nEven now, as we debate this bill, the Trump administration is arguing  to the Supreme Court that they should be allowed to withhold food stamp  funding that Congress lawfully approved. They were ordered by three  separate courts to distribute…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…hard it is for  everyday families in the Presiding Officer's State and mine and in the  ranking member's State to pay the bills because inflation has been  here. Instead of arguing about who is at fault for that, let's solve  the problem, not aggravate the problem. And these tariffs aggravate the  problem. There is absolutely no denying that. This is…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…without having a  clear, legal basis to continue.\n\nThey first recognized the legal parameters of the War Powers  Resolution back in September, but now the administration is arguing  that they are not bound by this law. They have changed their tune and  are contradicting their own arguments in order to get around the law.\n\nOf course, that won't stop them…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…through a  California sanctuary would cost these huge tech companies between $2.8  million and $7 million per year.\n\nTo put that in perspective, in the time that we have been arguing,  these companies have made more than that. This is pocket change to  these companies. They can afford to pay fair market value in order to  go through our national marine…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…is why the privileged motion is available to  even a single Senator. The privileged motions--and there are many  different kinds of privileged motions. In fact, we will be arguing  about another one later tonight dealing with Presidential war powers.  All privileged motions kind of fit into the ZIP Code of enabling a  Senator to challenge potential…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…withdrawal of the       Reporting Requirements cannot be a rule subject to CRA's       submission requirements, NCUA cites to National Fair Housing       Alliance v. Carson, arguing that information collections       subject to the PRA are distinct from rules under APA. There,       the U.S. Department of Housing and Urban Development (HUD)       promulgated…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…did the Biden administration's rule only  apply to oil and gas operations? Why didn't this rule apply to offshore  wind development?\n\nThis was politically driven. I am not arguing we need these  additional necessary requirements for offshore wind. I am just pointing  out the blatant hypocrisy of the past administration. It is clear where  their intentions…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…remains precarious, and American servicemembers  remain in danger. Many advocates for war, giving voice to their real  feelings, have loudly opposed the current cease-fire. Those arguing  against a cease-fire give a callous testimony, insensitive to the  cruelties of war.\n\nSome 40,000 U.S. troops are scattered throughout the Middle East as  we speak--some…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…become pegged to the U.S. dollar and  backed by high-quality liquid assets.\n\nMr. Speaker, in stark contrast to what my friend, the gentleman from  Illinois (Mr. Casten), was arguing, this actually prevents these other  so-called stablecoins from actually thriving in the marketplace.\n\nYou are going to have stablecoins that actually are stable. That is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…is actually an untenable position of Democrats to come  before  this body and say: Oh, we want to give subsidies to people who make  $225,000 a year. That is what they are arguing for. The ObamaCare  subsidies are not the basic subsidies. These are add-on subsidies that  started 2 years ago. If you make $100,000 a year, the Democrats want to  give you…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the Joint  Economic Committee. Go to the website, Joint Economic Committee  Republicans, and you will see our methodology and where the math is.\n\nWe are back to, once again, arguing: Is this how you want your  taxpayer dollars to disappear? We want our brothers and sisters to have  the most affordable healthcare possible in America, but to do it, do…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…President, and so  dedicated to this country that following his administration, he  returned to the Halls of this very building to continue his service as  a Member of Congress, arguing adamantly for the abolition of slavery.\n\nThis memorial will educate generations to come about this historic  family's role in our Nation's founding and inspire all Americans…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697630/adams-memorial-great-american-heroes-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…unless they are my kids, my friends, or my family.\n\nThat is Nicolas Maduro's hand right there. I will put a little arrow  there. That is Ranking Member Meeks, who has been arguing with me for  the last little while, right here. That is his arm around the ranking  member. I don't let people put their arms around me, especially not  people like that.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…manufacturer of water heaters to benefit their  competitors.\n\nMadam Speaker, our colleagues on the other side of the aisle have  spent an enormous amount of time in the past few weeks arguing that my  Democratic colleagues are the party of blue-collar American workers. In  the spirit of bipartisanship, I encourage my Democratic colleagues to  join me in support…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…nutrition needs to go back to the center of our healthcare.  Eating healthy food should be at the center of our healthcare reforms,  not necessarily all these policies that we are arguing about.\n\nYes, we can keep throwing money at it. Yes, we can start giving our  youth the latest GLP-1 drug. And rather than giving them a healthy  diet, we can start treating…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…family in tax hikes. For the country, it is $2,850.\n\nThat is the tax hike that is already in the law. That is already what  is coming at us. That is what the Democrats have been arguing, saying  we shouldn't extend these tax cuts, and then they give these beautiful  speeches about defending the working class.\n\nThis is coming to us. This is part of the battle.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…just read the headlines or read certain propaganda  to carry the day on their false allegations about this just helping the  rich people. Or one of my favorite is they were arguing during the  budget vote-arama, as it was called, that this was going to affect  Social Security.\n\nThey know and we know that the law prevents Social Security from  being even…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…house wired? Do you think the dentist  could vote by proxy to get the teeth fixed and fillings filled?\n\nIt is a joke. With all the problems this country has, here we are,  arguing over proxy voting.\n\nYou brought up the Speaker voting by proxy. I voted by proxy. Speaker  Pelosi put it in order a few times, and no one agrees with this.\n\nThe hardworking…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…only back to our American  Revolution, it goes back to the English civil war as well.\n\nIt goes back to probably Magna Carta. I mean, for hundreds of years  the English were arguing of the supremacy of Parliament, that  Parliament would be able to have the power over the King. So when we  were leading up to the Revolution, the cry from James Otis was,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…original design, in 2005, the Medicare part C was supposed  to come in at 95 percent.\n\nI know it is geeky, but this is a stunning amount of money. We will  spend hours here arguing about millions of dollars. These are billions  and billions, and over 10 years, it is in the trillions.\n\nWhy is it so hard for this place to want to take on the things that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…lawlessness, and this body should recognize it as such.\n\nIn 2024, my good friend, Sheriff Joe Roybal of El Paso County, and  other county leaders filed a lawsuit against the State arguing that  these laws are unconstitutional and that they hamper public safety.\n\nContrast that with cities like Denver, which have exacerbated their  housing crisis, and they continue…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}]