[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to  servicemembers' and military families' quality of life.\n\nInstead of focusing on how to keep the American people safe and  improve the quality of life for members of our Armed Forces, House  Republicans' bill undermines readiness and abandons our allies.\n\nI cannot support this bill, and I urge my colleagues to vote ``no.''", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…false charges filed against them simply for performing oversight.\n\nCitizens should not be shot at simply for raising concerns about the  safety of children in the presence of armed men in their neighborhoods.\n\nThis approach doesn't make us safer. It disrupts local economies,  increases costs for taxpayers, and undermines the workforce that keeps  our…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…how Xi Jinping  acts. That is not how America acts. I know there are Republicans on  this committee who are concerned about how Hegseth has acted. We need  Hegseth before the Armed Services Committee, answering to the American  people.\n\nShame on him for throwing an admiral under the bus. The admiral has  far more honor than Pete Hegseth has. We need him…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697796/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…to tens of  thousands of Haitian families facing a gang-fueled humanitarian crisis  that gets worse by the day.\n\nThe dire conditions on the ground in Haiti, driven by brutal, armed  gangs, cannot be understated, and 1.4 million Haitians, over 10 percent  of the country's population, are internally displaced. One-half of the  country's population experiences…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698851/haiti-economic-lift-program-extension-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…sky. They were so brave. They fought not only against the  forces of fascism abroad but, again, the deep-seated racism at home,  paving the way for the desegregation of the Armed Forces with the  leadership from Ohio, setting a precedent for generations to come.\n\nRight in my district of Toledo, the legacy of the Tuskegee Airmen  lives on. The area around…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Mr. Chair, I rise in strong opposition to this bill.\n\nI was very proud of the markup that passed out of the Armed Services  Committee. The bill that we delivered to this floor this week was  overwhelmingly bipartisan. It supported our men and women in uniform  and strengthened our national…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…country.\n\nThe new sales tax is also a drag on economic growth--we saw this in  the announcement this morning--but not just economic growth in the  United States. I am on the Armed Services Committee, and I had a chance  to go visit 2 weeks ago with the new government, incoming government in  Germany.\n\nGermany is a great ally. More U.S. troops are on…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…discipline, and the  safety of our  servicemembers. Our men and women in uniform deserve better, and  Secretary Hegseth needs to do the right thing to restore the confidence  of the Armed Forces, the American people, and our allies. Pete Hegseth  must go, and Congress must investigate to fulfill its constitutional  responsibilities.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689155/pete-hegseth-must-go"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…created to  support the next generation of veteran trailblazers. She was  instrumental in the creation of the original GI Bill and advocated for  a greater role for women in the Armed Forces.\n\nCongress created the Edith Nourse Rogers STEM Scholarship in 2017 as  part of the Forever GI Bill. However, since creation, we have learned  of cases where improvements…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695428/edith-nourse-rogers-stem-scholarship-opportunity-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…ensure we are exhausting every  possible resource we can to ensure that those who have signed up to  risk their lives for this country can find employment when they leave  the armed services.\n\nIt will be helpful for veterans to know about additional job  opportunities at ports, railroads, and trucking companies. Many of  these jobs are solid, middle-class,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695017/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and is characterized by       the displacement of their country of origin. This situation       is the result of a legacy of Colonialism and an interaction       of internal armed conflicts, institutional collapse, natural       disasters and extreme socioeconomic conditions, which has       forced them to emigrate not only to the United States of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…they have earned  through their service.\n\nThis bill also provides necessary funding for the American Battle  Monuments Commission, the U.S. Court of Veterans Appeals, and the Armed  Forces Retirement Homes, as well as Arlington National Cemetery.\n\nAs ranking member of the subcommittee, I was pleased to work closely  with Chairman Boozman to build a strong…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…report on January 29th. As  the Ranking Member of the Aviation Subcommittee, I'm proud to join them  as an original cosponsor of the ALERT Act, with our colleagues from the  Armed Services Committee, Chairman Mike Rogers and Ranking Member Adam  Smith, and many other colleagues.\n\nMr. Speaker, the House needs to follow regular order. Today's bill  was…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700106/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…bill provides even for a potential life sentence in Federal  prison for merely entering the country unlawfully with no other  criminal conduct required. There are obviously armed robbers and  rapists and even murderers who have done less time than that.\n\nObviously, we don't want these people entering the country illegally.  That is why the solution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Department of  Defense and authorizes our common defense. It is deeply unfortunate  that Congress considers this year's NDAA amongst a steady stream of  alarming misuses of the U.S. Armed Forces by President Trump. While in  office, the President has issued unlawful orders, directed unlawful  deployments, and has unlawfully misused Congressionally appropriated…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Senator  John Cornyn and quickly earned a reputation for being a hard worker who  was quick on his feet. He went on to serve as a Military Legislative  Correspondent for Senate Armed Services Committee Chairman Jim Inhofe,  where he developed a deep understanding of defense policy and America's  military.\n\nThis expertise became critical when he joined my…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…This resolution deals with escalation.\n\nThat is not what it does. It is six lines, and two of them say this:  ``Congress hereby directs the President to remove United States Armed  Forces from Venezuela . . . ''\n\nThere aren't any there.\n\nThey proposed to have us vote on something that is irrelevant because  the action they want to stop is not taking…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Authority............................................         185.761         967.912       1,987.937     Outlays.....................................................         177.349         926.669       1,876.969 Armed Services     Budget Authority............................................         289.771       1,117.079       2,102.064     Outlays.....................................................…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…recognize those who have  served and continue to serve this great country, I ask my colleagues to  join me in honoring Chobani's military appreciation efforts. God bless  our Armed Forces.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…the world, including to the  Persian Gulf and multiple international ports. She departed the Navy in  1997. During her service she earned the National Defense Service Medal,  Armed Forces Expeditionary Medal, Sea Service Medal Deployment Ribbon  three times, and the Good Conduct Medal two times.\n\nFollowing her military career, she earned a bachelor's…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Mr. SESSIONS. Mr. Speaker, I am honored to present Danny Wallace  Smith of Crawford, Texas, with a Congressional Veteran Commendation for  his exceptional armed forces service and unwavering commitment to our  country, state, and local communities. Danny served three years in the  United States Army, including 18 months in Vietnam…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today in  recognition of National Military Appreciation Month.\n\nThis month, we pause to honor the brave men and women of our Armed  Forces, past and present, who have worn the uniform of the United  States of America.\n\nOur military has stood for freedom throughout our history in times of  peace and peril.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691525/national-military-appreciation-month"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…1682) to amend the Federal Lands Recreation Enhancement Act  to provide for lifetime National Parks and Federal Recreational Lands  Passes for family members of members of the Armed Forces who lost their  lives while serving their country.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1682…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691053/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…time.\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank Chairman Rogers  for yielding.\n\nI am grateful to support the National Defense Authorization Act. I  appreciate House Armed Services Committee Chairman   Mike Rogers for  his success on peace through strength, working together with Ranking  Member Adam Smith.\n\nI am grateful that the language that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "James Risch", "party": "Republican", "sentence": "…infrastructure, and population       centers. This proposed sale will increase the       interoperability with U.S. forces and conveys U.S. commitment       to Israel's security and armed forces modernization. Israel       will have no difficulty absorbing this equipment into its       armed forces.\n\nThe proposed sale of this equipment and support will not…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…group. The four suspects are  now in Federal custody, and we know they will face the full force of  the law.\n\nGod bless the men and women in Federal law enforcement and in our  armed services who are really working around the clock to restore  safety and security here in our country.\n\nUnder President Trump, we have seen that national security has become…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "James Risch", "party": "Republican", "sentence": "…These strikes were fully compliant and fully  justified under the President's article II constitutional authority-- and not only authority but duty as Commander in Chief of our Armed  Forces to defend this country. And he took an oath to do so.\n\nSo why are we here today? We are looking at a resolution saying that  he can't do this anymore. This is nonsense.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…remove them, or we have no immigration law,  right?\n\nIf the word gets out that you come to the United States and, as long  as you don't break laws, as long as you are not an armed robber, as  long as you are not a drug dealer, you can stay here forever, everybody  will come here. That is like having no immigration law at all.\n\nIn any event, right now,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…leader who not only commands respect but  inspires it. He embodied the warrior spirit, the never-quit attitude,  and the deep sense of duty that defines the very best of our Armed  Forces in this country.\n\nToday, I am proud to tell you just one of many stories of Bruce  ``Puppy'' Fecht, and we honor him not just for what he did but for how  he did it,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…important than ever  that we invest in our servicemembers, protect defense spectrum, drive  innovation, and strengthen our missile defense systems.\n\nAs a member of the Senate Armed Services Committee, I am proud to  report that this year's National Defense  Authorization Act meets this moment. It includes key provisions I  secured to modernize our nuclear…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}]