[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…fathers of American sailors, marines, soldiers,  and pilots do not want to lie awake at night wondering if their kids  will be the ones who have to be deployed to yet another armed conflict,  this time in South America.\n\nLast month, we came to this body with a resolution to end the  unlawful strikes that this administration had been taking against boats  in…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President, I rise today to bring before the Senate a  resolution concerning one of our most serious constitutional  responsibilities: whether the United States should engage in armed  conflict against a particular adversary.\n\nThe Constitution clearly and intentionally places the power to  declare war in the hands of this body, the Congress, not with the  President…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…I, section 8 is clear on this issue--and for good reason.  Only the people's elected representatives should have the awesome power  to send our sons and daughters into armed conflict.\n\nI remember thinking about this in personal terms during the era of  the Vietnam war when I was a college student, thinking about the fact  that there had not been any…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Genocide,  would be unconstitutional absent the approval of the United States  Congress, and is profoundly unserious in light of the grave  humanitarian situation and ongoing armed conflict in Gaza.\n\nUsing the powers of his high office, Donald John Trump has unlawfully  conducted himself, bringing shame and embarrassment to the Office of  the Presidency and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…with no  discussion, no debate in this Chamber amongst the Representatives of  the people.\n\nThe administration has created a war that is not a war, a non- international armed conflict. It is a war inasmuch as we have an  aircraft carrier and massive amounts of military hardware in the  region, and we have killed upward of 100 people in 23, 24 strikes.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698242/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Speaker, my question is: Why on God's green Earth on the first  full day that this Congress is back in 2026 are the Republicans using  their floor time in the midst of armed conflict and daily corruption by  this administration to run a bill on rich people's showers for Donald  Trump? It is just absolutely amazing.\n\nMr. Speaker, I have a little less…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…decision.'' This by itself is an alarming admission.\n\nBut I am, frankly, not surprised by the Secretary's statements. For  years, he has expressed contempt for the law of armed conflict and has  championed servicemembers convicted of war crimes. During the first  Trump administration, he lobbied for the pardoning of several military  personnel who were…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…administration claims, but as a pretext to start a regime change  war in Venezuela. There is simply no evidence that these vessels posed  an imminent threat, nor is there an active armed conflict between the  United States and Venezuela. The Constitution gives Congress the power  to declare war, making the President's acts flat out illegal. Trump's  warmongering…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…impossible. The statute grants the       Secretary of Homeland Security the authority to designate       countries for TPS when there are conditions such as ongoing       armed conflict, environmental disaster, or other       extraordinary and temporary conditions that prevent safe       return. The program is designed to be responsive to facts on…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the President's article II authority and  claimed that these cartels were terrorist organizations.\n\nThen the President decided that America is in a ``non-international  armed conflict,'' which is a dubious claim. Now, Secretary Hegseth has  begun calling these cartels ``the Al Qaeda of the Western Hemisphere,''  and declared open season on them.\n\nBut…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…war--I am not; been there, done that; got the t-shirt.  Titanium legs don't buckle, by the way. What I am scared of, however,  is that the United States is stumbling into an armed conflict because  of a five-time draft dodger who is using our military to pretend to be  a tough guy on the world stage.\n\nWhat I am troubled by is that a man who was never brave…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…firing on alleged drug  traffickers--a sick parody of a well-known children's book. This man is  a national embarrassment. Tweeting memes in the middle of a potential  armed conflict is something no serious leader would ever even think of  doing. The only thing this tweet accomplishes is to remind the world  that Pete Hegseth is not up to the job.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697173/secretary-hegseth"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…hour or at least 40-some- odd minutes, the order was given to fire lethal rounds at these  survivors.\n\nEven if one accepts the President's determination that we are in an  armed conflict with cartels, the Geneva Conventions still apply.  Article 12 of the second Geneva Convention defines ``shipwrecked''  persons as those ``in peril at sea or in other waters…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Caribbean, reportedly killing 21 individuals.  These attacks have been retroactively explained by the President's  unilateral declaration that the United States is in ``armed conflict''  with unnamed ``non-state armed groups'' throughout the Western  Hemisphere.\n\nHe has deployed thousands of U.S. forces, ships, and aircraft to  conduct  these operations--all…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…everybody.\n\nThose are the alleged words from the leader of our Defense  Department. Just to be clear, killing defenseless people, regardless of  whether they had been engaged in armed conflict, is a war crime, plain  and simple. The administration is trying to brainwash the American  people into thinking that cruelty and murder and war crimes are normal.\n\nMr.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…are bringing cocaine and fentanyl to the  streets of Miami, New York, or Chicago.\n\nLet's see what international law says. The United States is waging a  noninternational armed conflict with Venezuela. What does that mean?  Our issue is not with Venezuela as a country but with Nicolas Maduro,  the narcotrafficker who hijacked that country after he stole…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…the United  States; while engaged in military operations involving conflict with an  opposing foreign force; or while serving with friendly foreign forces  engaged in an armed conflict against an opposing armed force in which  the United States is not a belligerent party.''\n\nSince the Medal of Honor was established by Congress in 1862, it has  been awarded…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…energy production even when it is new energy that is  fantastically clean, so much cleaner than it was when I was a child.\n\nThey hate it when Western countries wind up in armed conflict with  horrific opponents like Hamas, but for psychological reasons they side  with Hamas.\n\nThose are some of the issues that I think we ought to be paying  attention to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…and  has been briefed on this operation several times. These strikes are  lawful under U.S. law and international law, and all actions are in  compliance with the law of armed conflict.\n\nMost importantly, these strikes have dramatically reduced drug  smuggling operations.\n\nThe bottom line is that Americans are safer today because of  President Trump's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}]