[{"senator": "Al Green", "party": "Democrat", "sentence": "…people.\n\nWhen we do this, however, we do not acknowledge the people who made  it possible for General Gordon Granger to go to Galveston. These  persons were members of the 25th Army Corps, approximately 1,000  persons of African ancestry who went to Galveston prior to Gordon  Granger.\n\nThey made it possible for Gordon Granger to stand in Galveston and  deliver…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…with the administration's proposed budget effectively  annihilating the very science that keeps us safe. Programs that  previously had broad, bipartisan support, such as the Army Corps of  Engineers water infrastructure fund, EPA's drinking water and clean  water funds for States, forestry operations, energy utility assistance  for low-income households,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…those of us from the industrial and agricultural heartland,  energy and water drive the lifeblood of our economies. This bill  invests $10.4 billion in the indefatigable Army Corps of Engineers.  That is $3.8 billion more than the Trump administration's shortsighted  request.\n\nIt includes more dollars for harbor maintenance. It ensures that our  Great…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…opposition to the  underlying bill.\n\nThe bill itself cuts over $750 million from the FY25 spending levels,  revokes $5 billion from the Bipartisan Infrastructure Law, zeroes out  Army Corps programs that clean up radioactive waste and blocks clean  energy initiatives. My four amendments support essential funding for  our National Labs and our continued goal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…FEMA approved over $150 million in housing and other  emergency assistance. SBA approved over $3 billion in loans for small  businesses, homeowners, and renters. The U.S. Army Corps of Engineers  did an amazingly fast residential wildfire cleanup. It was the fastest  in our Nation's history.\n\nThese efforts saved lives and laid the groundwork for recovery,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Chair, I rise in strong opposition to the PERMIT  Act, Republicans' latest attempt to help corporate polluters dodge  responsibility.\n\nThis alarming bill would weaken the Army Corps' permitting process  and EPA's Clean Water Act authorities, threatening my district, where  the Clean Water Act protects our waters, our salmon, and our people.\n\nMoreover,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698018/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, it is my honor to recognize Joseph Seebode  on his retirement from the United States Army Corps of Engineers. Mr.  Seebode has dedicated 44 years of Federal service to USACE and his many  achievements and contributions as an Environmental Engineer should be  celebrated.…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…permitting  process.\n\nIn January, on his first day in office, President Trump paused all  new leasing and permitting of wind energy projects on public lands.\n\nIn February, the Army Corps of Engineers singled out and delayed 168  energy projects on private land.\n\nIn March, the Environmental Protection Agency withdrew the permit for  Atlantic Shores Offshore…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Assistance Program, but Democrats saved those and in  fact procured more assistance to help lower families' energy bills.\n\nNot only did we reject Trump's $2 billion cut to the Army Corps of  Engineers, we actually increased funding and spelled out in line item  after line item exactly how that funding is to be spent because last  year, Trump and Russ Vought…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…of the pain.\n\nThe NTSB is also leading the accident investigation itself. The  agency deployed over 40 investigators alongside the Coast Guard, FBI,  dive teams, and the Army Corps of Engineers to aid in the recovery and  analysis.\n\nAside from the wreckage of both aircraft and the personal effects of  the victims, the agency has recovered the recording…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Energy Regulatory Commission, FERC.\n\nToday, FERC is responsible for issuing licenses for hydropower dams,  but it is often dependent on other regulatory entities, such as the  Army Corps, the U.S. Fish and Wildlife Service, the National Marine  Fisheries Service, or State water agencies, to provide information and  approvals that FERC relies on to issue licenses.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693477/hydropower-licensing-transparency-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…dramatically.\n\nWhy? On January 20, the President froze Federal leasing for wind  projects and blocked permits for projects that had already been  approved.\n\nOn February 5, the Army Corps of Engineers halted permits for 168  renewable energy projects on private lands.\n\nIn March, as part of his tariff war, he imposed a 10 percent tax on  energy imported from…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…forward.\n\nIt ain't just this bill that has to come through EPW and go through  the Congress. There is also a highway bill coming. There is a water  resources bill for the Army Corps bill. Are we really going to have to  stop work on those big bipartisan bills because we can't trust the  Trump administration to implement them according to law?\n\nSomething…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…increasing their energy costs, just as so many are already seeing huge  hikes to their bills. It weakens national security, and it undermines  the critical work that the Army Corps of Engineers does to keep our  coastal communities safe.\n\nMr. Chairman, I will focus on the cuts to shore protection.  Republicans are making a massive cut to the shore protection…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694863/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…enforcement that are working in the community, all the work that the  Governor's office is doing, all the work that we are--a partnership we  are now getting from FEMA, the Army Corps of Engineers, and Homeland  Security to try to address this as a national emergency and clearly to  try to gather information about the direct economic impacts in hopes…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Mr. Drake was born in Winchester, Kentucky on November 6, 1918. He  attended the University of Kentucky's College of Engineering. At the  age of 23, he was serving in the Army Corps of Engineers and was in  charge of a temporary power plant in Hawaii. On December 7, 1941, he  became a part of history as he witnessed Japanese planes attack Pearl  Harbor,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…focused on the  highest priority research and development projects.\n\nThe bill also strengthens our economy and promotes public safety,  providing $10.3 billion for the great Army Corps of Engineers,  including full funding of harbor maintenance and over $2  billion for flood and storm damage reduction, and continued support for  the highest priority, ongoing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…critical. It protects our section 404 program,  and it ends the uncertainty caused by conflicting court rulings and  shifting interpretations in Washington.\n\nMeanwhile, the Army Corps of Engineers got a gut punch with an  overwhelming caseload while working hard to try to solve dozens of  projects that an activist judge has placed on hold in our communities…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Agencies Appropriations Act.\n\nMr. Chair, my amendment today includes funding to the operations and  management account under title I of this bill, which is the funding for  the Army Corps of Engineers.\n\nSpecifically, I would like to highlight my application that the  Little Rock Army Corps has submitted on behalf of a river in my  district, the Little Red…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Judicial Review Timeline Clarity Act, which is included in this  vital permitting reform package, establishes a strict 60-day window to  challenge section 404 permits once the Army Corps of Engineers grants  authorization.\n\nSection 404 of the Clean Water Act exists to safeguard our waters,  not empower radical environmentalists to harass hardworking Americans…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…appropriations bill has over $20 billion in funds for the  management of our nuclear weapons stockpile and over $2 billion for our  nuclear Navy.\n\nThis bill also funds numerous Army Corps of Engineers and Bureau of  Reclamation projects to provide dredging to maintain navigable ports  and rivers and water storage projects to increase the water supply in  drought-ridden…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…4553.\n\nMr. Chair, my amendment No. 21 is to the Energy and Water Development  and Related Agencies Appropriations Act for fiscal year 2026.\n\nMy amendment No. 21 prevents the Army Corps of Engineers from closing  campgrounds around Lake Lanier. My amendment will ensure that these  campgrounds are open for my constituents and people from all over the  country…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…water needs and the infrastructure of our water programs in Texas.\n\nToday, I rise to recognize Kathleen Spillane, chief of the Civil  Works Branch for the United States Army Corps of Engineers, Fort Worth  District.\n\nIn this role, Kathy oversees a comprehensive portfolio of critical  water resources development projects in Texas, including flood risks,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691207/recognizing-kathleen-spillane"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…dominance.\n\nIn the base of this bill, there is $50 million for the ARDP  demonstration programs and $77 million for risk-reduction projects. We  secured close to $5 billion in Army Corps projects that improve  navigation and operating waterways for vessels which strengthens our  economy, helps us to export, and helps us to lead on the world stage.\n\nProjects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694857/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…for a 17-mile stretch, is prone to flood. The  Flood Control Act of 1941 established that this river should be  maintained at 9-feet deep and 100-feet wide.\n\nIn 1956, the Army Corps of Engineers classified the project as an  operation and management project to be maintained at 9-feet deep and  100-feet wide for a 17-mile stretch of a river that runs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694867/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…developing facilities in Mexico, the  USDA is also working to ensure that we have a sterile fly facility here  in the United States. Planning is currently underway with the U.S. Army  Corps of Engineers to construct a domestic sterile fly production  facility in south Texas. This facility has a projected capacity of 300  million sterile flies per week. It will…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…regulatory cost of building a new  home and allowing builders to use lots that the cost of mitigation  today prevents them from using.\n\nAdditionally, my amendment directs the Army Corps of Engineers and  EPA to publish a revised compensatory mitigation rule that incorporates  advances in science and lessons learned since 2007; promotes  equivalency and flexibility…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…war.\n\nLike so many of his generation, John answered the call to serve,  devoting over 26 years to the defense of our country. He began his  service in 1943 with the U.S. Army Air Corps and concluded with his  honorable retirement from the United States Air Force in 1969.\n\nOver that distinguished career, Mr. Mass served in posts worldwide,  including the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…infrastructure to meet the modern demands, not just  coming up with more and more regulation.\n\nA prime example of real building is found in the $10.435 billion  secured for the Army Corps of Engineers and their projects such as  improvements to the Matagorda and Corpus Christi Ship Channels in south  Texas. The Port of Corpus Christi, for example, is the leading…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698759/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…my bill, the Jurisdictional  Determination Backlog Reduction Act, is included as a part of this  package. Across the country, Americans depend on timely answers from  the Army Corps so they know whether their projects require Clean Water  Act permits, but the Corps is not keeping up. Right now, thousands of  determinations and wetland delineations are…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698019/promoting-efficient-review-for-modern-infrastructure-today-act"}]