[{"senator": "Tina Smith", "party": "Democrat", "sentence": "…campaign of fear and intimidation.\n\nThis is government police, sanctioned at the highest levels of our  government, completely unbound, beating and attacking and detaining and  arresting and killing American citizens. This is what America looks  like with an authoritarian government, with no laws.\n\nBut here is what is happening not only in Minnesota but around…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…one more cent for an agency that would  recklessly take the life of Renee Good, an innocent and defenseless  young woman.\n\nI cannot support one more cent for masked agents arresting U.S.  citizens, pulling people out of their homes, tearing children away from  their parents,  and stating that it is exempt from the constitutional requirement for  search…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699350/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…from his  home and sent to a foreign prison infamously known for human rights  violations. When the President defies the courts, he crosses the line  into tyranny. He is even arresting judges whom he sees as standing in  his way.\n\nWhen tyranny takes root, no one is safe. Today, it is immigrants with  tattoos, 2-year-olds, and even children with cancer.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…military courts, so the  crux of the case is the child's confession or a signature on a document  in Hebrew they don't understand. There can also be an affidavit from an  arresting soldier or intelligence officer or an incriminating statement  made against the child by another child who was also arrested and  accused in connection with the same alleged…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…years old. The  United States is the only home he knows.\n\nFor the past 3 years, he has bravely served as a wildland  firefighter, putting his life on the line to protect us.\n\nArresting a firefighter who is actively fighting a wildfire does not  make our community safer. For roughly 48 hours after his arrest, the  Trump administration violated my constituent's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694948/arrest-of-wildland-firefighter"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…manure today.\n\nThis is nonsense. This is awful. How can these Federal agents get  away with this?\n\nIs the President of the United States telling folks to go down and  start arresting U.S. Senators, taking them down to the floor? Is that  what we have come to, the executive branch doing this to our  colleagues?\n\nThis is a Democrat. What happens when it…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692552/alex-padilla"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…their apartment without-- without--a judicial warrant, a clear violation of the Fourth Amendment.\n\nIn December, our Afghan community was repeatedly targeted, including  ICE arresting a father and son after they exited a mosque following  morning prayer. People who fled the Taliban, fearing for their lives  and their families' lives, are now wondering…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the  administration is unwilling to let the people see?\n\nThe legality of the entire campaign of striking these boats and  killing those onboard, rather than interdicting and arresting them, has  been called into serious question. An attack on shipwrecked sailors is  expressly prohibited by the laws of war.\n\nThe rationale for hiding this video seems far…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…wants people to believe, ICE is  creating significant levels of fear, including around schools.\n\nMr. Speaker, this is not about targeting criminals. It is about  targeting, arresting, and detaining people because of their national  origin or the color of their skin. This ought to send chills down the  spines of everyone in this body and this country.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…unfortunately, is highlighting a policy that turns  away refugees. The Trump administration has diverted resources from law  enforcement and national security efforts to focus on arresting  immigrants who pose no threat to public safety. We have seen it in  Chicago. We have seen it in Minneapolis and in other cities. This  administration is targeting legal…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…are masked agents in unmarked cars sent out,  violating people's due process rights, as the courts have found. This  includes all the way up to the Supreme Court. They are arresting  Members of Congress. They are prosecuting Members of Congress for doing  their jobs. They federalize the State National Guard when the police in  Los Angeles and the elected…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to a Presidency in modern history. Before our very eyes, the man  who occupies the Oval Office is destroying the foundations of our  democracy.\n\nFederal law enforcement is arresting people with little due process,  even going as far as arresting a judge in Wisconsin. At least four U.S.  citizens--all of them children, two suffering from cancer--have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Caribbean. Over the past decade, that approach led  to a steady decline in Venezuela's role as a major drug transit route.  It relied on stopping vessels, inspecting cargo, and arresting suspects  where evidence existed. This Administration has shamefully abandoned  that lawful and effective approach in favor of bombing boats and  committing extrajudicial…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…represent in Arizona's Seventh  Congressional District, we see the impact of these abuses every single  day. We have seen Border Patrol waiting outside of hospitals, literally  arresting women after they have given birth--no due process, no regard  for human rights.\n\nLast week, we saw a disturbing example near the ranching community of  Arivaca. Humanitarian…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697450/fighting-dhs-immigration-raids"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…process. If you are going to take a person and lock them up, they have  to be able to say, Hey, you have the wrong guy. They ought to be able  to say it to someone other than the arresting person. They ought to be  able to say it to someone who has authority over the arresting person.  They ought to be able to go to a disinterested third party--we call  that…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…millions to storm America. Many were sex traffickers, drug runners,  child predators, murderers, and thugs. Now thugs are rioting and  burning Los Angeles, all because ICE is arresting and deporting  killers, rapists, and drug dealers.\n\nThey are attacking local police, Federal agents, and the rule of law.\n\nI think they would have learned, but they have…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692194/los-angeles-protests"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…other thing that is interesting that got raised is  Minnesota. She talked about a couple of immigrants who have been  arrested. We don't have any problem about enforcement and arresting  people who commit crimes. In fact, we have had Democratic Presidents do  that. Obama deported more people than Trump has, but he went after  people with criminal records.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…lot of vitriol directed at ICE in  Minnesota, let us look at these individuals right here. These represent  about eighteen individuals who are the people that ICE has been  arresting in Minnesota. There has been a lot of news over one incident  in Minnesota.\n\nWhat we have here is a Somalian illegal alien convicted of homicide.\n\nWe have a Salvadorian illegal…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the nuances of  reasonable suspicion, Democrats are instead attacking their authority,  their dignity, and their work at large. That is beyond unfortunate as  ICE agents are arresting some of the worst criminals imaginable.\n\nDuring the first year of the Trump administration, ICE arrested 7,000  gang members from America's streets. This includes a criminal…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…and demonstration of peace  through strength. The message to the entire world is clear: If you  poison and kill the American people, you are going to be held  accountable.\n\nArresting Maduro also advances America's national security. Maduro's  allies and enablers are united in their commitment to undermine our  Nation: China, Russia, Iran, Cuba, even Hezbollah.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…this, as I said, and these  National Guards men and women are going to help maintain order so that  the Memphis police officers can be on the street and be tracking down  and arresting these criminals, getting them off the street.\n\nWe saw this strategy succeed in Washington, DC, where in just over a  month, the President's crime crackdown here in our Nation's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "John Thune", "party": "Republican", "sentence": "…single day. It is incredible what  President Trump has accomplished in just 6 weeks.\n\nI haven't even mentioned how his administration has been making our  communities safer by arresting and deporting criminals here illegally.  In just 6 weeks, they have taken a lot of dangerous people off of our  streets.\n\nIt all goes to show what is possible when you have…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…in Venezuela.\n\nNow, some of them on the quiet will tell you: Well, it was a war, but  it is all over. It is all done. Yeah. We are not going to quibble. We  really weren't arresting somebody. It wasn't a drug arrest. It was a  war. It is a mini-war. But it is all over, so the War Powers Resolution  doesn't apply because the war is over.\n\nAnd yet, we…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]