[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…private parking in the city of Hawthorne.  In that truck was Cary's partner, Brian. When she tried asking  questions about who the agents were and what authority they had to  arrest her partner, she was arrested.\n\nCary, an American citizen, recounted that: ``They started grabbing me  from both sides, and I ducked down to sort of shield my stomach because…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…around the  country is not law and order. It is thuggery--thuggery.\n\nHere is what former border control head Greg Bovino said recently in  a video that circulated online:\n\nArrest as many people [who] touch you as you want to. Those       are general orders, all the way to the very top.\n\nThat is the rhetoric of police states. That is precisely the abuse…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…resources on public safety in the local communities.\n\nSo let me say that again as clearly as I can: Sanctuary policies do  not prevent ICE from going into any State or any city to arrest the  violent criminals that the administration says they are after when they  are being released from prison.\n\nAnd, by the way, it is not like ICE does not know when someone…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…that believes that following the  Constitution is a mere suggestion.\n\nMy office has documented hundreds of cases marked by excessive force,  racial profiling, and the unlawful arrest of legal residents.\n\nJust last month, rogue Federal agents descended on the Allston  neighborhood in Massachusetts' Seventh District, a diverse community  that is home to small…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…extrajudicial killings at sea. There is no operational  reason for abandoning interdiction, which worked, respected the rule of  law, and avoided the use of lethal force where arrest and prosecution  were possible.\n\nAfter decades of forever wars, the American people are sick and tired  of being dragged into needless armed conflicts. Despite that, President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…School together: What  authorizes the government to send people out who are not identified  with any law enforcement insignia, who are masked and who are in  unmarked cars, to arrest people? Doesn't that set the people up for  danger in America?\n\nThat is what the assassins in Minnesota were doing. They showed up,  dressed like some kind of vague police…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…included a risk of       harm to persons through action or inaction, such as physical       and sexual violence, mishandling firearms, or compromising       evidence related to an arrest. The other 20 officers (54       percent) were terminated for reasons such as       misrepresentation of injuries, time theft, fraud, and other       misconduct that violated…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…healthcare for  millions of Americans, including DACA recipients. They are cutting  education benefits and opportunities for DACA recipients, but now they  are threatening to arrest DACA participants as well. That is exactly  what has been happening in my hometown of Los Angeles when, last month,  masked immigration officials--unidentified and masked immigration…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…aftermath of the briefing yesterday, I have had  good conversations with colleagues, and many of them have asked me  about the distinction between the execution of a valid arrest warrant  and a larger military operation.\n\nI want to state very clearly that I do not challenge, nor does this  resolution  challenge, the execution of a valid arrest warrant…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…United  States of America? Or are we going to show all the other folks in the  world who choose to do this to the people who were duly elected by  their people: No, just go arrest them. Throw them down on their face.  Treat them like garbage.\n\nWe are better than this in America, you all. We have got to speak up.  I hope, by tonight, every Democrat and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692552/alex-padilla"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…risk and safety based       pretrial system outperform most cash-bail jurisdictions in       the country. Ninety-two percent of people released pretrial       in D.C. remain arrest-free before trial, 87% appear for their       court dates, and 86% complete the pretrial period without any       compliance violation.\n\nH.R. 5214 would replace D.C.'s current…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…middle of the night. They claimed the apartment was  infiltrated by members of a Venezuelan gang. I don't understand this  President's obsession with Venezuela, but they did not arrest a single  member from that gang.\n\nI visited that apartment building and saw firsthand the destruction  those agents left. Doors to people's homes or apartments were kicked…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…has gotten to a level of an  insurrection, it means that the U.S. military can now be used as law  enforcement in our cities. It means the U.S. military can raid; they  can arrest; they can detain. You can easily see a world where the  President of the United States labels protest groups ``terrorists,''  doesn't tell anyone, and creates an excuse to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…ranking officials of this operation in President Trump's White  House--the Cabinet Secretary overseeing these raids, Kristi Noem; the  architect of this campaign of fear and mass arrest and detention, the  ``racist in chief'' Stephen Miller.\n\nThis impunity that we see on our streets, this violence--it comes  from the top; gaslighting amplified by the Vice…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…inhumane, out-of-touch mass  deportation agenda.\n\nI am infuriated by story after story of extreme overreach, excessive  force, and brutal tactics being used by masked ICE agents to arrest and  detain Oregonians.\n\nIn Portland, ICE wrongfully separated a young, loving mom from her  four little children for 4 months.\n\nIn Hillsboro, multiple unmarked SUVs circled…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…the secure immigration  detention facility;\n\nWhereas Representative McIver is alleged to have interfered with  Homeland Security Investigations (HSI) officials from making an arrest  of an unauthorized visitor;\n\nWhereas Representative McIver is alleged to have ``slammed her  forearm into the body'' and ``restrain'' an HSI officer by ``forcibly  grabbing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694802/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…country? The Democrats  want it that way. In 2020, Joe Biden said that illegal aliens with DUI  convictions should be allowed to stay in the United States. He said:  ``You only arrest for the purpose of dealing with a felony that's  committed, and I don't count drunk driving as a felony.''\n\nWhen Republicans tried to enact this law in 2021, then Democratic…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693083/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…That is what we are all  about. If that is not you--if they don't want to do that--again, we  don't want you here.\n\nThe Trump administration has worked tirelessly this year to arrest  and deport millions of illegals brought into the country by the Biden  administration. Patriotic Americans are thankful for the work of DHS  and ICE and what they are doing…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, there is much to unpack from the arrest  of Venezuelan dictator Nicolas Maduro. Above all, there is the stark  contrast between the American socialists who are bitterly denouncing  the ouster of this socialist dictator…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…stopped at the  border, processed, and then simply released into the interior just  weeks before. The illegal alien who murdered Rachel was a fugitive with  a warrant out for his arrest for the murder of a different woman back  home in El Salvador. He had been deported three times in that year  alone, only to waltz back in across our open border.\n\nThe monster…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…alienating  many of our friends and allies in Europe. And it sets the worst  possible example for Russia and China and others.\n\nThis is coming into focus in the wake of the arrest and extradition  of Nicolas Maduro. We get that. We get that. But Greenland is not  Venezuela. It is not Venezuela. It is not a narcostate that is run by  an illegitimate dictator.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…counties, even Gavin  Newsom's and Kamala Harris' San Francisco.\n\nAs a result, you are seeing law enforcement throughout California  that now has a new ability to restore order and arrest people who  commit crimes. We are starting to see real improvements across the  State that we have not seen in a very long time.\n\nFive, when it comes to high-speed rail, the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "John Thune", "party": "Republican", "sentence": "…in Venezuela and were  criticizing the President for not going far enough in opposing the  Maduro regime. President Biden raised the reward for information  leading to the arrest or conviction of Maduro to $25 million. But then  President Trump directs an isolated Special Forces raid in support of a  valid warrant to capture Maduro so that he can be…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…case as a domestic violence assault;\n\nWhereas on February 21, 2025, NBC4 Washington also reported that the  Metropolitan Police Department determined that probable cause to arrest  Representative Cory Mills for misdemeanor assault existed and sent an  arrest warrant for Representative Cory Mills to the United States  Attorney's Office for the District…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…communities have no right to be here in the first place. State and  local governments must work with the Department of Homeland Security to  share information on individuals they arrest. They must also honor  lawful detainers. When they do not, Congress must act.\n\nH.R. 2056 ensures that the District of Columbia cooperates with  Federal immigration agencies,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…taking action on this front, particularly Secretary  Noem and law enforcement officials who recently carried out Operation  Midway Blitz.\n\nThis enforcement action led to the arrest of 223 illegal aliens, 146  of whom were truckdrivers. And just a few weeks ago, ICE announced the  arrest of a man from Uzbekistan with a Pennsylvania CDL who was allowed…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…about, this resolution that you all refused to  even say a word about in your opening statements? It is about spite. It  is about the fact that you don't want President Trump to arrest Maduro,  and you will condemn him no matter what he does, even though he brought  Maduro to justice with possibly the most successful law enforcement  operation in history.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…People say: We are not talking about that.\n\nThen we would declare war. You have to declare war at the beginning.\n\nAnd then people say: Well, it is not a war. All it was was an arrest  warrant. It was just a drug crime.\n\nOh, he was guilty of possessing machineguns. That sounds like that is  being made up as humor.\n\nIn 1934, we passed a law in our country…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Ghislaine Maxwell was  arrested by the Trump administration.\n\nI know the gentleman from Maryland will go on to say that the Biden  administration then carried forward that arrest, indictment, and  prosecution. True, but it was, in fact, the Trump administration that  did what had not been done for a long period of time by taking forward  that indictment.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…harvesting in China appears to be targeting specific ethnic,  linguistic, or religious minorities held in detention, often without  being [informed of] the reasons for their arrest or provided arrest  warrants.''\n\nAmong those most frequently reported as targets are Falun Gong  practitioners and Uyghur Muslims in the Xinjiang Province. These  detainees,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}]