[{"senator": "Al Green", "party": "Democrat", "sentence": "…a 15-year-old high school student, member of the  NAACP. Claudette Colvin, she is a person who, 9 months prior to Rosa  Parks taking that seat, did the same thing and was arrested. Legacy  stolen, legacy denied.\n\nClaudette Colvin, not only did she go to jail and suffer the same  indignation and humiliation as the Honorable Rosa Parks, but she did  something…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…safety. A 2022 D.C. Auditor's report       catalogued cases where MPD was barred from firing officers       who had committed sexual and domestic violence, who were       arrested for assorted criminal activity, or who gave false       statements, misused their firearms, or slept on the job. H.R.       2096 would also restore a 90-day statute of limitations…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…detention facilities, but it does not stop there.\n\nWe must hold Tom Homan, Kristi Noem, and Donald Trump accountable.  They must tell me why a 17-year-old U.S. citizen was arrested,  traumatized, and suffered shards of glass in his eye when an ICE  vigilante smashed in his driver's side window and arrested him,  detained him first, and asked questions…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697458/fighting-dhs-immigration-raids"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…to use lethal force against  individuals who posed no imminent threat of attack and who could have  been stopped thousands of miles from our shore had we interdicted and  arrested those on board just as they routinely are by our Coast Guard.  Instead, the U.S. military used lethal force on four separate  occasions, killing everyone on board.\n\nDespite…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…force their victims  to commit other crimes, including prostitution, money laundering,  fraud, drug trafficking, robbery, and theft.\n\nThis leads trafficking victims to be arrested and prosecuted without  consideration of their status as victims themselves. They are often  then made to serve prison sentences and left with criminal records that  can stop…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and  underinsured. As a result of her unflinching leadership in the campaign  to address the needs of poor Americans, she has been both praised for  her determination and arrested for non-violent civil disobedience. She  has been central to the outstanding work of both Repairers of the  Breach and the Poor People's Campaign.\n\nRev. Dr. Owens-Barber is…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Trump rescinded the  practice of avoiding enforcement actions at sensitive locations, we  have seen a daycare worker snatched in front of children in Chicago and  a father arrested outside his child's preschool in Oregon.\n\nLet's not forget that many care workers are immigrants. Among early  educators, 26 percent, close to one-half million people, are…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…brutality and the bone-chilling  horror of the Renee Good and Alex Pretti murders, citizens shot dead  while exercising their First Amendment rights.\n\nTwo journalists have been arrested. Children have been taken from  their homes. U.S. citizens have been unjustly detained. At this point,  more than 35 people have died in ICE custody, and 15 have been shot.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699729/violating-core-tenets-of-our-united-states"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Congress. These killings occurred without due  process and without any explanation for why the vessels could not have  been stopped, inspected, and the individuals on board arrested and  prosecuted. Most disturbing of all, the Administration carried out a  so-called ``double-tap'' strike, deliberately targeting wounded  survivors after an initial attack.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…detained under this administration, some held for days,  many subjected to brutality just for brutality's sake.\n\nIt pains me to know and to say that four of these citizens were  arrested during ICE's crackdown on New York City's Canal Street. It is  disgusting, unconstitutional, and uncivilized.\n\nNo matter how desperately he wishes it weren't, I have news…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…at our hearing was a veteran who  served and sacrificed for this country in the belief that he was  helping to preserve the very liberties that he was denied when he was  arrested.\n\nNow, every one of these people sought to tell the agents that they  were an American citizen. They offered their passports or their  driver's license or other identification…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Oregon, father was dropping off his child at  preschool. With his child in the car, ICE surrounded him, traumatizing  the child, other parents, and preschool teachers. ICE then arrested the  father within sight of the school.\n\nIn October, two Oregon high school students were at a drive-through  coffee shop near their school. They were surrounded by multiple…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…country,  but lawyers are the ones who bring the lawsuits to stop the thievery  and the illegality. Lawyers are compelled by their oath to stand up for  the Constitution.\n\nPutin arrested Navalny's lawyers right on the eve of Navalny's trial.\n\nIn Venezuela, Maduro routinely harasses and detains lawyers--human  rights lawyers--because he knows those are the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…face on the hot sidewalk while their three  children watched on in horror.\n\nIn East Boston, my constituent Mercedes and her son are struggling  after her husband, Jose, was arrested at work and detained for 2 days  at an ICE facility in Burlington. Jose was living here legally with  temporary protected status but was told by the ICE agents who detained…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…pushed a  United States Senator to the floor.\n\nHis U.S. attorney indicted a United States Congresswoman from this  Chamber for doing her job.\n\nA New York City official was arrested in a Federal courthouse.\n\nI ask my colleagues: Is this the America that you swore your oath to  and that you raised your right hand to defend, an America where the  President…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "John Rose", "party": "Republican", "sentence": "…protect ours. They stay late  writing reports or working events. They are often required to testify  in court on their days off to ensure the conviction of a suspect they  have arrested. That time, overtime, is needed to truly serve their  communities. They do it without complaint.\n\nThey do receive extra pay, of course, for their overtime, yet that  often…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…was not something in black and white on  the History Channel. It was real life. People got their heads cracked,  and people lost their lives. Dr. Middlebrook, I think, got arrested  over 40 times during all of that. He is an inspiration to me.\n\nOne other story: We were at an NAACP dinner one night, and they were  asking everybody to sit at the head table.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…death, aggravated driving under the influence of alcohol, and  reckless homicide.\n\nLast October, Secretary Noem highlighted more than 140 illegal alien  truckdrivers who were arrested in Northwest Indiana during Operation  Midway Blitz. These aliens were found guilty of numerous crimes,  including driving under the influence, drug trafficking, theft,  burglary,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…up to do their jobs. Democrats have been  questioning the authority and jurisdiction of ICE's actions in  Minnesota.\n\nLet's shed some light on what ICE has been doing. They arrested a  criminal illegal alien from Somalia with a record of multiple counts of  credit card fraud, drug possession, controlled substance possession,  and drug trafficking. This…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…through  protecting our men and women of law enforcement.\n\nA few weeks ago in Colorado Springs, we had a raid by the DEA of a  nightclub where over 100 people were detained and arrested for criminal  activity. There was trafficking of adults and trafficking of children.  There were drugs. There was all sorts of illicit behavior there.\n\nThe men and women of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…conviction if the       level A offense was committed as a direct result of the       person having been a victim of trafficking.\n\n``(B) Arrests for level a offenses.--A person arrested for       any level A offense (or an attorney representing such a       person) may move the district court of the United States for       the district and division embracing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…a similar story will  play out in our Nation today as it is in other countries around the  world.\n\nIn barely more than a year, we have seen journalists covering  protests arrested. We have seen masked and unaccountable government  agents murder American citizens and then senior members of the  administration lying about who they were and what they were…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Romans, that because  she quoted it, she should be penalized for that.\n\nWe also heard from an Irish comedian who told jokes about  transgenderism in Great Britain, and he was arrested. He has since fled  to the United States, to a country in which you can still tell jokes  about transgenderism so far. You can still tell jokes about illegal  immigration…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…in D.C. is bleak. D.C.'s homicide  rate in 2024 was 27.3 per 100,000. That is the fourth highest in our  Nation. The first 6 months of 2025 alone, juveniles in D.C. were  arrested 900 times. Many of those arrests were for repeat violent  offenders. Around 200 juveniles arrested for violent crimes in 2024 had  prior violent crime arrests.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…office, and since that time, illegal  border crossings are down by 95 percent.\n\nImmigration and Customs Enforcement agents are working fast. In the  last 7 days alone, ICE arrested 130 illegal immigrants from Iran. Right  now, 670 Iranian nationals are being detained. President Trump's  detentions are working.\n\nNow the administration needs more resources…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of Jeffrey Epstein, which the  President's administration in 2019 indicted Epstein. They actually  moved forward and federally indicted him in 2019. Ghislaine Maxwell was  arrested by the Trump administration.\n\nI know the gentleman from Maryland will go on to say that the Biden  administration then carried forward that arrest, indictment, and  prosecution.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…border policy in North Carolina. Just last week, this picture to my  right, the FBI in Charlotte--and I want to give a shout-out to the FBI  agents based out of Charlotte. They arrested an illegal immigrant who  had already been deported.\n\nThat is a picture of him right there. He was charged with the  kidnapping of a mother and her 1-year-old child in Garner,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…gentleman is simply incorrect with respect to the  amount of evidence that has mounted over people who are voting and  should not be. The record is replete. In one example, ICE arrested  criminal illegal alien Ian Andre Roberts, who was serving as the Des  Moines, Iowa, school district superintendent at the time of his arrest.  After his arrest, it was found…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…didn't even have to  sneak in across the border. President Biden simply let them in through  the front door.\n\nAs just one example, less than 2 months ago, Federal officials  arrested a 33-year-old native of Gaza, who was living in Lafayette,  Louisiana, for his alleged involvement in Hamas' attack against Israel  on October 7.\n\nAfter learning about the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…hearing, following investigative  reporting by the Miami Herald detailing Epstein's controversial 2008  plea deal and highlighting accounts of his victims;\n\nWhereas Epstein was arrested in July 2019 and charged with one count  of sex trafficking of minors and one count of conspiracy to commit sex  trafficking of minors, and he was later found dead in the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]