[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…they needed a judicial warrant signed by a judge.  They needed to speak with the chief judge of Milwaukee County. The  chief judge told the agents that they could not make arrests inside  courtrooms or other private locations in the courthouse.\n\nThat makes a lot of sense. If people know they will be picked up by  ICE if they report to the courthouse,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…plate identifying who they are, and that they are held responsible  for excessive force.\n\nSecond, the GOP refused to join us in upholding the Constitution. Not  only are these arrests warrantless, but ICE has also now determined  they have the right to search your home without a judicial warrant.  That is illegal, and it is unconstitutional.\n\nThird, they…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…they have as their  title--from Minneapolis. And numbers are important. Part of the reason  for the brutality is the quotas that have been implemented and  exacted--quotas for arrests and detention. Those quotas haven't  changed.\n\nThe numbers of agents in Minneapolis may be reduced, but the  tactics--the police state and paramilitary tactics--that have…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the United States. It set quotas. It has moved away from  focusing on people with serious criminal convictions, and instead, it  is focused on getting the highest number of arrests and deportations as  possible, up to 3,000 a day.\n\nHomeland Security got $75 billion from Congress--not from votes on  our side. But it was really what allowed for this mass…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…targeting multiple       businesses in Downtown Los Angeles, including Korean-owned       garment factories.\n\nThese sudden and large-scale operations, which led to       numerous arrests, were reportedly conducted without prior       notice, causing severe disruption and significant damage to       the affected businesses.\n\nDisturbingly, reports indicate that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Nation to spend generations of debt on the backs of the  American people so that billionaires could get another small tax break?  No. What he did was deploy ICE to make mass arrests and terrorize  families in Los Angeles.\n\nWhen people went to go exercise their First Amendment rights, he  deployed the National Guard and then the United States Marines against…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…already passed laws  like the Trafficking Survivors Relief Act. It is past time that we take  similar steps to do this on the Federal level. By allowing survivors to  expunge arrests or vacate nonviolent convictions connected to their  trafficking, we give them a chance to reclaim their futures and move  forward without the weight of their past being used…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…physical       well-being. Nationally, pretrial detention is the riskiest       phase for in-custody deaths, and DC Jail is already unsafe.       Even before the recent wave of arrests by the current federal       executive branch, a report by the DC Auditor in collaboration       with the Council for Court Excellence (CCE) found that the       death rate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…raids do not make  our communities safer--and often have the opposite effect when done in  sensitive locations like courthouses and schools. That is 20 times more  agents, arrests, and illegal detention centers. Further, the Trump  Administration is diverting FEMA funds away from disaster recovery to  build and operate an inhumane new prison for migrants…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…raids are having on our communities.\n\nMy constituents have been surveilled, threatened, teargassed, hit  with pepper balls, and shot. They have been subjected to warrantless  arrests, rammed with Department of Homeland Security vehicles,  kidnapped, and disappeared. People keep asking us why DHS agents are  allowed to behave this way. Why isn't Congress…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…administration will do? Is there no line they will not cross? We see  lawlessness after lawlessness. We see threats to judges of impeachment  and of physical harm. We see arrests of Members of Congress. And now  this.\n\nAll of us have lived as part of a generation since World War II that  was used to seeing our freedoms ever expanding. We saw walls…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…government.\n\nMr. Speaker, how can we even trust that these are government  officials? It is nothing more than kidnapping, and it needs to stop.  There should be no more secret arrests and no more plainclothes agents  waiting outside of courtrooms. This kind of thing does not happen in  democracy. It doesn't.\n\nThe only way to protect Americans from these…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…now the agriculture interests are getting  involved. They should get the policy together.\n\nIt speaks to an underlying problem here, which is that the  overwhelming number of arrests now are not of people who are criminal  suspects for anything. Mr. Speaker, 65 percent of the people who have  been taken by ICE since this administration began had no criminal…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…complete chaos--while he was saying that, there might  have been two or three protesters outside the ICE building conducting  themselves peacefully; there have been weeks with no arrests--that is a  real invention.\n\nWhen our Governor talked to President Trump, she pointed that out,  and I gather he was like, ``Well, I have seen the tapes.'' I don't know  what…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…immediately. ICE must adhere to the Constitution and use only judicial  warrants for its enforcement operations. Instead, just last week, ICE  directed its officers to conduct more arrests without any warrants at  all.\n\nDHS law enforcement officers must be clearly identifiable and  prohibited from hiding behind masks. Racial profiling in immigration  enforcement…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699595/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…Over the last 10 months, our Federal officers and agents have faced a  dangerously escalating pattern of violence, ranging from hitting,  spitting, kicking, and biting during arrests to vehicle-ramming, open  gunfire, and throwing Molotov cocktails--all because they are doing  their jobs that they took an oath to do to protect other human beings.  From…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…isn't just a DOJ and FBI problem. Whistleblower  disclosures provided to my office showed that the Obama-Biden  administration's then-Secretary of State John Kerry obstructed arrests  of indicted Iranian terrorists. Kerry did so to score political points  with Iran for the failed nuclear deal.\n\nMy consistent efforts to let in sunshine continues across…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…one of the most important of which is to get help to  people who have drug issues and need treatment.\n\nThat was a big part of the initiative, is that people who have repeat  arrests for abusing drugs can be offered treatment as an alternative to  incarceration.\n\nThe Governor is refusing to fund the treatment programs that are  needed.  He is all too willing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…homicide  rate in 2024 was 27.3 per 100,000. That is the fourth highest in our  Nation. The first 6 months of 2025 alone, juveniles in D.C. were  arrested 900 times. Many of those arrests were for repeat violent  offenders. Around 200 juveniles arrested for violent crimes in 2024 had  prior violent crime arrests.\n\nMr. Speaker, this isn't rehabilitation. This…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…The District of Columbia has seen a staggering increase in juvenile  crime since the pandemic. According to the Metropolitan Police  Department, 51.8 percent of all robbery arrests in 2024 were juveniles,  and 53 percent of all carjacking arrests in 2025, as of August, were  juveniles.\n\nCongress must respond to these violent crimes being committed by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 4323) to provide for the vacating of certain convictions and  expungement of certain arrests of victims of human trafficking, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 4323\n\nBe it…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…shouldn't have been driving, unauthorized  possession of a firearm, and other crimes.\n\nYet we act like this isn't occurring. I have dozens of other examples  right here of arrests that have been occurring this year.\n\nMr. Speaker, I note that a couple of things that are important for  the American people to see is that this administration has driven…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…pandemic,  juvenile crime has surged. More than 2,000 juveniles were arrested in  both 2023 and 2024. According to the Metropolitan Police Department,  over half of robbery arrests last year were juveniles. This year,  juveniles account for more than half of carjacking arrests. This  legislation responds to that reality.\n\nCurrent law allows juveniles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…doubt, that the previous administration welcomed  millions of illegal aliens into our country when, during the first 50  days of the Trump administration, ICE made over 32,809 arrests, which  included 14,111 convicted criminals, including 1,155 criminal gang  members.\n\nWe cannot allow those kinds of folks who are in our country illegally  to take money…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…Department of Justice. Congress is  responsible for the oversight of the Department of Justice.\n\nWhen will we see justice? I will tell you what I have not seen. I  have not seen any arrests from the revelations in the Epstein files,  over 3 million documents describing horrible things, describing  unspeakable things, much of it redacted.\n\nOver two dozen people…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700177/justice-for-epstein-victims"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…MAST. You have to direct your remarks to the Speaker.\n\nMr. MAST. I would point to just Canada, number one. Canada, in the  last year, had an additional 8,000 fentanyl-related arrests because  they finally started cracking down on it. There was an increase of 80  percent that was seized at the U.S.-Canada border because of the  actions taking place, so,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…since President Trump was  sworn into office, the daily number of border crossings has plummeted  to record lows. Currently, our Border Patrol agents are making fewer  than 50 arrests per day at the U.S.-Mexico border. Under President  Biden, Border Patrol was averaging more than 1,000 arrests a day.\n\nPresident Trump has promised to secure our border and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…ICE arrested 7,000  gang members from America's streets. This includes a criminal illegal  alien from Venezuela, an active gang member. The perpetrator's rap  sheet includes arrests for homicide, assault, cruelty toward children,  domestic violence, and damaged property. He entered the U.S. in 2022  and was released by the Biden administration. ICE arrested…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…released a majority staff  report just last year. That report made public FBI emails that showed  agents tried to arrest high-level Iranians but were stopped from making  those arrests. Those agents were stopped then from doing their jobs  because of political considerations relating to the 2015 Iran nuclear  deal that President Obama was so intent upon…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…wonderful State of Tennessee, Memphis saw the highest  crime rate per capita in 2024. But since September, the  administration's Memphis Safe Task Force has made more than 4,200  arrests, including hundreds of warrant arrests for domestic violence,  aggravated assault; and dozens more for narcotics, sexual assault, and  homicide. They also have located more…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}]