[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…reach the President's desk and get signed into  law.\n\nAnd so I look forward to continuing to work in that spirit to  continue the conversation with my colleague from Alaska to arrive at a  balanced, bipartisan package of bills and work together to advance  them. Therefore, I must object at this time.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696139/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…what was on the horizon.       And so it is in that role--as the Congresswoman for the       Massachusetts Seventh and as the Co-Chair of the House Haiti       Caucus--that we arrive here today.\n\nReviving the Haiti caucus was a significant priority for       me, because my district represents the third largest Haitian       diaspora in the country. More…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…Holiness Ecumenical Patriarch Bartholomew, to Washington, D.C.\n\nThe longest-serving Archbishop of Constantinople in the history of  Christianity, the Ecumenical Patriarch will arrive in the United States  this month to receive the distinguished Templeton Prize. This  prestigious award will be presented in recognition of his ``pioneering  efforts to bridge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…concerned.\n\nThis meeting has filled me with a renewed sense of optimism for the  days ahead, for it is clear that these young women and men are not  waiting for the future to arrive. They are shaping it. They labor to  build a society that is more just, more inclusive, and more responsive  to the needs of all people.\n\nLet us take the inspiration from their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…if you work hard your entire  life and pay into Social Security, it should be there for you when you  retire, and you should not have to question that those paychecks will  arrive and that the government should strive to improve service to you,  not brag about cutting it; basic American principles like, if you serve  your Nation in the military, if you…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…action or debate.\n\nMr. BLUMENTHAL. Mr. President, first, let me say I am hopeful that we  can work together--if the chairman of the VA Committee is willing to do  it--to try to arrive at language that calls for the rehiring of these  veterans, rescinding the layoffs.\n\nI must say that we are joined today by a number of guests of my  colleagues as well as…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…did not have the opportunity to travel to New York. In  an interview with The Daily Memphian columnist Geoff Calkins in  January, Liddell explained that many of his students arrive at the band  room with no prior knowledge of jazz. He added: ``The City of Memphis  is why I do what I do.'' Over the years, the numbers in the Central  jazz band jumped from…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691133/congratulating-memphis-central-high-school-jazz-band"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…quiet champions of our schools working diligently, day in  and day out, to ensure that our learning environments remain clean,  safe, and welcoming. They are often the first to arrive and the last to  leave, faithfully fulfilling their duties with dedication and pride.  National Custodian Day was first established in 1972, when a group of  educators and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…river was not  visible during the day that the bomb was dropped and the days afterward  because of the number of bodies that just covered the surface of that  water.\n\nWhen you arrive at the memorial location, you can see bottles of  water that many people who attend these memorials will leave for the  thirsty souls of those who perished and those who were…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…collapsed       and wept before.\n\nYou witness speeches, polished, practiced, refined,\n\nWhat you don't see are the staffs who write drafts, fix       flaws, and make sure we arrive on time.\n\nAnd if we sound wise--sagacious on camera or TV shows--\n\nThe true heft we carry wasn't born from our highs,\n\nBut was forged through our lows.\n\nSo dear Pages, a truth…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…our low-income clients, Boston, MA.\n\nMs. CASTOR of Florida. Mr. Speaker, the bill also says it would gut  the ability of manufacturers, consumer groups, and others to arrive at  consensus.\n\nMost of what happens when the Department of Energy goes to update  energy efficiency standards is that everyone gets together and they  work out a consensus.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…reconciliation bill. I want us to  remember what is going to be voted on in this package, and it is a  thing. It is a thing that it is actually taking so long for this  package to arrive on the floor.\n\nDo you know why it is a thing? Because we have a House majority  trying to wiggle through the truth and figure out a way to spin death,  destruction, and poverty.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…delayed checks, websites crashing, and field  offices closing.\n\nMy district office in Raleigh, North Carolina, has received panicked  calls from seniors whose checks didn't arrive on time for the first  time ever.\n\nSeniors' benefits are under attack, and Donald Trump is to blame. We  will not be silent while Trump and his cronies try to slash the  benefits…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691162/threats-to-social-security"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…focus on the concrete reality  that a family is going to face if the Affordable Care credits expire.\n\nNo. 1, as Senator Shaheen said, this can't wait. The date is going to  arrive; the tax credits expire; people depending on that healthcare  won't have it. Twenty-four million Americans will face higher costs.\n\nAgain, I want to emphasize that is not 24…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…with a family that has been on my mind, a mom-to-be who  is 5 months pregnant. She and her husband are happy. They are in love,  and they are excited for their daughter to arrive. Every month, their  budget is tight. They get a little bit of help from food pantries, but  sometimes, even if they arrive by 6 a.m., the food is already gone.  Without the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688082/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…with  dispatcher Brenda Dawes, who started guiding her on how to perform CPR.\n\nBrenda was able to walk Josie through the proper CPR technique while  they waited for EMTs to arrive. When asked about who was in her mind  during this traumatic experience, she responded: Jesus.\n\nMr. Speaker, I ask my colleagues to join me in honoring this  remarkable young…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…enforcement. FBI comes in and helps them  solve crimes.\n\nTribal law enforcement also relies on the FBI. Tribal leaders  frequently describe the long wait times for police to arrive and the  countless criminal investigations left unsolved because there aren't  enough FBI agents.\n\nMr. Speaker, when you cut funding for the FBI, as Republican  President Trump…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…have different party affiliations and different ideas about how  we should solve problems can come together to try to build consensus  and to work through our differences to arrive at a policy framework  that gets at least 60 percent support in this body. The result of that  process is a product that has been stress-tested by Members on both  sides and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…heartily say: Absolutely not.\n\nTo the children at risk of falling behind in lagging schools all over  this country, I ask: Should we continue to allow millions upon millions  to arrive here illegally and crowd out your classrooms?\n\nI would say, again: Under no circumstances should we give public  education dollars to any person or any family who is here illegally.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…threat, Lieutenant Hall entered the camper,  removed the victims, and quickly administered critical first aid.\n\nIn a moment of crisis, Lieutenant Hall was among the first to arrive,  and when faced with danger, he did not pause. Lieutenant Hall's bravery  and quick thinking saved these lives and stand as a testament to the  selfless courage of the public…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692605/recognizing-the-bravery-and-life-saving-response-of-lieutenant-brandon-hall-of-buchanan-county-virginia"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…an invaluable part of the YMCA family. Teresa's impact can be felt  in every corner of the organization. She is involved in nearly every  event hosted--always the first to arrive and the last to leave. Whether  she's assisting with youth programs, supporting fundraising  initiatives, or simply offering a warm smile to a member in need,  Teresa gives…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692159/recognizing-teresa-piechowicz"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Congressional District.\n\nFirst responders, fire departments and emergency medical service  teams are summoned on short notice to serve their respective  communities. Often, they arrive at scenes of great adversity and  trauma, to which they reliably bring strength and composure. These  brave men and women spend hundreds of hours in training so that they…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and Means Committee members  Representatives Kustoff and Chu.\n\nFor too many Americans, help from the Federal Government after a  natural disaster can take too much time to arrive. This bipartisan bill  authorizes the Treasury Department, in consultation with FEMA, to  postpone tax filing deadlines for Americans living in State-declared  disaster areas…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…closes, families face hours-long drives in  emergency situations, expectant mothers lose access to obstetric care,  and seniors suffering from a heart attack or a stroke may arrive too  late.\n\nAs we mark National Rural Health Day this week, we must renew and  strengthen our commitment to rural hospitals by ensuring fair  reimbursement, strengthening telehealth…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…a lifeline. It  supports infrastructure planning by providing accurate data for  economic development. It reduces mail inconsistencies, ensuring that  packages and letters arrive where they are intended.\n\nSeniors and veterans have suffered vital and lifesaving medication  delays just because they were lost in the mail, which is entirely  unacceptable…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}]