[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…first-ever  indoor rendering of First Honors for the President by the military.\n\nI want to thank Abbie Platt, another former JCCIC staffer, and  McKinley Scholtz for their artistic eye, attention to detail, and  perseverance in the face of change, which made this year's inaugural  luncheon a success. We are grateful for the support of Korbel, Lenox,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…been a place where  Americans of every background could come together to experience  excellence in music, theater, dance, and culture. It was built to  foster national unity, artistic expression, and America's creative  spirit, not to feed the ego of a single individual.\n\nUnfortunately, over the past year, we have watched the systematic  takeover, with…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, today I rise to salute the work of Barry  Hoffman, founder and artistic director of the Symphony of Westchester,  which began in 1984.\n\nBarry has blended together 50 outstanding music professionals to  perform classical music works for adoring…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696750/saluting-the-work-of-barry-hoffman"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I rise today to recognize the tremendous  contributions of Maggie Mancinelli-Cahill, Producing Artistic Director  of the Capital Repertory Theatre, as she retires from her storied  career bringing the joy of live theater to patrons across the capital  region and beyond.\n\nSince…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695332/recognizing-maggie-mancinelli-cahill"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Professionally, Rob was an iconic figure in film and television whose  work will endure for generations. And Michele's own leadership--behind  the camera and in support of artistic expression--were integral to the  couple's success. Their partnership was a testament to the power of  collaboration and the beauty of shared purpose--and their legacy lives…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Diego.\n\nMr. Barajas served in the United States Air Force from 1961 to 1964.  During his service,  he worked as a Technical Illustrator, a skill that would later  influence his artistic career. He was recognized as a Newfoundland Air  Force Base Boxing Champion and honorably discharged as Sergeant.\n\nAn Associate of Arts graduate of Los Angeles Trade Technical-College,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…throughout our city, providing  opportunities for local professionals to share their talents on the  stage and behind the scenes. We are blessed to have a vibrant and ever- growing artistic community in Rochester. The Rochester Community  Players have been at the helm for an entire century, a remarkable  accomplishment.\n\nI congratulate President Michael Krickmire…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689016/congratulating-rochester-community-players"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…communities preserve memory,  identity, and family history, often drawing inspiration from our city's  legacy as the birthplace of modern photography through Kodak Park.\n\nBeyond his artistic practice, Jason manages the International Plaza,  a vibrant cultural and economic hub that celebrates the diversity of  Rochester, New York. Under his leadership, the Plaza…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…serving  more than 3,300 students with over 200 dedicated teachers.\n\nRooted in blue and gold and soaring under the banner of the eagle,  Leyden's commitment to academic and artistic excellence has inspired  pride, unity, and spirit across the district's communities.\n\nTrue to its mission to educate, enrich, and empower, Leyden does more  than reach; it…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…event; and\n\nTherefore, be it proclaimed that we, the 20th Congressional       District of Florida, do hereby commend CaRiMi for their       dedication to innovation, artistic excellence, and cultural       preservation, and express gratitude for the joy and       inspiration they have provided countless fans worldwide.       Their legacy is a testament…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Competition,  Addelynn's artwork will be proudly displayed on the walls of the  Capitol where visitors from across the United States and the world can  see our community's artistic and creative talent.\n\nI personally can't wait to see Annette's smiling face each time I  walk to vote on the House floor.\n\nIn addition to recognizing her exceptional artistic…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690574/champion-of-the-week-addelynn-ferguson"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…etched in the Grand Rapids Sports Hall  of Fame, a testament to his dedication to both sports and education.\n\nPaul Collins, Artist: Paul Collins has spent his life using his  artistic talents to tell the stories of those often overlooked.\n\nBorn in Muskegon and raised in Grand Rapids, Collins was drawn to art  from a young age. Despite initial discouragement,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…neighborhood of Hartford, Connecticut. Over its storied 100-year  history, the club has grown into the premier location for members to  enjoy organized social, intellectual, and artistic gatherings.\n\nOn May 21, 1925, just five years after the 19th Amendment guaranteed  women's suffrage, 400 women founded the Town & County Club as  Hartford's first private…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…experience as an African  American woman, but that still resonate with people from all  backgrounds. Her work is important and will doubtless be viewed as one  of the premier artistic vehicles for social change in the modern era.\n\nI had the distinct pleasure of welcoming Ava DuVernay to Capitol Hill  when she visited Washington, D.C. in 2024. Joined by…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…three decades,  this esteemed event has served as a cultural touchstone, welcoming  visitors from throughout the greater Washington, D.C., area and  exemplifying the spirit of artistic expression and community  engagement.\n\nSince its founding, Art on the Avenue has attracted tens of thousands  of attendees each year. The festival features the work of more…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696005/recognizing-30-years-of-art-on-the-avenue"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Ridge, presenting compelling  performances and fostering a broader appreciation for opera in western  Virginia.\n\nOver the years, the company has benefited from remarkable artistic  leadership and the guidance of legendary mentors, such as Eleanor  Steber and Irene Dalis. A special thank you to the board of trustees,  who have contributed to the success…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…a member-driven space where artists come together to sell  their work, share resources, and support one another.\n\nFor five decades, it has been a cornerstone of Savannah's artistic  community and a vital part of River Street's identity. The gallery has  showcased the work of countless local artists, offering visitors  ceramics, fiber art, jewelry, paintings,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…architectural heritage, and cultural identity.\n\nSince opening its doors in 1925, the Hanford Civic Auditorium has  served as the cornerstone of community life--a vibrant hub for artistic  performances, civic engagement, and social events. From city council  meetings and public forums to receptions, family reunions, and  community celebrations, it has hosted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}]