[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…1969, where he would  serve as a member of the 20th Infantry Regiment and platoon leader for  the 75th Ranger Regiment, acting as a go-between for teams in the field  and artillery and air support units in the sky. When he was later  transferred to the 173rd Airborne, he served as a liaison officer,  bringing aid and support to local villages.\n\nHe received…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…consequential moments in history. He served  as a radio operator, one of the Army's most dangerous and essential  roles, and in 1943, as a Tech 5th Grade with the 347th Field Artillery  Battalion of the 91st Infantry Division, known as the Wild West  Division in Italy. He contributed to the Allied victory that preserved  freedom for future generations.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699857/in-memory-of-donald-l-kuehl"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…``war criminal.''\n\nHe is not seeking peace. He is seeking domination. He is unserious  about the negotiations that are taking place right now. He wages war  not only with artillery and armor but with cyber attacks, propaganda,  disinformation, energy blackmail, systematic brutality. And he believes  that time is his ally. He believes that democracies…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…pivotal assignment on D-day  that would change the course of the war forever. He and his fellow  Rangers would scale 100-foot cliffs on ropes and find and destroy  German artillery that posed a huge danger to the Allied troops landing  on the beach below.\n\nUndaunted by the impossibility of this task, Mr. Lomell and his  platoon undertook their task.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Army, one of the ethnic armed  organizations controlling parts of Burma, is continuing to displace the  Rohingya. Many other Burmese citizens are fleeing bombardment by junta  artillery and warplanes. Despite these horrors, many countries are now  refusing to accept any Burmese refugees--including, regrettably, the  United States, which recently banned all…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Male High School to the United States Army and served in  Italy in World War II.\n\nIt was in April of 1944, in the Italian countryside, that Squires  braved automatic gunfire, artillery, and mortar  fire to carry messages through barbed wire and over minefields, to  organize troops, and bring reinforcements to the front line. With total  disregard for his…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…who had the privilege of working with him.\n\nWalt's military career spanned a total of 12 years, including 9 years  of active duty and three years in the Army reserves. As an artillery  crew member on active duty and a finance specialist during his time in  the reserves, Walt's expertise and commitment to service were clear. He  deployed to Afghanistan…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "French Hill", "party": "Republican", "sentence": "…living alumnus.\n\nHe is a World War II veteran. John was drafted at 18 and served in  England, Belgium, Germany, France, and the Netherlands as an Army  corporal in the field artillery attachment of the 5th Army Division,  the 9th Army spearhead, the 5th Armored Division, and the 29th Division  in Operation Kaput.\n\nJohn married his wife, Beverly, in 1947.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…and  teamwork and caring for the brother to the left and right of you. His  focus, even as a young soldier, was always on people.\n\nIn 1985, he earned his commission in Field Artillery at the Winona  State University Reserve Officers' Training Corps. When he entered  Active Duty, 2 years later, he transitioned to the Infantry.\n\nFrom the outset, General…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nForty-eight (48) M142 High Mobility Artillery Rocket       Systems (HIMARS)\n\nNon-Major Defense Equipment:\n\nThe following non-MDE items will also be included: M1084A2       HIMARS resupply vehicles; M1095 trailers; Low…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…congressional certification transmittal number       22-60 of the possible sale, under Section 36(b)(1) of the       Arms Export Control Act, of eight (8) M142 High Mobility       Artillery Rocket System (HIMARS) Launchers; thirty-six (36)       M30A2 Guided Multiple Launch Rocket System (GMLRS)       Alternative Warhead (AW) Missile Pods with Insensitive…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…terror and chaos the men of  the 116th saw.\n\nMr. Slaughter was one of more than 34,000 Americans who stormed the  beach over the several days of the operation and faced heavy artillery  from the Atlantic Wall and the Nazi war machine.\n\nMr. Slaughter, 19 years old at the time, lived through the horrors  and mass casualties of D-day. His company faced heavy…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…carpenter, Crane was a leader of the Sons of  Liberty and was the only rebel injured during the Boston Tea Party.\n\nCrane recovered and was commissioned as a Continental Army artillery  officer who distinguished himself at Bunker Hill. Despite losing part  of a foot to a cannon shot in 1776, he continued to serve and became  the top commander of the U.S.…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…rejoined his unit in the  pivotal battle of Okinawa, where he fought valiantly for 45 days. While  advancing on the enemy position, incoming fire forced him to take cover  in an artillery shell hole. Looking out to spot the enemy, he was shot  through the face. Unconscious for a time, he woke to feel a gaping hole  in his face. Confronted with the thought…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…of them veterans, produce, repair, and innovate the  equipment our troops depend on from the front lines to forward  operating bases.\n\nEvery rifle sight calibrated, every artillery shell inspected, and  every 3D-printed replacement part shipped from Rock Island shortens the  time between a soldier's need and the answer that keeps that soldier  alive.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…distinct honor to recognize Mr.  John Moddie on his 100th birthday and to commend him for his valiant  service with the United States Army as a member of the 590th Field  Artillery Battalion, 106th Infantry Division during World War II.\n\nAt just 18 years old, while working as a stock clerk at Peterson Boat  Works in Sturgeon Bay, Wisconsin, Mr. Moddie…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695299/recognizing-mr-john-moddie-on-his-100th-birthday-and-for-his-service-with-the-590th-field-artillery"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…clearing the coastline for advancing Army units.  Later, it provided support during the Invasion of Southern France.  During combat, Radioman Scarpelli was wounded by land artillery and  treated at a field hospital before rejoining his ship, where he  continued his duties, including cutting mine cables and neutralizing  deadly sea mines.\n\nIn one remarkable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…He graduated from Westfield  High School in 1957 and earned his degree from Siena College in 1961.  Soon after, he completed Officer Basic Training at the U.S. Army Field  Artillery School in Fort Sill, Oklahoma, and was deployed to Korea with  the 7th Infantry Division, where he helped defend the Demilitarized  Zone. After being honorably discharged…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691577/recognizing-jay-post"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nTwenty-six (26) M142 High Mobility Artillery Rocket Systems       (HIMARS).\n\nOne hundred thirty-two (132) M31A2 Guided Multiple Launch       Rocket System (GMLRS) Unitary pods with Insensitive Munitions       Propulsion…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…landing beaches, Omaha and Utah. It was heavily defended by       the Germans and the mission of Colonel James Earl Rudder's       225 Rangers was to disable five 155-millimeter artillery       guns, which could have rained artillery fire on the American       forces landing on either beach, jeopardizing the invasion.\n\n(7) Unknown to the American forces, the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Indian inhabitants through the military era. One of its  largest events, the old-fashioned Fourth of July celebration, features  costumed re-enactments, kids' activities, and artillery demonstrations.\n\nFort Laramie continues to be a small town with big character. Friends  and neighbors pride themselves on caring for each other. Visitors are  greeted with…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}]