[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Arthur Lane for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nArthur has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691861/recognizing-arthur-lane"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Isabella Garcia  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nIsabella has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691774/recognizing-isabella-garcia"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Lilith Roberts- Ruiz for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nLilith has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691136/recognizing-lilith-roberts-ruiz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Eamon VanDyke  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nEamon has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691744/recognizing-eamon-vandyke"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Carlos Alberto  Gutierrez Pachecho for earning the Arvada Wheat Ridge Service  Ambassadors for Youth Award.\n\nCarlos has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689812/recognizing-carlos-alberto-gutierrez-pachecho"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Abdullahi Ali  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAbdullahi has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690274/recognizing-abdullahi-ali"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize the 125th  anniversary of Arvada High School.\n\nFor more than a century, Arvada High School has been a central part  of the community, empowering students with the tools they need to  succeed in their future…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695847/recognizing-arvada-high-school"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Devonte  Bonggas-Ellenburg for earning the Arvada Wheat Ridge Service  Ambassadors for Youth Award.\n\nDevonte has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691185/recognizing-devonte-bonggas-ellenburg"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Julissa  Martinez for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nJulissa has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691749/recognizing-julissa-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Marisol Chavez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nMarisol has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690220/recognizing-marisol-chavez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Adrienne Van  Bruggen for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nAdrienne has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691190/recognizing-adrienne-van-bruggen"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Bellatrix Fail  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nBellatrix has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689798/recognizing-bellatrix-fail"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Makila Cordova  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nMakila has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691484/recognizing-makila-cordova"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Dayanara  Tiscareno Escalera for earning the Arvada Wheat Ridge Service  Ambassadors for Youth Award.\n\nDayanara has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691002/recognizing-dayanara-tiscareno-escalera"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Aden Cordova  Rubio for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nAden has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690372/recognizing-aden-cordova-rubio"}]