[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Amica Center for Immigrant;       Rights; Amsale Aberra Law, PLLC.\n\nAnimal and Earth Advocates; Ann Fromholz, The Fromholz       Firm, PLC; Ariel Law; Arseneault & Fassett, LLC; Asian       Americans Advancing Justice-AAJC; Asian Law Caucus; Autistic       Self Advocacy Network; Barbosa Group; Beckner Immigration       Law, PLLC; Bendit Weinstock, P.A.;…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Chairman, as chair emerita of the Congressional Asian  Pacific American Caucus, I rise in strong opposition to the DETERRENT  Act.\n\nFor now, the American university research system is the envy of the  world, but the DETERRENT…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…becomes a person of African ancestry,  their blood and that sort of thing. We knew there were six. There were  five persons who were Latinos. There were four persons who were Asian.\n\nSince the signing of the Voting Rights Act of 1965, section 2 of the  Voting Rights Act, section 4 of voting right act, section 5 of Voting  Rights Act. All of these in concert,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…minority communities are startlingly high, more  than most people would realize, with approximately 65 percent of Latino  students, 75 percent of Black students, 90 percent of Asian students  unable to digest dairy milk without detrimental effects.\n\nThis portion does, in fact, follow the science. These statistics are  real, and they are played out every…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698179/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…by advancing our  efforts to lift the outdated Jackson Vanik amendment, which has long  been an irritant in the trade relationship between the United States  and the Central Asian nations. Lifting this amendment would underscore  the U.S. commitment to the region, and provide the stability needed to  foster mutual investment and growth. We also hope…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…this Nation as a  young paratrooper leading an infantry platoon in the invasion of Iraq.  I think about the faces of those young men whom I was responsible for,  Black, White, Asian, Hispanic, from the North, from the South, East,  and West, from farms and from cities, rich and poor.\n\nWhen I think of America, I still think of those young paratroopers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Mr. Speaker, I am pleased to include in the Record the  following letter congratulating the Asian Pacific Islander American  Public Affairs Solano County Chapter ahead of their 10th Anniversary  and Celebration of Young Leaders banquet.\n\nThe Asian Pacific Islander American…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694253/congratulating-the-asian-pacific-islander-american-public-affairs-solano-county-chapter-ahead-of-their-10th-anniversary"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…know who you are. I understand that there is an  attempt to roll back the clock. People of color are becoming suspect in  this country. You can be African American; you can be Asian; you can be  Latino; we are moving toward your being suspect.\n\nThere are people of good will of all colors who are going to fight  this. I pray that we will succeed. There…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…highest Medicaid enrollee  districts in this country are in California, and some of them are  Republican districts.\n\nI think we all want to know, Black Americans, White Americans, Asian  Americans, and Latino Americans, all Americans want to know: Are you  going to cut their Medicaid? Are you going to cut their Social  Security?\n\nMr. Speaker, 140,000 children…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…United States in St. Malo, Louisiana in  1763.\n\nSince those early beginnings, our Filipino American community has  grown to nearly 5 million people and is the third largest Asian  American and Pacific Islander group in the United States. Many of the  early Filipino immigrants were young men who came to the United States,  most to Hawaii, California,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, I join my colleagues in honoring  Black History Month and uplifting the connection between the Black and  Asian community.\n\nAs a Member of Congress who is part of both the Black and Asian  community and the Civil Rights Task Force chair of CAPAC, I want to  acknowledge the long history…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687997/black-history-month-and-the-alliance-between-the-black-and-asian-community"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…It is the  basic infrastructure of diplomacy.\n\nWhy is this bill important right now?\n\nFirst, our strategic interests in the Indo-Pacific. ASEAN, the  Association of Southeast Asian Nations, is central to U.S. engagement  in Asia. Recognizing its diplomatic status here in the United States  shows our commitment to the region's future and to working with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, on behalf of the Congressional Asian Pacific  American Caucus, I rise in strong opposition to H.R. 881. This bill  would block Department of Homeland Security funding from colleges and  universities with a Confucius…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…are critical of Trump and his policies.  Effectively, the President of the United States got to pick the person  who will oversee the Columbia Department of Middle East, South Asian  and African Studies as well as the Center for Palestine Studies. That  is extraordinary. That is not what happens in a healthy democracy--the  leader of the country micromanaging…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Security benefits. Without Social  Security, 52.2 percent of older women would live in poverty. About 45  percent of Black seniors, 52 percent of Latino seniors, and 41 percent  of Asian-American seniors rely mostly or only on Social Security for  income. This effort to gut Social Security is an appalling illustration  of the highest level of greed, where billionaires…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…equivalent students (as defined in section 312(e) of such Act       (20 U.S.C. 1058(e))) that is a total of at least 50 percent       Black American, Hispanic American, Asian American (as defined       in section 371(c) of such Act (20 U.S.C. 1067q(c))), Native       American Pacific Islander (as defined in such section), or       Native American…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Herbert: Bloomberg       Industry Group; Jacobs, Benjamin: Politico; Janifer, Salina:       TR Tax & Accounting; Jaworski, Thomas: Tax Notes; Jayaraman,       Thirumal: South Asian Herald; Jin, Yan: Caijing Magazine;       Jindra, Naomi: Broadband Census; Johnson, Derek: Scoop News       Group; Johnson, Fawn: Bloomberg Industry Group.\n\nJohnson, Lydia:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…world and the       10th largest goods trading partner of the United States.\n\n(3) Although Taiwan is not an IMF member, it is a member of       the World Trade Organization, the Asian Development Bank, and       the Asia-Pacific Economic Cooperation forum.\n\n(4) According to the January 2020 Report on Macroeconomic       and Foreign Exchange Policies of Major…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Relations Act''       or the ``PARTNER Act''.  Sec. 1. Short title; table of contents. Sec. 2. Extension of privileges and immunities to the Association of                Southeast Asian Nations. Sec. 3. Extension of privileges and immunities to the European                Organization For Nuclear Research (CERN). Sec. 4. Extension of privileges and immunities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and Exchange Commission.\n\nThis change would place the IDA on equal regulatory footing with the  other World Bank divisions such as the Inter-American Development Bank,  the Asian Development Bank, the European Bank for Reconstruction and  Development, and the African Development Bank.\n\nPrior to 2018, the IDA did not issue debt in the securities markets.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an  outstanding member of our community, Executive Director of the  Association of Asian Pacific Community Health Organizations Jeffrey B.  Caballero, MPH, who has received the Hepatitis B Foundation's 2025  Community Leadership Award.\n\nPrior to becoming Executive…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Golden State is expected to lose 17 percent of  its capacity in the next year. This has led to an average gasoline  price of nearly $5 per gallon, an increased fuel dependence on Asian  producers, and jeopardizing the fuel supply chain of military  installations in their State.\n\nWe must not let this become status quo across the country. H.R. 3109  requires…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…value exceeding $7 billion and support over 75,000 jobs.\n\nOne of the greatest challenges facing the Great Lakes is the threat  of invasive species, such as the sea lamprey and Asian carp. To counter  these invasive species, Tribal, Federal, and State agencies introduce  hatchery-raised fish to encourage the recovery of native species. For  example, in…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…stuff in Missouri, too, with factories in  small towns all across our State; but as we welcomed China into the  world economy, Toastmaster began to feel the squeeze of cheap Asian  imports. By 2001, every Toastmaster plant in our State was gone,  shipping hundreds of jobs from rural mid-Missouri to China. The last  one to go, in the town of Macon--near…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…showcase not only extraordinary talent but also the spirit  of unity and joy that defines this wonderful celebration.\n\nIn eastern Washington, we are proud to have such a vibrant Asian- American community. For more than 170 years, Asian, Native Hawaiian,  and Pacific Islander families have helped to shape the cultural fabric  of the inland Northwest.\n\nAs…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Sarah: C-SPAN; Balinovic, Daniel: REUTERS RADIO & TV; Ball,       George: WJLA-TV/NEWSCHANNEL 8; Ball, Homa: WTTG-FOX       TELEVISION; Ballou, Jeffrey: ABC NEWS; Banda, Eshwar: ASIAN       NEWS INTERNATIONAL; Banks, Joshua: FOX NEWS; Banner, Jillian:       WASHINGTONPOST.COM; Bannigan, Michael: FOX NEWS; Bannister,       Craig: CNSNEWS.COM; Barbash, Jack:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…their home heating and local industry needs. In addition  to providing gas to Alaska, the Alaska LNG pipeline will be able to  export 20 million tons of LNG yearly, reaching our Asian allies in 6  days with no strategic choke points. It is no exaggeration to say that  creating this pipeline is one of the most crucial steps we can take to  counter China's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…lands.\n\nOne area of the bill that perhaps gets a little more parochial--but,  obviously, an issue of very real concern--is a focus on invasive  species.\n\nWe don't happen to have Asian carp in Alaska. We want to keep it that  way. I know that, in many parts of the South, Asian carp is a threat,  an invasive species that needs to be dealt with.\n\nUp on the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]