[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…public view on President  Trump's mad declaration that we have a border emergency with Canada  happening right now.\n\nI can tell you that if I go home to Rhode Island and ask people what  the emergency is in their lives, I wouldn't get one person who said:  Oh, we have got a real emergency with Canada. They are a huge threat.  That whole Canada situation,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…asking ICE to obey,  but right now, ICE is a rogue force. Lawlessness prevails when ICE  arrives.\n\nIf Republicans want to claim our proposals are nonstarters, they  should ask the people back home what they think of masked agents,  warrantless searches, and using kids as bait to arrest their parents.  These are not actions of real law enforcement. This…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700064/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…burn and  tax and deport and destroy?\n\nJesus' last words were uttered in the Aramaic language, and he  breathed his last breath asking why he had been forsaken. We can ask  this for people we know and we can do something to help. Some of us  must ask during Passover and Easter week who is being forsaken in this  wild rush to endow the billionaire class…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Bennet for participating as well and all the others who did as  well.\n\nWell, we know that free and fair elections are the very wellspring of  American democracy. When you ask people around the world ``What is  great about America?'' this is one of the first things they say: ``They  have elections, real elections, free elections.''\n\nBut unfortunately--deeply…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…troops go into war knowing that the civilian  leadership of this country have had the hard debate in view of the  American public and decided that the stakes are sufficient to ask  people to make the ultimate sacrifice.\n\nBut how dare we--how dare we--and I say this as the father of a U.S.  marine: How dare we ask people to make the ultimate sacrifice if we…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Member of Congress, when I go to Congress, we all go to Congress.\n\nInstead of assuming that I knew what mattered the most to people in  my district, we sent out a survey to ask people in Ohio's 13th what  mattered most to them. Thankfully, more than 2,000 people took the time  to respond.\n\nWhat they told us was pretty straightforward. They wanted me to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is completely closed. What does that  mean? It means nobody can offer amendments. Democrats can't offer  amendments. Republicans can't offer amendments. They didn't even ask  for people to submit amendments. They like to say nobody offered  amendments. Yeah, people did offer amendments.\n\nThe gentleman talks about the SCORE Act. A Republican came to the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republicans,  to address the affordability crisis. That is what the American people  want, not this report.\n\nMr. PALLONE. Mr. Speaker, my point is that this report does not ask  the people that are doing it to look into the change of law that would  be necessary in order to bring refineries back.\n\nThe reason why we lost so many refineries, particularly on…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…places that are not blessed with the  kind of competitive capitalistic markets that we have in the United  States; and, number two, they are doing everything they can to ask  people in this body to please prevent capitalism from eating my lunch  because I cannot compete in a competitive market. That is what is going  on.\n\nThe reason why we are spending…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…lot of  things that this took place.\n\nDoes the President have a plan for the future? He does, 100 percent:  free and fair elections, freedom for the people of Venezuela. Ask the  people of Venezuela if that is what they want. Ask the people of  Venezuela if they are better today than they were before  President Trump snatched up Maduro. They will tell…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…stage, the global stage, for the United States of America  and for the American people. The tariff policy that he has implemented  is bringing people to the table.\n\nPeople ask: Why are people wanting to talk to President Trump in the  Middle East as he is there visiting?\n\nThey see how much they want to get his ear. It is because he has  reset the table and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…significance.\n\nAgain, the facts speak for themselves. Mr. Speaker, if you want to  look at the top 12, it is New England, New Jersey, and New York. If you  want, Mr. Speaker, ask these people who live there, or ask their  Governors, their State legislators, or their regulators why their  prices are so high.\n\nIt is simple. It is because, again, these States…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…House are not  particularly concerned about.\n\nThe night that I told the President he should find a replacement--the  press has gotten this wrong. The President did not ask for people to  replace me, and then I decided to retire. The President and I were  having a dialogue that night. I told the President that I thought it  was time for him to look for…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone is a geek out there--it is probably 4 or 5 years old--the  University of Chicago, four of their Ph.D. economists wrote a brilliant  paper talking about: If you actually ask people to participate in  society, in the economy, to take a job, even if you give them welfare  or government subsidies, because they have an attachment to the  economy, to work,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…reason we are not prepared is that there are way too many  people who are not working as hard as they could in the Pentagon. I am  going to ask the press corps to wake up and ask people about that.\n\nI will also ask the press corps to wake up and ask Congress whether  it is appropriate that we penalize married couples by $25,000 or  $35,000 a year because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…they conduct their behavior in their communities each and every day.\n\nMr. Speaker, how do we figure out where to start? I think this bill  is a very commonsense answer: Ask the people who are most affected. The  whole point of the red tape hotline that President Trump set up and  that this bill codifies and makes permanent is to allow the people in…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…vote.\n\nIf they still want to lie to people on the other side, Mr. Speaker,  if they still want to try to scare people and talk about Jim Crow, then  you might want to ask those same people why the Democratic Party at  their convention just in 2024 required photo ID to get in. You couldn't  get into the Democratic convention without showing a photo ID.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}]