[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…colleague--my California colleague-- Senator Alex Padilla, being forcibly removed from a briefing by the  Secretary of Homeland Security's staff. He went there to observe and to  ask questions, and I watched with horror on this video, seeing these  agents grab my colleague--my fellow Senator from California--grab him,  push him out of the hearing, as he was identifying…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and the consequences of unilateral military  action; an administration that openly disdains and threatens a free  press, ignoring the fact that our fourth estate exists to ask questions  for the people, even if those questions are uncomfortable--especially  when those questions are uncomfortable--and shine a light on the places  where tyranny and despotism…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…knows how  by doing the thing that is in our Constitution--freedom of speech,  article I--by exercising his constitutional rights and his rights as a  U.S. Senator to ask some questions of government officials. He was  doing his job.\n\nHis job is oversight, oversight of the Department of Homeland  Security. This is in a Federal building, and this didn't…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…these forever wars.\n\nMr. MEEKS. Mr. Chair, in response to the chairman, I will say that we  asked those questions in the 117th and the 118th Congress. We  continually ask the same questions. We have gotten the answers, and I  think it is time to move on and to get this done.\n\nMr. Chair, I am pleased to yield 1\\1/2\\ minutes to the gentleman from  Texas…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695262/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and, worst of all, sets the stage for even more harmful cuts down the  line.\n\nThe so-called rescissions package continues a destructive Republican  pattern: Cut now and ask questions later. The same thing that is  happening with FEMA and the National Weather Service is happening right  here. Again, use that chain saw; cut, cut, cut--whether it is waste…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…the  great teachers they had along the way who taught them things, but more  importantly, who taught them how to learn, made them excited to learn,  who challenged them to ask questions about the world because as James  Baldwin said: No society progresses without those kind of teachers  around them.\n\nMrs. LaPointe's nomination came from a former student…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699985/recognizing-sondra-lapointe"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I am going to ask two questions. I am going  to tell a story about something that happened recently in Virginia and  ask my colleague from Oregon what he thinks about it, and then I am  going to hand…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…from the detention facility to other  immigration facilities across the U.S. to block legal action. As this  headline says, ICE's strategy is to ``Detain people first and ask  questions later.''\n\nSimply put, ICE is not following the law. They are part of an out-of- control Federal agency, indiscriminately kidnapping people off the  streets, and sowing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…forcibly reject what happened to a U.S.  Senator and to send the message that in this democracy it is just, it  is right, it is part of our responsibility to speak up, to ask  questions, and to be able to have the knowledge we need to represent  the people that we come here for.\n\nWe use our voices, we use our votes to be a part of this democracy,  not…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…California--the senior Senator from California--Alex Padilla. He is at  a press conference in California, where the Secretary of Homeland  Security is, and he wants to ask some questions, with all that is going  on in California. Look, I don't know what all happened, but Federal  agents took him down--took down a U.S. Senator--saying that they are  doing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692552/alex-padilla"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Guard and marines, which have  only inflamed peaceful protest, and they have thrown down to the ground  a U.S. Senator, my U.S. Senator, and handcuffed him for trying to ask  questions to DHS Secretary Noem.\n\nThis is happening because the administration does not like that they  have different opinions from the State of California.\n\nMy constituents deserve…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692443/californians-should-continue-to-peacefully-protest"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…genetic mutations.\n\nTo say it differently, if grandpa had it, his descendants might, too.  Check family trees. Talk to parents. Talk to loved ones. Take a moment  and ask those questions. How did great-grandpa die? What was his  ailment? What was the history in the family? It may very well save a  life.\n\nAccording to the National Cancer Institute, many…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…country. Fire the civil  service. Get rid of those people. Threaten to imprison judges.  Criminally charge House Members who try to visit an ICE facility.  Arrest Senators who ask questions.\n\nThis is not a drill. This is an assault on our democracy. I am  calling on my Republican colleagues to join us in demanding a  bipartisan investigation into this incident.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…floor as an  American proudly and profoundly shaped by the wonder and joy of public  television.\n\nMister Rogers taught us how to be a good neighbor. Bill Nye inspired  us to ask questions and never give up on the search for discovery.  ``Sesame Street'' taught us how to read and count while instilling  values of sharing and empathy.\n\nMr. Speaker, I would…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690775/fighting-to-reinstate-funding-for-public-television"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…``If it is viable, and it is going  to create jobs, and it is going to do these great things, we are going  to support that project.''\n\nThe Secretary said that he would ask these questions to make the  decisions: Is the investment legal? Is the technology viable? Is the  engineering done competently? Is there a market for it? Does it add to  our national…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…House, that we come up with a system that allows the body to  work its will and that we allow individuals to be able to move forward  in good faith to get information and ask questions of the executive  branch, no matter who is in power.\n\nI introduced the ARTICLE ONE Act to try to restrict Presidential  power under the Trump administration the first time…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…colleagues to support the DETERRENT Act. Doing  so will help defend against our adversaries while also holding our  institutions to a higher standard. Take foreign money first, ask  questions later is not the way to go.\n\nMr. WALBERG. Mr. Chair, I yield 3 minutes to the gentleman from  Washington (Mr. Baumgartner), who is the sponsor of this legislation.\n\nMr.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…the deal: When you are sitting there in a sitting  committee, and you are having communications with a convicted sex  offender, and you are taking their advice on how to ask questions,  maybe you have a problem. Maybe your problem is that you brought  disrepute on the House.\n\nThis isn't from the articles. This is from the 10,000 pages or so  released…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696896/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…crypto is pretty harmless. It is about like banking. I  mean, cash isn't technically illegal. When you go to the bank and ask  for any significant amount of it, they always ask questions. That is  because of the Bank Secrecy Act, the anti-money laundering laws, the  know your customer laws. ``What are you going to do with all that  cash?'' ``It is my cash.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…our division in the  dialogue, and I heard three young parliamentarians from other countries  talk about how hard they were working.\n\nPart of our job as Senators is to ask hard questions. It is to pose  challenges. It is to test the Cabinet of the President, to visit  Federal facilities, to ask questions that are sometimes uncomfortable  or unwelcome.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…public service did not stop at casework. She created mobile  district office hours so Idahoans--especially those living in small,  rural areas--could meet with my staff, ask questions, and find out how  we can help when problems arise.\n\nShe also created an event known as the ``Funders Fair,'' a one-stop  shop where federal agencies and organizations…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…The reason was the Bureau was less interested in the cost of the rule  than in expanding their own regulatory reach. This rule is a perfect  example of regulate first, ask questions later. That was the approach  of Director Chopra.\n\nUltimately, this style of regulation is going to chill innovation and  hurt the smallest players that depend on these…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…at least it does that.\n\nTo the apologists of the Democrats' open-border policies who say that  this is unnecessary and covered by other laws on the books, I would ask  these two questions: First, if that were so, then where were those laws  under Joe Biden?\n\nSecond, even if their argument was true and the legislation was  entirely unnecessary, then…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}]