[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the  Coast Guard by unanimous consent, before the end of the year. If he is  to be the head of the Coast Guard, this new nominee must reverse this  egregious policy, and I am asking him right now: Change that policy  now.\n\nLet's be very clear. If you are a Jew, if your family gave their  lives to fight the Nazis in World War II, if you are a minority in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…without teachers, schools without support, and communities left behind.\n\nI have stood arm in arm with Delaware educators, parents, and  students who are pushing back. They are asking for a fair shot, and we  should be investing in their future, not abandoning them.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697941/condemning-the-illegal-efforts-to-dismantle-the-department-of-education"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…operate undetected.  We hope this will ensure local communities have the access and the  resources necessary when a biological threat emerges.\n\nToo often, local officials are asking: Who do we call? Who has the  authority? Who has the expertise? Our legislation helps answer those  questions before another emergency unfolds.\n\nMr. Speaker, first responders…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…prospect worried about whether the employees and executives and their  families will have access to good healthcare.\n\nSo on the healthcare piece of this, what Democrats are asking for by  way of an alternative--not a nonnegotiable but by way of an  alternative--is let's go into the changes that were made in the  reconciliation bill and fix them.\n\nI have…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ever-changing tariff regime.\n\nMr. Chair, as we consider this bill, it is important that we consider  the context in which it will be implemented, if enacted into law.\n\nThis bill is asking the Department of Energy to do more with less.  Elon Musk and the DOGE minions decimated the Department of Energy,  purging more than 3,500 dedicated and hardworking Department…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…us rich. They  will pay; we won't. It is to bring manufacturing back here. Or it is to  punish folks that he deems unworthy. It depends on the day, and it  depends on who is asking. So there is no coherent rationale connected  to the imposition of this enormous economic pain and cost increase that  is being imposed on American businesses and American…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…woman, 63 years old, whose health insurance is going to  more than double each month. She doesn't make a fortune as a waitress.  She makes a basic wage in tips. And now she is asking me as her U.S.  Senator: Why did you do this to me?\n\nWell, my answer is: We have a chance this week to change it.\n\nAnd that is what I told her.\n\nIf we can get a bipartisan…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Chair, the gentleman from New Jersey is asking for  a review that has already been done. The Department of Defense in no  uncertain terms stated in this December 2024 letter, just 10 months  ago, that the Revolution Wind…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695152/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…their lactose intolerant child as having a disability, especially given  the high prevalence of lactose intolerance. So they may not realize  that they can write a letter asking for their child's school to provide  a milk alternative, and it creates an undue stigma.\n\nI want to thank my colleagues and their teams for their receptiveness  to my concerns.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697063/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…after a  young scientist who is living paycheck to paycheck who will not be able  to pursue a research career developing treatments to help others get  better.\n\nNow, you may be asking yourself: Why are Donald Trump and Elon Musk  doing this? Well, the answer is pretty simple--so they can give tax  breaks to billionaires. Why are they cutting off clinical…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…skyrocket  and housing remains unaffordable.\n\nUnfortunately, the Republican rip-off is a slap in the face to  working families.\n\nTrump, Elon Musk, and House Republicans are asking us to support  axing Medicaid by $180 billion, even though food stamps reduce rural  poverty. Republicans will cut this program too by $230 billion.\n\nRepublicans are defunding…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688020/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…of  that debate was that we need oversight. We need to make sure that we  know what we are doing. We need to make sure that what the  administration or any administration is asking for comports with the  policies of the Congress of the United States.\n\nIf we defeat the previous question, we will offer an amendment to the  rule that allows the House to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…in public safety, then we must start treating it like what it  is: a public health emergency.\n\nThat means commonsense gun reform, investments in trauma-informed  care, and asking ourselves: How many more funerals before we decide  enough is enough?\n\nTo the families who have suffered the unspeakable tragedy of losing a  loved one, I hear you, I see you,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690802/mourning-marshaun-futrell-jr"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…millions of dollars. And yet this kind of behavior that makes it  more dangerous for the flying public, they get no recourse. We don't  even know who stuck it in. People should be asking: Who stuck in this  language? Who is standing by it? Who is committed to it? Who thinks it  is a good idea? Because none of the safety advocates think that it is a  good idea.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…stability shattered, and their futures       uncertain? This is not a theoretical issue. These are the       very real questions that our residents and community members       are asking themselves as TPS for Haiti is set to expire on       February 3rd. For our children, what is next for them if this       protection is stripped away? Separating families in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…It ensures we are getting the necessary rounds  back into the magazines of our servicemembers, whether they are  training at home or deployed in harm's way.\n\nLet's be clear: Asking our troops to be ready to fight tonight  without basic tools to complete their mission is a risk that we are not  willing to take. This bill prevents that from happening.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…time to provide high-quality care.\n\nThis system will offer better tracking, better forecasting, and  better accountability. We are not reinventing the wheel. We are simply  asking the VA to adopt the same kinds of tools  and best practices that are already being used in the private sector  and to do so in a way that is transparent, results-driven, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…hands.\n\nA Democrat in the Committee on Rules this morning stated that:  Republicans would cut off your limbs and let you bleed to death, in the  context relating to a patient asking for help with a cold.\n\nIt was an absolutely disgusting remark that has no place in this  debate. Is this what Leader Jeffries wants to come to the floor to  state, that we…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "Mr. COONS. Madam President, I am asking why we are here--why we are  here on the floor of the Senate as the hours tick down to the end of  the Federal fiscal year and the shutdown of the Federal Government.\n\nI have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I thank my good friend Representative Jack for  asking me to do that. I think he has raised the expectations here, so  we will see what I can do.\n\nMr. Speaker, I have been in Congress now for 10 months, and this is  the second…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…simple: The purposes of this  tool is to identify obstacles that need attention, and regulations that  function well do not require intervention.\n\nSmall businesses are not asking us to preserve the status quo. They  are asking to eliminate the barriers that prevent them from thriving.  By isolating problematic rules, we empower Congress and Federal…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the  Medicaid program and you find out that a half a billion dollars has  been used to provide benefits for people who are not even residents of  the State, you ought to be asking questions.\n\nIn Illinois, the State's auditor general found that the government  paid out more than $5 billion in fraudulent unemployment insurance.  Well, do you know what?…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "John James", "party": "Republican", "sentence": "…works.\n\nWe are keeping a promise that should have been kept a long time ago:  real transparency, real competition, and real power will be back in the  hands of patients.\n\nI am asking every one of my colleagues to join our bipartisan bill,  Republican and Democrat, to stand with the families getting hammered by  these bills.\n\nMr. Speaker, cosponsor the Patients…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Venezuela. I know they all predicted  there was going to be some forever protracted war, but we were never at  war with Venezuela. There are no boots on the ground. Democrats are  asking us to vote on a resolution about a situation that literally does  not exist.\n\nWe do not have anybody there in Venezuela fighting. There are no  tanks on the ground in Caracas.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Speaker, the American people have felt the same  uncertainty, years of what many viewed as America last policies that  left families struggling, dreams deferred, and our Nation asking  itself: Are we on the rise or decline?\n\nTo answer that question, we need to look at where we have been for  the last year. We need to look at the results that this President,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…wanted, and hopefully  they will grow and thrive.\n\nIn Congress, let's try to get back one more time to the limited  government that our Constitution so clearly demanded and stop asking  the Federal Government to add another program after program after  program, but instead, have the type of government that encourages self- reliance and strong families.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695805/what-charlie-kirk-stood-for"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…standardizes labeling to empower adult  consumers to make informed choices, and requires independent third- party laboratory tests for consumable hemp products. They have been  asking Congress to pass legislation to responsibly regulate their  industry.\n\nRather than adopt this common-sense regulatory framework to protect  children and allow adults to make…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…problem. That is today. Keep in mind, the power needed  for AI is also growing exponentially, further creating a more difficult  problem for us.\n\nThird, grid operators are asking for dispatchable resources, such as  coal, natural gas, and nuclear. Yet, we continue to incentivize the  opposite.\n\nThese reliable resources are being prematurely retired,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Commerce-Justice-Science funding bill, I secured over $7  million for radio communications and equipment upgrades for Nebraska  law enforcement. Nearly a dozen counties reached out to my office  asking for help replacing outdated systems and gear. With these  upgrades, officers will be able to communicate, and they will be able  to respond faster. And this will improve safety…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…in the United Kingdom  are starting to question the decision of Prime Minister Starmer.\n\nThe House of Lords, one of the legislative chambers in Great Britain,  has started asking a lot of questions. The people of Great Britain have  started asking a lot of tough questions.\n\nPrime Minister Starmer--there will be an election soon. There may be  a snap…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}]