[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…they are identifying, screening,  engaging, and supporting foster and adoptive families, in consultation  with people with lived experience.\n\nTo me, one of the most critical aspects of this will be engaging with  the child's family, whether it is by placing foster children with  family members directly or making space for kin who can't be foster  parents…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Congress has a heart problem and is  in need of moral surgery. Why else would you propose, among other  things, to cut up to $880 billion from Medicaid?\n\nI could talk about many aspects of this budget tonight, but I will  just stick with Medicaid, programs that provide healthcare to the most  vulnerable citizens, the children, to the severely disabled, to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…may need more funding, not less.\n\nThe proposed House bill requires the Committee on Energy       and Commerce to find $880 billion in spending cuts, which       means some aspects of Medicaid, which the committee oversees,       may be on the chopping block.\n\nMedicaid is a massive . . . program that provides free and       reduced-cost health care for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Trump threatens Republican Members who demand justice in this matter.  Like Epstein survivors, the majority are now terrorized by men in power  to stay silent. I know that many aspects of this criminally corrupt  scandal are horrible to look at and think about, but we don't have to  be divided. Together, we can be the solution and send a message that we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…place and purpose in  the world'' and that ``Bartholomew has also deepened Christians' ideas  of what it means to be faithful in the world today. It involves caring  for all aspects of God's creation including the people around us and  the natural world in which we live.''\n\nI join American Orthodox Christians, environmentalists, and  peacemakers in welcoming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…educating,  training, and empowering its participants in African-centered rites of  passage, process, rituals, customs, and practices.\n\nIts further purpose is to promote all aspects of healthy growth and  development of individuals, families, and the community of African  descent in Akron, Summit County, and surrounding areas.\n\nFive years ago, the Akron…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…hate, we all  can take steps to end this violence.\n\nIn the Biden administration's national strategy to counter anti- Semitism, the U.S.' first-ever blueprint, it called on all aspects of  society to commemorate JAHM and use it as a tool to fight hate. That is  because we need Jews and non-Jews alike to learn about all the  remarkable Jewish Americans who…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and, unfortunately, all too common for veterans, in particular.\n\nThe VA's Breast and Gynecological Oncology System of Excellence is  well positioned to handle the clinical aspects of coordinating  veterans' cancer treatment, both at VA and its specialists in the  community.\n\nHowever, regardless of where individuals are receiving care, cancer  treatment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695419/women-veterans-cancer-care-coordination-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…time for the opening of the tax filing season       on January 26, 2026.\n\nImplementation required substantial changes to OTR's       systems and taxpayer forms for nearly all aspects of income       and franchise tax filings by District residents, trusts and       estates, as well as all corporations, unincorporated       businesses, and partnerships doing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong support of H.R. 1717, the  Communications Security Act.\n\nOur Nation's communications networks play an important role across  many aspects of our daily lives. We are more connected than ever  before, and it is vital that we do all we can to protect this critical  infrastructure and ensure it is reliable and available…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…right.\n\nUltimately, our job is to protect this institution as a coequal  branch of government, and you and I share that sincere belief. I think  these are just some technical aspects we could work out, and I look  forward to that opportunity.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Chair, I yield 1 minute to the  gentlewoman from California (Ms. Jacobs).\n\nMr. SMITH of Washington. Mr. Chair, I yield myself the balance of my  time.\n\nMr. Chair, there are two aspects. One is a budget debate, and it is  fascinating. We are having this passionate debate about $115 million,  and we didn't, apparently, have that debate when we passed the budget…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you do this, you become a de  facto dictator--you reduce the country to a de facto dictatorship--and  for this you must be impeached. The Articles will go into many other  aspects of this, but for these things you must be impeached\n\nThese Articles of Impeachment I shall bring, I have said that I would  and I will, but I want to give everybody notice…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…tirelessly with the Capitol Police, Tyler Pumphrey and Liz Aduso from  the Office of Congressional Accessibility Services, and other Capitol  Hill and DC partners to plan all aspects of the guest experience on the  west front of the Capitol. With the help of Michelle Reinshuttle, on  loan from the Capitol Police Board staff, Maggie's team maximized on-…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…priority for this country to meet our national security needs,  and this bill does that. The House really led on that, and I think it  is really important.\n\nThere are other key aspects of this bill. We have others outside of  the jurisdiction of the NDAA who are part of this, including Coast  Guard reauthorization, Foreign Affairs reauthorization, and the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Service'' award and its ``Distinguished  Stateswoman in Aviation'' award.\n\nMary's contributions are aptly described as ``the wise, trusted  relational bridge to many and varied aspects of the aviation  community.'' The bridges Mary has built have been used for decades by  industry leaders, government officials, and organizations to refine  policy aims, regulatory…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…advice and assistance to the Under Secretary       and coordinate with the Associate Administrator for       International Affairs in carrying out spectrum management       aspects of the international policy responsibilities of the       NTIA, including spectrum-related responsibilities under       section 103(b)(2)(G);\n\n``(7) carry out spectrum-related…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…Programs Subcommittee, I rise in  strong support for H.R. 7006.\n\nThis full-year funding bill really carries out our Nation's foreign  policy in a historic way in so many different aspects. First and  foremost, the bill restores fiscal sanity by reducing spending by 16  percent, which is nearly a $10 billion cut, in recognition of the  President's and the Secretary…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…applicants, and greater transparency and  predictability on environmental review and permitting schedules for  project sponsors and stakeholders.\n\nThe ePermit Act would codify key aspects of CEQ's action plan and  provide Federal agencies with direction on implementation of electronic  permitting systems. It would also instruct CEQ to work with other  agencies…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…of  this. But make no mistake, it was the Chinese Communist Party and its  policies that took a wrecking ball to the international trading system.  Yet, like so many other aspects of Friedman's piece, he gives the CCP  and Xi a pass on this most consequential point.\n\nU.S. Senators on both sides of the aisle, including those who don't  even get out much,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…resource values and to protect       and enhance access for subsistence activities throughout the       NPR-A. The rule also revised BLM regulations to incorporate       certain aspects of the 2022 ROD, such as the Special Area       designations and leasing and infrastructure allocations       adopted in the ROD.\n\nOn January 20, 2025, the President issued…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…associated with the application of regulations identified in       subsection (b)(1) to the operation of commercial amphibious       vessels;\n\n(3) An evaluation of whether aspects of the regulations       established in section 11502 of the James M. Inhofe National       Defense Authorization Act for Fiscal Year 2023 (46 U.S.C.       3306 note) should…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…be that one of the analogues--I am not  saying it will and I think the odds are slim, but it is possible that  one of the analogues will have a blocking effect on the deadly aspects  of fentanyl itself, and that would be a huge positive.\n\nWhen my colleague says that it has nothing on dealing with the  problem as far as people who have an addiction, he…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…requiring the Federal Reserve to conduct a  review of the discount window to identify deficiencies and develop a  remediation plan. This review will identify improvements in all aspects  of discount window operations, including technology, operating hours,  stigma, and interaction with other providers of liquidity, including  the Federal Home Loan Banks,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…confusion of why would you dismantle the Department of Education,  I will make sure I do my part, and I have spoken about this to a lot of  constituents back home. One of the key aspects and the things that are  important under title I is making sure that we have underfunded  communities well represented.\n\nMy son is on an IEP. He is a 9-year-old in the third…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…speed rounds, signature  cocktail pairings, and original recipe presentations.\n\nAs Georgia's sole finalist, he embraced that responsibility with  pride and excelled in all aspects.\n\nFor more than a decade, Nic has pursued this title with determination  and focus. As he himself said: ``No matter how much you want something,  no matter how long it takes,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "James Risch", "party": "Republican", "sentence": "…assistance.\n\n5. Foreign loans.\n\n6. International activities of the American National Red       Cross and the International Committee of the Red Cross.\n\n7. International aspects of nuclear energy, including       nuclear transfer policy.\n\n8. International conferences and congresses.\n\n9. International law as it relates to foreign policy.\n\n10. International…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…price, instead of other technical or operational factors  in Federal procurement, can result in agencies cutting corners, long- term value being sacrificed, or in its worse aspects, even potential  risks to America's national security.\n\nIn my view, the use of the LPTA may not always be appropriate when  Federal agencies purchase innovative technologies…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…conduct a remote or video       inspection of a unit provided that the remote or video       inspection--\n\n``(I) covers a substantially similar review of the relevant       aspects of the unit compared to an in-person inspection;\n\n``(II) does not misrepresent the condition of the unit; and\n\n``(III) provides the information necessary to fully and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…issuers and offerings of securities subject to       such section 5;\n\n(iii) corporate governance;\n\n(iv) financial statements and the components of such       statements;\n\n(v) aspects of unregistered securities, securities issued       by private companies, and investments into private funds,       including risks associated with--\n\n(I) limited liquidity;…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}]