[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the workforce--making sure that we have access to medical  care, housing, and behavioral health and to deal with what we know in  2023 was a decades long, uncovered, sexual assault and sexual violence  coverup in the Coast Guard.\n\nOperation Fouled Anchor identified 62 substantiated incidents of  rape, sexual assault, and sexual harassment perpetrated…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…organizations, and mortgage services unsure how the closure would be  administered, and what would happen to veterans that are already  reeling from this administration's assault on veterans and our economy.  We write today to urge you to immediately reverse this decision, and  avoid foreclosing on veterans who simply wish to keep paying their  mortgage…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…sabotage the independent oversight of inspectors  general. Meanwhile, it has been crickets from Republicans. They are  just happy to let him do it.\n\nNo nominee has exemplified the assault on independent oversight quite  like March Bell, the nominee to serve as Health and Human Services  inspector general.\n\nI would be remiss if I didn't start off by noting that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…here in the United  States of America, all over, in urban America, rural America, small- town America, suburban America, exurban America, and the heartland of  America.\n\nThe assault on the social safety net that Republicans have engineered  this Congress, Mr. Speaker, has been completely and totally  unacceptable, hurting everyday Americans and exploding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…to.\n\nAll of this is part of the dangerous campaign the Department of Labor  has launched to dismantle decades of progress for working Americans.  These rollbacks are a direct assault on workers' safety, wages, and  dignity.\n\nFrom healthcare workers, many of them women and women of color, at  risk of losing minimum wage and overtime protections; to construction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…President Trump has already  caused tremendous harm to Social Security, jeopardizing the well-being  of tens of millions of seniors, veterans, and people with disabilities.  This assault on Social Security is an assault on our nation's most  vulnerable and least secure. Across the nation, this damage is in  addition to his erratic  and senseless tariffs and…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Mr. Speaker, as we speak, House Republicans are finalizing  an extreme budget plan that includes the largest cut to Medicaid in our  country's history.\n\nThis is an outright assault on the healthcare of nearly 14 million  Americans, including over 370,000 people in my district, California's  29th.\n\nAdditionally, hospitals like Olive View Medical Center…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…especially at a time like this.\n\nI rise today not just with concern, but with alarm. In his first 100  days back in the White House, Donald Trump has unleashed a full-blown  assault on America, on our institutions, on our workers, on the rule of  law, and on democracy itself. This is not leadership. This is a broken  promise.\n\nI will talk a little bit…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…country.\n\nIn the middle of the night, Republicans on the Rules Committee will  consider a bill that contains the largest cuts to Medicaid in our  country's history. This outright assault on healthcare will result in  13.7 million Americans losing their health coverage, including many of  the 370,000 Medicaid beneficiaries in my district.\n\nThis includes people…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691409/gop-tax-scam-hurts-women-and-families"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Speaker, I rise today to defend Medicaid and the  Supplemental Nutrition Assistance Program, or food stamps, from an  ongoing Republican assault.\n\nIn a few hours Republicans will meet to advance a bill that abandons  Americans who are struggling with the cost-of-living crisis. It guts  Medicaid, which covers health…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691427/supporting-the-democratic-womens-caucus-on-defending-snap-and-medicaid-cuts"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to America because we had the best equipment, the best  experiments, and the best scientists, and they wanted to collaborate.  All of this is at risk.\n\nAmidst the Republican assault on science, I am going to focus my  remarks tonight mainly on the NSF.\n\nOn May 10, we celebrated the 75th anniversary of the National Science  Foundation. Today, together…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…the highest levels of the war,  despite all of the oily, phony, happy talk coming from Vladimir Putin  about seeking peace.\n\nOn Saturday, Russia launched the largest drone assault of the war,  with 805 drones and 13 cruise missiles, killing 5 people and hitting  the Cabinet of Ministers of Ukraine. The Tuesday before, a glide bomb  killed 23 Ukrainians.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695239/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Republican bill is flawed. By treating children as adults, Mr.  Speaker, you deny them protections from abuse from adults in prison,  including bullying, physical violence, sexual assault, and rape.\n\nThis Republican bill makes children's lives worse. Unlike in other  States, when kids in D.C. are treated as adults, the Bureau of Prisons  ships them hundreds…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that the  Department of Justice was giving to local police departments across the  country, community safety groups, and organizations assisting victims  of rape and sexual assault.\n\nAs far as we can tell, one person in DOGE, one unelected, midnight  bureaucrat whose career was made with Elon Musk, who seems to have  skipped town now, that guy cut out…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…video, to  gather some additional facts, to come to a conclusion. But we need our  Republican colleagues to be on the floor right now with us because this  is not simply an assault on Senator Padilla. This is not an assault on  Democratic Senators. This is an assault on the rule of law. This is an  assault on our democracy. And ultimately, we are robbing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692557/alex-padilla"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…real threats,  danger, and consequences.\n\nThat is why, today, I am introducing the Leo K9 Protection Act, a  straightforward bill to strengthen the penalties for those who assault  or injure these animals in the line of duty.\n\nI am proud to champion the Leo K9 Protection Act alongside the  dedicated team at K9s United, whose tireless advocacy ensures…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Speaker, last Monday marked a somber  milestone. It was 500 days since the horrific attacks on October 7,  2022, when Iranian-backed Hamas terrorists launched the most harrowing  assault on Israel and the Jewish people since the Holocaust.\n\nWe witnessed an unprecedented act of violence that shocked the world  500 days ago. We will never forget the 1,200 innocent…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Over the course of his military career, Captain Retzlaff completed  numerous schools, including the Armor Basic Officer Leader Course, the  Army Reconnaissance Course, Air Assault School, the Advanced  Situational Awareness Course, the Maneuver Leaders Maintenance Course,  and the Maneuver Captain's Career Course. His service has been  recognized with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…areas, but this is one area where I don't  like to brag about Alaska because there is not much to brag about. We  have some of the highest rates of domestic violence and sexual assault  than anyplace in the country--really bad.\n\nSo when I was attorney general a number of years ago, the Governor  and I launched this big initiative called the Choose Respect…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…introduced by Mr. Knott talked about Tren de  Aragua, and we see that Tren de Aragua has become embedded in our  communities. They are involved in violent crimes like robbery, assault,  and murder. They are involved in human trafficking, and they are  involved in narcotics trafficking.\n\nSo, Mr. Speaker, I believe that this legislation goes hand in hand…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…was issued a final order of removal  in 2022.\n\nICE also arrested a criminal illegal alien from Laos with three prior  convictions for selling drugs as well as convictions for assault and  contributing to a minor's delinquency. This criminal was issued a final  order of removal in 2009, Mr. Speaker.\n\nA criminal illegal alien from Mexico previously arrested…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Madam Speaker, I rise today because  democracy is under assault in my home State. California politicians,  led by the Governor, are throwing a grenade at our Constitution in  order to strip power from voters and seize it for themselves.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…But since September, the  administration's Memphis Safe Task Force has made more than 4,200  arrests, including hundreds of warrant arrests for domestic violence,  aggravated assault; and dozens more for narcotics, sexual assault, and  homicide. They also have located more than 120 missing children and  have recovered 970 illegal firearms and 560 stolen…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…respectively. During his 16-year career in the  Army, Rob served in key tactical and strategic positions. He has  successfully completed the Basic Officer Leader's Course, Air Assault  School, Marine Expeditionary Warfare School, and the Marine Command and  Staff College. Upon commissioning, Rob became a military police platoon  leader in Kandahar, Afghanistan,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Federal Reserve is, regrettably, not adding the  energy needed to abet this growth potential.\n\nAfter 4 years of inflation caused by excessive government spending  and an all-out assault on U.S. energy, our private-sector economy is  now in significant recovery, and it truly is only the beginning.\n\nTariffs are realigning supply chains here at home. By supply…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…The Biden administration's misguided decision to grant California  this waiver has serious implications far beyond the State of  California, impacting all Americans. It is an assault on our way of  life in northern Minnesota.\n\nMadam Speaker, I am not opposed to Americans having the ability to  purchase and drive an electric car, truck, or bus if they so…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Biden administration's disastrous energy policies that put  our energy security and the security of our allies at serious risk.\n\nThe White House launched a whole-of-government assault on American  energy production: slow-rolling permits; killing infrastructure  projects, like pipelines; and, most importantly, pandering to radical  climate activists. Then…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…As a result, victim assistance programs nationwide face a $600 million  funding shortfall. For organizations serving survivors of domestic  violence, child abuse, and sexual assault, including programs across  northeast Texas, where I represent, this means fewer services and, in  some cases, the risk of shutting the doors of organizations who are  helping…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698844/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…to Republicans' efforts, hard-working Americans and small  businesses have been spared these costly regulations.\n\nWe have also been able to dismantle Democrats' regulatory assault on  Americans' cars. President Trump repealed the Biden administration's  electric vehicle mandate, and here in Congress, we approved legislation  to repeal waivers that would…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…illegal alien who has committed many, many crimes.\n\nA criminal alien from Laos was also apprehended, with three prior  convictions for selling drugs, as well as convictions for assault and  contributing to a minor's delinquency. The criminal was issued a final  order of removal in 2009, but here we are.\n\nLikewise, law enforcement in Minnesota arrested a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]