[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…workforce--making sure that we have access to medical  care, housing, and behavioral health and to deal with what we know in  2023 was a decades long, uncovered, sexual assault and sexual violence  coverup in the Coast Guard.\n\nOperation Fouled Anchor identified 62 substantiated incidents of  rape, sexual assault, and sexual harassment perpetrated by at…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…healthcare.\n\nEqually important, this bill capitalizes on the extensive work that  former Commandant, Admiral Fagan, did to make institutional changes to  address sexual assault and sexual harassment.\n\nOur coasties deserve better, and this legislation provides oversight  and the tools needed for the Coast Guard to prevent these crimes,  protect victims,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…efficient for the officers nor responsible to the       residents of the District.\n\nThe conduct for those terminated officers included criminal       acts such as sexual assault, sexual abuse, indecent exposure,       solicitation of prostitution, domestic violence, receiving       stolen property, fraud, and false statements. For many of       those…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…merchant  mariner credentialing exam, and expanding the pool of eligible  mariners.\n\nFinally and importantly, the bill includes numerous provisions to  address sexual assault and sexual harassment within the Coast Guard.  These new requirements, directives, and oversight were developed  because the Coast Guard deliberately hid Operation Fouled Anchor…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…yield investments and marine research. Sec. 406. Additional response assets. Sec. 407. International maritime oil spill response.           TITLE V--SEXUAL ASSAULT AND SEXUAL HARASSMENT RESPONSE  Sec. 501. Independent review of Coast Guard reforms. Sec. 502. Comprehensive policy and procedures on retention and access                to evidence…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…communities.\n\nIn the first 6 months of President Trump's term in office, his  administration has removed more than 70,000 convicted criminals, many  of whom are convicted of assault, sexual crimes, kidnapping, and even  homicide.\n\nYet, despite their historic work enforcing our Nation's laws, our ICE  agents are facing a disgusting string of threats and violence…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}]