[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…system that fuels mass incarceration, racial       disparities, and benefits the 2 billion dollar bail industry.\n\nD.C.'s pre-trial system is grounded in individual       assessment, not based on wealth. The federal Pretrial       Services Agency for the District of Columbia evaluates each       person's likelihood of appearing in court and assesses…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…withdrawal takes effect. Withdrawing from  treaties may require an act of Congress. It would be a serious mistake  for the White House to go down that road, absent a thorough assessment  by the relevant executive Agencies and congressional committees of  jurisdiction of the pros and cons of doing so. Otherwise, it will be  just a matter of time before China…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…they vote for these crappy  rules that are totally closed, so that is a bunch of bullshit. Let's be  honest. That is what we are talking about here. That is not an accurate  assessment of what is going on here.\n\nThis is the most closed Congress in history. Republicans should be  ashamed.\n\nMr. Speaker, I remind my Republican friends, who kind of just go…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…year. The track team won a title at  the VHSL Championships. The production of ``Hairspray'' was a huge  success. The chamber orchestra earned straight superiors at their  assessment.\n\nPotomac Falls was named a National Model School this year, 1 of only  13 in the United States and the only 1 in Virginia.\n\nThese students have left their mark on Potomac…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…There,       the U.S. Department of Housing and Urban Development (HUD)       promulgated a 2015 rule, which, among other things, announced       that HUD would be rolling out Assessment Tools for certain       block grant program participants to use to demonstrate       compliance with a statutory requirement to ``affirmatively       further fair housing''…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…safeguards to ensure the  project's continued operation wouldn't harm the park.\n\nThese include prohibiting any expansion of the project within the  park, requiring safety assessment, and appropriate compensation for the  use of public resources.\n\nH.R. 1044 would build on that responsible approach. By allowing the  Secretary to continue renewing permits…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693462/amendment-to-kaweah-project-provision"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…blockade. That is it. That is the  plan.\n\nNot in the plan: positive change for the people of Venezuela. There  is no framework for elections or democratic transition, no serious  assessment of the rival political factions inside Venezuela--factions  that have been waiting for precisely this moment to seize power.\n\nI have seen no contingency plan for what happens…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…that he talked  about, if they were in the United States, they would have been tried in  our courts. That decision raises serious questions about the  administration's own assessment of threat, necessity, and purpose.\n\nThese strikes have not been authorized by Congress, and the  administration has not sought congressional authorization to use lethal…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…individuals who are involved in forced organ harvesting or trafficking.\n\nThe legislation will make sure the U.S. is carefully gathering all  the facts  to make an informed assessment on the magnitude and prevalence of this  problem and developing appropriate responses.\n\nThe trafficking of persons for the purpose of organ removal is a form  of trafficking…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…cybersecurity threats our mobile networks and mobile devices face at  the hands of foreign adversaries and other bad actors. Among other  things, the report will include an assessment of whether mobile  carriers have or have not addressed cybersecurity vulnerabilities in  their respective  networks. It will also include an analysis of whether there are…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693422/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…less than the kids in the suburbs. It is  not that they wouldn't study as hard. They would. It is just that they  don't have access.\n\nThe Department of Education's National Assessment of Educational  Progress, for example, has repeatedly shown that high-performing  students had much better access to the internet at home. I don't think  you have to be Horace…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Education. I also know that I, and every Democrat, will do what we can  to ensure the Department continues.\n\nNow to the issue at hand. As reflected in the latest National  Assessment of Educational Progress (NAEP) data, schools are struggling  to make up for lost time in the classroom following the COVID-19  pandemic. Achievement gaps, which existed before…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…implementation schedule, reports on VA's internal staffing levels  after support workforces were heavily depleted by the Deferred  Resignation Program and other attrition, and an assessment of its  recent failures in this modernization effort.\n\nThese updates represent just the most basic levels of oversight and  planning that VA should have done once it decided…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695397/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…confusing. The law  does not specify how the IRS must describe the math error or require  the IRS to inform taxpayers that they have 60 days to request that the  math error assessment be reversed.\n\nThis bill will fix these issues by requiring the Internal Revenue  Service to provide a clear and straightforward explanation of any  alleged math or clerical…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…strengthening our school system, it distracts from the  urgent challenges our schools are facing, such as widening achievement  gaps, as reflected in the latest National Assessment of Educational  Progress scores, the NAEP scores, and the growing difficulty of  recruiting and retaining quality educators.\n\nLet me underscore the broader point. My colleagues…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…If we are not  accounting for robust growth, which I think we will get, then we will  have an unclear picture, which is why I am leaning into OMB Director  Russ Vought's assessment of the bill.\n\nMrs. HOUCHIN. Mr. Speaker, I am prepared to close.\n\nMrs. HOUCHIN. Mr. Speaker, may I inquire how much time I have  remaining.\n\nI have got just a couple of things…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…containing the findings, conclusions, and       recommendations of the task force.\n\n(3) Contents.--The reports under this subsection shall       include the following:\n\n(A) An assessment at the lowest classification feasible of       the sector-specific risks, trends relating to incidents       impacting sectors, and tactics, techniques, and procedures…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…have yet to take advantage of this resource.\n\nMy legislation will advance America's bioweapon defense posture by  directing the Secretary of Homeland Security to conduct an assessment  of how, if at all, DHS has utilized this resource to address homeland  security needs. It also directs DHS to submit a strategy for how the  agency will coordinate with…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to the Committee on Financial       Services of the House of Representatives and the Committee on       Banking, Housing, and Urban Affairs of the Senate a written       assessment that--\n\n(A) describes the management and oversight activities of       the receiver or Federal monitor for the covered public       housing agency;\n\n(B) identifies the significant…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…``paragraphs (6), (8), (9), or (10) of section 5(a)''.       SEC. 7. CIVIL PENALTIES.\n\n(a) Determination of Liability; Amount; Participation by       Secretary of State in Assessment Proceeding.--Section 8(a)       (16 U.S.C. 973f(a)) is amended--\n\n(1) by striking ``Code'' after ``liable to the United       States''; and\n\n(2) by striking ``Except for…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…provision of covered technical       assistance builds capacity in communities to access other       water infrastructure programs carried out by the       Administrator.\n\n(5) An assessment of the needs of economically distressed       communities eligible to receive assistance under a clean       water infrastructure program carried out by the Administrator…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Secretary, acting through the head of ITS,       shall work with private sector entities and the heads of       appropriate Federal agencies, to--\n\n``(A) perform a needs assessment to identify and evaluate       the measurement, technical specifications, and conformity       assessment needs required to improve the operation and       reliability of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…unanimously rated Josh as  ``well qualified'' to serve on the First Circuit. I would note that  that is the highest possible rating for a judicial nominee. It reflects  the ABA's assessment of his integrity, experience, and temperament.\n\nThere were several compelling letters of support submitted to the  Senate Judiciary Committee in favor of Josh's nomination,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Mr. PFLUGER. Mr. Speaker, I thank the chairman for the time.\n\nMr. Speaker, I rise in support of H.R. 1736, the Generative AI  Terrorism Risk Assessment Act.\n\nThe mass adoption of artificial intelligence is the latest in a  series of technological revolutions that have permeated and influenced  every aspect of our lives.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Bachelors  of Arts in Secondary Science and Social Science Education from DePaul  University in 2011. While completing her Masters of Art/Ph.D in  Measurement, Evaluation, and Assessment from the University of  Connecticut, Kristen began her career in Washington, D.C. as a Student  Trainee for the U.S. Government Accountability Office before becoming  an…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691958/recognizing-kristen-pinnock"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…and debate as to whether or not we should go  forward with the military operation in question. That would paralyze  this country.\n\nAnd this leak of the defense intelligence assessment tells you  exactly what would happen if they brought this problem over to us to  solve.\n\nSo it has been clear to me that only five times in the history of the  country have…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "French Hill", "party": "Republican", "sentence": "…all Soviet-era geological surveys of Ukraine, both in  the contested Donbas region, as well as free Ukraine, and provide  Congress and the administration with an up-to-date assessment of the  strategic minerals available for Ukraine's further economic  development.\n\nThe time for action is now. Apparently, Putin needs more unified  pressure to convince…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…(E) a description of where new cutters and aircraft being       acquired as part of the program of record of the Coast Guard       will be assigned, including--\n\n(i) an assessment of the shoreside and infrastructure needs       for such cutters and aircrafts; and\n\n(ii) an assessment of whether existing facilities are       adequate to support such…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 1737) to direct the Secretary of Commerce to submit to  Congress a report containing an assessment of the value, cost, and  feasibility of a trans-Atlantic submarine fiber optic cable connecting  the contiguous United States, the United States Virgin Islands, Ghana,  and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…technology;\n\n(E) ACAS-X interoperability considerations for aircraft       operators (including rotorcraft operators) equipped with ADS-      B Out and ADS-B In equipment;\n\n(F) an assessment of safety benefits for aircraft operators       equipping with such technology, including civil and military       operators; and\n\n(G) any recommendations for administrative…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}]