[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…legal.\n\nThese are just three examples in a very long list, but the fact is  that President Trump has a record of chronic unlawful misuse of our  military and national security assets. This is dangerous to our  national security, the future of our democracy, and this behavior is  directly relevant to whether Congress should endorse an NDAA that, in  my opinion,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…the high seas, and from Somalian pirates, who are  plundering and pillaging at rates unseen in a decade.\n\nMy bill imposes sanctions on any pirates around the world, blocking  assets in or associated with the United States and denying them entry  into our country. As an international leader in trade and security, the  United States must seek to stop piracy…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…capital and management assistance to  growing businesses that are often underserved by traditional lending  institutions. By law, BDCs must invest at least 70 percent of their  assets in small and mid-sized domestic companies.\n\nOver time, BDCs have filled a crucial gap in our economy by funding  businesses in industries and geographies often overlooked by…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…We meet at a precarious moment, when we might be on the precipice of  war with that country. Today, in the Caribbean or on its way to the  region, are the following military assets: Three Arleigh Burke-class  destroyers, the USS Gravely, Jason Dunham, and Sampson; the USS Lake  Erie, a Ticonderoga-class guided missile cruiser; the USS Newport News,  a…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Nobody should be able to use this job  to profit personally. It is horrendous, and it is a huge problem. One  of the first things I did after being elected was move all of my assets  and those of my wife Gabby Giffords to a qualified blind trust--the  best standard identified by Senate ethics--and I think all Members of  Congress need to do that.\n\nThese…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…same time, our laws have not kept up with these novel crypto  products, and there is wide agreement that Congress must update our  laws to appropriately account for crypto assets. However, today's bills  are not the answer to that problem.\n\nThe CLARITY and GENIUS Acts are bad legislation. They are industry- written bills that give the crypto industry…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…informed, less sophisticated, and dumber investors.\n\nFinally, it would allow anyone to create a self-hosted wallet, which  is basically an online account where they can transfer assets between  anonymous users with absolutely no regulation. If the goal is to make  money laundering easier, then I have no idea how to make the CLARITY  Act better.\n\nYet somehow,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the Trump administration, the SEC has said that  memecoins, stablecoins, and bitcoin mining all do not fall under their  oversight. Can my colleagues imagine that?\n\nDo these assets sound familiar? Oh, yes, they do because these are  all ventures that Trump and his family are pursuing now with no  oversight by Wall Street's cop on the beat--that is the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…transparency, have longer lock-up periods, and are much more volatile  and less liquid than their public counterparts. It is critical that  anyone who invests in these risky assets have sufficient knowledge of  those risks.\n\nCurrently, companies, or the brokers they hire, can only solicit  these ``investment opportunities'' to individuals who have been…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…standing by silently as facts are erased, as the  pipeline of aid to Ukraine peters to a halt, as the Trump  administration disbands Federal task forces established to seize the  assets of Russian oligarchs and guard against foreign election  interference and disinformation campaigns.\n\nSilence is complicity. We cannot allow this to continue. If we are  going…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…risk--  i.e., the market realizes that climate risk is out there and has not  been priced adequately into financial documents--       could lead to a disorderly repricing of assets, which could       in turn have cascading effects on portfolios and balance       sheets and therefore systemic--  Systemic--       implications for financial stability.\n\nLike…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Iranian missiles. That is more than imminence; that is  actual kinetic hostility.\n\nThe United States is being urged to enter the war. The United States  is moving military assets into the region and withdrawing diplomats  from the region.\n\nThe Iranians are acknowledging that: If the United States enters the  war, we have plans to go after U.S. troops,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. oversight of federal agency actions that  affect its coastal waters. D.C. urgently needs the protection of the  CZMA because of serious flood risks that affect federal assets,  residents and businesses in D.C., including the National Mall and  federal buildings in the Federal Triangle area.\n\nThe CZMA provides planning and technical services to assist…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of the essence. Multiple warships have been moved from other  ports of the world to be just off the coast of Venezuela. By some  estimates, 10 percent of the Navy's deployed assets are now in the  Southern Command area of responsibility.\n\nThese actions certainly do not sound like mere drug enforcement  against organized criminals--not even close. These…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Trump's so-called Department of War, even after the Pentagon failed  seven audits in a row.\n\nAs recently as 2023, the Pentagon could not even account for 62  percent of its assets--a trillion dollars, while the President is  deploying troops in our neighborhoods and threatening to go to war  against American cities.\n\nIt seems my colleagues can always…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Act last Wednesday, which  permanently classifies fentanyl analogs as the deadly drugs they are.\n\nOn Friday, he signed the GENIUS Act, the landmark bill to bring  digital  assets into the mainstream and secure U.S. leadership in financial  innovation.\n\nAnd the first rescissions package in three decades is headed to the  President for signature.\n\nWe…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…vision to strengthen the domestic  maritime base and boost the pool of qualified United States merchant  mariners who can mobilize during times of crisis to operate sealift  assets.\n\nThe legislation also gives the service an important voice by  establishing a Coast Guard service secretary, as envisioned in my  legislation, H.R. 2546, the Secretary of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694195/coast-guard-authorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…It would be the first intensive sanctioning of the  Russian banking industry since the invasion.\n\nUnder Congressman Nunn's PEACE Act, the U.S. would take Russian  sovereign assets that have been immobilized and let the Ukrainians use  them to purchase defensive weapons.\n\nCongress should also fully consider, debate, amend, and pass the  sanction legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…has repeatedly warned that a CBDC is ``a solution in  search of a problem.'' Nonetheless, Mr. Speaker, in 2022, in his  executive order on Responsible Development of Digital Assets, President  Biden sought to explore a U.S. central bank digital currency placing  ``the highest urgency on research and development efforts into the  potential design and development…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…into one that was based  on a relationship and shared mutual interests and national security,  and working with Greenland and the Kingdom of Denmark to ensure that  military assets could be based at Thule, at the time--now called  Pituffik--Air Base Station.\n\nAgain, these are discussions that have been had in the past--but in  the very, very distant past--until…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Representatives; and\n\n(B) the Committee on Homeland Security and Governmental       Affairs, the Committee on Judiciary, and the Select Committee       on Intelligence of the Senate.\n\n(2) Assets.--The term ``assets'' means a person, structure,       facility, information, material, equipment, network, or       process, whether physical or virtual, that enables an…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…American Conference by all the league's  coaches.\n\nZoe is known by her teammates, coaches, teachers, and family as an  exceptionally hard worker and team player. These are assets that will  be of great service to her and our country as she now serves in the  military.\n\nZoe plans to continue her basketball career at the Naval Academy,  where she will…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "Ms. LUMMIS. Mr. President, before I talk about digital assets, I want  to take a moment to remember Sarah Lynn Milgrim and Yaron Lischinsky,  who were tragically, senselessly murdered last night at the Capital  Jewish Museum.\n\nMay their…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Committee on Natural Resources looks forward  to taking action to develop our Nation's resources and to do that  responsibly. Our resources are among our Nation's greatest assets and  revenue generators.\n\nThis resolution starts the process to do something worthy to be  remembered in our day and generation, a process to keep taxes low for  working Americans,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…They were in many ways bipartisan ideas from back then because we  were bleeding out productive capacity in this country. We were  transferring productive capacity and our assets overseas because of our  tax regime and the ability to compete.\n\nNow, it looks like the reality of sounding like an idiot economist  around here doesn't buy you a lot of friends,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…provide services at the front       lines of the bankruptcy process, administering thousands of       cases.\n\n(5) Chapter 7 bankruptcy trustees provide valuable returns       of assets to government creditors, including the Internal       Revenue Service, the Department of Agriculture, the Small       Business Administration, and other Federal, State, and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Federal Reserve Act in the 2       previous calendar years, that--\n\n(1) identifies the number of such investments, broken down       by--\n\n(A) purpose;\n\n(B) type;\n\n(C) amount of assets of the association or State member       bank that made the investment, using not less than 4       categories to describe the amount of assets of the       associations and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I rise in support of the CLARITY Act, which  provides long-overdue updates aimed at protecting the future of digital  assets, encouraging growth, and protecting American consumers.\n\nThe days of stifling this emerging industry through litigation and  rogue rulemaking must end. The Securities and Exchange…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693772/digital-asset-market-clarity-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…stepped- up basis and to stop far-left Democrats' farm killer tax. For decades,  stepped-up basis has protected families from being forced to pay  capital gains taxes on inherited assets.\n\nPresident Biden tried his best to remove this provision, which would  have resulted in the destruction of family farms across my district and  around the country. I have…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…Seapower and Projection Forces Ranking Member    Joe Courtney, for his dedication to supporting our naval and projection  forces.\n\nAmerica's Navy and Air Force are incredible assets for our country,  protecting critical interests and projecting our presence around the  world. In the face of increasingly audacious threats to order from  adversaries scattered…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697808/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}]