[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…are out providing  coffee and cocoa and some warm soup to each other so they can get  through this. Why are they doing it? Do you know what? They care about  the right of assembly. They care about the First Amendment. They care  about their constitutional rights. But the reason they are doing this  is they care about each other. That is who they care…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…discussing.\n\nThen they proceed to try to change the rules for elections so they  can rig the next elections.\n\nThen they start to attack any form of dissent--suppress freedom of  assembly, freedom of press, freedom of speech and due process. We see  that.\n\nThen they say: Now we want to free the military. But in all of that  is this sense that the people are…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…manufacturing  strategy--also employed in Japan, Korea, and Europe--aimed at using a  variety of high-skilled and low-cost labor markets to source  components, software, and assembly.\n\n``The result has been that U.S. industrial capacity in autos has  grown alongside an increase in imported motor vehicles, engines, and  parts. From 1995 to 2019, imports…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…hostages held in Gaza.\n\nMany of us in Atlanta's Jewish community, including Ohr HaTorah, Beth  Jacob, B'nai Torah, and now all of the synagogues of the Atlanta  Rabbinical Assembly have decided to adopt Evyatar's case, to call  relentlessly for his immediate release and to ensure he is not  forgotten or left for dead.\n\nThis 24-year-old man has now spent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691457/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…a 174-percent increase. That is what Virginians are  facing if we can't find common ground to solve this problem, even  temporarily.\n\nOur former colleagues in the General Assembly have predicted that at  least 60,000 Virginians would end up canceling their insurance coverage  due to affordability if they lose access to the enhanced premium tax  credits.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…preserve, protect, and defend the Constitution of the United  States.\n\nHe has denied and violated the right of the people of the United  States to freedom of speech and of assembly and to petition the  government for redress of grievances.\n\nHe has denied and violated the right of the people of the United  States to due process of law and equal protection…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Kazakhstan through their decision to disarm and continued  commitment to a world free from nuclear weapons, is more urgent than  ever.\n\nIn 2009, the United Nations General Assembly designated August 29th  as the International Day Against Nuclear Tests--honoring Kazakhstan's  decision and reminding the world of the human costs of explosive  testing of…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…and to serve concurrently and       without additional compensation as an Alternate       Representative of the United States of America to the       Sessions of the General Assembly of the United Nations.\n\n23. Executive Calendar #290--Jennifer Locetta, of Florida,       to be Alternate Representative of the United States of       America for Special Political…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695711/s-res-377"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…diversity, granting freedom to Black Americans from slavery  and ensuring their right to vote, and establishing the right of women  and those over 18 to vote, as well--free speech, assembly, and  religious practices for all.\n\nEconomic growth recognizes the buying power of all of our citizens  and the rising tide that allows women, people of color, and those of…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…and to make the Pregnant Workers Fairness Act the  law of the land.\n\nMatt has worked for the New York Senate Democratic Conference, as a  Legislative Aide in the New York Assembly, and as an intern for New  York Senator Kirsten Gillibrand. Matt's journey on the House side of  Capitol Hill began as an intern in my Washington, D.C. office back in  2019.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise today to recognize the Minneapolis Fire  Department for the historic assembly of their first all-Native fire  crew.\n\nManned by Captain Michael Graves, fire motor operator Jessie Strong,  and firefighters Johnny Crow and Bobby Headbird, the new crew…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698104/minneapolis-first-all-native-fire-crew"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…that their fight for freedom is not distant.  It lives right here in our own communities.\n\nThe people of Iran deserve a future without fear, a future with free  speech, free assembly, and the right to choose their own leaders and  their own path.\n\nI stand with the women of Iran. I stand with their courage. I will  continue fighting for a future where every…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697722/free-iran"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…today in support of labor  leader David Huerta. The head of the SEIU California union was arrested  in Los Angeles while exercising his First Amendment rights to speech  and assembly, rights that are guaranteed to all of us in the  Constitution. That is what separates us from autocratic regimes around  the world.\n\nThe Trump administration is now going…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692154/supporting-david-huerta"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…shift in the global  security and political paradigm and building momentum that catalyzed  the Comprehensive Nuclear Test Ban Treaty.\n\nIn 2010, the United Nations General Assembly adopted a resolution  calling for an International Day Against Nuclear Tests. Thus, August  29th was selected to commend and recognize Kazakhstan's honorable  decision to…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…amendment make it  to the House floor this year. Not even one.\n\nMr. Speaker, this Republican leadership seemed to have forgotten that  this institution is a democratic legislative assembly. Instead, they  are running it like a wannabe authoritarian dictatorship.\n\nI know that Donald Trump speaks admiringly of Vladimir Putin all the  time, but this place is becoming…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…personally cannot be overstated, my  chief of staff, Nate Soule, as he concludes his service to New York's  17th Congressional District.\n\nWhen I first ran for the New York State Assembly in 2020, before  there was a congressional office or a seat in this Chamber, Nate took a  leap of faith and helped build a campaign from the ground up. Together,  we delivered…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…past. More manufacturing leads  to high-paying jobs at home.\n\nConstruction sites are booming. You are seeing it there in the  construction sites. You are also seeing it in the assembly line. More  innovation, more production means prices go down.\n\nAnd small businesses are the engine of Americans' prosperity. The  Working Families Tax Cuts law helps small…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…HARIDOPOLOS. Mr. Speaker, I rise to recognize the extraordinary  work done in my district at Kennedy Space Center.\n\nI recently had the privilege of touring this iconic vehicle assembly  building, a structure that rises 716 feet into the Florida sky. For  almost 60 years, it has stood as a symbol of American space ambition.\n\nThis is where the mighty Saturn…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689663/recognizing-extraordinary-work-of-kennedy-space-center"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…that  number was actually down from the number in 2023, which had been 1,432  reports, and that was because of the effort that our Governor, Bill  Lee, the Tennessee General Assembly, and the Tennessee Bureau of  Investigations made into fighting this human trafficking and trying to  bring an end to what truly is modern-day slavery.\n\nBut, unfortunately,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Integrated Ocean Observing System, including through the       incorporation of emerging technologies and new data       integration methods.\n\n``(b) Coordination and Data Assembly.--In carrying out       subsection (a), the Program Office of the Integrated Ocean       Observing System shall--\n\n``(1) coordinate with the National Centers for Coastal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…affirmation of the people's sovereignty in a republic founded on  universal suffrage, as well as pluralism.\n\nTwo, freedom of speech, freedom of political parties, freedom of  assembly, and freedom of the press and the internet: dissolution and  disbanding of the Islamic Revolutionary Guard Corps, the IRGC; the  terrorist Quds Force; plainclothes groups;…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…legislature.''\n\nWhy in the world would the Democratic supermajority in California  target TFA? I was there in the legislature at the time, and I helped to  kill that bill on the State assembly floor, but it did pass the  California State Assembly Education Committee, unbelievably enough.\n\nWhat could possibly have motivated this attack? After all, TFA's  mission,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…and to serve concurrently and       without additional compensation as an Alternate       Representative of the United States of America to the       Sessions of the General Assembly of the United Nations\n\nExecutive Calendar No. 290, Jennifer Locetta, of Florida,       to be Alternate Representative of the United States of       America for Special Political…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a critical good.\n\n(16) Production equipment.--The term ``production       equipment'' means any component, subsystem, system,       equipment, tooling, accessory, part, or assembly necessary       for the manufacturing of a critical good.\n\n(17) Relevant committees of congress.--The term ``relevant       committees of Congress'' means the following:…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Francisco or even that very first segment from  Bakersfield to Merced, which is now projected to miss the 2033  deadline.\n\nListen to the bipartisan pushback that this is getting. Assembly  Member Steven Bennett, a Democrat from Ventura, said: ``We have no  plan. We have a good likelihood it is going to get worse, and we have a  short time to solve the problem.''…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "James Risch", "party": "Republican", "sentence": "…comprised of two major       tactical components, which are a reusable Lightweight Command       Launch Unit (LwCLU) and a round contained in a disposable       launch tube assembly. The LwCLU incorporates an integrated       day-night sight that provides a target engagement capability       in adverse weather and countermeasure environments. The LwCLU…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…philanthropic  work.\n\nI first met Marlee as a high school student leader in Tustin, and she  was my first and only choice as chief of staff when I was elected to  the California State Assembly in 1982.\n\nSomehow, she was able to clean up every mess I made in those years.  She continued in that capacity until Newhall Land and Farming Company,  the largest land developer…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…memory that shaped their lives and reflected the quiet strength of his  character.\n\nThat faith extended far beyond his home. Mr. Brewton was a founder of  the Brownsville Assembly of God in Pensacola, a church that continues  to serve his community today.\n\nThrough his life, he set a shining example--before his children, his  family, all who knew him,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…was signed into law. It was signed into law in the  State of Georgia by the Governor of the State of Georgia.\n\nMr. STEIL. Will the gentleman yield?\n\nMr. STEIL. I assume the assembly and senate of the State of Georgia  prior to signature by the Governor of the State.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…offensive, and  our National Guard members are owed an apology.\n\nToday, I hope we can stand together, Republicans and Democrats, in  making it very clear that protests and assembly are fundamental rights  in this country and that acts of violence are a grave threat to those  rights.\n\nSpecifically, this resolution recognizes the right to assemble and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]