[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…receive its share of  Broadband, Equity, Access, and Deployment Program funding, I hereby  announce that I intend to object to the nominations of Arielle Roth to  be Assistant Secretary of Commerce for Communications and Information  (PN22-25), Paul Dabbar to be Deputy Secretary of Commerce (PN26-12),  Pierre Gentin to be General Counsel of the Department…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692204/nominations-objections"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…full- blown crises.\n\nThis legislation includes critical provisions from last Congress'  Supply Chains Act, which I co-led, including a provision to designate  the Assistant Secretary of Commerce to lead a governmentwide supply  chain resilience effort.\n\nIt also ensures input from the Department of Labor and lays out a  national strategy to coordinate action…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the malicious actions of our foreign adversaries and  other bad actors.\n\nH.R. 1709 is an important step toward addressing these concerns.\n\nThis bill directs the Assistant Secretary of Commerce for  Communications and Information to report to Congress on the  cybersecurity threats our mobile networks and mobile devices face at  the hands of foreign adversaries…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693422/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…internet are free from the influence of our foreign adversaries.\n\nH.R. 866 accomplishes this objective by requiring the Secretary of  Commerce, acting through the Assistant Secretary of Commerce for  Communications and Information, to study the national security risks  and cybersecurity vulnerabilities in American homes posed by routers  and modems manufactured…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…American Samoa, Guam, the U.S.       Virgin Islands, and the Northern Mariana Islands. In advance       of funds being distributed to Eligible Entities, the       Assistant Secretary of Commerce for Communications and       Information (Assistant Secretary) must approve each Eligible       Entity's letter of intent, initial proposal, or final       proposal.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…present for the vote, I would have voted nay.\n\nI was necessarily absent for rollcall vote No. 416, motion to invoke  cloture on the nomination of Arielle Roth to be Assistant Secretary of  Commerce for Communications and Information. Had I been present for the  vote, I would have voted nay.", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694603/vote-explanation"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…providing small communications  providers with the support they need to determine whether Open RAN is  an appropriate network solution for them. Under this bill, the  Assistant Secretary of Commerce for Communications and Information will  be required to engage in outreach and provide technical assistance to  small communications providers concerning the uses,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…including the use of  innovative sharing technologies for our airwaves and improving the  Federal Government's use of spectrum.\n\nThe legislation also will allow the Assistant Secretary of Commerce  for Communications and Information, acting through the head of ITS, to  enter into agreements needed to carry out the functions of the  laboratory.\n\nThis bill…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693437/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…include significant representation from trusted American companies and  those from allied countries, as well.\n\nH.R. 1765 accomplishes this objective by requiring the Assistant  Secretary of Commerce for Communications and Information to encourage  and facilitate the participation of trusted companies and stakeholders  in the domestic and international standards-setting…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693507/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Diana Harshbarger", "party": "Republican", "sentence": "…is a  bipartisan piece of legislation that I am proud to have led through the  House alongside my co-lead, Representative Nanette Barragan.\n\nIt will require the Assistant Secretary of Commerce for Travel and  Tourism to develop a plan to boost music tourism, welcoming both  domestic and international visitors to experience the rich musical  heritage…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690269/american-music-tourism-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1455) to codify the Institute for Telecommunication Sciences and  to direct the Assistant Secretary of Commerce for Communications and  Information to establish an initiative to support the development of  emergency communication and tracking technologies, and for other…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Communications       Networks Act of 2019 (47 U.S.C. 1601(c)).\n\n(2) Secretary.--The term ``Secretary'' means the Secretary       of Commerce, acting through the Assistant Secretary of       Commerce for Communications and Information.\n\n(3) Trusted.--The term ``trusted'' means, with respect to       an entity, that the Secretary has not determined that the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Continuation of civil actions.--This subsection, and       the amendments made by this subsection, shall not abate any       civil action commenced by or against the Assistant Secretary       of Commerce for Communications and Information before the       date of the enactment of this Act, except that the Under       Secretary shall be substituted as a party…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1709) to direct the Assistant Secretary of Commerce for  Communications and Information to submit to Congress a report examining  the cybersecurity of mobile service networks, and for other purposes.\n\nThe Clerk…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Authorization Act for Fiscal Year 2021 (Public Law 116-283).\n\n(b) Definitions.--In this section:\n\n(1) Assistant secretary.--The term ``Assistant Secretary''       means the Assistant Secretary of Commerce for Communications       and Information, acting through the head of the Office of       Internet Connectivity and Growth.\n\n(2) Open network architecture.--The…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…1. SHORT TITLE.\n\nThis title may be cited as the ``Promoting Resilient Supply       Chains Act of 2025''.       SEC. 2. ADDITIONAL RESPONSIBILITIES OF ASSISTANT SECRETARY OF                     COMMERCE FOR INDUSTRY AND ANALYSIS.\n\nIn addition to the responsibilities of the Assistant       Secretary on the day before the date of the enactment of this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…NTIA's leadership reflects the important role it  plays today, both domestically and internationally.\n\nThis legislation elevates the NTIA Administrator from an Assistant  Secretary of Commerce to an Under Secretary of Commerce. This elevation  will help NTIA best represent the United States as it coordinates with  other agencies and works with other…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``American Music Tourism Act       of 2025''.       SEC. 2. RESPONSIBILITIES OF THE ASSISTANT SECRETARY OF                     COMMERCE FOR TRAVEL AND TOURISM.\n\n(a) Domestic Travel and Tourism.--Section 605(b) of the       Visit America Act (15 U.S.C. 9803(b)) is amended--\n\n(1) in paragraph…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1765) to direct the Assistant Secretary of Commerce for  Communications and Information to take certain actions to enhance the  representation of the United States and promote United States  leadership in communications…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 866) to direct the Secretary of Commerce, acting through the  Assistant Secretary of Commerce for Communications and Information, to  conduct a study of the national security risks posed by consumer  routers, modems, and devices that combine a modem and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690158/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}]