[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of U.S. Armed Forces against Iran does not affect the ability of  the United States to defend itself, to share intelligence with Israel  or our other partner nations, or to assist them in taking defensive  measures to protect themselves from an attack by Iran or its proxies.\n\nOur intent in this amendment is to make it crystal clear that calling  up and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…unexpectedly.\n\nI traveled to Florida for a brief vacation. During that       time, a family member living in New Jersey became seriously       ill, and I traveled there to assist her. Before I was able to       return to my home country of Haiti, a devastating earthquake       struck. The place where I lived collapsed, and the building       where I…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Library, and, yes, I still have too many overdue  Library books.\n\nI worked with Dr. Hayden during the dark days of COVID-19 to help  Michigan, to preserve the history, and to assist veterans. Her  premature dismissal, Mr. Speaker, is a true loss to the institution and  the millions of people it serves, including my colleagues, who rely on  the Library's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…work 19 hours a week. Therefore,       insurance is not provided. Medicaid is a necessity to       maintain her physical and emotional health and provide       services to assist with her independence so she can continue       to be a contributing member of society. By withdrawing       funding for Medicaid, the policy would disrupt programs       serving…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…agencies on November 3, 2025. States       will rely on the issuance tables to calculate the benefits       due to each eligible household in their respective States. To       assist State agencies with the massive changes, USDA will       have staff available for technical assistance.\n\n27. As is required by Federal law, after receiving notice       from…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…with open arms. And he was right. Jesuit  principal Father C.J. Stallworth, who had served on the LHSAA executive  committee for seven years, said he would do what he could to assist St.  Augustine, but added it would be helpful to him to have Sister Madalena  of Xavier Prep also apply for admission to bolster his request.\n\nFather Grant faced resistance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bunch of incentives in this program to drive down  excess methane pollution and remediate the effects of pollution that do  occur, but the program provides over $1.5 billion to assist the  industry with reducing current and legacy methane emissions, including  $700 million of incentives for small producers.\n\nThe methane charge, or fee, only applies to wasted…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the commitment  of the police officers who serve our communities, who serve us in  Congress, and who serve across the country.\n\nTwo, we try to think of ways we actually can assist them in doing  their jobs better so we can make their work more effective and safer,  and we can make the police function generally more efficacious for the  American people.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…President of the Association of Hue Students, eager to connect with  others from his hometown. Additionally, he volunteered with the  Vietnamese Red Cross, leading him to assist refugees in the ongoing war  after becoming an accredited doctor.\n\nOn April 29, 1975, shortly after graduating from medical school, Dr.  Vo fled by Navy Ship to escape communist…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Anderson Pew initially  focused their philanthropic work on anonymously providing grants to  priorities such as cancer research, the Red Cross, and a pioneering  project to assist historically Black colleges. Over the years, this  institution has evolved into a much more expansive enterprise, allowing  flexibility to engage in a variety of community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…own lives--all reduced. These real-life impacts are  undeniable. We are talking about the people who make sure that veterans  have transportation to those appointments, who assist with benefits  claims, who ensure that the VA hospitals are maintained and that they  are safe, who clean operating rooms and sterilize instruments in  between procedures.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…this climate crisis, at least let  California protect Californians.\n\nI am realistic with the times that we are living in. Under this  administration, I doubt we will get the assist from the Federal  Government over the course of the next 3\\1/2\\ years.\n\nI want to acknowledge that it was former President Ronald Reagan,  when he was Governor of California,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the inferno.\n\nLouisville is safer because of the men and women of Okolona Fire and  the more than twenty departments who came from across the city and the  Commonwealth to assist. Their bravery and selflessness reflect their  deep love for this community and stand as a testament to what it means  to serve. I ask all my colleagues to join me in honoring…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…education. All you are going to do now is just throw them in  prison, which only exacerbates the problem.\n\nIn the President's budget, they propose to cut SAMHSA programs that  assist with harm reduction strategies to help those in need, as well as  programs to help prevent Americans from using controlled substances.  The President's budget also calls for…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…businesses. As Trump administration and ICE are terrorizing our  community and small businesses, it is more important than ever that the  CDFI Fund remain fully funded to assist small business owners as our  community rebuilds after this crisis.\n\nWhile these bills were not ideal, I urge my colleagues to support  this bipartisan agreement.", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…while cross-country skiing off duty at Nub's Nob  Ski Resort, Sergeant Wagner observed a skier collapsed along the side  of the trail. Without hesitation, he stepped in to assist Nub's Nob ski  patroller Steve Biggs, who had begun providing emergency care. Sergeant  Wagner helped roll the  skier onto his back, positioned the head to open the airway,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699808/recognizing-michigan-state-police-sergeant-dennis-wagner"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…families affected by autism, helping  them lead fulfilling lives.\n\nOur schools and early childcare programs must be equipped with the  knowledge, resources, and training to assist those living with autism.  Early diagnosis and intervention are critical, as they can  significantly improve communication, social skills, and quality of life  for individuals…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…balance of my time.\n\nMr. CALVERT. Mr. Chair, this amendment strikes all funding for the  Overseas Humanitarian, Disaster, and Civic Aid account. The funding is  used by DOD to assist during humanitarian disasters. The funding is  also used when specialized DOD experience is needed, such as detection  and clearance of landmines, unexploded ordnance, and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…referred to as the Four Corners,  into trust for the Pit River Tribe. The Tribe has attempted to pursue  this ask through administrative process, but it is time for Congress to  assist legislatively.\n\nMr. Speaker, I urge passage of this bill, and I yield back the  balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698137/pit-river-land-transfer-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…402 of the CWA.\n\nUnder Section 404--dredge and fill permitting--home       builders pull some of the highest numbers of Nationwide       Permits (NWPs) issued annually. To assist with planning and       permit backlogs, this legislation extends the duration of a       NWP from 5 to 10 years and right sizes the acreage threshold       for impacts to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…inventory financing, interest subsidies, operating       expenses, and similar costs not associated with construction       or expansion of existing operations.\n\n(v) Activities to assist homebuyers to purchase existing       dwelling units or dwelling units under construction,       including closing costs and down payment assistance, interest       rate buydowns,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…towns and communities across  America, rural hospitals are critical lifelines. They provide emergency  care, support seniors and veterans, deliver behavioral health services,  assist mothers who are giving birth, supply pharmacy services, and  serve as major local employers.\n\nYet, many rural hospitals are under serious strain. Nearly half are  operating…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…Senate  committees to have an open, transparent conversation about the  Department's efforts.\n\nLast week, the Senate Finance Committee moved to advance more  nominees who will assist in the Department's management and  communication with Congress.\n\nSecretary Kennedy and his team deserve time to deliver on the promise  of putting patients first, promoting…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…for supporting  Veterans continued in his role as a Veterans Affairs Caseworker for the  United States House of Representatives. In this capacity, Walt worked  tirelessly to assist Veterans and Servicemembers in navigating the  complexities of federal benefits, healthcare, and other issues related  to the Department of Veterans Affairs. His work as a…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and       economic power contributes significantly to ensuring peace       and economic stability in the Western Pacific. It is vital to       the U.S. national interest to assist this ally in developing       and maintaining a strong and ready self-defense capability.\n\nThe proposed sale will improve Australia's capability to       meet current and future…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…bipartisan vote.  These bills support State and local law enforcement, invest in vital  scientific research, promote economic development, help protect our  national security, and assist our coastal communities.\n\nThis fiscally responsible package includes the Commerce-Justice- Science bill, the Energy and Water Development appropriations, and the  Interior…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…other service recommended or required by a       physician.\n\n(9) Supported decision-making.--The term ``supported       decision-making'' means the use of a support person to assist       a qualified individual in making health care decisions,       communicate information to the qualified individual, or       ascertain a qualified individual's wishes.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…and getting signed into law this  Congress so we can continue to innovate and grow in America.\n\nIn addition to national defense efforts, the aerospace industry  continues to assist with our emergency responses in our Nation.\n\nEarlier this year, we saw wildfires devastate my home State of  California. Unfortunately, this is something that we know all too…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…to demonstrate       sufficient political loyalty to the PRC Government.\n\n(16) Popular discourse surrounding the ongoing atrocities       in the XUAR and advocacy efforts to assist Uyghurs remains       muted in most Muslim majority nations around the world.\n\n(17) Former Secretary of States Antony Blinken and Michael       Pompeo and Secretary of State…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…of the organ harvesting and organ trafficking `market' is  staggering.''\n\nMr. Speaker, we also know that there are hospitals dedicated just to  dealing with and helping to assist Chinese Communist Party leaders. One  of them is the Army Hospital 301 in Beijing. Where do they get these  victims? From the very groups of people who they hate so much: the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}]