[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of U.S. Armed Forces against Iran does not affect the ability of  the United States to defend itself, to share intelligence with Israel  or our other partner nations, or to assist them in taking defensive  measures to protect themselves from an attack by Iran or its proxies.\n\nOur intent in this amendment is to make it crystal clear that calling  up and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Legal Services and Community-Based       Organizations. Congress should increase funding for legal       services providers and trusted community-based organizations       that assist TPS holders with transition planning,       applications for relief, and know-your-rights education.       Access to legal counsel is often the difference between       stability…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Library, and, yes, I still have too many overdue  Library books.\n\nI worked with Dr. Hayden during the dark days of COVID-19 to help  Michigan, to preserve the history, and to assist veterans. Her  premature dismissal, Mr. Speaker, is a true loss to the institution and  the millions of people it serves, including my colleagues, who rely on  the Library's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…work 19 hours a week. Therefore,       insurance is not provided. Medicaid is a necessity to       maintain her physical and emotional health and provide       services to assist with her independence so she can continue       to be a contributing member of society. By withdrawing       funding for Medicaid, the policy would disrupt programs       serving…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…agencies on November 3, 2025. States       will rely on the issuance tables to calculate the benefits       due to each eligible household in their respective States. To       assist State agencies with the massive changes, USDA will       have staff available for technical assistance.\n\n27. As is required by Federal law, after receiving notice       from…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…cities with programs like Securing the Cities are  so crucial.\n\nThe Department of Homeland Security launched the Securing the Cities  initiative in 2007 as a pilot program to assist the New York City metro  area in detecting and preventing nuclear or radiological threats. The  program has since expanded and currently provides 14 municipal  governments…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…education. All you are going to do now is just throw them in  prison, which only exacerbates the problem.\n\nIn the President's budget, they propose to cut SAMHSA programs that  assist with harm reduction strategies to help those in need, as well as  programs to help prevent Americans from using controlled substances.  The President's budget also calls for…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the commitment  of the police officers who serve our communities, who serve us in  Congress, and who serve across the country.\n\nTwo, we try to think of ways we actually can assist them in doing  their jobs better so we can make their work more effective and safer,  and we can make the police function generally more efficacious for the  American people.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…President of the Association of Hue Students, eager to connect with  others from his hometown. Additionally, he volunteered with the  Vietnamese Red Cross, leading him to assist refugees in the ongoing war  after becoming an accredited doctor.\n\nOn April 29, 1975, shortly after graduating from medical school, Dr.  Vo fled by Navy Ship to escape communist…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Anderson Pew initially  focused their philanthropic work on anonymously providing grants to  priorities such as cancer research, the Red Cross, and a pioneering  project to assist historically Black colleges. Over the years, this  institution has evolved into a much more expansive enterprise, allowing  flexibility to engage in a variety of community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…own lives--all reduced. These real-life impacts are  undeniable. We are talking about the people who make sure that veterans  have transportation to those appointments, who assist with benefits  claims, who ensure that the VA hospitals are maintained and that they  are safe, who clean operating rooms and sterilize instruments in  between procedures.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…this climate crisis, at least let  California protect Californians.\n\nI am realistic with the times that we are living in. Under this  administration, I doubt we will get the assist from the Federal  Government over the course of the next 3\\1/2\\ years.\n\nI want to acknowledge that it was former President Ronald Reagan,  when he was Governor of California,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the inferno.\n\nLouisville is safer because of the men and women of Okolona Fire and  the more than twenty departments who came from across the city and the  Commonwealth to assist. Their bravery and selflessness reflect their  deep love for this community and stand as a testament to what it means  to serve. I ask all my colleagues to join me in honoring…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bunch of incentives in this program to drive down  excess methane pollution and remediate the effects of pollution that do  occur, but the program provides over $1.5 billion to assist the  industry with reducing current and legacy methane emissions, including  $700 million of incentives for small producers.\n\nThe methane charge, or fee, only applies to wasted…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…businesses. As Trump administration and ICE are terrorizing our  community and small businesses, it is more important than ever that the  CDFI Fund remain fully funded to assist small business owners as our  community rebuilds after this crisis.\n\nWhile these bills were not ideal, I urge my colleagues to support  this bipartisan agreement.", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…WILLIAMS of Texas. Madam Speaker, I move to suspend the rules and  pass the bill (H.R. 5764) to amend the Small Business Act to require  small business development centers to assist small business concerns  with the use of artificial intelligence, and for other purposes, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, this legislation requires the SBA to report to Congress  on the challenges facing individuals with disabilities and what  resources or programs the SBA provides to assist them. The report will  also include legislative recommendations to address those challenges.\n\nAmerica is the land of opportunity, meaning that anyone can and  should be able…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691756/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…certain additional  matters, issue final decisions in specific cases, and use limited  contempt authority to maintain order. This is similar to how magistrate  judges currently assist Federal district court judges to streamline  their dockets when consent of the parties exists. The result is simple:  faster resolution for taxpayers without sacrificing expertise…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…from any division or       office of the Commission, including the Division of Economic       and Risk Analysis; and          (C) enter into agreements with third parties to assist in       data analysis.          (b) Report.--The Advocate for Small Business Capital       Formation shall issue a report to the Congress containing all       findings and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…time with us in ``blue skies'' as well.  She completed the agency's stringent 3-day VITA (Volunteer Income Tax  Assistance) training in December and became IRS certified to assist  low-to-moderate income families throughout tax filing season. Donna  volunteers her time as a tax preparer, working one on one with  families, at 3 of 5 Hernando preparation…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…development centers to start and expand a small business       concern; and\n\n``(Y) as appropriate, connecting small businesses with       career and technical education programs to assist students       and graduates of such programs with identifying career       opportunities.''.\n\n(c) Women's Business Centers.--Section 29(b) of the Small       Business Act…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…Senate  committees to have an open, transparent conversation about the  Department's efforts.\n\nLast week, the Senate Finance Committee moved to advance more  nominees who will assist in the Department's management and  communication with Congress.\n\nSecretary Kennedy and his team deserve time to deliver on the promise  of putting patients first, promoting…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…ObamaCare, if you are in the individual market, that is  not allowed anymore. That is absolutely prohibited in Federal law now.\n\nSo we have a very simple proposal: We do want to assist folks who are  stuck in this ObamaCare Marketplace to try to figure out how we help  them through this, but we don't want to send the dollars to the  insurance companies. That…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…402 of the CWA.\n\nUnder Section 404--dredge and fill permitting--home       builders pull some of the highest numbers of Nationwide       Permits (NWPs) issued annually. To assist with planning and       permit backlogs, this legislation extends the duration of a       NWP from 5 to 10 years and right sizes the acreage threshold       for impacts to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Assumption BVM has become a source of strength,  spiritual growth, and support for countless individuals.\n\nAssumption BVM works alongside the Society of St. Vincent de Paul to  assist people who struggle to afford basic necessities. To help ease  these burdens, Assumption BVM collects grocery store gift cards and  other monetary donations for those in need.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…to demonstrate       sufficient political loyalty to the PRC Government.\n\n(16) Popular discourse surrounding the ongoing atrocities       in the XUAR and advocacy efforts to assist Uyghurs remains       muted in most Muslim majority nations around the world.\n\n(17) Former Secretary of States Antony Blinken and Michael       Pompeo and Secretary of State…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…her typing, proficient with patient checkout and efficient at  scheduling imaging and Dermatology referrals. Cheryl is a vital part of  the team. She is always available to assist the patients and co-workers  whenever needed. The clinic would not run smoothly without her diligent  efforts.\n\nIt is clear Cheryl Dillow has made a profoundly positive impact…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690208/recognizing-cheryl-dillow"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…across counties for treatment, a trip that could cost them  their lives.\n\nIn addition to nearly 50 years of medical service, Dr. Hotz founded  Albany Area Primary Health Care to assist rural communities in  obtaining accessible healthcare.\n\nMr. Speaker, Dr. Hotz represents the best of compassion and community  service, and it is an honor to recognize him…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Mansfield Air National Guard Wing to the 179th  Cyberspace Wing. During the COVID-19 pandemic, his strong leadership  allowed the National Guard to respond across the state and assist  hospitals and Ohioans in need.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Major General John Harris, on his retirement from the Ohio National…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691689/special-recognition-of-major-general-john-c-harris-jr-upon-his-retirement-as-adjutant-general-of-the-ohio-national-guard"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…other service recommended or required by a       physician.\n\n(9) Supported decision-making.--The term ``supported       decision-making'' means the use of a support person to assist       a qualified individual in making health care decisions,       communicate information to the qualified individual, or       ascertain a qualified individual's wishes.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}]