[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Members of Congress.\n\nMore than 60,000 Palestinians have been killed, widely reported, but  understand this: 18,500 of them were children. According to a reporting  by Associated Press, more than 80 children have died from malnutrition- related causes. And for every child who dies of malnutrition, there are  thousands more in deep trouble.\n\nUNICEF, in…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…gunfire at that point.\n\nThis is a quote. These are the words of Inspector Thomas Lloyd of the  U.S. Capitol Police, as reported in a new book by Mary Jalonick of the  Associated Press. Gunfire--in this room--to protect Senators from  getting hurt or worse. That is how close we were. Let's call it what it  was. This was an insurrection--an insurrection…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…extract tens of millions of dollars in putative settlements,  effectively acting as a conduit for flagrant bribery and extortion.\n\nHe has restricted the access of the Associated Press after they  refused to use the name ``Gulf of America'' in their reporting and has  defied court orders to cease this unconstitutional action.\n\nHe has also threatened…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the only photographer  to be awarded the organization's Photographer of the Year Award five  times. Additionally, some of Bruce's photographs have been published by  the Associated Press.\n\nAside from photography, Bruce has been an active member of the  community. He was president of the Greater Mansfield Area Chamber of  Commerce and served on the Mansfield…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…of  both the Michigan Journalism Hall of Fame and the Michigan Association  of Broadcasters Hall of Fame. She's received multiple Emmy nominations,  accolades from the Associated Press, and recognition from the Michigan  Association of Broadcasting. Sheri is also a proud member of the Silver  Circle of the Michigan chapter of the National Academy of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690456/recognizing-sheri-jones"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Alexandra: Thomson Reuters; Al-Rikabi, Ramsey: Bloomberg       News; Alvarez Jacobs, Gabriel: Washington Post; Amenabar,       Edwin: Washington Post; Amiri, Farnoush: Associated Press;       Anastacio, Nicholas: National Journal; Anderson, Zachary: USA       Today; Andrea, Lawrence: USA Today; Andrews, Natalie: Wall       Street Journal/Dow Jones; Anglin,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…earned the trust of his  listeners and the respect of his colleagues.\n\nDoug's list of accolades features more than 100 awards from the  United Press International and Associated Press, and his enduring  dedication has meant so much to his community.\n\nDescribed by Mayor Bob Morgan as a positive and stabilizing influence  for the city, Doug has also served…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Scott: Associated Press Photos; Augustino, Jocelyn:       Freelance; Bailey, Allison: Freelance; Baratz, David: USA       Today; Barrett, Stephen: Freelance; Barria Moraga, Carlos:       Reuters…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}]