[{"senator": "Mike Levin", "party": "Democrat", "sentence": "…Data centers are expanding dramatically, and utilities are investing  billions of dollars in transmission upgrades.\n\nFor example, in PJM, $4.3 billion in transmission costs associated  with data center growth were passed to ratepayers. An additional $7.3  billion in increased generation costs were recorded.\n\nWithout guardrails, households and small businesses…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…ceases to be viable.\n\nSame scenario: climate risk, insurance collapse, mortgage failure,  property values crash.\n\nThe Mortgage Bankers Association:\n\n[C]hronic physical risk associated with climate change may       . . . exceed the capacity of insurance and government       assistance to sustain some areas.\n\nWhole regions.\n\nBy the way, the Allianz guy said…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Ramirez for her  leadership in this special hour, and I thank the Congressional  Progressive Caucus, as well as the Congressional Hispanic Caucus, and  all the other Members associated with this special hour.\n\nMr. Speaker, I rise today to forcefully speak against the Trump  administration's horrific ICE abuses, far beyond an overreach on the  immigrant…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…investment in our economy.\n\nMembers of Congress continue to hear from farmers, workers,       and business owners about the harm inflicted by broad-based       tariffs and the associated economic uncertainty. American       families are facing thousands of dollars in higher prices as       a result of these increased taxes. Small businesses,       manufacturers,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…intoxication. He was impeached  and convicted under the same constitutional law that all Presidents  have been impeached under.\n\nTypically, there has been no constitutional crisis associated with  Articles of Impeachment. I have to repeat this because there seems to  be the notion that you must wait for the constitutional crisis before  you can initiate impeachment.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…colleagues, and that is that, not long ago, when circuit  court nominees were brought forward, they had cleared the Senate blue- slip process because each circuit court seat was associated with a  State, except for DC. But, normally, a DC Circuit Court seat was  associated with a State, and the Senators from that State had the  ability to recommend a nominee…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696140/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Owl ROD\n\nThe Barred Owl ROD documents FWS's decision to adopt the       Final Barred Owl Management Strategy (Barred Owl Management       Strategy or Strategy) and issue an associated permit under       the Migratory Bird Treaty Act (MBTA) to implement the       Strategy. The ROD states that the purpose of the action ``is       to reduce barred owl populations…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…reported in 2024.\n\nWe are witnessing disturbing incidents of politically motivated  violence across the Nation, targeting elected officials and high- profile individuals associated with both political parties.\n\nWhether it is the horrific assassination of Charlie Kirk at a college  campus in Utah or the tragic assassination of former speaker of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Salle principal, Christian Brother Cassian. It was painfully blunt:  ``Father, personally, I am not one to rush into situations which may  not be to my advantage and to those associated with me. For years, I  have refused to play certain high school teams on the basis that there  was nothing to gain by such competition. This is how I feel about your  request…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Congress has mandated puts children and all  Americans' physical safety in grave danger.\n\nThe CPSC is a small agency tasked with a massive job to protect  consumers from hazards associated with a vast array of consumer  products, from infant car seats to window blinds to home repair  equipment. American consumers deserve to have peace of mind that the  products…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "Mr. MOSKOWITZ. Mr. Speaker, I rise today to recognize Associated  Builders & Contractors Institute Apprenticeship College (ABCI) on the  event of its 50th anniversary. A proud institution in Florida's 23rd  Congressional District, ABCI…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691681/recognizing-associated-builders-contractors-institute-apprenticeship-colleges-50th-anniversary-celebration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…positions, each of them there, I thought, to  give the President a report about conditions related to their various  areas of expertise and the departments that they are associated with.  That is what I thought.\n\nSilly me. They were there to pledge their fealty on national TV to  the President of the United States of America. It was a sad sight to…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…self-glorification to misuse this  data.\n\nBeyond the obvious danger of empowering a surveillance state or  enabling the targeting of political opponents, the other danger  associated with this mass centralization is that this sensitive  information held by the Federal Government in one place could be  exposed to hacking. One vulnerability, one malicious…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…healthcare coverage for IVF,  despite the fact that IVF is critical for helping Active-Duty personnel  grow their families.\n\nIt certainly is poor character to ban initiatives associated with  diversity, equity, and inclusion, even though these cuts will undermine  military readiness.\n\nThis mammoth bill expands the administration's power to attack  immigrants,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698052/opposition-to-the-military-spending-bill"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…no Members of Congress.\n\nMore than 60,000 Palestinians have been killed, widely reported, but  understand this: 18,500 of them were children. According to a reporting  by Associated Press, more than 80 children have died from malnutrition- related causes. And for every child who dies of malnutrition, there are  thousands more in deep trouble.\n\nUNICEF,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…drug application under section 505(b)(1) or section 351(a) of       the Public Health Service Act for which the priority review       voucher is used. All other user fees associated with the       human drug application shall be due as required by the       Secretary or under applicable law.''.\n\n(c) GAO Report on Effectiveness of Rare Pediatric Disease…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the only photographer  to be awarded the organization's Photographer of the Year Award five  times. Additionally, some of Bruce's photographs have been published by  the Associated Press.\n\nAside from photography, Bruce has been an active member of the  community. He was president of the Greater Mansfield Area Chamber of  Commerce and served on the Mansfield…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Act of 2022 (title III of division FF of       Public Law 117-328); and\n\n(2) modernizing the regulation of human cell and tissue       products, including considerations associated with assessing       minimal manipulation and homologous use (as such terms are       defined in section 1271.3 of title 21, Code of Federal       Regulations (or successor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…reality behind this--I am a doctor and  most people around here know that in order to cure cancer there is not  just one simple answer. When it comes to the unaffordability associated  with housing costs, there is not just one answer there.\n\nThat is why I am so proud to support and have voted in favor of the  Housing for the 21st Century Act. I call on…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…of the aisle to use incendiary language like ``shameful,'' I submit  what is shameful is to take away this lifeline from our constituents.\n\nConsumers understand the costs associated with overdraft services,  and they willingly opt in because they find value in the protection  that it offers. They are not coerced. They make an informed decision,  knowing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…II--MODERNIZING LOCAL DEVELOPMENT AND RURAL HOUSING PROGRAMS  Sec. 201. HOME Reform. Sec. 202. Community Development Fund Amendments. Sec. 203. Grants for planning and implementation associated with                affordable housing. Sec. 204. Rural housing service program improvements. Sec. 205. Choice in Affordable Housing.     TITLE III--EXPANDING MANUFACTURED…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…first year, and 90 percent are still being subsidized,  resulting in checks worth more than $12,000 per month going to  insurance companies.\n\nOne Social Security number was associated with more than 125  different ObamaCare policies. One Social Security number was tied to  more than 125 policies--waste, fraud, abuse. Apparently, the other side  doesn't…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…new equipment. I  know because I operated an air-conditioning business for 35 years. They  will incur significant, major up-front costs on equipment while  reckoning with associated operational disruptions and supply chain  challenges. The Biden-Harris DOE itself estimated that the cost of  these standards, which were last updated just a handful of years…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…today is just one example of her commitment to her  constituents and our entire Nation. The contrast between the successful  policies under market capitalism and the freedoms associated with,  particularly, our robust democracy here in America and socialism across  the world and in history could not be starker.\n\nI cannot express this enough: This resolution…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…large percentage of Wyoming's resources  historically locked up in Federal lands, including national forests,  communities across my State have long weathered challenges associated  with reduced flexibility and a decreased tax base.\n\nWhile a percentage of revenue from timber sales previously alleviated  tax shortfalls, shifting land management priorities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…government entity;\n\n(iii) assessment fees of a government-created special       district or program; or\n\n(iv) any charges or fees for an optional product or service       associated with the covered services that may be selected by       a purchaser of covered services.\n\n(2) Commission.--The term ``Commission'' means the Federal       Trade Commission.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…focused on advocating for patients and  helping drive success within his teams. Scott continues to work and  thrive in the industry by helping counteract the social stigmas  associated with the field. He has received several honors and awards  for his efforts.\n\nIn 2017, Scott founded a non-profit organization called ``Reunite the  Fight''. The organization…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…four of his children from infancy. It is tough. It is expensive.\n\nThere is a lot that goes into it just on the financial side, let  alone the emotional side and everything associated with it. It is  important to do, and we are doing some of that in this legislation.\n\nWe are also increasing the HSA contribution limit and cap for small  business expensing,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…important to a select few people who live around, for  example, a particular piece of land owned by the Federal Government and  might be affected by the land management policy associated with that  parcel, are very important to that local population but might be  completely unknown not only to people on the other side of the country  but even to people in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Alexandra: Thomson Reuters; Al-Rikabi, Ramsey: Bloomberg       News; Alvarez Jacobs, Gabriel: Washington Post; Amenabar,       Edwin: Washington Post; Amiri, Farnoush: Associated Press;       Anastacio, Nicholas: National Journal; Anderson, Zachary: USA       Today; Andrea, Lawrence: USA Today; Andrews, Natalie: Wall       Street Journal/Dow Jones;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]