[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…aren't doing as well now ever  since the Department of Education existed.\n\nIf you will engage in a brief colloquy with me, and let's talk about  why that is an erroneous assumption.\n\nMs. BONAMICI. Absolutely.\n\nMs. BONAMICI. That is why we have Federal education research, which  they are also trying to cut. I tell you: If we could fully fund IDEA,  if…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…to guide program participants in considering       certain factors constituting the AFFH requirement. In       particular, the court disagreed with the plaintiffs'       assumption that the Assessment Tools were ``legislative'' or       ``substantive'' rules that would therefore be subject to       APA's notice-and-comment requirements.\n\nIn sum, the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…security  threats. And that threat, those threats, are a threat to the election  integrity that is so essential to the well-being of our democracy.\n\nThe Executive order makes an assumption that noncitizen voting is a  problem. The assertion that noncitizens are voting is alarming.  Fortunately, it is not true. Also, Federal law already bars noncitizens  from…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…officer, as she turns away, shoots  her and then, as she is passing by, shoots again.\n\nI assume the first shot hit her. I don't know whether it did or  didn't. That is my assumption, so I am saying that. But we do know  this: There were additional shots fired as she passed by through her  window--the window was not up; it was not elevated--through her…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…because we have immigrant roots, we shouldn't be demonizing  people like this young 5-year-old's family and terrorizing them as we  are.\n\nAny policy that begins with the assumption that immigrations are a  problem or a threat or a public safety concern, instead of beginning  with the reality that our immigrant communities have been part of the  great…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…because Republicans didn't hold a  hearing on the legislation to bring in a witness from the Park Service  to answer any questions, but there are two problems with this  assumption they seem to be proceeding under.\n\nOne, the current rule was issued under a settlement agreement to  enforce compliance with environmental protection laws. Repealing that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Comitatus, is extremely  scary because it explicitly has in the law a certain interpretation by  the President, or deference to interpretation by the President. The  core assumption was that a person in that position would always be a  person who had high regard for the Constitution and for the boundaries  and for the liberties and for the freedom and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…in 2020.\n\nCitizens United, which allowed corporations and unions to       raise and spend unlimited amounts on elections, was premised       significantly on the Court's assumption that all of this       newly permitted election spending would be transparent. In       reality, many of the groups the Court allowed to spend money       on elections were…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…shipments to countries without free trade  agreements.\n\nIn other words, this bill assumes automatically and without review  that every LNG export is good for America. That assumption is not only  irresponsible, but it is also dangerous and absolutely false.\n\nAnalyses have shown that increasing LNG exports drives up natural gas  prices here at home. DOE's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…efforts to protect wetlands and water resources and       is now blocking Florida's ability to issue necessary permits       for development projects across the State.\n\nState ``assumption'' of the Section 404 program is an       important part of the Clean Water Act's cooperative       federalism structure. Assumption can streamline permitting       processes,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an incredible  parish from my district--Assumption of the Blessed Virgin Mary (BVM)  Parish in Feasterville, Pennsylvania. This year, Assumption BVM  celebrates its 75th Anniversary, an exceptional milestone that reflects…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…incomplete  update, assumes there will still be Federal dollars. They are saying  there is a $7 billion budget shortfall for just the next few months,  and that has an unrealistic assumption that goes with it that there is  going to be further Federal funding.\n\nI can say this right now: There will not be further Federal funding.  How do I know that? Because I…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Policy Act of 1969 (42 U.S.C. 4321 et       seq.), and other provisions of law that further the purposes       of such Act, is otherwise specified in law.''.\n\n(2) Tribal assumption of environmental review       obligations.--Section 305(c) of the Multifamily Housing       Property Disposition Reform Act of 1994 (42 U.S.C. 3547) is       amended--\n\n(A)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…yesterday--and I can  do this off the top of my head--basically said the 3 years cost $80  billion.\n\nThe reason it is lower than my $105 billion is because they made an  assumption that this year, if the Senate were to pass these, that there  will be a delayed sign-up, so there will be half a year or so where  people--but if they did a claw back, the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…contracts using Fryingpan-Arkansas project facilities.\n\n``(2) Operations and maintenance.--The contract for the       Arkansas Valley Conduit shall provide for the assumption by       the contracting parties of the care, operation, maintenance,       and replacement of the conduit.''; and\n\n(2) in section 2(b)(3)(A), by striking ``this section''…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…have  been terrified by the Democrats realize that their benefits are  untouched? Well, we are going to find out.\n\nWill the national debt balloon? Only if you accept the assumption  that the economy will grow at an anemic 1.8 percent next year. The  average 20th century growth rate, including the Depression, was 3.3  percent. A mere 3 percent growth…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…hundreds of truckers protesting the COVID vaccine mandate  in 2022.\n\nSurely, this totalitarian surveillance tool would never take root in  the United States. However, that assumption would be wrong. This is not  a theoretical risk. It is a very real and very dangerous precedent.\n\nUnder the Biden administration, financial surveillance was a core  tenet…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Mr. Speaker, I rise today to recognize the  extraordinary achievement of the Davenport Assumption girls' soccer  team, who have once again made Iowa history.\n\nWith a 2-0 victory over the number one ranked Denver Cyclones, the  Knights captured their record-setting 12th…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…have one here of Angelica Maria Francesco in Alabama in 2024, an  illegal alien charged by Federal authorities with nine criminal counts  in connection with her fraudulent assumption of the identity of a U.S.  citizen, including voter fraud.\n\nWe have Alford Nelson, as known as Alford Samuels, in Florida in  2024. Alford Nelson was known as Alford Samuels,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…basis,  so it must be acknowledged that the people of California have spoken.  Even though there is an ongoing Federal challenge to the new map, I am  proceeding under the assumption that the new map will govern the  elections in 2026.\n\nI did want to point to one particular provision in Prop 50 that I  actually support. Indeed, I think a good part of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the power to take this vital  freedom away from the people or to punish anyone solely for expressing  their opinions.\n\nWe have based our entire form of government on the assumption that,  when exposed to all sides and all viewpoints, more than half of the  people are going to get it right more than half of the time. This  assumption has served us well…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…and businesses. This dedication is further seen in the development of  programs and coursework that meet the workforce development needs in  the region, along with their assumption of the Small Business  Development Center and the Zone 9 Police Training Academy. Clinton  Community College and its leadership have always worked towards  building the best…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Goodyear plant located in the district of my neighbor,  Congressman John McGuire, and that facility would be affected.\n\nIn the Rules Committee, I was erroneously under the assumption that  this might affect my Yokohama Tire plant today. I still submit, Madam  Speaker, that it could affect them because what happens at the EPA, if  they do it now on the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…myths and false claims that are  propagated to suggest that this bill will somehow increase the debt are  totally false and using a baseline, a CBO score, with a growth  assumption based on the policies and laws of the last 4 years.\n\nI think 1.8 percent growth is actually generous considering the last  4 years and the economic policies of our Democratic…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}]