[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…for wanting to shroud  what they have set out to do tonight in secrecy. I don't blame them for  trying to hide it. It was just a few short weeks ago the Republican  leader assured this body that he would never do any such thing, but  that was then.\n\nBut hide or not, the blame will lay squarely on my Republican  colleagues for the impact of what is done…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…agreements by enacting one-sided decisions  like what my Republican colleagues are going to be doing here, the  appropriations process will simply break down.\n\nHow can we be assured that these bipartisan agreements are being made  in good faith if Republicans are just going to turn their backs on them  just a few months later? How can we be sure that…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…That was the commitment I asked President Trump's nominee and the  current Director of National Intelligence, Ms. Gabbard, to make during  her confirmation hearing, and she assured our committee and the  American people that she would protect the independence of the  intelligence community to ensure that the IC is never politicized. She  even pointed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…has changed? What deals have been made?  The American people deserve to know. We, as Members, on both sides of  the aisle, deserve to know before casting our votes.\n\nI was assured that nothing had changed. There were no agreements  made.\n\nThen the very next Republican speaker, who is one of those hard-line  conservatives, gave the game away and said…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…a former era when America became economically paralyzed due to  oil embargoes and dirty manufacturing.\n\nThree of the projects across our country for which funding had been  assured are from well-respected Ohio  companies: Libbey Glass, Owens-Illinois Glass, and Kraft Heinz.\n\nLet's talk about Libbey. This historic company holds deep roots in my  hometown…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…who have placated the legislature and judiciary while       wielding outsized influence over public policy, all while       bypassing democratic accountability.\n\nPlease be assured of my prayers for you and your leadership       during this critical moment in our nation's history. May you       find strength in your faith and courage in your convictions…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…causes or tolerates the suffering  of children can claim to be their protector.\n\nLove for our children would ensure each of them have every single  thing they need to thrive assured to them.\n\nMadam Speaker, I urge my colleagues here in the House of  Representatives to vote ``no.'' Let's build a future where our  children, including our transgender little…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698344/protect-childrens-innocence-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…must bar the       president along with all elected officials and their families       from owning, buying or otherwise trafficking in stablecoins.       Americans must be assured that policy won't be fashioned by       those profiting from the shape of the legislation.\n\nFurther, Congress should approve an amendment that restates       conflict laws…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…because for 80 years, as Robert  Oppenheimer and others hoped after revealing to the world the immense  destructive power of an atomic bomb, the inevitability of mutually  assured destruction itself has deterred the use of those nuclear  weapons.\n\nIt is different today. With mercurial leaders like Vladimir Putin and  Kim Jong Un, we cannot rely on deterrence…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…measure of military success, Ukraine has done the  impossible. I am not giving away classified information when I tell you  that in the days right after the invasion, we were assured by our  military that the Russians would be in Kyiv within weeks. They weren't.  The only reason they weren't was because of the ingenuity and  inventiveness and just plain…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…politician and a heartless man.\n\nJust a few weeks ago, Trump's own USDA confirmed it had $6 billion in  emergency funds to keep food and aid following. When asked about SNAP,  Trump assured everyone it will be fine; he said it.\n\nThen suddenly, last Friday, Trump ordered USDA to delete the plan,  take it off their website, and refuse to use the money. No reason.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…honorable service. We celebrate the difference he made with a lifetime  of intention and of active citizenship for this beautiful land and our  people.\n\nThose who know him can rest assured they will never ever meet his  likes again. May God protect him, bring him peace, and allow his spirit  to soar with the eagles.\n\nMr. Speaker, thank you for allowing me to…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…gunsmoke cleared from the Gaspee's deck,\n\nThe Rhode Islanders had her as their prize,\n\nAnd her crew bound up in chains and ties.\n\nWhen the crew was ashore, Pawtuxet's Rangers\n\nAssured they'd present us no further danger.\n\nBack to the Bay, in the dark of the night,\n\nWent the Gaspee Raiders to set her alight.\n\nThe fire spread through the Raiders' prize,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…the largest and most responsive fire agencies  in California, operating 41 state of the art fire stations  strategically positioned across the region. Sacramentans can rest  assured knowing Metro Fire's highly trained professionals are prepared  to handle a diverse range of emergency situations.\n\nBeyond emergency response, the Metro Fire district excels…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…working with local governments and  others, trying to develop affordable housing projects.\n\nHe was working specifically with a county in outer Northern Virginia.  He had been assured everything was set. He was going out to the meeting  where it was going to be ``project approved.'' He got to, again, the  county offices. And it was at a time during the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…horrors.\n\nSocialism has no place in our country. Unfortunately, so-called woke  liberals in New York City don't seem to understand that socialism is  nothing more than mutually assured poverty and recently voted to bring  these failed policies to their own once-great city.\n\nWhile I am saddened that New Yorkers will be willing victims of  Zohran Mamdani's…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697155/denouncing-the-horrors-of-socialism"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…American culture.\n\nDoug was a steadfast warrior for the country and State he loved. He  will be sorely missed. His faith, grit, and authenticity have inspired  us all. Rest assured, we will continue to carry on the torch that Doug  championed so well.\n\nWe know where Doug is at this moment. Our prayers are with him, with  Jill, and with his family. Rest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698718/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…executive branch       agencies; (2) the nominee has filed a financial disclosure       report and a related ethics undertaking with the committee;       (3) the committee has been assured that the nominee does not       have any interests which could conflict with the interests of       the government in the exercise of the nominee's proposed       responsibilities;…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…ultrasound, and  for the very first time, we saw our child, who, at that time, was about  the size of a peanut. Half of that peanut was a heartbeat. Most  importantly, they assured us that our child was okay and would be just  fine.\n\nWhen we went to leave, I had just one question for them: How much do  we owe you? They looked at us and they said: Guys,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…law, and  these good people who are being forced to work or who have been  furloughed can get the pay they deserve. Again, today, tomorrow, and in  the future, they will be assured they will never ever be used like  pawns in these partisan games.\n\nAgain, I underscore that I will not modify my request.\n\nMr. JOHNSON. Will the Senator yield?\n\nMr. JOHNSON.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…go after the people who attacked us. When we were attacked  at Pearl Harbor, once again, the vote was virtually unanimous to go to  war.\n\nJames Wilson, one of the Founders, assured Americans at the  Pennsylvania Ratifying Convention that the proposed Constitution would  not allow one man or even one body of men to initiate hostilities.\n\nIn Federalist…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Charge Maria Thomas for the       Department of the Army Criminal Investigation Division,       Central Texas Field Office. ``The Army community, and the       public, can rest assured that we remain committed to       aggressively pursuing anyone that uses government programs       for their own personal gain.''\n\n``Mello's penchant for extravagance is what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…ignore the cost of backup generation needed to keep the  lights on at night or when the wind isn't blowing. The low-cost claims  don't account for these expenses, but, rest assured, utility customers  still pay for them.\n\nAnd last, but not least, eliminating these subsidies is fully  consistent with an all-of-the-above energy strategy.\n\nI believe in…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…individuals and Chairman Calvert,  we were able to secure $29 million in the FY25 CR spend plan for the  Department of Defense for these nonrecurring engineering expenses.\n\nRest assured, I will continue fighting to secure the additional  funding in the final FY26 Defense bill.\n\nBefore I withdraw this amendment, I ask Chairman Calvert to commit to  working…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Norman too  acknowledged that he at times wondered ``what it all amounted to'' and  sometimes feared the answer was ``not much.'' But nothing could be  further from the truth, I assured him. For nearly 70 years, Norman  informed, educated, persuaded, and succeeded with his words. He taught  multiple generations not just to love our country but also why we…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…yourself.\n\nTo the students of this Nation, I would encourage them to ``see you  at the pole'' next Wednesday morning.\n\nThis coming Wednesday morning, September 24, you can be assured I am  going to be parked across the street from a campus watching a group of  students pray for a Nation that needs help. I will join them and say,  ``God help us. We need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…and President Trump's  leadership, we will be prepared to meet this nasty parasite if it  arrives in the United States. Texas cattle ranchers and beef lovers  alike can rest assured knowing that Secretary Rollins and President  Trump and the U.S. Congress are on the job.", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…United States should do whatever it is able to do  to assist in the return of normal economic health in the world, without  which there can be no political stability and no assured peace.''\n\nAmerican security and stability depended on European security and  stability, not least because conflict with Nazi Germany was succeeded  immediately by the threat…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…already  precarious humanitarian crisis in Venezuela and lead to mass migration  into neighboring countries already struggling under the strain of  millions of refugees. And rest assured, many of those who flee the  disaster of the war that will come will make their way to the United  States.\n\nMost consequentially, any military operation comes with the risk…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Governor Sarah Sanders,  Arkansas Parks & Tourism, the leadership of our Game and Fish  Commission, and many other local  leaders and outdoor recreation groups in our State.\n\nRest assured also, Mr. Speaker, the current forest management plan  for Flatside already includes prescribed burns, fire suppression  techniques, and reiterates the authority of management…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}]