[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…on and feel like:  Oh, maybe we should have done this differently.\n\nThe most likely vote where regret would be most painful is a vote on  matters of war.\n\nAnd I just want to assure my colleagues: Here is something I can  guarantee you. No one has ever regretted--no one has ever regretted--a  vote that just says: Mr. President, before you send our sons…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…elect their own city officials  and to govern themselves in local affairs.\n\n``As the Nation approaches the 200th anniversary of its founding, it  is particularly appropriate to assure those persons who live in our  Capital City rights and privileges which have long been enjoyed by most  of their countrymen.''\n\nThe over 700,000 D.C. residents, the majority…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…protect our air, water, and  open spaces for all to enjoy health and the joy of getting outside in  our beautiful State.\n\nA better future is possible if we fight for it. I can assure you all,  I came here to do just that. It is time for the Federal Government to  stand up for working families and break up the monopolies and power  circles that are holding…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…expand our  cemeteries as is required to make sure we provide places that honor our  veterans? This basic information is an absolute prerequisite for us to  do our job and assure that veterans are really honored on this Memorial  Day and every day of the year.\n\nWe owe our veterans that honor--honor with action--every day, not  just Memorial Day. Americans…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Furthermore, the deal includes no security guarantees from the United  States, which the Ukrainians have--rightly, I believe--insisted upon.  Security guarantees are essential to assure Ukraine that the United  States is not simply interested in an enrichment scheme but is  committed to the pursuit of a just and lasting peace.\n\nIndeed, a just and lasting peace…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Zelenskyy tried to remind President  Trump and Vice President Vance about last Friday--betrayal of  agreements by Vladimir Putin. He is a thug. He understands force. He  will assure the security of Ukraine only if force is guaranteed to meet  another invasion if this one is stopped.\n\nOn these negotiations and the timing, Senator Van Hollen said it  well.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…future. They are not  talking about today. They are talking about preparedness for the  future.\n\nMr. Chair, if you want a ribeye steak, cultivated meats can create  that, and I assure you it will be delicious. They will love it, and  they will not know the difference. Our military will not know the  difference.\n\nMr. Chair, if we take this even out of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…elect their own city  officials and to govern themselves in local affairs. As the Nation  approaches the 200th anniversary of its founding, it is particularly  appropriate to assure those persons who live in our Capital City rights  and privileges which have long been enjoyed by most of their  countrymen.''\n\nD.C. residents have all the obligations of American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…that taxpayer dollars were not being used to fund discrimination.\n\nBut despite the President's reckless actions and the acquiescence of  congressional Republicans, we need to assure the public that many are  still fighting for diversity, equity, inclusion, and accessibility.\n\nNow, this is not just a fight in Congress. That is why we have asked  these organizations…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…permits  would qualify in this bill in lieu of the special use permit process  that would ordinarily apply.\n\nMr. Speaker, how can we look the American people in the eye and  assure them that no environmental safeguards are going away when we  don't even have that very basic information? For many in the majority,  the truth is, the details just don't matter.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…hurricane victims  in an effort to try to force a State government to take an action that  this or that Member of Congress or this or that President wants them to  take.\n\nI want to assure the country we are going to build back better. We  are going to make sure that the Palisades does not burn again. We have  a very strict fire building code that is applicable…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…of their insurance.\n\nThis agenda to strip healthcare for millions and raise healthcare  costs for tens of millions is not what the American people are  clamoring for, I can assure you.\n\nWisconsinites have been crystal clear that they need lower costs. The  last thing they need is their healthcare premiums to be jacked up or,  worse, not even being able…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…the statement made in Spanish is as follows:)\n\n``This is a historic moment for our community. It is an honor to be  the first Latina to represent Arizona in Congress. Let me assure you,  while I am the first, I will not be the last.''\n\n``Este momento es historico para nuestra comunidad. Es un honor ser  la primera latina en representar Arizona en el Congreso,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…then, and he is right now.\n\nI am going to bring those Articles of Impeachment.\n\nThe public is constantly asking me: How many votes do you think you  will have?\n\nI can only assure them of one thing, Mr. Speaker: I will have one  vote. This I can assure them of. I will have one vote.\n\nWhy?\n\nIt is because I believe that it is better to stand alone on some…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…sometimes  survival, it is fundamental fairness.\n\nThey were promised. They have earned it. They deserve it. They need  it. They ought to have it.\n\nAnd this measure simply would assure a vote--a vote. We ought to face  our responsibilities. Maybe my colleagues, even though 76 of them have  cosponsored--that is three quarters of this body--maybe it would still…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John James", "party": "Republican", "sentence": "…would  agree.\n\nGavin Newsom may be content with being the number one State for  declining population, losing nearly 1.2 million Californians from 2020  to 2023. Mr. Speaker, I assure you that I am not. This Biden-era waiver  allows California to ram its comply-or-die, zero-emission truck rule  down the throat of the American trucking industry, essentially…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…car of their choice. In fact, Biden  used liberal California to force a one-size-fits-all solution  nationwide. One State should never dictate national policy because I  can assure my colleagues that what works in California sure doesn't  work for the people of my great State of Michigan.\n\nIn fact, this policy only hurts Michigan auto manufacturing jobs,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Belarus.\n\nMr. Dodik should be on notice then that the United States is watching  to see that he stays on the straight and narrow that he wants us to  believe that he is on.\n\nI can assure you that this Senator will be on the lookout for any  destabilizing actions that threaten the peace in Bosnia. And I will  work with the Trump administration to make sure that…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696528/bosnia"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…immune system. It builds healthy  habits, and it tastes great.\n\nAs the grandson of a dairy farmer, as an OB-GYN for over 30 years, it  may seem like I am a bit biased, but I assure you this legislation is a  slam-dunk solution for our Nation.\n\nOf course, there is always room to improve our public health, and I  look forward to working with our colleagues…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…character of our region. They provide jobs and economic activity.  They provide recreation and joy, and they are open to all.\n\nMr. Speaker, I will fight in every way I can to assure that they  remain open to all and that the will of our local communities is not  subordinated to decisions made in Washington, D.C.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692816/do-not-mess-with-our-public-lands"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…something. I am not interested in just  putting on a show. My bill will pass the House of Representatives, and  my bill will be signed by the President.\n\nSenator Paul's bill, I can assure you, will not pass the House of  Representatives, and President Trump will not sign it. I am not saying  someone is right or somebody is wrong. President Trump does not  consider…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California just in 1 year, as  well as receiving Federal funding and receiving generous subsidies from  the city of Los Angeles.\n\nI introduced the No Tax Dollars for Riots Act to assure that this  does not happen again. As if to underscore the need for this  legislation, this same group, CHIRLA, that helped organize the L.A.  riots, has now announced that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…least some payment for the death of  cattle caused by wolves. These programs, although welcome, come nowhere  near to making those damaged by wolves whole.\n\nIn addition, I can assure everyone that the rancher would absolutely  be happier if he or she could completely avoid the losses that lead to  asking for justice under these programs.\n\nIf we are properly,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Biden-Harris  administrations were guilty of using the EPA to promote radical policy  designed to drive out baseload generation in favor of wind and solar,  which simply cannot assure adequate grid reliability. It increases the  risk of rolling blackouts.\n\nH.R. 3616 will correct that very problem by improving Federal  rulemaking to ensure that future regulations…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…also note that I think it is shockingly racist and sexist for my  colleagues on the other side to believe that we are not smart enough to  figure out how to get IDs. I can assure my colleagues that we are, even  if we get married.\n\nThe SAVE America Act requires individuals to provide documented proof  of U.S. citizenship along with a valid photo ID…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…recreational, fish and wildlife, or historical or scenic       value'' and requires that exploration in these areas ``shall       be conducted in a manner which will assure the maximum       protection of such surface values to the extent consistent       with the'' statute's requirements for exploration activities.       BLM refers to these lands…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Secure  Rural Schools Reauthorization Act, I am very glad and relieved this day  has finally come.\n\nMr. Speaker, seven of the counties in my district rely on this  program to assure every child has access to a quality education and to  provide important public services.\n\nThroughout the period in which this fund has lapsed, I have met with  many of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697664/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…to Washington, we are more determined than ever to  continue our work to enact commonsense policies that benefit all  Americans.\n\nIn the days, weeks, and months ahead, I can assure my colleagues more  stories of the benefits of the One Big Beautiful Bill Act will be  heard. The fear-mongering from the Democrats is just going to have to  stop. We are excited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…it and its Project Vote  registration affiliate from 2005 until 2006. She said: It is ludicrous  to say that fake registrations can't become fraudulent voters. She  said: I assure you if you can get them on the rolls, you can get them  to vote, especially using absentee ballots.\n\nThere were documents that were provided by the whistleblower that  indicated…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, first of all, I will assure the Chair that  I will not be speaking for 60 minutes. I will be kind of amazed if I  get to 25.\n\nWe now go on a work period back in the district for a little over a  week.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]