[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…National  Guardsmen, before we had even gathered the full facts, to scapegoat  Afghan allies and immigration communities, has been repugnant. The  administration swiftly suspended asylum decisions, halted the issuance  of special immigration visas, and prioritized Afghans for deportations.\n\nRepublicans who just last year spent every day ending in y  criticizing…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…week. Yet,  once again, the master of distraction seeks to avoid any accountability  for his role in this tragedy. Only 7 months earlier, the Trump  administration granted asylum to the assassin.\n\nBig unanswered questions for the President: What specific vetting was  done with regard to the 3 years that this assassin lived here in  America? Was his…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697312/attack-on-two-national-guard-members"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…destruction of due process, not  just now for U.S. citizens but for people who are here whether it is a  legal status or because they have been invited to this country to apply  for asylum.\n\nI want to go ahead and speak a little bit more about Andry Romero,  this young gentleman right here. He is a gay hairstylist and makeup  artist who came to the United States…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690508/trump-immigration-policies"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…at the border.\n\nInstead, ICE agents are scrambling to meet Stephen Miller's quotas by  arresting people at work or when they attend court hearings on their  legal cases for asylum or citizenship, as they are required to do, and  the hell with the impact on the local community, or, in the case of the  disastrous raid on the Georgia battery plant last…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…been used during peacetime as  grounds to send Department of Homeland Security agents to the homes of  individuals with varied alien status, including permanent residents and  asylum seekers, arrest them, and either detain them indefinitely or  forcibly deport them. Lawyers representing the subjects have been  denied access to their clients as well as access…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Turner, Attorneys at Law; Tzedek DC.\n\nUntiedt Dabdoub, PLLC; Urban Justice Center; Urofsky Legal       Advisory Services, PLLC; VECINA; Vera Institute of Justice;       Vermont Asylum Assistance Project; VIDAS; Virginia Poverty       Law Center; VKV Law Group, LLC; Vogele Law PLLC; Volunteer       Lawyers Project of CNY, Inc.; Walden Law, PLLC; Washington…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…and children seeking refuge in the United States to Panama  on U.S. military aircraft, locking them in hotel rooms without access  to basic rights or counsel.\n\nThis includes asylum seekers from Iran, China, and other countries  known to persecute religious minorities. They have since been deported  to detention camps in a remote jungle and are being forced…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…of American companies, people just trying to make a  living. They are not only deporting people who came here illegally.  They are going after legal green card holders and asylum-seekers,  locking them up with no due process. Students who had the gall to write  an op-ed expressing their opinion on a political issue are being locked  up for deportation.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…not true. ICE agents  are terrorizing not just immigrants, but U.S. citizens, sowing chaos,  murdering an unarmed American mom in broad daylight, and deporting  veterans and asylum seekers who are here legally.\n\nAnother campaign promise: Donald Trump said he would lower prices on  day one. Oh, my God, Mr. Speaker, has anyone in this administration  gone…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…records.\n\nA report from ``60 Minutes'' just last month showed that 75 percent  of those deported to CECOT had no criminal record. These were people  who in many cases had pending asylum cases or some other sort of  immigration protection. But simply because they may have tattoos, the  Trump administration has decided to use them for a poorly executed and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…``terrified''--she uses this word--she is ``terrified'' of  her daughter losing her Medicaid. She is so afraid, she is literally  talking openly about going to Canada and asking for asylum there so  that her daughter has her healthcare needs met. That is outrageous to  me, that an American who is fearful for their child would think about  fleeing to Canada for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…opportunity to draw attention to another case that  has captured the public conscience, that of Andry Jose Hernandez  Romero, a 31-year-old gay Venezuelan makeup artist and asylum seeker  who was forcibly disappeared without due process.\n\nAndry entered the United States legally, fleeing persecution for his  sexual orientation and political beliefs. He…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…these raids, my constituent Fatima Velasquez-Antonio, was  detained. She has work authorization, no criminal record, and is  allowed to legally remain in this country while her asylum case is  pending.\n\nYet despite all of this, she was taken into custody and ripped away  from her family for weeks. Thankfully, after an outpouring of public  anger and criticism,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699039/ice-raids-in-north-carolina"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Five, it terminates the IRS Direct File program, a successful, free  tax filing service that helped over 140,000 people file their taxes in  2024.\n\nSix, it increases fees on asylum seekers and dumps billions into  Trump's mass deportation efforts.\n\nSeven, get this: The Republicans' bill is great for Big Oil and Gas.  It turns over millions of acres of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…lawful status so they can be deported. We just  saw this on Kauai recently, where a raid that swept up 44 people ended  with six Venezuelan men--who were legally here seeking asylum--self- deporting after the administration revoked temporary protected status  for their country. To anyone who thinks this could never happen to me,  consider this: Two-thirds…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697462/fighting-dhs-immigration-raids"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…any event, we have to ask ourselves: How do we handle this huge  influx of people coming into the country? If people come here and lie  and say that they are coming here for asylum, it seems to me that the  only alternative is to remove them, or we have no immigration law,  right?\n\nIf the word gets out that you come to the United States and, as long…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…country during the Biden administration can be  removed.\n\nIn addition to the criminals, there are roughly 1\\1/2\\ million people  who have pursued some relief in the form of asylum but have been denied  any sort of relief from immigration laws and who have been ordered  removed from the country but have simply stayed in the United States  and defied being…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…House. Two young National Guardsmen, who had served their country like  the Presiding Officer, who were doing their jobs of keeping us safe,  were ambushed by a gunman here on asylum.\n\nIt was 20-year-old Sarah Beckstrom who tragically perished from her  injuries and 24-year-old Andrew Wolfe who remains in critical, yet  stable condition.\n\nWe all in the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…be reserved  for American citizens.\n\nIn Illinois, JB Pritzker and the Democrats rolled out the red carpet  and actively enticed illegals and those covered by Biden's bogus asylum  programs to settle in my State, to the tune of over 500,000 people.  They received welfare benefits, CDL licenses, and State identification.  The Democrats have even voted…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…which I was alluding to before on  H.R. 2, that is legislation designed to codify effectively what  President Trump is doing: to stop the abuse of parole, to stop the  abuse of asylum, to stop the abuse of catch and release, to stop all of  the abusive ways in which an exploited border can undermine our  security and endanger us.\n\nWe cannot rely on the administration…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…southern border is  ridiculous. Many people are coming here. Obviously, if we are going to  enforce the law, we have to remove the people who came here by  pretending they needed asylum and didn't. Then, there are going to be  millions of people, and the same people who encouraged them to come  here, knowing full well they were breaking the law or having to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…illegally present in the United States. We know that the previous  administration let in millions of people into the United States,  wrongfully and illegally under parole and asylum, blatantly abusing the  law to put people in the United States that have no basis for being  here, many of whom carried out dangerous acts against American people,  killed…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…allows for isolated cases of parole, they  released thousands en bloc.\n\nMr. ROY. Hundreds of thousands en bloc under parole, an abuse of the  law, an illegal act, abuse of asylum to release people in our country,  and then wide-open borders where people were flooding across the river.\n\nDid that in totality, coupled with people overstaying their visas,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…been very clear. Migrants cross  the border and surrender to authorities. They repeat carefully  rehearsed lines, provided by NGOs, to meet the bare minimum threshold  for asylum. They are released into the country and set a court date  years in the future. They will begin to actually receive healthcare  benefits at the expense of taxpayers, who have…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…criminal leniency initiatives that have not  only put law-abiding Americans in danger but also police officers, too.\n\nThe fact is, we are letting the inmates not just run the asylum, but  letting the inmates run our communities. Then, under the Biden  administration, we are inviting other countries to dump their prisons  out into our communities. The radical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…noncriminal  immigrants out of court, where they are going through a lawful process  to come in here, so that they can be removed in expedited removal; so  that they can have their asylum claims, a lawful pathway, voided; and  so they can be kicked out of the country with minimal due process just  so Republicans and President Trump can meet their quota of mass…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Americans and fit in our culture, which means they are law-abiding.\n\nJust in general, the idea of having a million people breaking the law  to come here, saying they need asylum when they don't, means they are  not going to fit in with our culture.\n\nFinally, I will share a word from Mark Reihl, back from my State  legislative days, of the carpenters…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690016/this-country-has-immigration-laws"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…comprehensive border security plan we have ever had. It wasn't  about future flow. It wasn't about amnesty. It was about securing the  border. It was about fixing the broken asylum, the broken parole, the  broken catch and release, all of the things that Biden and Mayorkas  were using to abuse our system to flood our country with foreign  nationals.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…forbid.''\n\nThat is what the phrase ``suicidal empathy'' is meant to describe. We  open our borders and import millions of unvetted refugees because we  can't bear to turn a single asylum seeker away. We empty out our  prisons because we just can't stomach the thought of keeping anyone  behind bars.\n\nWe let violent criminals off with a slap on the wrist because…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}]