[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…consequence, it must  of necessity owe the secure enjoyment of indispensable outlets for its  own productions to the weight, influence, and the future maritime  strength of the Atlantic side of the Union, directed by an indissoluble  community of interest as one nation. Any other tenure by which the West  can hold this essential advantage, whether derived…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Fisheries Science Center work  to maintain healthy fish populations to support local fishermen.\n\nIt is in my home State of Rhode Island, the Ocean State, where NOAA  is building Atlantic Marine Operations Center, which will centralize  its operations and take advantage of the expertise found in Rhode  Island and our nearby States.\n\nWe have an incredible concentration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…in the United States Navy at the age of 17. He went on to  serve with distinction as a Petty Officer Second Class, participating  in several major campaigns, including the Atlantic Invasion of North  Africa and the pivotal battles of Iwo Jima and Okinawa in the Pacific  Theater.\n\nDuring the Okinawa campaign, Mr. Drake and his fellow sailors bravely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…working at WJIZ, where he earned the title ``No. 1 Soul Wax Man,''  famously known as ``The Love Man--6 Foot 2.'' He also collaborated with  prominent organizations such as Atlantic Recording Company in New York,  WDAS Radio Broadcasting Station in Pittsburgh, PA, and WOAK in Atlanta,  Georgia.\n\nAs an astute entrepreneur, he founded and served as President…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…required immediate hospital care.\n\nMr. Speaker, I had the honor of representing the Connecticut  submarine base where the USS Delaware and its crew are homeported. In  the north Atlantic, our subs have conducted joint NATO patrols in the  waters off Greenland, Iceland, and the U.K. for many decades which  benefits U.S. Homeland Security. It is a team effort…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700095/thanking-the-people-of-denmark-and-greenland"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3428, a bill to direct the GAO  to review the three Mid-Atlantic River Basin Commissions and report on  the practices and Federal responsibilities of each commission.\n\nThe Mid-Atlantic River Basin Commissions serve an important role in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695002/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…production in our part of  America.\n\nBy the way, the Great Lakes St. Lawrence Seaway is built too small  because the coast didn't want us to succeed. We are far from the  Atlantic. We can't get to the Pacific out of our part of the country  other than by train, so we needed a way to move our product. They  figured it out with the help of President Eisenhower…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…1949. The alliance has more than doubled its membership since its  founding. Central to the enlargement is NATO's open-door policy,  enshrined in article 10 of the North Atlantic Treaty, which affirms a  core NATO tenet that any European nation that demonstrates a  willingness to contribute to our collective security and the values and  obligation…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…is that simple.\n\nWe can't let a bunch of climate-denying Republicans in Congress  gamble with New Jersey or other coastlines. I think about it like a  slot machine on the Atlantic City boardwalk: We will just hope that the  storm doesn't come, and we will be okay.\n\nMr. Chairman, that is not what happens. The reality is that places  like the Jersey shore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694863/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…time as I may  consume.\n\nMadam Speaker, I rise in support of H.R. 36, a bipartisan bill  designed to make sure that the United States remains committed to  Georgia's Euro-Atlantic and democratic aspirations.\n\nI thank my friend, the gentleman from South Carolina (Mr. Wilson),  for his tireless efforts on this topic, in addition to his fervent work  to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…from key cities, take away longtime tax deductions, impose their values  and policies, and now curtail transportation options.\n\nThose of us who represent northeast and mid-Atlantic States get the  message loud and clear: We don't count.\n\nAmtrak represents growth and expansion for America. When we treat it  as such, we will see more of these benefits…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692196/northeast-corridor-amtrak-cuts"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…alumni have received 9  Nobel Prizes and registered more than 11,000 patents. Its impact has  shaped not just Israel but the whole world, including in Virginia  through the Mid-Atlantic Branch of AFHU. Benefactors of HU and this  celebration include so many whose legacy can be seen across Virginia  and the Mid-Atlantic region: the family and descendants of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697239/100th-anniversary-of-hebrew-university-of-jerusalem"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…no desire to be a part of this coverup,  but he is only there in that he was the person who, in a sense, acts as  a whistleblower. I am talking about Mr. Goldberg with The Atlantic  magazine.\n\nMr. Goldberg is the person who had messages sent to him that he did  not seek and that he did not ask for. According to the reports that I  have read and you have…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…consequence, it must of  necessity owe the secure enjoyment of indispensable outlets for its own  productions to the weight, influence, and the future maritime strength  of the Atlantic side of the Union, directed by an indissoluble  community of interest as one Nation. Any other tenure by which the West  can hold this essential advantage, whether derived…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…more than 3,150 flight hours in the F-15 Eagle and  other aircraft, and has participated in combat and support missions in  Operations SOUTHERN WATCH, ENDURING FREEDOM, and ATLANTIC RESOLVE.\n\nAfter a decade of active duty, Colonel Halasi-Kun joined the  Massachusetts Air National Guard in 2008, where he has served with  distinction for the past fifteen…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…stepped up to  assume some of the financial support for the war, most recently  agreeing to a $105 billion loan for Ukraine.\n\nThere is much more I believe both sides of the Atlantic can do to  assist Ukraine. I called for providing Tomahawk missiles last summer,  and the European Union should use Russian foreign reserves to help pay  for Ukraine's war…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "Mr. BARRETT. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3428) to require the Comptroller General of the United  States to conduct a review of the Mid-Atlantic River Basin Commissions,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3428\n\nBe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…numbers. They are real solutions for the families who  sacrifice so much to serve our great Nation.\n\nFinally, I traveled to Wallops Island in my district to visit the  Mid-Atlantic Regional Spaceport, where Virginia is playing a vital role  in America's return to the Moon and preparation for Mars. The One Big  Beautiful Bill Act provides nearly $10 billion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, I am proud to introduce H.R. 3428, the  Mid-Atlantic River Basin Commissions Review Act.\n\nThis legislation will bring much-needed oversight and clarity to the  activities and funding streams for the Delaware River Basin Commission,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…of Beaches Emergency  Assistance Ministry, BEAM, a lifeline for families facing hardship in  eastern Duval County, places like: Mayport, Jacksonville Beach, Neptune  Beach, Atlantic Beach. From keeping the lights on to filling the  pantry, supporting seniors and single parents, BEAM continues to show  up with compassion and care.\n\nMr. Speaker, I know…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…are not Greenlanders but who live in  Denmark are justifiably disturbed and unsettled.\n\nIt is deeply unsettling, if you understand the immense value of  NATO--of the North Atlantic Treaty Organization--and how one cofounding  member taking land from another shatters this crucial alliance forever.  We have seen that in statements coming from our NATO…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Industry Group; Bennett, John: Roll Call; Bennett, Rema: The       Hill; Benson, Samuel: Politico; Benton, Nicholas: Falls       Church News Press; Berman, Russell: Atlantic Monthly;       Bernsen, Markus: Weekendavisen; Bertenthal, Ari: Broadband       Census; Bertuca, Anthony: Inside Washington Publishers;       Bikales, James: Politico.\n\nBlaine,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Assistance Initiative and our commitment to sharing  intelligence with Ukraine. Good for the President, and good for our  friends in the House and Senate.\n\nOur allies across the Atlantic are taking the lead now, as my  colleague from Kentucky just pointed out, in financing security  assistance for Ukraine. NATO allies are buying equipment from us in the  United…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…bag.\n\nHis life was forever changed when he applied and was accepted into  the American Field Service program and became an exchange student in  1955. He sailed across the Atlantic with fellow students. They spent  the time discussing American customs and culture.\n\nIt was on this ship that he was advised to avoid asking out girls who  wore a pin because…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…marking the beginning of a new era. The USS  Iowa is the third naval vessel to bear that name following a battleship  that served with distinction in World War II, both in the Atlantic and  the Pacific, in the Korean war and in the Gulf. That proud legacy now  continues beneath the sea. The legacy of the Gray Ghost and the new USS  Iowa nuclear-class submarine…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689656/recognizing-the-uss-iowa"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…and Cultural Affairs.\n\nThe U.S. delegation shall consist of experienced and accomplished  Hill staff who can contribute to the success of the exchange on both  sides of the Atlantic. The Bundestag reciprocates by sending senior  staff professionals to the United States.\n\nApplicants should have a demonstrable interest in events in Europe.  Applicants need…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699719/announcement-of-the-2026-congress-bundestagbundesrat-exchange"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…with general assemblies that have progressive ideas on energy that have  put restraints on energy that have driven up the price.\n\nUnfortunately, we have friends across the Atlantic we can look at.  They put these kind of policies in place, and Europe has three times  the energy prices that we have. What we are saying over here is that we  need to have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Europe, ask  them how mass migration is working out for them. They have done it, and  it isn't working.\n\nSo, if you have got any advice coming back from that side of the  Atlantic, I am not really interested on this topic or on censorship.  Maybe you can deliver the message that they ought to step up for their  own defense of their own continent in…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and pass the  bill (H.R. 1737) to direct the Secretary of Commerce to submit to  Congress a report containing an assessment of the value, cost, and  feasibility of a trans-Atlantic submarine fiber optic cable connecting  the contiguous United States, the United States Virgin Islands, Ghana,  and Nigeria.\n\nThe Clerk read the title of the bill.\n\nThe text…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Affairs of the House of       Representatives; and\n\n(D) the Committee on Appropriations of the House of       Representatives.\n\n(2) NATO.--The term ``NATO'' means the North Atlantic       Treaty Organization.\n\n(3) Secretary.--The term ``Secretary'' means the Secretary       of State.       SEC. 3. SENSE OF CONGRESS.\n\nIt is the sense of Congress that--…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]