[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…serving his community  throughout his life. McKinney bravely served during World War II in a  segregated unit of the U.S. Army Air Corps. He graduated from Morehouse  College in Atlanta after returning home from war, and then he went on  to earn a divinity degree from Colgate in 1952. He settled down in  Seattle, where he came to lead the congregation of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…There are massive cuts being made to science and research funding for  universities which have long been the basis for our innovation economy.  Whether in California, Boston, Atlanta, or around the country, we know  that high-end research creates jobs. It leads to innovation that leads  to new companies. It is what has made America great over time. Yet,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…her  3-year-old daughter and 5 months pregnant at the time, was brutally  beaten for demanding the desegregation of Albany, GA. That was July of  1962.\n\nJust this week, the Atlanta Journal-Constitution announced that the  Cold Case Records Review Board, whose purpose is to investigate civil  rights cold cases--the beatings, the killings and lynchings,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698140/civil-rights-cold-case-records-collection-reauthorization-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Georgia, gathering and guiding people in  worship.\n\nIn 1991 Bishop Williams answered a divine call to preach the gospel.  He pursued nonprofit and leadership training at Clark Atlanta  University and, in 1992, launched Gethsemane Worship Center  International in Albany from a small building on Baldwin Street leased  by then-Mayor Paul Keenan. With only…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Foot 2.'' He also collaborated with  prominent organizations such as Atlantic Recording Company in New York,  WDAS Radio Broadcasting Station in Pittsburgh, PA, and WOAK in Atlanta,  Georgia.\n\nAs an astute entrepreneur, he founded and served as President of  Flint River Construction, a respected general contracting firm known  for projects of regional…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…I rise today to welcome my  constituent George Glezmann home from more than 2 years of wrongful  detention by the Taliban in Afghanistan.\n\nGeorge is home with his family in Atlanta in large part because of  the tireless efforts of his wife Aleksandra. A devoted Delta airplane  mechanic, George has an infectious zeal for life, travel, and  experience,…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691683/welcoming-george-glezmann-home-to-georgias-5th-congressional-district"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…pressure on housing  affordability, making the problem worse--not solving it.\n\nJust last week, when people want to talk about GDP and where this is  going, it was amazing that the Atlanta Fed was forecasting GDP growth  over 2 percent for the first quarter of 2025. That is literally what  this line here was discussing, that the consensus was 2 percent, and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…that we already have?\n\nBeyond wildfire prevention, the roadless rule protects the water  sources that sustain our communities. Many people don't know that large  cities like Atlanta and Denver and Los Angeles rely on water supplies  from our national forests. In fact, some 180 million people--over  68,000 communities, large and small--rely on forested…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Martin Luther King,  Jr., on more than one occasion.\n\nReverend Middlebrook secured the appearance of Dr. King for multiple  strikes and also participated in multiple sit-ins in Atlanta while a  minister at Ebenezer Baptist Church, where Dr. King held a pastorate.\n\nI encourage my colleagues to join me in honoring the life of Reverend  Middlebrook by naming…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697618/reverend-harold-middlebrook-post-office-building"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Her fingerprints and legacy will be evident  in Columbus for many years to come. Her voice and vote were critical in  efforts to renovate Golden Park, which helped bring the Atlanta Braves  Double-A team to our city.\n\nJudy was a truth-teller, always voting her conscience, earning the  respect and admiration of those she served.\n\nThroughout her life, Judy…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…And he was recently taken to witness the release of other  hostages and then returned to captivity simply to torment him.\n\nI first met Evyatar's brother Ilay when he visited Atlanta and then  hosted Ilay in my office here in the Senate, and I was inspired by the  tenacity of his hope and his relentless effort to ensure his brother is  not forgotten. And…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691457/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…in our Nation's history. On May 18, we celebrate the 60th  birthday of Head Start. I take this time to acknowledge the leaders and  advocates from the YMCA of Metropolitan Atlanta, Georgia's largest Head  Start provider.\n\nThrough the years, my office has developed an outstanding partnership  with the YMCA of Metropolitan Atlanta as we work hand in hand…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…intimidate  voters in the Fighting Fifth.\n\nThe SAVE America Act is just another part of a scheme by House  Republicans and the Trump administration to take over our elections.\n\nAtlanta's civil rights leaders, like my predecessor, the late  Congressman John Lewis, faced one of the bloodiest battles over our  right to vote.\n\nThe SAVE America Act will make…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700000/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…people who are in need, how to treat the poor; and maybe that is  why faith leaders all across the State of Georgia have been reaching  out to me in advance of this debate.\n\nAtlanta Bishop Jack Lumanog from the Anglican Diocese of St. Ignatius  Loyola reached out to me earlier this month, and here are some excerpts  from the letter he sent to me. He said:…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…I first met him about 2 or 3 years into his pastorate when he was  still a student at Benedict College in Columbia. He graduated from the  Morehouse School of Religion in Atlanta and has served not only as a  pastor of their church, but as a great leader in South Carolina.\n\nHe serves to make true the words of James when he wrote in his  epistle: ``Faith…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690891/welcoming-reverend-dr-charles-b-jackson-sr"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…transferred to the USS Enterprise, where he flew combat  missions in Vietnam. He later served at the Defense Intelligence Agency  and as a commanding officer at Naval Air Station Atlanta before  retiring at the rank of captain in 1994, almost 26 years of service.\n\nBart is not only recognized for his exemplary service to our country  as a veteran, but he is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…growth, is actually well beyond almost any of what  even my economists were predicting over the last year.\n\nWe are seeing some data right now--if you actually look at the  Atlanta Fed, GDPNow, nowcasts, some of these--we could hit a five- handle this quarter, which is remarkable.\n\nLooking at some of the data from the third quarter of 2025, it looks…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Mr.  Paul W. Brown on his retirement from the FBI, where he served as  Special Agent in Charge of the FBI Atlanta Field Office.\n\nMr. Brown has served the FBI diligently since 2006, with experience  spanning counterterrorism and weapons of mass destruction.\n\nHolding degrees from both Western…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699636/congratulating-paul-brown-on-his-retirement"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…today to recognize an incredible  individual who is a true pillar of the community, Mrs. Pam Younker, and  congratulate her on her retirement from Children's Healthcare of  Atlanta.\n\nThe daughter of a United States Marine, Pam is a longtime advocate  for our military, as well as our local community, and our children. Pam  has spent more than a decade…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691682/recognizing-pam-younker-on-her-retirement"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…over $1,100 a year. The economy grew 3.8 percent in the second quarter  of this year. We are seeing strong economic growth, and more strong  economic growth is expected. The Atlanta Federal Reserve predicts  third-quarter growth could be 4 percent--even greater economic growth.\n\nYou might ask yourself, what is at the heart of this economic  comeback?…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…ridiculous  it was.\n\nCorporate America bought into the misstatements and the falsities of  President Biden. If we recall, Major League Baseball removed the All- Star Game out of Atlanta, Georgia, following Georgia passing this piece  of legislation.\n\nOf course, two elections have passed since that legislation went into  effect. So we should look at the empirical…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…hadn't been on the job long, but you wouldn't have known it. He  showed up ready to work, ready to serve, and ready to make a  difference.\n\nJake was a man of faith. He loved the Atlanta Braves, loved playing  golf, and more than anything, he loved being a firefighter.\n\nHis loss is a tough one for Hickory, for the department, and for  everyone who knew him.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692830/recognizing-chief-reed-baer-on-his-retirement"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Congress has a unique authority, and therefore,  responsibility for our Nation's Capital as opposed to other  municipalities across the country. Why not Phoenix, New Orleans,  Atlanta, et cetera? It is because they are not the Nation's Capital,  that is why. It is because it is not reflected in the responsibilities  that are enumerated for Congress for…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…for the very first time. Both schools call Troup County  home, right in the heart of Georgia's Third Congressional District and  less than 1 hour away from Hartsfield-Jackson Atlanta International  Airport.\n\nFounded in 1831, LaGrange College is the oldest private college in  Georgia, and its vision is to be an innovative institution,  holistically educating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694895/recognizing-lagrange-college-panthers-and-the-point-university-skyhawks"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Transportation's Federal  Aviation Administration, the FAA, and our country's air traffic  controllers, who keep our skies safe.\n\nGiven my district's proximity to Hartsfield-Jackson Atlanta  International Airport, I proudly represent more air traffic controllers  than any other Member of Congress. During the Democrats' previous  shutdown, our Democratic colleagues…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…limit their cooperation with Federal agencies that are  charged with immigration enforcement. The SBA Administrator announced  that the agency would be relocating offices in Atlanta, Boston,  Chicago, Denver, New York City, and Seattle, and moving them to less  costly and more accessible locations to better serve the mission and  comply with Federal immigration…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…for everyone's sanity, I hope not to go  60 minutes. I might go 40.\n\nMr. Speaker, first, the good news. If anyone else is a geek out  there, there is this app put out by the Atlanta Fed, Atlanta Federal  Reserve, and what they do is they do certain samples in trying to  constantly estimate what the gross national product, GDP, will actually  be.\n\nA little…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…the insurance business.\n\nIn 1974, Billy's son, William Boyd McGehee, III (Bill), returned with  his wife, Evelyn, to Talladega to work at Talladega Insurance after  leaving Atlanta, where he worked for the Great American Insurance  Company. In 2004, Bill's son, Boyd, joined the agency.\n\nToday, Boyd runs the agency. He is an alumnus of The University…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…got so off the rails.\n\nWithin 3 days of Trump's announcing ``I am going to run again,'' the  process started, and within 6 months, he had 91 felony charges in  Manhattan; in Atlanta, GA; in Washington, DC; and in Florida. I had to  spend $1.2 million to go down to Georgia for the Fani Willis debacle.  So this will be looked at.\n\nWas there a coordinated…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…young leader from southern Minnesota, Vannah Heil of St. James. This  November, Vannah will join more than 700 youth from across the Nation  at the National 4-H Congress in Atlanta.\n\nVannah is one of only nine students selected to represent Minnesota  at this prestigious event, where she will take part in workshops,  service projects, and opportunities…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697141/recognizing-vannah-heil"}]