[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Russia, is trying to bring them closer  to Russia and Putin.\n\nLastly, the bill envisions a stronger U.S.-Georgia relationship once  Georgia returns to its traditional Euro-Atlantic path mandated in its  own constitution and demanded by its people.\n\nMadam Speaker, I thank Congressman   Joe Wilson and the other co- leads of this important legislation,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…time as I may  consume.\n\nMadam Speaker, I rise in support of H.R. 36, a bipartisan bill  designed to make sure that the United States remains committed to  Georgia's Euro-Atlantic and democratic aspirations.\n\nI thank my friend, the gentleman from South Carolina (Mr. Wilson),  for his tireless efforts on this topic, in addition to his fervent work  to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…economy.\n\nIt is also inspired in upstate New York because I represent the  easternmost portion of the Erie Canal. This is a bold vision that  connected a great ocean, the Atlantic, with the Great Lakes. It allowed  for not only the strengthening of the port of a small place called New  York--New York City--but gave birth to a necklace of communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…administration has proposed that the United States abandon  and even scold our European allies. Let me be clear. Our Nation  intergenerationally and painstakingly has built the North Atlantic  Treaty Organization, a global fortress of democratic nations.\n\nAcross Europe, from the ruins of World War I and World War II lie the  precious graves of 411,516 American…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…from key cities, take away longtime tax deductions, impose their values  and policies, and now curtail transportation options.\n\nThose of us who represent northeast and mid-Atlantic States get the  message loud and clear: We don't count.\n\nAmtrak represents growth and expansion for America. When we treat it  as such, we will see more of these benefits…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692196/northeast-corridor-amtrak-cuts"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, this week The Atlantic reported that the  Trump administration is planning to incinerate $800,000 worth of high- nutrition biscuits, food that was meant for starving children in  Afghanistan and…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693656/foreign-food-aid-incinerated"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, today, I rise in disbelief at the troubling  stories in ``The Atlantic'' magazine of classified attack plans  carelessly leaked by the U.S. Department of Defense in a reckless and  dangerous fashion.\n\nCongress must conduct a fully independent…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689228/responding-to-signal-chat-leak"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…him for helping to trace the history of the Great Lakes-St.  Lawrence Seaway, which connects his part of America, all the way west  to Duluth, Minnesota. It takes us to the Atlantic and to the world. I  thank him so very much for being here tonight, and it is an honor to  serve with him.\n\nMr. Speaker, before I call on Congresswoman Hoyle, I thank her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…complete offshore wind project off the coast of Rhode Island. This  project is 80 percent constructed, with over $5 billion invested and 45  turbines already installed in the Atlantic Ocean. It supports more than  1,000 local union jobs and is poised to deliver enough low-cost energy  to power 350,000 homes in Rhode Island and Connecticut. State officials…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…no desire to be a part of this coverup,  but he is only there in that he was the person who, in a sense, acts as  a whistleblower. I am talking about Mr. Goldberg with The Atlantic  magazine.\n\nMr. Goldberg is the person who had messages sent to him that he did  not seek and that he did not ask for. According to the reports that I  have read and you have…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…also destroy 840,000 American  jobs by the year 2030, jobs that would have been people up on roofs  installing the solar or having offshore wind work or electricians off  the Atlantic Coast or installing coal efficiency into homes across our  country and just going through the home to make it more energy  efficient, solar installation, and fewer manufacturing…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…a peaceful partnership for our shared democratic  ideals. Truman considered the treaty a means to establish freedom from  aggression and from the use of force in the North Atlantic community.  If one ally invaded another, the center would not hold.\n\nNow, President Trump seeks to threaten our historic alliance by his  flippant, poisonous quip that we…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…a mistake. This  oversight likely occurred because the CZMA was passed in 1972, which  was before D.C. achieved home rule.\n\nScientists have predicted that the tides on the Atlantic Coast could  rise two to four feet by 2100, causing property worth as much as $7  billion in D.C. to be routinely under threat by floodwaters. This  includes private homes…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…receiving the Outstanding  Contribution to Outdoor Recreation award from the Virginia Department  of Conservation & Recreation and the Land Manager of the Year award  from the Mid-Atlantic Mountain Bike Enthusiasts. Along with his  tremendous service to NOVA Parks, Mr. Gilbert has also dedicated his  time as an Executive-in-Residence for George Mason University's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Fisheries Science Center work  to maintain healthy fish populations to support local fishermen.\n\nIt is in my home State of Rhode Island, the Ocean State, where NOAA  is building Atlantic Marine Operations Center, which will centralize  its operations and take advantage of the expertise found in Rhode  Island and our nearby States.\n\nWe have an incredible concentration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…numbers. They are real solutions for the families who  sacrifice so much to serve our great Nation.\n\nFinally, I traveled to Wallops Island in my district to visit the  Mid-Atlantic Regional Spaceport, where Virginia is playing a vital role  in America's return to the Moon and preparation for Mars. The One Big  Beautiful Bill Act provides nearly $10 billion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Industry Group; Bennett, John: Roll Call; Bennett, Rema: The       Hill; Benson, Samuel: Politico; Benton, Nicholas: Falls       Church News Press; Berman, Russell: Atlantic Monthly;       Bernsen, Markus: Weekendavisen; Bertenthal, Ari: Broadband       Census; Bertuca, Anthony: Inside Washington Publishers;       Bikales, James: Politico.\n\nBlaine,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…of Beaches Emergency  Assistance Ministry, BEAM, a lifeline for families facing hardship in  eastern Duval County, places like: Mayport, Jacksonville Beach, Neptune  Beach, Atlantic Beach. From keeping the lights on to filling the  pantry, supporting seniors and single parents, BEAM continues to show  up with compassion and care.\n\nMr. Speaker, I know…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…his people. He served honorably in the United  States Navy for over three decades, retiring in 1994 with the esteemed  rank of Force Master Chief, Naval Surface Force, U.S. Atlantic Fleet.  He was a veteran of both the Vietnam War and Desert Storm, embodying  courage, commitment, and leadership throughout his military career.\n\nJerry brought the same conviction…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…are not Greenlanders but who live in  Denmark are justifiably disturbed and unsettled.\n\nIt is deeply unsettling, if you understand the immense value of  NATO--of the North Atlantic Treaty Organization--and how one cofounding  member taking land from another shatters this crucial alliance forever.  We have seen that in statements coming from our NATO…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…old,  he enlisted in the United States Merchant Marine, trained at Gallops  Island in Boston Harbor, and soon found himself at sea, supporting  Allied operations in both the Atlantic and Pacific theaters.\n\nOne of the most defining chapters of his service came aboard the  Liberty ship SS Henry Bacon. Dick served during the infamous Murmansk  Run, an Arctic…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…and Cultural Affairs.\n\nThe U.S. delegation shall consist of experienced and accomplished  Hill staff who can contribute to the success of the exchange on both  sides of the Atlantic. The Bundestag reciprocates by sending senior  staff professionals to the United States.\n\nApplicants should have a demonstrable interest in events in Europe.  Applicants need…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699719/announcement-of-the-2026-congress-bundestagbundesrat-exchange"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…with general assemblies that have progressive ideas on energy that have  put restraints on energy that have driven up the price.\n\nUnfortunately, we have friends across the Atlantic we can look at.  They put these kind of policies in place, and Europe has three times  the energy prices that we have. What we are saying over here is that we  need to have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "Mr. BARRETT. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3428) to require the Comptroller General of the United  States to conduct a review of the Mid-Atlantic River Basin Commissions,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3428\n\nBe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and pass the  bill (H.R. 1737) to direct the Secretary of Commerce to submit to  Congress a report containing an assessment of the value, cost, and  feasibility of a trans-Atlantic submarine fiber optic cable connecting  the contiguous United States, the United States Virgin Islands, Ghana,  and Nigeria.\n\nThe Clerk read the title of the bill.\n\nThe text…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Affairs of the House of       Representatives; and\n\n(D) the Committee on Appropriations of the House of       Representatives.\n\n(2) NATO.--The term ``NATO'' means the North Atlantic       Treaty Organization.\n\n(3) Secretary.--The term ``Secretary'' means the Secretary       of State.       SEC. 3. SENSE OF CONGRESS.\n\nIt is the sense of Congress that--…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…marking the beginning of a new era. The USS  Iowa is the third naval vessel to bear that name following a battleship  that served with distinction in World War II, both in the Atlantic and  the Pacific, in the Korean war and in the Gulf. That proud legacy now  continues beneath the sea. The legacy of the Gray Ghost and the new USS  Iowa nuclear-class submarine…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689656/recognizing-the-uss-iowa"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…was bent on conquest.\n\nIn 1948, two-thirds of Americans said America and Western European  friends should join together for a mutual defense pact. By 1949, with  the North Atlantic Treaty in the works, the question actually got more  specific: Would the American people support ``a promise of mutual aid  from all the members of the alliance if any single…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…week, I will travel to the annual Munich  Security Conference, which my friend and late colleague Senator John  McCain helped build up into a critical gathering of the North Atlantic  community, of NATO allies, of Ministers of Defense, heads of state,  parliamentarians from all over the world, principally focused on the  alliances rooted in values that…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Europe, ask  them how mass migration is working out for them. They have done it, and  it isn't working.\n\nSo, if you have got any advice coming back from that side of the  Atlantic, I am not really interested on this topic or on censorship.  Maybe you can deliver the message that they ought to step up for their  own defense of their own continent in…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}]