[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…seeks to prohibit, restrict, or undo DC's       laws, and co-sponsor and support all bills that seek to       expand DC's local power.\n\nDC needs more local power--not more attacks. The 700,000       people who live in DC deserve the same rights and dignity as       the people in your home district. No democracy will be able       to function in the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…and interoperability.\n\nTime and again, CSRIC has improved the reliability, availability, and  performance of our communications networks during natural disasters,  terrorist attacks, and cybersecurity attacks. It is common sense that  we should make this council permanent.\n\nThe bill specifies that CSRIC must include representatives from a  wide range…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, Donald Trump says that he isn't sure if  he needs to uphold the Constitution. It is clear to all of us from his  attacks on the courts, the rule of law, our democratic institutions,  our civil and legal rights, an open and free press, the dismantling of  Federal agencies, and attacks on our…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690721/holding-this-administration-to-account"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…PADILLA. Mr. President, I rise today with a number of my  colleagues. I will speak for the next, probably, hour-plus on the topic  of election integrity and the seemingly constant attacks on our  election integrity by Donald Trump and our Republican colleagues.\n\nI am joined by a number of my friends and colleagues in our remarks  here for the next block. Senator…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Committee,  chaired by somebody who calls the opposition stupid, to hear our  motivations as we stand up for a fundamental constitutional prerogative  mocked through ad hominem attacks, shame, sir. Shame.\n\nWe are here because we are standing for our constitutional right to  be consulted on the most consequential decision that the United States  can make:…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699372/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the aim of this  bill, which passed the House with bipartisan support in the last  Congress. No one affiliated with Hamas, nor anyone involved in the  horrific and lawless attacks of October 7, should be admissible to the  United States or eligible for any immigration benefits whatsoever. That  is an obvious point of political and moral consensus in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…contradiction here because the President says he loves  Medicaid, but he also says he loves the House bill. And the House bill  does not love Medicaid. What the House bill does is it attacks  Medicaid.\n\nIn Vermont, we have 20 percent or so, a little more, of our folks who  depend on Medicaid for healthcare. It is kids from low-income families;  it is seniors.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…vicious campaign to erase our stories, voices, and  contributions to this Nation.\n\nMake no mistake, we will fight tooth and nail for our communities and  stand up to these attacks. We will not let anyone tell us that our  stories don't matter.\n\nOur stories are American history, and without us, our Nation would  not be where it is today.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688013/standing-with-cbc-in-shared-fight-for-equality-and-justice"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…North Koreans use it to fund their nuclear program. Hamas  used it to fund their October 7 attack. Fentanyl traffickers use it to  get paid. All, 100 percent, of ransomware attacks get paid in crypto.\n\nThat is a really good argument for legislation, and if the crypto  industry did not want to hang out with criminals, then they would have  welcomed good…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise today in vigorous opposition to  occupant Trump's hostile attacks, hostile and insecure attacks on Black  history. Black history is American history.\n\nDictators try to shutter museums, censor history, and whitewash the  truth, but we know…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689876/trumps-attacks-on-black-history"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…protections against pollutants,  and ends longstanding air quality rules that keep children with asthma  out of the ER. Ending these safeguards could cause thousands more  asthma attacks per day in frontline communities.\n\nThis bill also greenlights unchecked offshore oil and gas leasing. It  guts environmental reviews and public comment requirements. It  threatens…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…consider this amendment with  a straight face. I would be curious to know if the sponsor talked to  the agriculture community. I am sure they would have concerns about the  attacks on biodiesel and ethanol. This attack is actively harmful, and  it sets us backward, especially when newer fuels and technology have  such strong potential for energy efficiency,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…shine a light on the  ways in which this President continues to undermine our democracy and  disregard the Constitution: How is Donald Trump undermining Congress  through his attacks on the bipartisan appropriations process? And when  he does that and the majority--the Republicans in Congress--allow this  to happen, how do the American people lose?\n\nMs.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Those are  earned benefits. My constituents receive more than $350 million of  those monthly benefits.\n\nI join my colleagues in sounding the alarm on this administration's  attacks on the bedrock national promise of Social Security, which Mr.  Musk called a Ponzi scheme. We have already seen firings in the Social  Security Administration, threatening…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690821/protecting-social-security-benefits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…damaged or  destroyed in some way by Putin's bombing, drones, missiles. Putin is  attacking Ukraine, but he is also attacking America, and America should  be outraged by these attacks on American businesses.\n\nIn the meantime, my main takeaway from this trip--my ninth--was the  incredible endurance and resilience of the Ukrainian people. But they  don't…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…America's differences must be resolved through debate and democracy,  not through violence.\n\nThe resolution we are voting on today denounces these disturbing and  anti-American attacks and mourns the tragic loss of Melissa and Mark  Hortman.\n\nH. Res. 519, introduced by the gentlewoman from Minnesota (Ms.  Morrison), unequivocally condemns the horrific attacks…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, we heard so much over the weekend from  Tennesseans who were reaching out, just so saddened by the series of  truly devastating attacks we saw in Syria. Two of our National Guard  members from Iowa lost their lives. Indeed, we know that right now,  President Trump and Senators Grassley and Ernst are out at…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…without a vote of your  representatives? What kind of world would that be? Who could be for  that?\n\nThe Constitution empowers the President to defend the country against  sudden attacks initiated by any foreign power. The initiation of  hostilities by the United States that requires deliberation and  authorization must be voted upon in Congress.\n\nOur Founders'…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Thune", "party": "Republican", "sentence": "…in Qatar and Iraq. President Trump has been clear that  he is not afraid to hold Iran accountable for any retaliation, and Iran  risks going down a dangerous road with these attacks.\n\nNevertheless, I am glad that the initial reports indicate that no  Americans were killed in these strikes. If Iran is considering any  further attacks against U.S. forces…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692769/iran"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…littoral waters so they can intercept drug and human  traffickers in the Caribbean and sweep for deadly mines. Most  importantly, they support U.S. naval efforts to end Houthi attacks on  commercial vessels in the Red Sea.\n\nOur littoral combat ships have risen to the occasion to defend our  homeland. They have provided the necessary backup needed to protect…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…stunt.'' He  blamed President Trump.\n\n``Political stunt''? It is a matter of public safety.\n\nPresident Trump is the one who is protecting American citizens from  terrorist attacks--attacks like the one witnessed last week, just in  front of the White House. President Trump and Republicans want every  American to be safe, to be secure, and to be prosperous.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people of Belarus and to address and try to disrupt  the elections in Romania and the Republic of Georgia.\n\nOpen borders for dictators puts all Americans at risk of more 9/11  attacks imminent as warned by the FBI. President Donald Trump is  reinstituting existing laws which are successfully securing our border  to protect American families with peace through…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…aviation events. However, from my conversations with Mary, her  effort to restore activity to the barren general aviation ramp at  Reagan Washington National after the terrorist attacks of 9/11 gave her  the most satisfaction. Politely but stubbornly, she refused to accept  the notion that 9/11 would permanently close the Nation's capital  airport to general…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Party, practically giving away a port on the Black Sea that  should be for the people of Georgia.\n\nThey are also subservient to the regime in Tehran, who we know  launched attacks against Israel just yesterday; and war criminal Putin,  who seeks to indeed make the people of Georgia subservient.\n\nThe Georgian people are among the bravest and most pro-American…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…enforcement. This tragic incident resulted in the loss of 14       lives and injuries to at least thirty-five others, including       two police officers.\n\n(2) Vehicle-ramming attacks and other vehicular terrorist       incidents represent an enduring and evolving threat to public       safety in the United States and around the world, targeting       innocent…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Dave's contributions to our Nation's missile defense capability are  equally extraordinary. As Product Manager for the Sentinel Radar System  following the September 11th attacks, he rapidly deployed teams to  support operations, achieving record readiness rates and earning him  recognition as the top product manager among thirty-two Lieutenant  Colonels.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Mr. Speaker, I rise today in strong support of  this resolution to denounce the anti-Semitic terrorist attacks that  occurred in Boulder, Colorado, on June 1, 2025.\n\nFirst and foremost, let me say my heart goes out to the Jewish  community, who were peacefully advocating for the release…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…the civilized world and so  tragic for the Russian people, not to mention the Ukrainian people.\n\nSince Putin's military campaign is failing, he has now doubled down  on his attacks on civilians--unarmed civilians. As we all know, a  bitter cold snap has descended on Ukraine, and the maniacal Vladimir  Putin has turned this winter into a weapon. He has…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and agree to the  resolution (H. Res. 519) condemning the attacks on Minnesota lawmakers  in Brooklyn Park and Champlin, Minnesota, and calling for unity and the  rejection of political violence in Minnesota and across the United  States,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…This includes the Iranian-backed Houthi  terrorists in Yemen.\n\nIt appears our Democratic friends have forgotten that the Houthis are  responsible for at least--at least--150 attacks against the United  States and allied naval and commercial ships, which have killed at  least 3 people. These terrorists have also targeted our friends in  Israel, Saudi Arabia,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}]