[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Republican attorneys general. Texas Attorney General Paxton alone filed  over 100 lawsuits against the Biden administration. Republicans are now  seeking to undermine and attack the same judiciary they used to take  the Biden administration to court, and they are personally attacking  judges whose decisions they disagree with.\n\nMr. Speaker, I urge…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689013/supporting-federal-judiciary-and-judges"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…dollars are  spent in an effective, efficient, and equitable manner.\n\nThis bill that is on the floor right now has nothing to do with  waste, fraud, and abuse. It represents an attack on the public health  of the American people, the national security of the American people,  the public safety of the American people, and the ability of the  American people…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…Ohio are closing. These are clinics thousands of girls and  women rely on for things like cancer screenings and contraceptive care,  their basic healthcare.\n\nIt is a direct attack on women, and it is just the start. Millions  and millions of Americans will lose their healthcare. In the end, more  than 15 million people could be left without care, all…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694049/planned-parenthood"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Act, and one can only hope that he is able to watch C-SPAN  on a black-and-white television set in his prison cell.\n\nYou don't have to be a genius to know that this bill is an attack on  working families. That is why the AFL-CIO says no, and they are scoring  it.\n\nThey call it stablecoin. It is not stable. It is not a coin. It is a  money market account…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…business, and on synagogues and places of worship.\n\nAnd incidents of anti-Semitism in the United States and globally have  risen dramatically since Hamas's brutal terrorist attack on October 7.  All of it--all of it--is wrong and has no place in our country, no  place in our society, no place in the world.\n\nThose who commit these egregious acts, they…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…to pass massive tax  cuts for billionaires and mega-corporations, and they want your  children and your grandparents to pay for it. This isn't just about  politics. It is an attack on everybody who has to clock in and out  every day for work.\n\nYesterday, House Republicans wanted to forcibly remove me from a  committee for calling out this administration's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688241/republican-hypocrisy-and-gop-budget-plan"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Madam Speaker, I rise today to speak out  against another outrageous move by Donald Trump: his attack on the  National Institutes of Health.\n\nThe NIH is not just another governmental agency, it is the foundation  of America's medical research. It funds lifesaving breakthroughs…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…it enters these negotiations.\n\nLet me just finish with this thought: You know, I think it is  difficult to describe what it is like to be in Ukraine in the midst of  an air attack. On a couple of my visits, we were forced into bunkers  when the sirens started. Obviously, we were never injured, and I want  to avoid any misrepresentation. I never felt…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…injured, and several lost their lives  defending this institution. Their courage deserves not just remembrance  but that we remain vigilant in upholding the rule of law.\n\nThe attack on January 6 was the result of a President who chose  division over truth, grievance over governance, and chaos over  accountability. That choice continues to threaten our…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698551/january-6-attack"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…initiatives associated with  diversity, equity, and inclusion, even though these cuts will undermine  military readiness.\n\nThis mammoth bill expands the administration's power to attack  immigrants, including for our Haitian neighbors.\n\nThe few good things in this legislation do not outweigh the cruelty  and the harm that will undoubtedly come if it is signed…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698052/opposition-to-the-military-spending-bill"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…weaponize that  information against the American people in so many different ways.\n\nSo I would just ask: Did you hear my distress that Trump could use  this information to attack his opponent? Could he use this information  to disrupt the elections in '26 as a path to further authoritarian  influence in the United States?\n\nMr. REED. If the Senator would…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…last year that adds  enormous amounts of regulatory burden for any American who chooses to  access the so-called ObamaCare Marketplace.\n\nThe truth is, this administration's attack on the Marketplace,  ObamaCare, the Affordable Care Act didn't start with this rule. As we  all know in this Chamber, this is just another step in a now close to  15-year crusade…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…outlet locations by 2026. Orvis had to lay off 50 employees,  citing tariffs.\n\nAnother business, Peter Case of Burrows Sports in Brattleboro:\n\nWe love what we do and it's under attack! For 90 years,       Burrows Sports has proudly served Brattleboro, growing with       our community through good times and hard ones. Today's       economic pressures, rising…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…same injustices we are now seeing repeated  today. We see it in the targeting of immigrants. We see it in the  dismantling of civil rights protections. We see it in efforts to attack  birthright citizenship. We see it when they invoke legal powers that  once falsely justified locking up over 120,000 Japanese Americans.\n\nLooking back, what would have changed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…someone from my district who I know personally. Her name is Mia Tretta.\n\nIn 2019, as a 15-year-old freshman at Saugus High School, Mia was  shot in  the stomach during a horrific attack that took the life of her best  friend. She survived, endured surgeries, and fought to reclaim her  life, eventually earning her way into Brown University.\n\nThis past weekend,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698292/gun-safety-in-america"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…made the ultimate sacrifice to save the lives of his fellow soldiers.\n\nOn December 4, 2006, while on patrol in eastern Baghdad, Specialist  McGinnis and his unit came under attack. An enemy insurgent positioned  on a rooftop hurled a grenade into his Humvee.\n\nWithout hesitation, Specialist McGinnis threw his body onto the  grenade, saving the lives of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…completed  high school when he enlisted in the United States Marine Corps. He  reported to the 3rd Marine Division on September 11, 2001, just two  hours before the tragic attack on the World Trade Center occurred. Over  a remarkable near-decade career, Scott worked to forge strong  relationships with foreign leaders, serving in diverse and demanding…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Christmas.\n\nIt is not Republican or Democratic. It is demographics and interest,  but that isn't a lot of fun because our political consultants need  something where we can attack each other. By doing  that, we are incapable of an honest conversation of the bleed.\n\nUnderstand a basic principle, Mr. Speaker: At this rate of borrowing,  when you are clicking…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…him safe travel back to Missouri, and hopefully, next  week, we can get busy saving the American people from a broken  healthcare system.                       America Under Attack From Within\n\nMr. ROY. Mr. Speaker, I am going to take a few minutes in the time  that I have remaining to talk about another issue that is critical to  the State of Texas and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…the front lines.\n\nIt incentivizes scholarships that empower American families and  students to choose the education that best fits their needs.\n\nIt repeals Democrats' insane attack on the gig economy.\n\nIt reforms and streamlines the Federal student loan program to drive  down tuition costs and simplify repayment plans.\n\nIt strengthens accountability for…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…hatred unacceptable in contemporary American society. This movement  empowers Jews to live openly and proudly, celebrating their heritage  without fear of discrimination or attack. On April 29, 2022, the first  official #EndJewHatred Day was recognized, marking a national  commitment to ending anti-Semitism and building a future free from  hatred and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690314/recognizing-april-29-as-endjewhatred-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…how you want to try to save Social Security and all the  steps you have to do, all the inputs, because it turns out it is  complicated, that side over there is going to run attack ads beating  the crap out of you because you mentioned the words ``Social Security''  even though you are trying not to double senior poverty. That is how  immoral this place…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…economically and militarily.\n\nPresident Xi, the head of the People's Republic of China, and the  Chinese Communist Party have threatened time after time after time to  forcibly attack Taiwan and to consolidate Taiwan with mainland China.\n\nWe also know that the battle for the future of the world will  literally be determined by who wins the race for artificial…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nThree thousand eight hundred forty-five (3,845) KMU-558B/B       Joint Direct Attack Munition (JDAM) guidance kits for the       BLU-109 bomb body.\n\nThree thousand two hundred eighty (3,280) KMU-572 F/B JDAM       guidance kits for the MK 82 bomb body.\n\nNon-Major…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the Department of Homeland Security Vehicular  Terrorism Prevention and Mitigation Act of 2025.\n\nOn New Year's Day 2025, our Nation was shaken by a horrific ISIS- inspired attack in New Orleans that took the lives of 14 innocent  people and injured dozens more.\n\nThis tragedy is a stark reminder that vehicles are increasingly being  weaponized as instruments…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…people-to-people ties, military  cooperation, and encourages an improved bilateral relationship.\n\nThe United States should reward partners for good behavior. This bill  is not an attack on the Georgian people. It seeks to support them by  punishing rogue officials who are taking them further away from the  United States.\n\nThe House Committee on Foreign Affairs…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…all.  It is just another backdoor tax designed to squeeze the very industry  that keeps America powered.\n\nThis isn't just bureaucratic red tape, Mr. Speaker. It is a direct  attack on Texas jobs, Texas families, and energy producers that fuel  our Nation.\n\nMr. Speaker, I am proud to support my colleagues in striking down  this burdensome tax and standing…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688183/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…that same night, after being taken and hidden  out for a few hours, was that this was the worst disaster and was even  worse than Pearl Harbor. By the way, that was a real attack that killed  2,403 Americans.\n\nAnd I thought at that time: Are you kidding me? What are we talking  about here?\n\nThen almost immediately afterwards, those same Democrats that…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…recently,  Russia launched two ballistic missiles and 165 drones, wounding 11  people, including 2 children.\n\nOne 54-year-old Kyiv resident, whose car caught fire during the  attack, expressed frustration at the lack of progress for peace,  saying:\n\nThey can't agree on anything, and we are the ones who       suffer the consequences.\n\nAn 18-year-old student…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…that once the executive initiates a hostile act  against a foreign power, it has, in fact, declared war by giving that  power casus belli. He said that reacting to a military attack is one  thing, but initiating an attack is quite another.\n\nPersonally, I think he had a point. I disagree with the current  precedents, although I find it hard to fault the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}]