[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Amazingly, this is basically an attack on  the Endangered Species Act that the Department of Defense has never  asked for.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "Unfortunately, I just  saw while we were waiting to start this process a few minutes ago, we  had three major natural disasters today across the country, but FEMA is  under attack, and the funding is being cut.", "title": "Big, Backstabbing Bill", "date": "2025-05-13"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "So what this looks like is a vindictive attack outside the law and  proper due process by the Trump administration.", "title": "Permitting Reform", "date": "2026-01-07"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Recently, our biggest scientific agencies have come under a full- scale attack with the administration's proposed budget effectively  annihilating the very science that keeps us safe.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "I know it  sounds like an exaggeration to say that our democracy is now under  attack, but it is from adversaries and enemies abroad--China, Russia,  Iran, North Korea.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": "2025-10-09"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "You don't have to be a genius to know that this bill is an attack on  working families.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "It is an attack on the most  vulnerable to pay for the wealthy and the well-connected.", "title": "Protecting Americans From Harmful Crypto Practices", "date": "2025-05-08"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "On that day, violent  insurrectionists attacked police officers, many of whom sustained  serious injuries and five of whom have passed away since the attack,  including Brian Sicknick, a New Jersey native and a proud Capitol  Police officer.", "title": "Holding Ice Accountable", "date": "2026-01-08"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Instead, I have seen two impeachments, an insurrection, a pandemic,  cyberattacks, social unrest, political assassinations, mass shooting  after mass shooting, wars, tumultuous elections, and a rapid collapse  of our social fabric.", "title": "Why I Came to Congress", "date": null}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "Madam Speaker, we are witnessing yet another shameful  attack on the fundamental rights of millions of Americans.", "title": "Gop Creating Chaos in Electoral System", "date": "2025-04-01"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "This mammoth bill expands the administration's power to attack  immigrants, including for our Haitian neighbors.", "title": "Opposition to the Military Spending Bill", "date": "2025-12-11"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "Ever since  President Trump has tried to blame the war on Zelenskyy and Ukraine,  Putin has ramped up the war, launching more aggressive attacks than he  ever has in the 3\\1/2\\ years of the war, and most recently, sending  drones over Poland, as well.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Senate Republicans are doubling down on egregious attacks against  historic investments in the Inflation Reduction Act, cutting more than  $500 billion in investments and programs, threatening hundreds of  thousands of jobs, and raising monthly household energy bills.", "title": "One Big Beautiful Bill", "date": "2025-06-17"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "After their big, ugly bill made energy more expensive for American  families already struggling to make ends meet, Republicans are  attempting to finish the job by further continuing their nonsensical  attack on clean energy.", "title": "Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act", "date": null}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "In one tragic case that we  all now know about this week, an illegal immigrant who overstayed his  visa launched Molotov cocktails at innocent Boulder residents in what  was a hateful, racial attack, despite the State knowing that that  person was already illegally in our country.", "title": "Save Sba From Sanctuary Cities Act of 2025", "date": "2025-06-05"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "On New Year's Day 2025, our Nation was shaken by a horrific ISIS- inspired attack in New Orleans that took the lives of 14 innocent  people and injured dozens more.", "title": "Department of Homeland Security Vehicular Terrorism Prevention and Mitigation Act of 2025", "date": "2025-11-17"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "It is a direct  attack on Texas jobs, Texas families, and energy producers that fuel  our Nation.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "It was an ambush attack, and it happened  just blocks away from the White House.", "title": "Wyoming Servicemembers", "date": "2025-12-02"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Speaker, we heard one hollow Hail Mary  attack after another designed to scare the American people and prey on  their fears, the last gasp of a broken status quo.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Ray Dalio, who is talking about a book he is  giving away, talks about his incredible fear of the squeeze that is  happening around the world because the countries in the world are  bingeing on debt and that there may be a shortage of borrowable  capital, which will cause us, as he says, a heart attack.", "title": "A Real Math Problem", "date": "2025-03-06"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "176) to amend the Immigration and Nationality Act with  respect to aliens who carried out, participated in, planned, financed,  supported, or otherwise facilitated the attacks against Israel, as  amended.", "title": "No Immigration Benefits for Hamas Terrorists Act of 2025", "date": "2025-12-01"}, {"senator": "James Risch", "party": "Republican", "sentence": "Years down the line,  the sanctions relief Iran received from this deal directly funded  Iran's terror proxies and led to Hamas's October 7 attack on Israel.", "title": "-9999", "date": "2025-07-23"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "But the following week after Thanksgiving, another parolee nearly  committed a terrorist attack in Fort Worth, TX.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "Perhaps they even share the delusion that people can sexually  identify as an attack helicopter because, apparently, that is also an  option for some of these maniacs.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Brian Mast", "party": "Republican", "sentence": "This bill  is not an attack on the Georgian people.", "title": "Mobilizing and Enhancing Georgia's Options for Building Accountability, Resilience, and Independence Act", "date": "2025-05-05"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Last year, I did an entire series of charts, which the Democrats  turned into attack ads, that showed raising the cap.", "title": "Math Always Wins", "date": "2025-06-10"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "In the early morning hours of June 14, many of us woke up to the  horrifying news of a targeted political attack that took the lives of  former Minnesota Speaker of the House Melissa Hortman and her husband,  Mark, and which left State Senator John Hoffman and his wife, Yvette,  hospitalized with multiple gunshot wounds.", "title": "Condemning the Attacks on Minnesota Lawmakers in Brooklyn Park and Champlin, Minnesota, and Calling for Unity and the Rejection of Political Violence in Minnesota and Across the United States", "date": "2025-06-24"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "America Under Attack From Within\n\nMr.", "title": "Bringing America Back to its Roots", "date": "2025-12-12"}]