[{"senator": "Lori Trahan", "party": "Democrat", "sentence": "Mrs. TRAHAN. Mr. Speaker, I was unable to attend the first vote  series today due to a delayed flight into Washington, D.C. Had I been  present, I would have voted YEA on Roll Call No. 71, YEA on Roll Call  No. 72, NAY on…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700150/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…workers any more flexibility.       Instead, it allows employers to hold trainings and       professional development opportunities after work hours and       not pay workers who attend--as long as the employer does not       say it's required. However, employers can still lead workers       to believe these trainings and professional development       opportunities…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Hirota.\n\nDoris was a Santa Ana resident, the youngest of seven, and she was  born at the beginning of the Great Depression in Rochester, New York,  in 1932.\n\nDoris went on to attend nursing school in Chicago, where she met her  husband, Tomio, when they both began their life of service to others.\n\nIn 1965, Doris and Tomio bought their home in Santa Ana,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…regulation; we are pulling the plug on progress in our country; we are  abandoning millions of students who lack the internet access needed to  complete their homework, to attend class, to reach their full  potential.\n\nThis repeal will widen educational disparities in our country, it  will deepen the digital divide, and it will slam shut the doors of…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…staff and those folks who show up to those hard  meetings and hear the public out, but the public who comes out, in my  district sometimes driving 30, 40, 50 miles, just to attend one of  those meetings so that they can eventually get to an RPM, knowing that  that will be the law of the land.\n\nToday, I rise in opposition to all the CRAs, but in particular,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…separated families at  the border.\n\nLet me be clear: According to the United States Supreme Court, all  children, regardless of their immigration status, have the right to  attend public schools. The ICE tactics that we are seeing of targeting  students and families will have lasting effects on children and  families, and they will cause generational…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…supposed to uphold the  values of freedom, the values of democracy, and the American Dream.  Instead, the very people who came here in pursuit of that dream are  afraid to attend school, go to their jobs, go to church, and even leave  their homes for fear of being hunted down, detained, and deported.\n\nNowhere have the effects of ICE's operations been…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…attack.\n\nThis is punishment for being poor. For being Black. For attending  public schools.\n\nA report from UCLA's Civil Rights Project reveals that 40 percent of  Black students attend schools where 90 percent or more of their  classmates are also students of color. These schools too often have  fewer counselors, overcrowded classrooms, and outdated materials.…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…effort to end the bloodshed in Ukraine. I would have opposed  cloture on the nomination had I been present for the vote. The vote was  rollcall vote No. 381.\n\nI was unable to attend the cloture vote for Executive Calendar No.  261, Whitney D. Hermandorfer, of Tennessee, to be United States Circuit  Judge for the Sixth Circuit, due to my participation at…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693523/vote-explanation"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…populated area than people visualize when they say Chicago, IL. Western  Macomb, IL, has Western Illinois University. Thousands of students from  all around the State and the area attend college there. A year ago,  there was an active shooter in the community. They learned about it  through the police notifying the radio station, and they started  broadcasting…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to exercise the right. As I  conclude, I would just say this: On Flag Day, I would encourage  Americans of all kinds, find a peaceful assembly on June 14--on Flag  Day--and attend it and show that you are a brave and patriotic American  that embraces the First Amendment to the Constitution, and you will not  allow anyone to intimidate you.\n\nI was a missionary…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Solutions Act (H.R. 2270), and       the Tipped Employee Protection Act (H.R. 2312).\n\nH.R. 2262, Flexibility for Workers Education Act, would let       employers require workers to attend job-related training       without paying them for that time. The bill allows employers       to label training as ``voluntary,'' even when workers feel       pressured to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…good friend and  fellow Anaheim High School alumnus, Jimmy Oregel, for a life of  dedication to the city of Anaheim and to Anaheim High School.\n\nAt St. Boniface, where we both attend, he helped found the Orange  County Congregation Community.\n\nWe are both diehard Anaheim High School football fans, and at  Anaheim, he served as a sports team manager. Upon…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…does not do that at all.\n\nWe know that the longer we do nothing, the more likely it is for  someone else to have their family torn apart like I have or for someone  else to attend a wake or a funeral instead of a wedding or a graduation  ceremony. It doesn't have to be this way.\n\nMr. Speaker, I just--if we want to say it this way--celebrated the  12th…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, now on the all-Senators briefing tomorrow  morning: Senators, tomorrow morning, will attend a briefing by  Secretary of Defense Pete Hegseth and Secretary of State Marco Rubio on  the latest developments in the Caribbean, including getting to the  bottom of what happened…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…benefits under subchapter II of       chapter 75 of title 10;\n\n``(4) the provision of all travel and transportation       allowances to family members of a deceased member to attend       the repatriation, burial, or memorial ceremony of a deceased       member as provided in section 453(f) of title 37;\n\n``(5) the eligibility of the member for general…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Speaker, I rise today to recognize the  commissioning of the USS Iowa, the Navy's newest Virginia-class,  nuclear-powered, fast-attack submarine.\n\nI had the honor this weekend to attend the ceremony at Naval  Submarine Base New London, alongside Governor Kim Reynolds, veterans,  and the families of over 140 crew members.\n\nIt was a powerful moment marking the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689656/recognizing-the-uss-iowa"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…endowed upon any of us by the grace of our  creator.\n\nIt is truly inspiring to witness the multitudes of Americans who  journey from far distances across this great country to attend the  march.\n\nIn my role in the House of Representatives, I am a reliable vote for  the pro-life community and have been able to sponsor many pieces of  legislation that provide…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699378/march-for-life"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, it was an honor to visit Gateway Nursing and  Rehab in Lenoir, North Carolina, this past Friday and attend a program  that honored veterans who are receiving care there.\n\nI commend Shannon Price, the director of social services, as well as  members of the staff for taking the time…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690222/recognizing-gateway-nursing-and-rehab"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…attended Spring Valley High School, where he earned the rank of Eagle  Scout. A talented athlete, he wrestled and played football, earning the  nickname ``Tank,'' and went on to attend Illinois Wesleyan University,  where he played football for 4 years and later earned his MBA from  Washington University.\n\nIt was at Illinois Wesleyan that Ted met his wife,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I was unable to attend votes today. Had I  been present, I would have voted NAY on Roll Call No. 333 and YEA on  Roll Call No. 334.                             PERSONAL EXPLANATION", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698068/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…that ball for years with my wife, my daughters, friends, fellow  marines. Alas, given the work we are doing here in the Senate to reopen  the government, I was not able to attend--a huge disappointment for me.  I really, really wanted to be in Alaska with my fellow marines and my  family.\n\nThere was also another Marine Corps ball last night. It was…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…music-related attractions, including       museums, studios, venues of all sizes, and other sites       related to music; or\n\n``(B) the act of traveling to a State or locality to attend       a music festival, a concert, or other live musical       performance or music-related special event.''.\n\nMr. BILIRAKIS. Madam Speaker, I yield myself such time as I may…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…classes. In 1995, they became ordained family  life ministers.\n\nJaime volunteered in Millard Public Schools as a translator, mentor,  and soccer coach. He helped Hispanic students attend national  leadership conferences, ensuring that opportunity extended beyond his  own family and to a broader community.\n\nFrom Jaime's example of faith and sacrifice, the Suarez…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…abroad through any means necessary, including coercion and violence.  This is the goal that we all know drives his decision making.\n\nLike many in the Senate, I frequently attend classified briefings on  China. We just had the INDOPACOM Commander testify today, Admiral  Paparo, who, by the way, is doing a great job. Make no mistake--it is  in all the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…In April, Harvard released a report examining anti-Semitism on its  campus with stark findings. One Israeli student said: ``My friend has  been told that others would not attend social gatherings if I was  present, as they couldn't risk the social consequences of being seen  with an Israeli.''\n\nAnother student said: ``I am tired of fighting. It is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…2025. Kacee exemplifies the values  of hard work, dedication, and service, making a profound and lasting  impact on Cass City and beyond.\n\nA soon-to-be graduate, Kacee plans to attend Alma College to pursue a  Bachelor's Degree in Business, with the goal of becoming an insurance  agent. Her academic excellence is evident through numerous honors,  including…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…staff delegation from the U.S. Congress will be selected to visit  Germany from Friday, October 2 through Sunday, October 11, 2026. During  this exchange, the delegation will attend meetings with Bundestag/ Bundesrat party staff members, and representatives of numerous  political, business, academic and media agencies.\n\nA comparable delegation of German…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699719/announcement-of-the-2026-congress-bundestagbundesrat-exchange"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…family-owned small businesses.\n\nOne such visit was to Daikin Texas Technology Park in Waller County,  a suburb of Houston. There, I had the opportunity to tour their  facility and attend a townhall with many of their employees. It is a  truly impressive facility, employing more than 10,000 workers in our  State and leading the world in the engineering and manufacturing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…priorities and listening to the  issues that are important to them.\n\nAbove all else, in this role, our job as Representatives is to listen  to our constituents. I was honored to attend the Indiana National Guard  change of command ceremony, at which Brigadier General Lawrence  Muennich assumed command from Major General Dale Lyles, making General  Muennich…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}]