[{"senator": "Al Green", "party": "Democrat", "sentence": "…alliances fractured,'' referring  to what happened on 9/11, the lives that were lost to terrorism.\n\nThen, Mr. Speaker, there is another article that I would call to your  attention in The Washington Times. It is styled: Growing leftwing  violence blamed for deadly shooting.\n\nMr. Speaker, I wish to address violence. I wish to address violence,  and I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…brought joy and creativity  to our halls in their performance of ``The SpongeBob Musical.''\n\nBeyond that, Woodgrove High School was recognized in Virginia for its  growing attention to environmental awareness and stewardship. The  students' efforts have made a lasting impact on the school and  community.\n\nI extend a special thank-you to the students,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Setting Consumer Standards for Lithium-Ion Batteries Act and       help move this important public safety measure forward       without delay.\n\nThank you for your leadership and attention to this urgent       issue.            Sincerely,                                                     Manuel Moreno,      BOMA International Chair and CEO.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…trillion by the end of  the century--$1,200 trillion.\n\nAnother study has monetized ocean damages. Rhode Island is The Ocean  State. My wife is a marine scientist. I tend to pay attention to ocean  things. But we do tend to overlook ocean damage. It is worth looking  out for the oceans, though, because 90 percent of the excess heat  caused by fossil fuel emissions…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "John Hickenlooper", "party": "Democrat", "sentence": "…people who have preexisting medical conditions that are  worried that if they go off their healthcare now, they might be pushed  into a circumstance where they can only receive attention in emergency  room situations, defeating the purpose of their treatments.\n\nBy going forward and taking a 1-year extension, nothing new, but just  a 1-year extension, we allow…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696606/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Yet, when it comes to helping  consumers afford electric water heaters or stoves, all of a sudden,  they have a big problem.\n\nI just don't get it. I mean, that is where their attention is, on  going after consumers, making life more difficult for everyday working  families.\n\nMr. Speaker, tonight is the State of the Union, and I am sure that  the President…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…left?\n\nIt is the impeachment.\n\nWhether anyone else agrees with me or not, I want my record to show  that at a time when democracy was at risk, I brought impeachment to the  attention of the Congress.\n\nMr. Speaker, you can do it for two reasons at least, there may be  others, but two that I will call to your attention. One, to remove a  President--to remove…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…``Green  Patriarch,'' he has also championed environmental protection efforts,  including by organizing international, interfaith summits to address  climate change and call attention to pressing environmental concerns.\n\nOnce again, I join with Rhode Island's vibrant and important Greek  community to welcome His All-Holiness Ecumenical Patriarch Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695453/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…radio. They are concerned about what might  happen for them during the Christmas holidays, a key time of year for  their businesses.\n\nThe Trump administration didn't pay any attention to that. In fact,  he just moved forward with the tariffs that he put in place. He did so  not just against China, not just against our adversaries, but against  allies like…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…impact on  surgeries for transgender young people because surgery is already  extremely rare for transgender adolescents.\n\nRepublicans keep bringing up surgeries to shift attention away from  how extreme this bill is. This bill hypocritically bans safe and  effective medications for an entire group of people just because of who  they are, while still…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698352/protect-childrens-innocence-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…thing: If you cut Medicaid, community health  centers shut down, which means that instead of preventative care, folks  go to emergency rooms. If you ever need urgent medical attention, and  there is an ER bed available, you are a Medicaid beneficiary.\n\nIf you cut Medicaid, public school kids with special needs won't get  the targeted resources that they…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691175/medicaid-benefits-all-of-us"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…families that we are doing the best that we can, all I see  is the bipartisan support for a war machine budget that can't pass an  audit?\n\nI want people to look at this and pay attention because they will  never, ever fully fund Medicaid, universal school meals for every  hungry child, or guarantee healthcare as a human right in our country.  I think maybe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…billion worth of agriculture products a  year. That was the number from 2023--$7.5 billion. So anytime somebody  starts a trade war, I guarantee you, you are going to get our  attention.\n\nUnder the President's trade war, the farmers in my State are going to  be the first victims. Trump said to our farmers yesterday on Truth  Social, ``Tariffs will go on…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise tonight to bring attention to the  Senate's despicable decision last week to sneak in a self-serving  provision into the bill that was used to reopen the government.\n\nWhile 42 million Americans on…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696864/calling-for-quick-action"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…are offering us is, indeed,  an authoritarian playbook: Attack the weakest in order to intimidate  the rest of us. That is why it is the obligation of all Americans to  pay attention to all of the discussions on this topic and to speak out  and not yield. The American abolitionists told me that eternal  vigilance is the price of liberty to keep the powerful…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Although these CEQ studies provided useful data on the cumbersome  review timelines and resource strains resulting from NEPA analysis,  they have either been produced ad hoc or attention to their continued  production has fallen by the wayside.\n\nSimilar to CEQ's annual litigation surveys conducted between 2001 and  2013, the reports required by this bill…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…served in my office and the constituents of Utah's Fourth  Congressional District for nearly 5 years.  During this time, I have come to rely on her sharp instincts, her keen  attention to detail, and her unwavering commitment to keeping my  constituents back home informed of the day-to-day effort here in  Washington.\n\nIt is often said in Congress that if…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698096/recognizing-emma-hall"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…International Court of Justice.\n\nThe International Court of Justice, as you know, Mr. President, is  part of the United Nations, and I don't mean any disrespect, but nobody  pays any attention to them. They don't have any authority. They  certainly don't have any authority over the United States of America,  and they don't have any authority over the United Kingdom…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Biden, to see what President Trump is able to do, with the incredible  contributions made by the intelligence community, our military, and law  enforcement, has got to get the attention of our adversaries around the  world. We know, during the Biden administration, the world had become a  much more dangerous place because when our adversaries sense weakness,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…The SAVE Act restores this vital principle by requiring proof of  citizenship and identity in the Federal elections that affect every  American. Americans should pay close attention to this vote, for it  will reveal those who would subvert their vote to foreign nationals.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…it's known for its unrivaled custom  boots and saddles, M.L. Leddy's also offers western clothing, hats,  buckles, and accessories. Each piece is crafted with meticulous  attention to detail, a time-honored technique inspired by the store's  namesake. When M.L. Leddy's first began crafting handmade boots and  saddles, he did so with the passion and…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700234/recognizing-ml-leddys-on-being-included-in-the-new-york-times-list-of-the-top-50-clothing-stores-in-the-united-states"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…running traffic in and out  of the second largest FedEx air cargo hub in our district.\n\nWhen the good people who keep our skies moving tell you what is at  stake, you pay attention. Their work is why I pushed to secure funding  to modernize our outdated air traffic control technology. We have to  invest in the next generation of controllers, cut the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697078/commending-air-traffic-controllers-and-faa-employees"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…everyone--volunteers,  clients, residents, and community members--with warmth, compassion, and  genuine joy in service. Carol is always ready to tackle any task that  needs attention. Metropolitan Ministries relies heavily on her to keep  Volunteer Services running smoothly, not just during the holidays but  all year round. She embodies the four key values…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690148/recognizing-carol-brisbois"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…mental  health advocate John Schlimm; and installing a digital billboard on the  Elk County highway route that reaches thousands of vehicles daily.\n\nMr. Speaker, by bringing attention to mental health, we can help  those affected seek and receive the care they need. I applaud the  Cameron Elk Suicide Prevention Task Force for its innovative approach  to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697845/congratulating-cameron-elk-suicide-prevention-task-force"}, {"senator": "John Thune", "party": "Republican", "sentence": "…bills were being written behind closed doors.  That is not how I want to do things. When I became majority leader, I  made it clear that I wanted appropriations to get the attention that it  deserves, and we made some solid progress on this front in this  Congress. We considered appropriations bills through regular order and  passed three Senate appropriations…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…SCHWEIKERT. Excellent. If I do this quickly--and I apologize for  talking so fast. I have had a lot of coffee today. I am trying to  detox.\n\nSomething almost no one around here pays attention to, but it is my  job on Ways and Means and my job with the Joint Economic Committee to  talk about the financing. How do you have a country that if we are  going to burn…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…fentanyl labs.  They didn't want to increase their spending on border patrols, but they  have to do it because President Trump is putting pressure on them.\n\nTariffs get more attention than strongly worded letters, and millions  of Americans' lives are being saved because President Trump has  declared this national emergency and is actively forcing our…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…similar.\n\nI am sure all the committees, all the leadership, all the folks who  are helping us watch the bond market and the liquidity and our ability  to borrow are all paying attention to the bleed rate, but it is math.  It is real.\n\nMr. Speaker, our debt to GDP when we closed the '25 fiscal year  actually got slightly better, but we also rolled some of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…1, 2025, Solebury marked 100 years since its first day of  classes. Over the past century, Solebury School has remained steadfast  in its founding ideals such as personal attention, intellectual  curiosity, and a deep respect for individuality. The school's faculty,  students, and alumni continue to embody these values, carrying forward  the founders'…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…bill into one budget. We are now  negotiating that, and this is all yet to be determined.\n\nWhy am I saying all this? No one wants to read all of this. Nobody is  going to pay attention to a chart. All of my staff and everybody says,  ``Don't use charts on the floor. Just go down and say things that will  get clipped and sent around.'' Let me try to say…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]