[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…person who herself made  that decision to stand up for America, to defend our country, put  herself in harm's way, who inspires us every day with her incredibly  positive attitude despite these incredible injuries that none of us-- none of us can imagine what it is like.\n\nYou are so special.\n\nIt is amazing to be her colleague, isn't it? It really is.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…justice under law''--a quid pro quo deal. But Mr. Bove  said it was fine.\n\nEven more disgracefully, he said a court cannot review, at all, a  dismissal of this kind. This attitude toward the law alone should  disqualify him, but he went further in a March meeting, according to  the whistleblower. He said, essentially, that lawful court orders  shouldn't…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…people who just brush aside what  happened on January 6, 2021. They just brush it aside, as though: Oh,  well, that happened, but it won't happen again.\n\nThat seems to be the attitude that is preeminent among the minds of  many. If he did it once, what makes us think he won't do it again?  Where is the empirical evidence to support the notion he won't do…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…course. If we remain one people under an efficient  government, the period is not far off when we may defy material injury  from external annoyance; when we may take such an attitude as will  cause the neutrality we may at any time resolve upon to be scrupulously  respected; when belligerent nations, under the impossibility of making  acquisitions upon…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the Commission to look at the issue of service comprehensively.\n\nOne of the statutory mandates of the Commission was to explore the  ``means by which to foster a greater attitude and ethos of service  among United States youth.'' We as a government must be prepared to  invest in what is truly one of our Nation's greatest assets--our public  servants.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Museum.\n\nBut I also have to say that the end of this week was rather  outrageous and horrific, and it was brought to the American people, I  strongly believe, because of the attitude of this President and his  ability to just work outside of the boundaries of what most Americans  feel are in accordance with our values and our ethics.\n\nWhat happened today…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…trillion tax cuts for billionaires that House  Republicans, Donald Trump, and Senate Republicans want to pass right  now. That is what this is about.\n\nThere is a slash-and-burn attitude to firing many thousands of  Federal employees. They have attempted to fire hundreds of thousands of  Federal employees, including those at the Consumer Financial Protection…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…appreciation for the arts, outdoor recreation opportunities, and small  community feel, along with the work of the more than 70 nonprofit  organizations that embody the town's attitude of ``taking care of  ourselves and our neighbors.''\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to celebrate Evergreen, Colorado,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…certain high school teams on the basis that there  was nothing to gain by such competition. This is how I feel about your  request to play De La Salle. Time may change my attitude.''\n\nMr. Clarence Jupiter, who would go on to become a top administrator  at Xavier University, championed the cause by asking why St. Augustine  and Xavier Preparatory, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…local people volunteering for that job. The President's policies  against immigrants are not only denying them the source of these  workers, but they are also creating an attitude in other adjoining  countries that have served us in the past that it is too dangerous to  try to come and work in the United States. That is the reality.\n\nNationwide, for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…and yes, it was a pleasure to work with him. He has always  consistently, even when we disagree profoundly at times, been a  gentleman and always represents the values and attitude that I believe  a Member of Congress should have.\n\nTo my friend, the gentleman from New York, I will attribute that to  him, as well. We sometimes differ even more profoundly…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…was Maxwell's specialty. And the President has said that they may have  stolen some of them from his spa, as if they were chattel to be bought  and sold. But that was the attitude that Epstein and Maxwell had toward  them, and, sadly, that was the attitude that, perhaps, some of their  aiders and abettors or coconspirators or simply enablers had as…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…came and testified before us that their kids--normal, happy,  productive, good students--in a short period of time were captivated by  laptops and cell phones into changes in attitude, changes in conduct.  Sadly, some of the children took their own lives because of their  exposure to what happened on these devices. It is heartbreaking.\n\nI recall one in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the law  says, the philosophy is this: We are the unitary executive. We are in  charge, and we can do whatever the hell we want--a ``take us to court  if you don't like it'' attitude. Then we see the deliberate crushing of  rights, and we see the deliberate grabbing of the power of the purse  from Congress.\n\nThe difference between an authoritarian government--and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…all they can to wage war on the rest of us and not enforce our  immigration laws.\n\nThis is the most egregious example of the problem. Can you imagine a  grand jury whose attitude is we don't care if an ICE agent gets their  finger bitten off? That is what we have in Minnesota.\n\nLike I said, while it is outrageous in its own right for this  individual,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…his entire team home, every single  one of them.\n\nThat is the mark of a leader who not only commands respect but  inspires it. He embodied the warrior spirit, the never-quit attitude,  and the deep sense of duty that defines the very best of our Armed  Forces in this country.\n\nToday, I am proud to tell you just one of many stories of Bruce  ``Puppy'' Fecht,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Republican Conference and 75 percent of the entire House of  Representatives.\n\nThis could not have been accomplished without dedication, teamwork,  and a true get-stuff-done attitude. Representing our constituents in  this Chamber is not a job, Mr. Speaker. It is a calling. There is no  higher calling than helping the most vulnerable in our society.\n\nI,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Simona, not only for what she has brought to  us legislatively but also for who she is as a person. From day one, it  was obvious that she would fit well with Team Bice. Her attitude,  spirit, and wit will be truly missed, especially at Monday morning  coffee.\n\nThis past weekend was the 126th Army-Navy game. As a member of the  Board of Visitors at West…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698207/recognizing-simona-elvin"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing were distributed. These volunteers have a `can do' attitude no  matter how large the challenge.\n\nThey also have tremendous teamwork. They sort through all donations,  retain those appropriate for a pregnancy center and then share other…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are used to is going to disappear, and  it will be replaced by people who may not be protecting our country or  keeping the current law or the current Constitution or the attitude of  less government going.\n\nWe are almost certainly going to get people who turn America into the  countries they came from, countries in which there is socialism, in  which…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing were distributed. These volunteers have a `can do' attitude no  matter how large the challenge.\n\nThey also have tremendous teamwork. They sort through all donations,  retain those appropriate for a pregnancy center and then share other…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…course. If we remain one people under an  efficient government, the period is not far off when we may defy  material injury from external annoyance; when we may take such an  attitude as will cause the neutrality we may at any time resolve upon  to be scrupulously respected; when belligerent nations, under the  impossibility of making acquisitions upon…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…conference room. It read: Is it good for the  park?\n\nI suggested that was the wrong question. The right question is: Is it  good for the park's visitors?\n\nIt is a matter of attitude.\n\nThe Yosemite Grant Act of 1864 was the first time that land was set  aside for the use, resort, and recreation of the American people. It  says nothing about the park's…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…decade don't  even add up to the amount of borrowing that is in the Senate  reconciliation budget because it is so much easier here just to spend  and borrow it. There is this attitude here of: Give it to me now. You  guys will figure out something in the future.\n\nWe have worked with some of the DOGE folks because I have the  economists, but go on their…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…to merge.\n\nMr. Speaker, by celebrating the 150th Anniversary of the Village of  Tontogany, community members recognize the outstanding  achievements, maintain the pioneer attitude, and strive to better their  village through the principles on which it was founded. I thank and  congratulate Tontogany on this significant milestone.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…affordable homes in our community. Neil is the  epitome of a team player, consistently willing to contribute his time  and talents wherever needed. His dedication and positive attitude are  respected by fellow volunteers, Habitat staff, and the partner families  he supports. Neil Quinn's commitment embodies the spirit of Habitat for  Humanity, making a tangible…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Whether you are a first responder in the healthcare field, or  in the military, how do you deal with it? How do you deal with what you  gave? Can you return to a positive attitude in your life?\n\nThat is why the belief among servicemembers and first responders who  have gone through this, we have figured out that the best way to deal  with what we deal…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…grandmother, and friend to  all those around her.\n\nThis achievement speaks not only for Ms. Harn's fantastic skills as a  professional, but also for her grateful and compassionate attitude.\n\nMr. Speaker, I thank Ms. Harn for her professionalism, dedication,  and commitment to her field.                        Honoring Nurse Heather Daniels\n\nMr. CARTER of Georgia.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Justice Brandeis wrote in 1913, ``Sunlight is said  to be the best of disinfectants.''\n\nTransparency brings accountability and the public's business ought to  be public. That attitude and approach is an important check on the  Federal Government. It reminds bureaucrats that they ultimately work  for and answer to ``We the People.''\n\nOne transparency tool…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}]