[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Benjamin Arquit, Abigail       Ashcraft, Alexander Attebery, Grant Auman, Sky Avants, Zehra       Bakirdan, Shawn Baldy, Andrew Bambrick, Zachary Bannon,       Jennifer Bastin, Audrey Beck, Sara Bell, Lyssa Bell, Caroline       Bender, Ashlynne Beninga, Craig Berning, Jacqueline Bisille,       Thomas Blanford, Jackson Blodgett, Anthony Bocchino, Micah…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…that she is going to be back after she finishes at the  University of Utah.\n\nMadam Speaker, I congratulate Kendall on her graduation.                       Celebrating Consul Audrey Rivera\n\nMr. CORREA. Madam Speaker, I rise today to celebrate the incredible  service of Dr. Audrey Rivera Gomez, head consul of the Mexican  Consulate in Santa Ana.\n\nFor years,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of outdated, vague, and inaccurate criticisms of an  organization that has seen dramatic reforms over the past 7 years under  the outstanding leadership of Director General Audrey Azoulay. Since  her initial appointment in 2017, Director General Azoulay has made  numerous trips to Washington to meet with leaders in the Congress and  the administration.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…sparking a movement that  transformed an entire generation. Charlie believed in the promise of  America, and his life's work  was making sure we lived up to that promise.\n\nAudrey and I continue to pray for Charlie's wife, Erika, who has two  beautiful young children, and his family, friends, and supporters. Last  week, President Trump invited the Nation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Komatireddy, Aditya Kota, Ria Kupumbati, Isaac Kwon,       Heather Lam, Skylar Lariviere, Lukas Larkin, Jacqueline       Larsen, Claire Lawson, Sarah Lee, Seth Lee, Brandon Lee,       Audrey Lee, Chaewon Lee, Junmyeong Lee, Noah Lee, Katherine       Lee, Eric Lee, Alex Lee, Alexis Lee, Kangmin Lee, Jonathan       Lee, Xenia Lee, Tyler Lee, Olivia Lee, Hannah Lee,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…His  multigenerational family farm grounded him and his beliefs, making him  an even better advocate for the abundant agricultural producers of  California's First District.\n\nAudrey and I are praying for Doug's loved ones as they grieve through  this tragedy.\n\nPsalm 34:18 says: ``The Lord is close to the brokenhearted; he  rescues those whose spirits are…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698727/9999"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Title. The team overcame the challenges posed  by intense competition in their effort to surpass all other relay teams  in their event.\n\nIn pursuing the State Championship, Audrey Alig, Lana Kaiser,  Kiersten Keller, and Isabella Zahn defeated their outstanding  competitors to win with an impressive time of 3:53.94. The members of  this very special…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693429/special-recognition-of-coldwater-high-schools-girls-4x400-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…will not be tolerated, and  there will be grave consequences for such action. This is what  leadership looks like, and I applaud President Trump for putting  America first.\n\nAudrey and I are grateful that our brave servicemen and -women were  not harmed in the strikes, and I continue to pray for the safety of our  troops and Americans in the region. The…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  work of Pasco County Community Development and to congratulate the  County on receiving the prestigious Audrey Nelson Award, a national  honor that recognizes exemplary achievement in serving communities and  low- and moderate-income residents through the innovative use of  Community…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…peaceful pro-Israel demonstration in  Colorado, a Hamas sympathizer threw Molotov cocktails into a crowd and  injured more than a dozen people while yelling: ``Free Palestine.''\n\nAudrey and I are deeply grieved by these senseless anti-Semitic  terror attacks, and we continue to lift up the victims, their families,  and their loved ones in prayer.\n\nNow is not…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Lydia: Bloomberg Industry Group; Davidson, Amelia: E&E News;       Davidson, Mark: Energy Intelligence; Davies, Stephen: Agri-      Pulse; DeBonis, Michael: Politico; Decker, Audrey: Defense       One; Degen, Courtney: Crain Communications; Dellenger,       Elizabeth: The Hill; DeSenne, David: Tax Notes; Desiderio,       Andrew: Punchbowl News; Desrochers,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Speaker, I congratulate Libby Russell and Zanna Paraskevas, who  were accepted to the United States Military Academy at West Point.\n\nI congratulate Savion Kirby, Natalie Doig, Audrey Ponton, and  Maximilian Perez, who were accepted into the United States Air Force  Academy.\n\nI congratulate Victoria Nelson, who was accepted into the United  States Naval…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689824/congratulating-floridas-eighth-districts-student-accomplishments"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Riley will start a new endeavor in the second Trump  administration at USDA. There are few words to describe how much he  will be missed at 344 Cannon and the Big First, but Audrey and I cannot  be more proud of him or grateful for his service to our district and to  the team.\n\nTeam Mann will be praying over this next chapter for him and Lauren  and cheering…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}]