[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…National Estuary Program since 2009 and is calling it a  career at the end of this year. Ranking Member Larsen and I had the  privilege of meeting with her in Mobile this past August, and her  dedication to building partnerships and advancing science-based  solutions is a big reason the program has been so successful in Mobile.\n\nIt could not be more fitting…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…may not have the Medicaid coverage for insulin to save their  lives.\n\nSo this is a matter of life and death, Mr. Speaker. This is not just  a regular bill that we do in this august body to feel good or to maybe  take care of a specific issue in a particular State. This is a matter  of life and death.\n\nYou have Latinos with renal problems, and cardiovascular…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…welcoming and accepting people through all walks of life into your  community of faith. Ever since Rev. Moses Allen Williams organized the  First Presbyterian Church of Ashland on August 18, 1875, this church in  southern Oregon has remained dedicated to--in their own words-- ``honoring the teachings of Jesus and being a safe haven for all who  walk through…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693320/recognizing-the-150th-anniversary-of-first-presbyterian-church-of-ashland"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…full-year 2025 electricity costs       per state based on the monthly electricity bill data released       by the federal Energy Information Administration (EIA) for       January-August of 2025. The Committee projects that annual       electricity costs will be at least 5 percent higher than last       year in 37 states plus D.C., and at least 10 percent higher…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Crushing 100  Million Americans.'' It is from October of last year.\n\nThis author--I just want to give a little more understanding of what  kind of article this is--is John August. He is the Scheinman  Institute's director of healthcare.\n\nGeorge Curlee is one of 52 million people or 1/3 of       Americans in the workforce who earn $15/hour or less.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…other than Virginians, but I did a  lot of travel around the State in April as some of these proposals were  on the table. I did a lot of travel in July, a lot of travel in August,  and I just did a good bit of travel last week around Virginia. And on  the healthcare side, here is what my constituents are saying to me  about what is now happening:\n\nThe…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…standard of healthcare to veterans  in Manchester exemplifies the virtue of service to community and  country.\n\nOne story in particular highlights Janette's positive impact. In  August, 2021, a veteran was at the Manchester VA for routine cardiac  tests, administered by Janette. During the tests, the veteran entered  sudden cardiac arrest and collapsed in…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688916/recognizing-janette-gibb-for-her-service-at-the-manchester-va-medical-center"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…provide, such services of the MPD as the President may  deem necessary and appropriate'' for 30 days, unless Congress  terminates or extends the emergency declaration.\n\nOn August 11, 2025, President Trump declared a crime emergency in  D.C. pursuant to section 740, even though violent crime reached a more  than 30-year low in D.C. in 2024 and is down…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…vote again every 6 months. Because the administration has  refused to lift this so-called emergency and instead doubled down by  raising tariffs on Canada to 35 percent as of August 1, with a threat  of more, we are back on the floor today, and we will be back on the  floor until this passes.\n\nJust this past week, the President announced, as I noted, yet…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…underway before the  Trumped-up energy emergency.\n\nForty-five of the planned 65 wind turbines were already installed  when the Trump administration, just months ago in late August, issued a  stop work order, grinding this project to nearly a complete halt--men  and women on the job in New London, offshore, onshore, stopped from  going to work, out of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…at risk of losing their health insurance  through cuts to Medicaid. We saw a list of over 300 hospitals in rural  areas identified as being at risk of closing.\n\nDuring the August recess, I traveled all over Virginia not just to  talk to my constituents, but as one of only two members of the Energy  and Commerce Committee to talk to a wide cross-section…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…the 1990s to put  pressure on Congress not to pass legislation with that big of a deficit  impact. Unfortunately, the majority ignored the paygo rule.\n\nWhat CBO told us on August 15 is that will trigger automatic cuts to  other programs. That is the way the paygo law was designed to create  some deterrent on Congress from excessive deficit spending.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…decide it.\n\nWell, actions are more powerful than words. The words were:\n\nWe should put everything out there.\n\nThe action was he adjourned the House of Representatives early for  August recess to avoid voting on releasing the files.\n\nWell, the House is back in session now. So I call on Speaker   Mike  Johnson to stand up for the principle carved above those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…servant  and faithful woman of God, Mrs. Juanita Carson Booker. Mrs. Booker  celebrated her 95th Birthday with her family, friends, and community  leaders at a celebration on August 21, 2025, at the Green Island  Country Club in Columbus, Georgia.\n\nThe Genesis of the Life of Juanita Booker began with her birth in  Reynolds, Georgia to the union of Thomas…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…It is a civil rights  issue. It is a women's right issue. It is a disability issue.\n\nI know this administration is already sick of hearing from me, but  that is too bad. In August, I wrote to the Secretary of Labor urging  her to stop these rollbacks. Today, I want to again call on the  Department of Labor to withdraw this dangerous and disgusting proposed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Marketplace by falsifying information on their applications.       Additionally, according to CMS, the agency received       approximately 275,000 complaints between January and August       2024 that consumers were enrolled in a plan or had their plan       changed without their consent. Such practices can result in       wasteful federal spending on APTC…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, this August, Washington will hear a sound we  know well in Indiana, the roar of IndyCar engines.\n\nThe Freedom 250 Grand Prix will bring IndyCar to our Nation's Capital  as we mark 250…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699865/freedom-250-grand-prix"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Taiwan Allies International Protection       and Enhancement Initiative (TAIPEI) Act of 2019.\n\n(9) In its fact sheet, entitled ``U.S. Relations with       Taiwan'', published on August 31, 2018, the Department of       State asserts: ``The United States supports Taiwan's       membership in international organizations that do not require       statehood as…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…us.\n\nTo me, they are heroes. They wear the uniform not for their safety  but for ours. We see it abroad, and we also see it at home.\n\nAnd what we have seen at home is, since August, National Guard troops  have been deployed right here in Washington, DC. As a result,  Washington, DC, is safer for residents and for visitors, for people who  come from your…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Financial Crimes Enforcement Network, FinCEN,  reports of check fraud doubled from 2021 to 2022.\n\nFinCEN's most recent report on check fraud found that between  February and August of 2023, the bureau received over 15,000 individual  reports about mail-theft-related check fraud.\n\nNow, this has been a problem in my district in west Tennessee, and we  have…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…to get the Senate back to  regular-order appropriations, and we made a strong start last year,  passing three appropriations bills with robust bipartisan margins  before the August work period--the first time that we have passed an  appropriations bill that early since 2018.\n\nUnfortunately, Democrats then chose to shut down the government,  which seriously…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…extraordinary service and unwavering  dedication of Sergeant Major Timothy Babcock, a proud veteran of the  United States Marine Corps and our distinguished Veteran of the Month  for August 2025 from Michigan's 9th Congressional District. His  exceptional military career and steadfast commitment to duty,  excellence, and patriotism embody the very best of American…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…partnerships between States and nongovernmental  entities for the purpose of reclaiming and restoring land and water  resources adversely affected by coal mining activities before August 3,  1977, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 167\n\nBe it enacted by the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…our UK, French, and  German partners to immediately trigger snapback sanctions pursuant to  U.N. Security Council Resolution 2231. We cannot afford to wait until  the end of August. Initiating the snapback process would be right and a  long-overdue move and would deny Iran the resources it uses for its  terror agenda.\n\nThe 2015 deal flooded Iran with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…These businesses face challenges that larger  corporations are often better equipped to navigate.\n\nThis bill will clarify the authority of the Small Business  Administration's august Office of Advocacy to examine international  economic data and represent small business interests in trade  negotiations, ensuring that our small business people are not left…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…both sides  of the aisle. We have been exchanging and I have been watching these  beautiful pictures of Molly growing up with those kids from when she  was young to just last August at the convention.\n\nLisa McGovern dedicated herself to helping families deal with cancer  at Prevent Cancer Foundation. Lisa knows directly what it is like to  see that terrible…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "Mr. RUTHERFORD. Mr. Speaker, I rise today to honor the memory of  James ``Jim'' P. Citrano, who passed away this last August at the age  of 83.\n\nJim was born on January 2, 1942, in Newark, New Jersey. After  graduating  from Colgate University, he was commissioned as a second lieutenant in  the U.S.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698995/recognizing-james-jim-p-citrano"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…demeanor and deep commitment to his constituents,  Congressman Pascrell served our Nation in the U.S. Army and in this  body for nearly three decades, until his passing last August.\n\nOverlook Park is a 2.5-acre area providing panoramic views of the  falls and the gateway to the larger historical park.\n\nThe Great Falls Scenic Overlook Trail Bridge is one…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691128/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Cherry. The Colossal  Cherry is now an artifact, but at one time it was the largest black  cherry tree in the world. The Wilds Sonshine Factory hosted a  dedication ceremony on August 22 in honor of the Colossal Cherry, which  is also known as the Sheffield Log.\n\nDiscovered and preserved through efforts of local historians and  conservation advocates, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694894/the-colossal-cherry"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  contributions of Mr. Charles ``Charlie'' Webb. Charlie graduated high  school in Colorado in May 1970 and in August 1970 reported to Fort  Knox, Kentucky. for Basic Training and Advanced Individual Training at  the Armor School. He was assigned to the 2nd Armored Cavalry Regiment  in January…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}]