[{"senator": "Brad Schneider", "party": "Democrat", "sentence": "…passings. I couldn't stop shaking for hours after.\n\nI was twelve years old.\n\nWe found our way to the small and remote mountain town of       Voiron in east central France. My aunt and younger cousin had       successfully made the same journey to a nearby town.       Grandmother and I found a place to stay in what I recall as a       warehouse. We had…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to workforce reductions, service limitations, and financial       strain on already overburdened health care facilities.\n\nThe Governor of Nevada knows that my mom, my aunt, my uncle, my other  aunt--they live in Nevada. My mom lives in a retirement community  there. This Governor knows that that State would be hit so hard by a  reduction of these…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Americans to the greater Grand  Rapids community.\n\nRillastine Wilkins, City Council: At age 18 and with $3 in her  pocket, Wilkins made her way to Muskegon, where she had an aunt. She  became active in the civil rights movement and attended school board  meetings and Muskegon Heights City Council meetings.\n\nRillastine Wilkins shattered glass ceilings,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…2026, at Mount Zion Baptist  Church in Albany, Georgia.\n\nAdrian Earl Jenkins, Sr. was born May 7, 1928, in LaGrange, Georgia,  to Julia Byrd and was primarily raised by his aunt and uncle, William  and Jesse Pattilo. His hands told his story: strong from teaching  generations of students, callused from building a home and other  community structures…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…years ago, fathers, mothers, sisters, and brothers  looked out across a vast ocean as Saigon was falling behind them. Among  them was Helen, my constituent, who watched as her aunt boarded a boat,  and days later she would also follow the path of Vietnamese refugees on  to San Jose in my district, which proudly boasts the largest population  of ethnically…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…suffering they are going to create has  a face, and it is Dominique's.\n\nWhen she was just 6 years old, Dominique was diagnosed with sickle  cell disease. That is also when her aunt enrolled her in Medicaid.\n\nMedicaid didn't mean that life was easy--Dominique spent much of her  time in hospitals and visiting doctors--but it made life possible.\n\nWith Medicaid,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691523/gop-tax-scam-hurts-women-and-families"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…they had access to  essential resources during difficult times.\n\nJosephine Barbee also founded the M.E. Stith Daycare Center at Zion  Holiness Church, named in honor of her aunt. This daycare center became  a cornerstone of early childhood development in Newark, serving as a  nurturing and educational environment for generations of young  children.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688217/recognizing-josephine-barbee"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…putting country over hate.\n\nThat leads me to someone who lived much of her life until she died in  my hometown, Lieutenant Colonel Charity Adams Earley, whom I finally  called Aunt Charity. She mentored me and taught me much of what I know  today. She always reminded me of barriers and challenges, but always  said to move forward and go forward and do…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Rozolia  Draper Brown. Her family went on to live in Kansas City, Kansas, and  after her parents passed Edith moved to the south side of Chicago,  Illinois, to live with her aunt. In 1940, Edith met her husband, the  late William Henry Coleman, and relocated to Gary's Midtown  neighborhood.\n\nEdith is an accomplished scholar, having earned both a Bachelor…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Medicare. I talk to young  people in my district, Mr. Speaker. They say: ``I am not on Medicare.''  I say: ``That is right. Maybe you are not, but your grandmother is,  your elderly aunt is, and the doctor you see is able to see you because  of the reimbursement they are getting from a Medicare patient.''\n\nWith these cuts, we are hearing from community clinics.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…for God and church was a  guiding force throughout his life. Family was at the heart of Corey's  world. He cherished his grandmother, the late Margaret Lucinda Sidney,  his aunt Sylvia Sidney, and his cousin Arthur Dennis Sidney, both of  whom now reside in Washington, D.C. Corey was proud of his close-knit  family and maintained affectionate relationships…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…being here today as we celebrate a truly       extraordinary life.\n\nTo know her was to love her. My grandmother went by many       names in her dynamic 97 years.\n\nDotty. Dot. Aunt Dot. Mrs. Christiana. Mother Dear. Ma.       Gram. Great Grammie.\n\nBut to me, Dorothy Christiana was always Dee Dee. Born on       the 17th Day of the 7th month in the year…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…California, and spent  her summers visiting her father's home state of Alabama. It was in  Alabama that DuVernay found her passion for film through cherished time  spent with her aunt, Denise Sexton.\n\nSetting out into the film industry first as a film marketer, Ava was  on set with some of the world's most renowned filmmakers including  Steven Spielberg,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Lavonne Harris Rischer, a  beloved member of our Fort Worth community, who passed away on February  12, 2025, at the age of 70. Sharon was a dedicated daughter, mother,  sister, aunt, and friend, whose impact will be felt for generations to  come.\n\nBorn on October 7, 1954, in Fort Worth, Texas, Sharon was a proud  graduate of the Lake Como Class of 1973,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…very long time to come.\n\nOf course, this period of time was also met with some social change,  progress, and pushing. Not all the Rosies went back to the home. My  mother's aunt, my great-aunt Ada, was in Cleveland. I guess you could  say she was a Rosie, Mr. Speaker. She was in a factory. She was tough.  She never married. She worked so hard, and they…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…Mansfield and ultimately served as Secretary of the Senate  from 1977-1981. His uncle Jay Kimmitt spent decades on the  Appropriations Committee as a professional staff member. His aunt and  godmother Judy dedicated nearly her entire professional life to serving  six different Senators. This is a patriotic family who clearly values  the dignity of public service.…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…great-grandchildren, and ten nieces  and nephews who all call her weekly and some even daily to keep in  touch. She is a social animal who loves being with people and is a  wonderful friend, aunt, and, most of all, mother.\n\nMr. Speaker, I wish Eileen a very happy 100th birthday.                       Honoring the Life of Bob Sekerak\n\nMr. MILLER of Ohio. Mr. Speaker,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…President, would you speak to my mom? She loves you.\n\nHe got on the phone and graciously spoke to her for about 5 minutes.\n\nA few months later, I was down in Florida. I had an aunt and uncle-- the same thing. I called him up--the same thing. He can be a gracious  person.\n\nThe President, though, got it wrong. He was right in saying that I am  not running…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]