[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…power to use violence unjustly against its  citizenry. That is when we slip away from our democratic ideals, from  our constitutional principles, and slide towards an authoritarian  government that wants to make its people heel before them, kneel before  them.\n\nThat is what I physically saw with my own eyes--a Member of this body  being driven to his knees…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…experiences, with all of our different parts of the  country, and we say: Here are programs and funding that fit our Nation  as a whole. It is a master compromise. But in an authoritarian  government, one person decides what is funded and what isn't. And that  is what happens in this special power when it is submitted within 45  days of the end of the fiscal year.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…act.\n\nH. Res. 537 addresses abuse of Presidential powers by disregarding  the separation of powers, devolving American democracy into an  authoritarian--an authoritarian, an authoritarian--government, usurping  congressional power to declare war.\n\nMr. Speaker, I take no delight in what I am doing. I do this because  I love my country. I do this because…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…of our  government, completely unbound, beating and attacking and detaining and  arresting and killing American citizens. This is what America looks  like with an authoritarian government, with no laws.\n\nBut here is what is happening not only in Minnesota but around the  country. Our constituents, the Presiding Officer's constituents are  watching these…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…American  people understand what is happening to us.\n\nWe have sent emails, and we have sent letters. We have challenged the  illegal, unconstitutional actions of this  authoritarian government, and we have not received any responses.\n\nIt is our job as Members of Congress to provide accountability and  oversight of activities of the executive branch. Activities…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…President, who Secretary Rubio has said is more  pliable, more manipulatable, will more service our interest than the  predecessor, and yet all the corruption of that authoritarian  government, all of the repression left fully in place.\n\nPresident Trump said:\n\nIf she doesn't do what's right, she is going to pay a very       big price, probably bigger than…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…MERKLEY. I so appreciate the question from my colleague from  Wisconsin.\n\nPart of the discussion earlier was you can detect a difference  between a democracy and an authoritarian government in the following  fashion: Are the decisions about which programs are funded, how they  will operate, and how they are funded decided by the Congress or by the  President?…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…we did the initial program.\n\nWe are saying to our colleagues across the aisle, if the power of the  purse means something--and it does: the difference between an  authoritarian government and a democracy--then work with us to defend  our Constitution, defend that what we have done together cannot be  undone by the Executive.\n\nSo far, we have not received…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…kindness of their hearts. The  CCP is not interested in helping American students learn Mandarin. They  want to brainwash our children, plain and simple.\n\nSince 2013, the authoritarian Government of the People's Republic of  China has sent curriculum and PRC-trained teachers into hundreds of K- 12 schools across America as an unofficial component of its global…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Western Hemisphere, counters our rivals for that Western Hemisphere  influence, Russia, Iran, China, and keep America safer by taking this  action.\n\nThe communist, authoritarian government in Caracas has long been an  adversary of the United States.\n\nIn the early 2000s, our relationship with Venezuela was strained when  they named strongman Hugo Chavez…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}]