[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…fluctuations in deposits that continue to threaten the fund and our  ability to provide vital support to victims of crime.\n\nIt would provide critical stabilization of the fund by authorizing an  infusion of unobligated funds collected through the False Claims Act to  halt the immediate bleeding. This stopgap measure will prevent further  catastrophic cuts to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…recent news of escalating unemployment higher than the last 4 years,  does anybody think that what the American people need right now and are  looking for is a Federal law authorizing FBI agents and government  prosecutors to investigate doctors, nurses, hospitals, and parents for  providing AMA-recommended medical care to children?\n\nThe politicians that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…granting       California a preemption waiver for regulations applicable to       new 2024 and subsequent model year California on-road heavy-      duty vehicles and engines and authorizing regulations       regarding off-road diesel engines. 90 Fed. Reg. at 643-44.       The Advanced Clean Cars II Waiver Notice announced the EPA       Administrator's December…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…opposition to this bill.\n\nWhile the SUPPORT for Patients and Communities Act was first passed  in 2018 with bipartisan support, the idea was to address the opioid  crisis by authorizing programs that aimed to prevent substance use  disorder and increase access to treatment and recovery, but the  Trump administration has unlawfully gutted the agency responsible…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…voters and not donors.\n\nTo my colleagues here in the House, we don't need to end campaign  spending for Members of Congress to do the right thing. Integrity  doesn't require authorizing legislation. We cannot allow big money  donors to buy or bully Congress. We need to do the right thing.\n\nMr. Speaker, today's rule also provides for consideration of the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Maybe the gentlewoman supports what the President is doing. Maybe she  supports gutting these programs, but I don't. I don't, and if you truly  support what these bills are authorizing, you would be screaming as  loud as we are.\n\nThis is bad for our constituents. This is bad for our country. We  have made progress in my home State of Massachusetts in reducing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…power in Venezuela. President Trump has even directed the seizure  of oil tankers in the region to apply pressure in Venezuela. As a  Member of Congress who voted against authorizing the disastrous Iraq  War, I believe that a war to enact regime change in Venezuela would be  a catastrophic decision. That is why these two war powers resolutions  are so…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Ambassador Kevin Rudd from Australia described Phil's  work as follows:\n\nMr. MacNaughton played an integral role in drafting and       shepherding through the groundbreaking AUKUS authorizing       legislation in 2023. Over the course of his time working with       our Embassy, he has shown deep expertise and incredible work       ethic to help take AUKUS where…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia.\n\nGAO, a federal agency that conducts investigations and audits for  Congress, has the same authority over D.C. that it has over federal  agencies. GAO's authorizing statute defines D.C. as a federal agency.  In addition, GAO's authorizing statute and the D.C. Home Rule Act  require GAO to engage in specific types of oversight of D.C.…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696213/introduction-of-the-government-accountability-office-district-of-columbia-home-rule-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…it was, and I was privileged to witness some of those       occasions.\n\nOur deliberations today, not just our debates but the       exercise of all our responsibilities--authorizing government       policies, appropriating the funds to implement them,       exercising our advice and consent role--are often lively and       interesting. They can be sincere…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…went       beyond threats to try to use the machinery of government to       punish critics. During his first week in office, President       Trump signed an executive order authorizing federal agencies       to withhold funding from ``sanctuary cities'' that refused to       cooperate with the administration's crackdown on undocumented       immigrants.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…should  be proceeding through regular order before taking any action that could  potentially impact the entire hemp industry and affect more than  220,000 American jobs.\n\nAuthorizing policy through an appropriations bill is counter to House  rules and undermines the jurisdiction of our authorizing committees.  Appropriations bills are intended to fund…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…This bill will take us one critical step closer to ensuring that our  Rosies receive the recognition that they deserve.\n\nIn 2022, Congress passed bipartisan legislation authorizing the  establishment of a memorial dedicated to the Rosies. However,  additional legislation is needed to permit the memorial to be located  near the existing World War II…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and development presence in the Pacific Islands by recommending that  the administration increase the number of staff working on Pacific  Islands issues and in the region, authorizing the Secretaries of State  and Commerce to hire locally employed staff in the region, establishing  a workforce development program, codifying a media program and more.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…outrageous that Republicans are here today trying to pat  themselves on the back as doing something meaningful for those  struggling with addiction while the entire agency we are  authorizing programs for is being dismantled.\n\nThe people doing the work we are authorizing have all been fired, and  the administration is proposing even more draconian cuts for mental…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…practice forces veterans to wait weeks for information they could  receive in minutes through a text message.\n\nFurther, this bill would modernize VA's Solid Start program by  authorizing it to communicate with veterans via text message. Right  now, VA is only able to reach out to veterans in Solid Start by calling  them. While the older generation of veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…million  square feet, costing an additional $800 million in addition to $51  million annually to operate and maintain.\n\nDespite oversight, and even at one point a moratorium on authorizing  new courthouses, the courts issued an updated courthouse design guide  in 2021 that did just the opposite of consolidating the judiciary's  space.\n\nA GAO review of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…northernmost villages within what became  Everglades National Park were managed under a special use permit until  1998, when Congress placed that permit framework with the MRAA,  authorizing the Tribe's use of the area and noting it as Indian  Country.\n\nThe original law did not include Osceola Camp. H.R. 504 would include  the Osceola Camp in the Miccosukee…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698658/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…of the Pipeline and Hazardous Materials Safety       Administration a list of approved foreign manufacturers of       cylinders and the duration of those approvals.\n\n(g) Authorizing Foreign Inspections.--Not later than 18       months after the date of enactment of this Act, the Secretary       shall revise section 107.807(d) of title 49, Code of Federal…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…job is to ensure that  the mission is accomplished. If they can do that with different  agencies, we need to have that debate. I think that is important. It  starts with authorizing the program, and in this case reauthorizing the  program.\n\nMr. Chair, I just want you to know there are no reasons to vote  against this in substance. The language of this…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…the 2026 National  Defense Authorization Act earlier this week.\n\nThe 2026 NDAA codifies critical provisions of President Trump's peace  through strength agenda, including authorizing full funding for the  Sentinel ICBM program. The Sentinel program is set to provide essential  upgrades to the land-based component of our nuclear triad.\n\nI thank the airmen,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698101/importance-of-ndaa-passage"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Secure  Rural Schools Reauthorization Act. I secured numerous provisions in the  Working Families Tax Cuts Act, which benefited American agriculture, as  well as a provision authorizing Workforce Pell Grants.\n\nThe Whole Milk for Healthy Kids Act will soon be signed into law, and  the House approved both my Digital Asset Market Clarity Act of 2025 and  the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…wildfire threats as its Four Corners  neighbors, Utah is the only State in the region without a SWERI center.  Representative Kennedy's legislation corrects this oversight by  authorizing an additional institute in Utah, allowing the State to  expand research, strengthen watershed restoration, and develop  innovative fuel-reduction strategies.\n\nWe know that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…including the operation, maintenance, repair, or replacement       of any authorized utility facility within the corridor or       right-of-way; or\n\n(B) the Secretary from authorizing the establishment of a       new utility facility right-of-way within an existing       designated transportation and utility corridor referred to in       paragraph (1)--…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Affairs of the House of Representatives       and the Chair and Ranking Member of the Committee on Foreign       Relations of the Senate not later than 15 days before       authorizing the activity; and\n\n(2) the activity is not otherwise prohibited.\n\n(c) Report.--The Secretary of State shall submit to the       Committee on Foreign Affairs of the House…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…rules  requiring burdensome archaeological reports on energy producers.\n\nThere will be ample opportunities to debate, amend, and provide  suggestions when the appropriate authorizing committees move forward  when we begin our work on spending reforms in a budget reconciliation  package. We should focus on the legislation before us this week.\n\nI encourage…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…using these a couple of times here  because I think they make a point.\n\nThe way a reconciliation budget is laid out is it creates a series of  boxes. Here are all of these authorizing committees. We need you to  find savings. We need you to find those savings through modernization  and waste and fraud.\n\nWe are going to spend a little time actually talking…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Independence was a turning point in the history of the       United States and the world that warrants national       recognition.\n\n(2) The 68th Congress celebrated this fact by authorizing       the United States Mint to commemorate the 150th anniversary       of American independence by issuing $2.50 coins.\n\n(3) The issuance of a $2.50 anniversary coin for…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…session, with changes       that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would prohibit the Director of the Office of Management       and Budget from authorizing the use of amounts from accounts       that are not subject to rescissions made by the bill for       activities funded by accounts that are subject to rescissions…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693657/hr-4"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…procure technologies that bolster operational capabilities,  incentivizing the consideration of commercial, off-the-shelf products  prior to entering expensive contracts, and authorizing the Defense  Innovation Unit to develop regional outreach centers.\n\nThe fiscal year 2026 NDAA is a strong bill that prioritizes our  national security through commonsense…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697795/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}]