[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…policies to ensure that small businesses can  compete for Federal contracts.\n\nThese policies, including and especially the small business  procurement goals and set-aside authorities, have leveled the playing  field for small businesses and enabled their participation in the  Federal marketplace. They have a proven record of success.\n\nFederal agencies…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…investment ties--particularly regarding       Libya's vast reserves of oil--with an administration known       for its deal-based transactional foreign policy. The Libyan       authorities also aim to solidify security ties that may       bolster NATO's position in the Mediterranean, curb the free       flow of fighters and arms to conflicts raging in the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…the defense industrial  base to strengthen our submarine and shipbuilding capacity and  workforce; working tirelessly to ensure our Sailors and Marines had the  necessary authorities, weapon systems, and capabilities; and leading  efforts to secure the most significant acquisition reforms in a  generation. Phil exemplifies the qualities of the best professional…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…well-respected Austin resident, an engineer and law-abiding  citizen, serves as co-president of LightPulse, a respected Kenyan  healthcare and educational institution. Kenyan authorities cooperated  in the abduction of one of his employees, who was taken to Turkiye and  tortured. The next thing that we knew, up on a website in Turkiye was a  declaration…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…in those  jurisdictions. What sanctuary policies are is simply an affirmation  that immigration enforcement is the job of the Federal Government and  that State and local authorities cannot be co-opted or forced into  performing inherently Federal responsibilities. It means that while  Federal Agencies carry out immigration enforcement, State and local…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…are going through a legal immigration process in  this country, you go through a process, and it is your obligation--your  legal obligation--to check in with the Federal authorities.\n\nWhat is happening now is that you are getting--folks are getting-- legal residence getting a letter to appear. They have a choice. They  know that if they don't comply,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…advising the President on advanced technologies.\n\nMr. Speaker, a lot has changed since the NTIA was last reauthorized  in 1992. We should ensure that it continues to have the authorities it  needs to implement many of our Nation's broadband efforts and  technological advancements in such areas as spectrum management and  artificial intelligence.\n\nH.R. 2482…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…was  mayor.\n\nYou want to talk about cooperation. Anybody who knows local  government from the FBI to the ATF to ICE, all over New Jersey, we are  cooperating with Federal authorities. What we have simply said is we  are responsible for local law enforcement. We are not going to do  things that create such fear in our communities that immigrant  communities…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…Commerce that works  across the Federal government to develop telecommunications and  information policy. Congress should support this agency and give it the  resources and authorities it needs to fulfill its current mission.  However, this bill would waste taxpayer dollars by unnecessarily  duplicating activities already authorized by Congress.\n\nThe NTIA…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693613/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…in  central Oregon grow to more than 95,000 acres, making it the largest  wildfire of the year so far in the United States.\n\nI am grateful for the firefighters and local authorities who bravely  responded and who are continuing to fight the flames. Thanks to them,  the fire is now over 70 percent contained.\n\nMr. Speaker, while Oregon firefighters are…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693956/addressing-firefighter-funding-cuts"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…a 25-year period.\n\nThe Bipartisan Policy Center goes on to say: ``Illegal voting,  including by noncitizens, is routinely investigated and prosecuted by  the appropriate authorities, and there is no evidence that noncitizen  voting has ever been significant enough to impact an election's  outcome.'' That is from The Heritage Foundation.\n\nIf my Republican…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…decides how millions of troops are deployed all around the  world. We trust that the President is going to use those powers for  good, that the President is going to use those authorities to protect  the United States of America.\n\nBut they are vast powers. They are immense powers. So there is always  the potential that those powers are going to be used for…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…bill is a perfect example. It is a bill that has been described  well by the chairman and the ranking member that, in effect, would  ensure that a number of different water authorities--specifically, the  Eagle River Water and Sanitation District and the Upper Eagle Regional  Water Authority--would have access, as the town of Minturn already  does, to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…on this point: Congress  and only Congress has the power to enact laws. Congress and only  Congress has the power to appropriate funds.\n\nIt is very clear in our Article I authorities. The President does not  have the authority to try to undo our laws or to impound funds that we  have appropriated. Certainly a special government employee like Elon  Musk…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…``liberated'' from is their hard-earned retirement savings.\n\nA small group of my Republican colleagues in the other body has moved  to vote to reclaim their congressional trade authorities in response to  the president's misguided tariff war on our friends in Canada, by  introducing legislation to reclaim Congress's authority in the face of  the president's…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…country that has signed  the Abraham Accords.\n\nI am grateful to Representatives Harshbarger and Vargas for their  work to facilitate operations between the FDA and regulatory  authorities and innovators in Abraham Accords countries.\n\nLast but not least, this bill also includes a provision championed by  Representatives Dunn and Mullin that will ensure more…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…move to suspend the rules and pass the  bill (H.R. 3427) to require the Comptroller General of the United  States to review all clean water-related technical assistance  authorities of the Environmental Protection Agency, and for other  purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…cause of the problem.\n\nI am going to ask unanimous consent that we vote on S. 3805. That  would make it a crime for a State or local official not to turn over to  Federal authorities a criminal illegal immigrant, somebody who is  charged with a crime or convicted with a crime. And if you don't turn  them over, you would face punishment. That will stop…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Entities of  Concern Act.\n\nMr. Speaker, over the past decade, Communist China has persecuted the  Uyghur population for their religious and cultural practices. Xinjiang  authorities have detained Uyghurs in internment camps without formal  charges, forced them into slave labor, and have committed numerous  other human rights abuses against the Uyghur…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…cooperative       federalism structure. Assumption can streamline permitting       processes, reduce duplication of effort and overall       expenditures by state and federal authorities, while       providing better protection of a state's environmental       resources by those who know their state best.\n\nBeginning almost a decade ago, Florida began work…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…friends on the  streets out there are very clear about what is going on here.\n\nThis war is organized. It is coordinated and actively aided and  abetted by local and State authorities across this country.\n\nSince January 2025, there has been a 1,347-percent increase in  assaults on ICE officers, a 3,200-percent increase in vehicular  attacks, and an 8,000-percent…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…basic pay of the Under       Secretary) shall take effect on the first day of the first       pay period beginning after the date of the enactment of this       Act.\n\n(c) Authorities and Responsibilities.--\n\n(1) Coordination of executive branch views on matters       before the federal communications commission.--Section       105(a)(1) of the National…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…senior, a veteran, a child, and a family  struggling to pay the bills.\n\nFor the past 4 years, the pattern has been very clear. Migrants cross  the border and surrender to authorities. They repeat carefully  rehearsed lines, provided by NGOs, to meet the bare minimum threshold  for asylum. They are released into the country and set a court date  years…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…division B of       Public Law 117-167 (42 U.S.C. 19231 et seq.)).\n\n``(k) Rule of Construction.--Nothing in this section may be       construed to amend, alter, or affect the authorities of the       Secretary to define, establish, or enforce new environmental       industry standards for, or related to, cement, concrete, or       asphalt.''.\n\n(b) Clerical…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…protect our communities, and I want to emphasize that our local  law enforcement in Colorado Springs, in El Paso County, in southern  Colorado, choose to work with Federal authorities. They are not ICE  agents, but they go to a lot of places. They work with our Immigration  and Customs Enforcement agents to root out people who are breaking the  law. They…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Code, the Administrator shall set       aside $13,740,000 for each of fiscal years 2026 through 2028       to--\n\n(1) recruit, select, train, and delegate the necessary       authorities to additional aviation medical examiners and       human intervention motivation study aviation medical       examiners, including those who are psychiatrists;\n\n(2) expand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…why these sanctuary policies are  dangerous to the safety and well-being of Americans.\n\nAs a former police officer, I know that law enforcement must be able  to work with authorities to keep Coloradans and Americans safe. In this  particular case, the attacker was an illegal immigrant who was granted  a driver's license by the State of Colorado. He had…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…that schools had anonymously  accepted $8.4 billion in foreign money over the past decade.\n\nLet's keep in mind that the Biden administration did not utilize  section 117 authorities at all in its 4 years. You heard that  correctly, Mr. Speaker. In 4 years, the Biden administration did not  enforce section 117. Despite the Trump administration's uncovering…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…thereto.\n\n``(c) Contents.--The strategy, including any updates       thereto, shall--\n\n``(1) account for and describe all Federal programs,       projects, activities, and authorities including associated       spending levels, to secure elementary and secondary schools       from acts of terrorism;\n\n``(2) identify specific school security vulnerabilities…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…in the organ       transplantation field while the Chinese Communist Party       remains in power;\n\n(2) take appropriate measures, including using relevant       sanctions authorities, to coerce the Chinese Communist Party       to end any state-sponsored organ harvesting campaign; and\n\n(3) work with allies, partners, and multilateral       institutions…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}]