[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…and economic sanctions. In other words, designating a cartel as a  foreign terrorist organization limits that group's financial, property,  and travel interests. It does not authorize lethal military action. We  have searched high and low for a designation authorized by Congress of  a group that would automatically allow lethal action, and we have not…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…like to  present a middle ground. Since we don't have unanimous consent for the  Major Richard Star Act today, let's agree to a vote. Let's have a time  agreement that would authorize the Senate to take a single up-or-down  vote on passage of this bill before the end of the year. This time  agreement doesn't guarantee passage. It simply guarantees a vote.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…enforcement work.\n\nThe bill strengthens the FMC's ability to address anticompetitive  behavior, which is vitally necessary throughout the shipping industry.  It will also authorize the FMC to investigate complaints against  shipping exchanges concerning market manipulation and other  anticompetitive practices.\n\nThe bill creates a National Port Advisory…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…over debt- trap diplomacy, all while encouraging private-sector-led development,  market-based economies, and goodwill towards the U.S.\n\nThe PROSPER in the Pacific Act would authorize the President to  designate certain articles imported from eligible Pacific Island  countries for duty-free treatment, extending to them the same  preferential access that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…car chase is appropriate.\n\nCongress should not require D.C. police to use tactics that the  community does not want. D.C. residents should be empowered to decide  when to authorize their police to use dangerous tactics.\n\nUnder current D.C. law, pursuits are allowed if a fleeing suspect has  committed a violent crime, for example, or poses an imminent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…their       decision and reasons in the Federal Register. B-334309, Nov.       30, 2023.\n\nThe Clean Air Act provides similar procedures for the EPA       Administrator to authorize California to adopt and enforce       emission control standards for certain nonroad engines or       vehicles. 42 U.S.C. Sec. 7543(e)(2)(A). The Administrator       must…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…not what is going on here.\n\nThe budget eliminates these programs, so my Republican colleagues  can't just come here on the floor and say that they support all this  and then authorize the very programs that are being eliminated, so  there is no funding and no staff to carry them out. It is not fair.  They are giving the impression to the public that they…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of the Reversionary Interest  Conveyance Act, introduced by my colleague from California,  Representative Matsui.\n\nThis legislation would authorize the conveyance of certain  reversionary interests in approximately 8.43 acres administered by the  Bureau of Land Management in Sacramento.\n\nDevelopment at this site is currently…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691118/reversionary-interest-conveyance-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…considerations from these specific districts.\n\nIn Allen v. Milligan, 599 U.S. 1, 45 (2023), Justice       Kavanaugh noted that ``even if Congress in 1982 could       constitutionally authorize race-based redistricting under       Sec. 2 for some period of time, the authority to conduct       race-based redistricting cannot extend indefinitely into the       future.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…This needs to change.\n\nThe BRAIN Act will increase awareness for clinical trials, invest  funding into glioblastoma therapeutics and cellular immunotherapy  research, and authorize the FDA to ensure brain tumor patient access to  clinical trials. Many aggressive pediatric cases have a survival rate  of less than the average school year. We have the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…offered to remote, island and Tribal communities  that is unique and accommodating to their expertise and deep knowledge  of local challenges and solutions.\n\nThe bill will authorize $31 million for each fiscal year from 2026 to  2030 to carry out the bill's objectives. No later than 1 year after the  establishment of the bill, the Comptroller General…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…powers resolutions  are so critically important,\n\nPresident Trump and his administration are out of control. The  Constitution grants Congress the power to declare war and authorize  military action. Because Congress has not done so in this case, the  military activities directed by President Trump in SOUTHCOM are  unlawful. Congress must prevent President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…because of what they have done to kidnap Ukrainian children. One will  stop Chinese entities from supporting Russia's brutal war machine  against Ukraine. And the final one will authorize a continued quarterly  transfer of Russia's foreign assets that have been seized in the United  States to support Ukraine.\n\nSo I think--all of these bills passed. They were…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696340/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…President of the United States, and the  Department of Defense come to Congress with a request. They come to  Congress as a coequal branch of government to ask that we, Congress,  authorize and appropriate the funding they need to defend our Nation  and to protect our national interests on the world stage. And that  request traditionally includes a justification…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…work, and move  around their communities. Prices are going up, not just in America's  heartland, but across our great country.\n\nRepublican leadership today had a chance to authorize year-round E15,  a commonsense blend of ethanol and gasoline, but guess what. They  walked away from it again.\n\nInstead, and I can tell you this for the farmers I represent,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "James Risch", "party": "Republican", "sentence": "…happening, and that is exactly what  the resolution directs the President to do.\n\nCurrently, there are no U.S. forces engaged in hostilities in  Venezuela. The President did authorize actions that were limited in  scope, short in duration, and done to protect U.S. interests and  citizens. The operation only saw 200 troops, and they were inside  Venezuela,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…pollutants, but nowhere in the statute does it allow for proxy  carbon studies.\n\nHydrocarbons are not listed as a hazardous air pollutant. The plain  language, I repeat, does not authorize proxy or surrogate studies to  say: Well, we looked at it, and there is a lot of carbon. Therefore, we  are going to make specific regulations that cost hundreds of millions…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…I rise today in support of S.  1071, the National Defense Authorization Act of 2026, which includes  the Coast Guard Authorization Act of 2025, bipartisan legislation to  authorize appropriations for the Coast Guard for fiscal years 2026 and  2027.\n\nThis bill will allow the Coast Guard to continue its vital missions  of defending our maritime borders,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…and environmental services that it needs.\n\nBut all of these priorities mean little without investing in the  brave men and women who carry them out. That is why I fought to  authorize $19 million above the President's budget request to help  recover and identify the remains of our fallen servicemembers from past  wars and conflicts. The U.S. military leaves…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "Mr. GOSAR.  Res. 133) requesting the Secretary of the Interior to  authorize unique and one-time arrangements for displays on the National  Mall and the Washington Monument during the period beginning on  December 31, 2025, and ending on January 5,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696823/requesting-secretary-of-the-interior-to-authorize-unique-and-one-time-displays-on-the-national-mall-and-washington-monument-beginning-december-and-ending-january-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…I may consume.\n\nMadam Speaker, today, I urge my colleagues to support H.R. 469, the  Semiquincentennial Congressional Time Capsule Act.\n\nThis nonpartisan legislation would authorize a time capsule to be  buried on the Capitol Grounds to mark the Nation's semiquincentennial.  America is turning 250 on July 4, 2026. This time capsule represents  one way…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of the people, the United States has made  the world more free and more prosperous over our two-and-a-half  centuries.\n\nTo celebrate our semiquincentennial, H.R. 5616 will authorize the  United States Secretary of the Treasury to issue special $2.50  numismatic coins. This continues a long tradition of marking  significant milestones with coins that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…investigation shall be initiated by the Committee unless       at least five members of the Committee have specifically       requested the Chairman or the Vice Chairman to authorize such       an investigation. Authorized investigations may be conducted       by members of the Committee and/or designated Committee staff       members.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 2492) to authorize the Secretary of Agriculture and the  Secretary of the Interior to permit removal of trees around electrical  lines on National Forest System lands and Bureau of Land Management…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…election. This suit  challenges the Senator's right to be seated in the Senate, an issue  which the U.S. Constitution commits exclusively to the Senate.\n\nThis resolution would authorize the Senate legal counsel to represent  Senator Wyden named as a respondent in this suit in order to remove the  case to Federal court and seek its dismissal on the basis…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690107/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…H. Res. 352\n\nWhereas ``Jewish American Heritage Month'' has its origins       in 1980, when Congress enacted a Joint Resolution entitled       ``joint resolution to authorize and request the President to       issue a proclamation designating April 21 through April 28,       1980, as `Jewish Heritage Week' '', approved April 24, 1980       (Public…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…make the index available and       freely accessible on the website of the agency.\n\n(e) Rule of Construction.--Nothing in this section shall be       construed to require or authorize appropriations.\n\nMr. Speaker, first of all, I thank the gentlewoman from Georgia for  joining with me in this effort. I thank the minority leader for his  past work on this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…shall apply to amounts paid or distributed after the date of       the enactment of this Act.\n\nBy Ms. Collins (for herself, Mr. King, and Mrs. Shaheen):\n\nS. 3353. A bill to authorize the Secretary of Agriculture to provide  grants to States, territories, and Indian Tribes to address  contamination by perfluoroalkyl and polyfluoroalkyl substances on  farms,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…are disclosures authorized by law, including for purposes of       section 1905 of title 18, United States Code. This       subparagraph shall not otherwise be construed to authorize       the disclosure of nonpublic qualitative or quantitative       information about the ingredients in a listed drug, or to       affect the status, if any, of such information…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…so severe that local communities could see the costs of their  drinking water triple without this legislation.\n\nContrary to what the veto message states, my bill does not authorize  any additional Federal funding. It simply modifies the repayment terms  for small rural communities in my district so they are able to afford  their 35 percent cost share…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}]