[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…company says that a  television personality's comments can cause a television station or  should cause a television station to cancel his show and  it happens, that is authoritarianism. It is also when the government  dictates what should and shouldn't be said on television and whether  they should be punished and using the power of the government to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…commitment to our founding ideals than the people  running the executive branch. This administration will not last  forever, and the reactions of everyday Americans to this  authoritarianism give me heart.\n\nA couple of weeks ago, after an ICE raid at a pizzeria in Honesdale,  Pennsylvania, two people gave quotes to local news that have been  making the rounds.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Committee, to tell them what socialism is really all about.\n\nMs. WATERS. Mr. Speaker, I would just like to say that the  Republicans are confusing socialism with despotism or authoritarianism.\n\nAgain, Republicans are confusing socialism with despotism or  authoritarianism. Despots try to control the press, education, and the  system of justice. Despots send…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…history and no  criminal history other than being undocumented.\n\nMost migrants, of course, are coming due to poverty, insecurity,  violence in their home country, and authoritarianism at home. In fact,  the two most common crimes committed by people who have been detained  by ICE are being here without documentation and traffic offenses.\n\nNow, the President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…defending our  neighbors. He is someone who recognizes that fear does not create unity  and love. Fear creates division. As we reflect on what it means to  stand up to authoritarianism by defending our neighbors, our  neighborhoods, and our culture, I recognize a longtime community leader  and a public servant, Billy Ocasio.\n\nBilly was born and raised…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…ground for working families and our  democracy in moments when others have not, including the sponsor of  this resolution of disapproval, who has opened the doors to  authoritarianism by the way she votes.\n\nYou don't have to agree with how the events of his decision to step  down unfolded to recognize that this resolution is misguided and  disingenuous.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…tune in to their TV and radio stations. We won't send our kids  and our money to their universities. We won't use their services if  they are going to enable our slide to authoritarianism. What makes  their cowardice and greed so stark is the courage we have seen from  everyday Americans.\n\nWhen ICE agents started interrogating kids on a baseball diamond…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…the agenda for the American people that is not a con job, then we need  to pass the Make Housing Affordable and Defend Democracy Act. It is  about affordability, not authoritarianism. It is about American values,  not Donald Trump's wins.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…terrorist, but he  was an assassin.\n\nThese people don't understand who we are, and they certainly don't  understand that the American public does not tolerate this kind of  authoritarianism.\n\nSo what do we need to do? We need accountability. We need the people  who are the masterminds of these policies to leave their jobs. Either,  again, Stephen Miller and…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…in countries becoming  dictatorships, that they build their power on the backs of people they  dehumanize.\n\nYou are seeing at home another powerful sign of a budding  authoritarianism--a growing authoritarianism--and that is the use of  propaganda, the use of taxpayer money for propaganda. You see banners  with the President's glowering face now on…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…assault. He has denied persons due process of  the law.\n\nI believe that, if we do not take immediate action, this  authoritarian President will devolve the country into authoritarianism.  I believe he is a would-be dictator who would become a dictator.\n\nI today announce that, later today, I will bring these Articles of  Impeachment to the floor, and I…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…you while defying  court orders, then none of our rights are safe. If we let this slide,  we are saying the Constitution is optional. It is not.\n\nWhat we are seeing is authoritarianism creeping in through the  backdoor, one ignored ruling at a time.\n\nMy colleagues and I are ready to fight back with everything we have  got.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690505/trump-immigration-policies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…it or not or anybody else, he is going to be impeached  before he leaves office again. He should be for what he has done to the  country in terms of its devolution into authoritarianism. He should be  impeached.\n\nMr. President, you will be impeached for your dastardly deeds done  and for the way you have demeaned the Presidency, the way you have  harmed…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…push back.\n\nMy question for you, Senator Merkley, is, How is the fight to lower  costs for families all around this country linked to the fight against  Donald Trump's authoritarianism?", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…fought on the frontline and held the line for as long as they possibly  could. The true patriots are the Americans that stand up for democracy  and speak out against authoritarianism. The true patriots are Americans  who refused to bend the knee to wannabe Kings.\n\nTrump will continue to lie about what happened here on January 6,  2021, but the video,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…conflicting core issues demand resolution and       reconciliation to guarantee a robust democracy in a       pluralistic Jewish context, eschewing both secular       authoritarianism and oppressive theocracy. Otherwise, the       gates of Gaza (the book's title) that biblical Samson carried       facing the threatening Philistines, would now prove…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…lesson from an authoritarian regime comes without strings  attached. The CCP seeks to shape American students' views of communism  and tyranny, softening opinions toward authoritarianism, and  potentially fostering replication of those same ideas here.\n\nAlready, we see these influences on college campuses. Instead of free  speech and open debate, we see…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…fight for freedom and democracy. Ms. Boyajian's stewardship has upheld  and enhanced this legacy, positioning the institution as an  indispensable force in countering authoritarianism and fostering  democratic renewal worldwide.\n\nHer leadership and commitment will be missed greatly at Freedom  House, as her mark of excellence will be recorded in the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…China.  The argument for a CBDC that Beijing is doing this, so we should do it,  too, why on Earth would we want to imitate, emulate, or copy Beijing's  surveillance-state authoritarianism?\n\nTo my friend on the other side of the aisle who just made the  argument that we are behind and the European Central Bank is doing  this, when have we in this country,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…done under his leadership.\n\nThe National Endowment for Democracy is a critical tool for ensuring  that prodemocracy movements have the resources they need to counter  authoritarianism and confront human rights abuses. Countries such as  Ukraine, Bosnia, and Georgia face constant pressure and interference  from Russia, and the National Endowment for…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]