[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…States and newly naturalized citizens to       apply for or update their Social Security cards in person,       eliminating a long-standing practice that sent the cards       automatically through the mail.\n\n``We realize this is a significant change and there will be       a significant impact to customers,'' Doris Diaz, deputy       commissioner of operations,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Paperwork Reduction Act (PRA), and       therefore is not a rule subject to review under CRA. As       explained below, we conclude that the scope of CRA does not       automatically exclude agency action subject to the PRA.       Instead, the agency action must be analyzed under CRA.                                  DISCUSSION\n\nAt issue here is whether…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…spokesperson declared for  the first time--now, I want to make sure I get this right, so I am  going to quote:\n\nIllegal aliens who claim to be recipients of DACA are not       automatically protected from deportations.\n\nShe went on to say that DACA recipients should now self-deport from  the United States. Think about what that means. The Trump  administration…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…bank merger framework, creating a more  comprehensive process and a more transparent process. First, the new  rules will end the practice that allows certain mergers to be  automatically approved just 15 days after the closing of the public  comment period.\n\nThis resolution would reinstitute automatic approval just as Elon  Musk's, his DOGE, guts the very…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…providing the fundamental protections of due process and  a fair trial that exist in the civilian justice system and which are  rooted in international law.\n\nIsrael, however, automatically and systematically prosecutes  Palestinian civilians in the West Bank in Israeli military courts under  Israeli military law. These courts lack impartiality and transparency,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…property,  and travel interests. It does not authorize lethal military action. We  have searched high and low for a designation authorized by Congress of  a group that would automatically allow lethal action, and we have not  found it. Congress is still waiting for the President to publicly  release the legal opinion underlying these legal actions preceding…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…that bill  because of the trillion dollars in tax cuts to the wealthiest Americans  and the trillion dollars in tax cuts and giveaways for corporations  that it actually automatically triggered $500 billion in Medicare cuts  on hospitals.\n\nSo when we go, as we did--our Members on the Democratic side--last  week and met with people in hospitals and patients…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Howard decision narrowed the scope of section 2251(a), holding  that the mere physical presence of the minor in a visual depiction of  sexually explicit conduct does not automatically violate the statute.  To obtain a conviction for production of CSAM in the Seventh Circuit,  the child in the photo, video, or image must themselves be engaged in  the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…coming forward and registering with this government who  they are, where they live, and they pay a fine for coming to this  country without documentation. They then don't automatically become  citizens, but they are allowed to work. They wouldn't be deported, and  they can live a normal life, paying their taxes and doing what people  who are in this country…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…ratification of the 14th Amendment in 1868 codified equal  protection as a constitutional principle. Yet, Americans soon  discovered that simply declaring equal protection didn't automatically  create it.\n\nThe real challenge was in translating these legal guarantees into  everyday justice through their implementations. When the landmark  Supreme Court decisions…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…cystic fibrosis       may be exempt from work requirements, we know exemptions for       people with disabilities and caregivers do not work.       Exemptions may not happen automatically and can require       complex paperwork and regular recertification even for those       with chronic lifelong conditions.\n\nThe bottom line is, it doesn't matter what you…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Section 9, Clause 7 proclaims that  Congress, not the President, determines how the taxpayers' dollars are  spent. I urge my colleagues to reject this rule, which would  automatically adopt the rescissions package pursuant to the June 3,  2025, special message.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…or their state might drop their coverage due to       a drastic increase in state costs. Twelve states--\n\nTwelve American States--\n\nhave ``poison pill laws'' that would automatically end       expansion coverage or require review of the coverage if the       federal matching rate drops below 90 percent. In [those]       states, expansion enrollees are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…about adjusting temperatures to meet consumers' needs.  Smart refrigerators provide recipe suggestions based on the content of  the refrigerators. Smart ovens scan food to automatically optimize the  cooking process.\n\nEvery year, American consumers have more and more interconnected  devices. Unfortunately, the convenience sometimes comes at a cost.  Troubling…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…LNG exports are in the public interest, like lowering  costs, before approving shipments to countries without free trade  agreements.\n\nIn other words, this bill assumes automatically and without review  that every LNG export is good for America. That assumption is not only  irresponsible, but it is also dangerous and absolutely false.\n\nAnalyses have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…China's. While  constructive, there is still nothing in the underlying text of this  bill and nothing within the definition of a ``foreign entity of  concern'' that would automatically refer to the section 1260H list of  Chinese military companies.\n\nSince the section 1260H list is something that the Secretary of  Defense is instructed to update, it is…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…carrier that they  have switched policies.\n\nThe way the program was designed by our friends on the other side of  the aisle, that never happens, and because an individual is  automatically reenrolled each year, this can go on for years. Thus,  over time, it builds up to that 20 percent of shadow enrollees.\n\nWe cannot, in good conscience, in defense of the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…insurance programs to keep them in line  with the average cost-of-living changes.\n\nThe maximum coverage of these programs is provided by law and under  current law does not automatically adjust for changes in cost of  living. Any increases in the maximum coverage for these programs  require congressional action.\n\nWe must ensure that we have all the data…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…They want a government that  works. They want flood insurance that protects their homes, families,  and livelihoods. That is why I am working on legislation that would  automatically reauthorize the NFIP if there is any lapse in government  funding; in other words, prevent any future shutdown from interrupting  the NFIP.\n\nIt fixes the damage caused…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…total of at least 22 million noncitizens reside in the United  States. In 19 States, noncitizens can obtain a driver's license, and in  some cases, that driver's license automatically registers them to vote.  This is an unacceptable vulnerability in our election integrity. For  that reason, it is now incumbent on Congress to close the loophole. We  must…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…such visa       or other entry documentation is or was issued.\n\n(ii) Immediate effect.--A revocation under clause (i)       shall--\n\n(I) take effect immediately; and\n\n(II) automatically cancel any other valid visa or entry       documentation that is in the individual's possession.\n\n(c) Exceptions.--\n\n(1) Exception relating to importation of goods.--…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…exchange?  It went up 129 percent, and that is since 2014. If you go back to 2013,  it has gone up 221 percent, because insurance companies, when this  program was introduced, automatically significantly increased and  boosted their rates.\n\nSo, today, if you are in the individual marketplace, this is how much  your insurance rates have gone up since ObamaCare,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…regardless of when the visa or other entry       documentation is or was issued.\n\n(ii) Immediate effect.--A revocation under clause (i) shall       take effect immediately and automatically cancel any other       valid visa or entry documentation that is in the alien's       possession.\n\n(d) Exceptions.--\n\n(1) Exception for intelligence activities.--Sanctions…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Act was meant to constrain the Republic. We were already  worried about too many emergencies. Many on my side have actually  cosponsored bills that say emergencies should automatically end unless  affirmatively approved by Congress. Many of those people now are  looking the other way. They are looking the other way and saying: Well,  it is our President…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…automation  tools, and submit a plan to Congress on improving, modifying, or  creating new tools to support claims processors.\n\nThese improvements would, in return, help the VA automatically  retrieve veterans' records, compile evidence, automate Federal  Government data sharing, and generate notice letters to veterans. These  improvements are common sense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…consistently  show that they outperform traditional public schools, and they have a  lot of students who are on their wait list. However, the teachers at  those schools are not automatically unionized as a matter of default.\n\nThat is what inspired Gavin Newsom and his enablers to try to enact  and, indeed, succeed in enacting an anti-charter school agenda.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…standard deduction is taken  advantage of by over 90 percent of Americans. This is what simplifies  our tax code. When you show up to do your taxes for that year, you are  automatically given a dollar figure that you can deduct from your  taxable income.\n\nIn 2017, that number was doubled. We said to middle-income filers,  lower-income filers that we want…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…point you have got to look--and I am sorry I have beaten up  this chart, but we have been trying to model what happens to the  economy if we allow these tax hikes to come in automatically.\n\nIt turns out the economy is also benefited if we maximize how much we  pay for at the end of 10 years. I know changing spending policy is  hard, but if we were to maximize…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…of when the visa or other entry documentation is issued.\n\n(ii) Effect of revocation.--A revocation under clause (i)--\n\n(I) shall take effect immediately; and\n\n(II) shall automatically cancel any other valid visa or       entry documentation that is in the alien's possession.\n\n(c) Exceptions.--\n\n(1) Exception to comply with international obligations.--…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…documentation       regardless of when the visa or other entry documentation is       or was issued.\n\n(ii) A revocation under clause (i) shall take effect       immediately and automatically cancel any other valid visa or       entry documentation that is in the foreign person's       possession.\n\n(3) Exception.--Sanctions under paragraph (2) shall not…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}]