[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…remarkable technology, but neither can we let them proceed  unfettered without considering all the implications of its use.\n\nH.R. 3854 directs the VA to plan for the use of automation tools to  aid in retrieving service records, medical evidence, and claims  decision support, and to generate correspondence to the veteran. It  requires the VA to share this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…semiconductor industry directly       contributes $246.4 billion to the nation's GDP and employs       over 300,000 people in roles such as chip design, electronic       design automation, and manufacturing. Additionally, the       industry supports nearly two million indirect and induced       jobs. With continued investments and advancements, the       semiconductor…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691950/recognizing-dynamic-random-access-memory-dram-day"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…advanced manufacturing.\n\nOhio knows what it means to get left behind. We have seen the effects  of globalization. We have lived it. We have seen the effects of  outsourcing and automation. The United States simply should not be  hurting our legacy companies.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…for small companies rolling out AI.\n\nAI should be an opportunity for every American business, not just  those with the biggest budgets. As AI rapidly evolves from simple  automation to agents that could interact with customers, handle  sensitive data, and even make decisions, the stakes for getting it  right on privacy and cybersecurity are growing.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700128/small-business-artificial-intelligence-advancement-act"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…company's digitization and  strong e-commerce platforms was a major shift for the company from that  as a brick-and-mortar company to an omnichannel retailer.\n\nSupply chain automation in warehouses and major pay increases for  hourly associates were instrumental in his visionary leadership and  success.\n\nMr. Speaker, I could speak volumes about Doug McMillon's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3854) to direct the Secretary of Veterans Affairs to submit a  plan to expand the use of certain automation tools in the Department of  Veterans Affairs, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…(J) Grid modernization and grid security.\n\n(K) Rural technology development, including manufacturing,       precision agriculture technologies, and mechanization and       automation technologies.\n\n(L) Wildfire risks and prevention, including the power       sector's role in fire prevention and mitigation and wildfire       impacts on energy infrastructure.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…IEEE Power and Energy Society's Lifetime  Achievement Award.\n\nThis is one of the highest honors in the field and a testament to Dr.  Bose's groundbreaking work in power grid automation, control, and  education. His research not only shaped the future of global energy  systems but has also inspired and educated generations of engineers in  eastern Washington…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…outdated systems at the VA are causing unnecessary  delays that create real hardships for both veterans and their families.\n\nTo speed up disability claims, the VA has used automation tools, like  AI, to draft letters and gather documents. That same technology has not  been applied to other types of claims, such as pensions or survivor  benefits. This…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…industrialized  world got old. We have a shortage of young people. I think the math is,  in 9 budget years, 23 percent of America is 65 and up.\n\nAre we doing the things to maximize automation and growth so we can  have productivity and continue to afford and provide the very services  we promised? No, that would require math, thinking, and policy. It is  not good…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…arrival of their first grandchild  in October.\n\nThroughout his career, General Rasch served in various capacities,  including key roles within the acquisition and systems automation  corps. He led as the project manager for the Army's Integrated Battle  Command System and later as the military deputy to the commanding  general of the Army Aviation and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…found during the comprehensive assessment of the       agency;\n\n(B) the ongoing maintenance of software asset management       upon the completion of the remediation;\n\n(C) automation of software license management processes and       incorporation of discovery tools across the agency;\n\n(D) ensuring that officers and employees of the agency are       adequately…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…they would even send financial help and say nice things about me, but  it is not about that. It is about the entire continuity of society,  when we create these barriers for automation, for doing things better,  faster, healthier, and cheaper.\n\nIf you are going to have a command and control economy, let's just  admit we are populous. We want to run the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the full lifecycle of environmental reviews and       authorizations is critical for--\n\n(A) effective project management and process improvement;\n\n(B) enabling workflow automation, transparency, and       tracking; and\n\n(C) simplifying reporting requirements;\n\n(5) modern business process management systems that track       Federal agency workflows…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…and is now known as the East Broad Campus. It is home to many  of Gadsden State's workforce development programs such as Precision  Machining, Mechanical Design, Industrial Automation, Welding,  Electrical, Electronic Technology, Salon/Spa, Court Reporting, Truck  Driving, Skid Steer Training, Certified Nursing Assistant, Phlebotomy  and Civil Engineering.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in 1990, U.S. fertility rates  rolled over. We have a shortage of young people in America.\n\nTell me how I grow the economy if you are not going to let me do  things like automation of ports, automated rail, AI, technology,  allowing AI when it has the right data to be able to prescribe, and  people go: ``Oh, I don't like that.'' Fine. Tell me how much…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "James Risch", "party": "Republican", "sentence": "…U.S. economy. The semiconductor industry contributes  $246.4 billion to the Nation's GDP and employs over 300,000 people  across various roles, like chip design, electronic automation, and  manufacturing. DRAM is also a vital asset to America's national  security. Every fighter jet, missile defense system, and intelligence  operation depends upon the reliable,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691716/recognizing-national-dram-day"}]