[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…all you had was the ATM. You didn't have anybody you  could talk to. When people go to the bank and they only have the ATM,  what do you do when you want to talk about an automobile loan? What do  you do when you want to talk about a mortgage? Who do you talk to? Who  answers questions about the credit cards and about things that show up  on the credit…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…participant rules to examine the  largest  nonbanks with respect to consumer reporting, consumer debt collection,  student loan servicing, international money transfers, and automobile  financing.\n\nWhy should Big Tech get special treatment? Why should they be treated  any differently?\n\nOur colleague, the gentleman from Nebraska (Mr. Flood), claimed that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…have none to preserve. Therefore--\n\nNixon said--\n\nI shall propose new financing methods for purchasing open       space and parklands now, before they are lost to us.\n\nThe automobile--\n\nNixon said--       is our worst polluter of the air. Adequate control requires       further advances in engine design and fuel composition.\n\nLittle could he have imagined…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Trump administration's tariffs are  far-reaching, and they are biting down already. They threaten to raise  prices on everything, including automobiles. I come from an automobile  manufacturing center. Increases per car may be $9,000 to $12,000 per  car. That is unaffordable. Housing is unaffordable now. Now cars, now  other commodities like items…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…announced tariffs on automobiles are likely to raise prices most  significantly for the most affordable cars.\n\nThe President, however, when asked over the weekend about automobile  price increases replied: ``I couldn't care less.''\n\nThe Secretary of the Treasury from my home State of South Carolina  was doing quite well financially as a hedge fund…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…confirming the       alien's participation in a religious ceremony;\n\n(5) passport entries;\n\n(6) a birth certificate for a child who was born in the       United States;\n\n(7) automobile license receipts or registration;\n\n(8) deeds, mortgages, or rental agreement contracts;\n\n(9) tax receipts;\n\n(10) insurance policies;\n\n(11) remittance records;\n\n(12) rent…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…in Los Angeles in the 1980s. I have seen images of what  the air was like in Los Angeles in the 1970s and the 1960s and the  1950s. We are a basin. And with  all of that automobile traffic and all of that congestion and our  geography and topography, it means that exhaust gets trapped, that smog  gets trapped. There are times when you can't see the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…face the moral hazard of competing with the borrower.       Viability of a credit facility should not hinge on the       viability of a commercial venture. For example, an automobile       manufacturer that also sponsored a stablecoin might raid the       reserve should car sales begin to falter. Or a major online       aggregating retailer might disfavor…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…don't grow coffee. We  don't grow chocolate. Why is he imposing tariffs on those items?\n\nThen, the tariffs he imposed on some of our best allies, like Canada,  disrupted the automobile market. They are still struggling to try to  get their way. He backed off of the giant tariffs that he put in, but  he left 10 percent tariffs in place.\n\nWe are still in…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…said that electricity is scary. It can kill you and is produced  by burning coal, which is dangerous, so we are not going to research  electricity or atomic power or the automobile. Tens of thousands of  Americans die every year because of the automobile.\n\nWe don't know, and the majority says let's not learn because they  have some ideological fixation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…asking for a 1905 report from the Federation of  Blacksmiths on how to better change the horseshoes on a horse instead  of focusing on the rising future of transportation: the automobile.\n\nSo I wonder: When will Congress use its time to call for a report on  the state of the future for renewable energy?\n\nWhen will we be asking clean energy producers how the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697162/renewable-energy-means-lower-energy-costs"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…townhalls I held during our Passover and  Easter work period.\n\nThe lesson came to us one day when my two brothers and I were  accompanying my dad to a--well, let's call  him an automobile mechanic. Back when I was growing up in the little  town of Sumter, everybody had a neighborhood mechanic, and everybody  knew who that mechanic was because he was the guy…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…time, prices are showing up all the time  for this product or that product. I don't know how many times I see  that something costs $9.99 or $19.99 or that the price of an automobile  is $26,000. But when it comes to prescription drugs, presumably there  is something very sensitive about this that they don't want to tell us  what it is going to cost.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…the Democratic  Party took over the White House and the House and the Senate.\n\nWe believe that we can help the American people be able to afford  their groceries, afford an automobile, and afford education. That is  why we are doing what we are doing.\n\nMr. Speaker, I rise in support of H.J. Res. 20. The Congressional  Review Act is in response to the Biden-Harris…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…take further steps to prevent future  administrations from issuing similar mandates.\n\nThat is why I have partnered with Representative Fulcher to introduce  the Choice in Automobile Retail Sales, or CARS, Act, which will prevent  similar EV mandates and safeguard Americans' freedom to choose the  vehicle that is best for them. We must put consumers back…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689285/put-consumers-back-in-the-drivers-seat"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…I rise to honor my constituent Raymond  Farabaugh, Co-President of D-Patrick, Inc. in Evansville, Indiana, who  was named the 2025 TIME Dealer of the Year at the National Automobile  Dealers Association Show in New Orleans, Louisiana. This prestigious  award reflects the dedication, hard work, and commitment of the entire  team at D-Patrick. Mr. Farabaugh…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…six New York House  Democrats voted against this rule.\n\nAs States and manufacturers ramp up to meet this EV mandate, the  impacts and costs will be massive. As the National Automobile Dealers  Association wrote, the economic impact of California's regulation will  affect all States. Soon, automakers will be forced to either sell more  EVs or limit the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…ADAPTIVE VEHICLE TO AN ELIGIBLE PERSON.\n\nSection 3902(a) of title 38, United States Code, is amended       by striking ``by paying the total purchase price of the       automobile or other conveyance'' and inserting ``by paying       the total purchase price of the automobile or other       conveyance, and the total shipping price to deliver the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}]