[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "Speaker, this amendment appears to require  GAO to submit a report to Congress that compares the returns generated  through the brokerage windows with those of other investments available  through retirement plans.", "title": "Protecting Prudent Investment of Retirement Savings Act", "date": "2026-01-15"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "I myself have encountered       challenges with my own patients--some have lingered on       inpatient units for extra days waiting for a rehab facility       to have a bed available.", "title": "Witness Testimony During the Congressional Field Hearing on Haitian Tps Termination", "date": "2026-02-04"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Raising this cap would dramatically increase the amount of  investment capital available to our country's small businesses for whom  even small investments can mean so much.", "title": "Investing in Main Street Act of 2025", "date": "2025-02-24"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "It is incumbent       on you to use all of the tools available to you to preserve       and protect the independence and integrity of the legal       profession, including opposing the use of the federal       government to attack lawyers, law firms, and legal       organizations for engaging in good faith representation of       their clients.", "title": "No Rogue Rulings Act of 2025", "date": "2025-04-08"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "These alerts are critical, particularly in rural communities where  these local public stations are often the only ones available to reach  people during an emergency.", "title": "Rescissions Act of 2025", "date": "2025-07-15"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "The alternative- fuel vehicle must be commercially available at a cost, including both  purchase or leasing price and operating cost, that is comparable to  traditional internal combustion engine motor vehicles, and there is an  exemption if the purchase or lease of such a vehicle is, to quote  directly from the law, impracticable under the circumstances.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "3481, as amended, looks to  codify these efforts into law to ensure they are available to veterans  in the future.", "title": "Delivering Digitally to Our Veterans Act of 2025", "date": null}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "House Republicans must do more than pay lip service to the goal of  making healthy food available to children and families.", "title": "-9999", "date": null}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "There are resources available to make  things better, but you have to take that step.", "title": "Raising Awareness About Men's Health", "date": "2025-06-09"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "If you ever need urgent medical attention, and  there is an ER bed available, you are a Medicaid beneficiary.", "title": "Medicaid Benefits All of Us", "date": "2025-05-14"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Editors Cynthia Pena and Joyce Farrell ensure timely local news  reaches the readers in each community, as well as the readers of  Westchester Jewish Life, which is always available in the local  synagogues and temples.", "title": "Recognizing Bethesda Baptist Church and Pastor Horace Sanders, Jr.", "date": "2026-01-07"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "It will increase investment capital available to SBICs and allow them  to invest more in small businesses.", "title": "Investing in Main Street Act of 2025", "date": "2025-02-24"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "I urge the White House to put the lives of women and children above  politics by allowing these contraceptives, purchased with funds agreed  to by a large majority of congressional Republicans and Democrats, to  be made available to those who need them most.", "title": "Women's Health", "date": "2025-10-29"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "A license plate       depicting the burning of the Gaspee became available to state       drivers this fall--and it looks ``wicked cool,'' said John       Concannon, a retired pediatrician who is Gaspee Days'       historian.", "title": "253rd Anniversary of the ``gaspee'' Raid", "date": "2025-06-02"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "For the past nearly 24 years, Gerard has worked at Truman Medical  Centers (now called University Health), our area's safety net provider,  helping to advance issues of health care access and health equity He  has served as the Chief Health Policy and Government Relations Officer,  where he serves in a leadership role to help educate and advocate for  the hospital system, to ensure adequate local, state, and federal  resources are available to meet their mission.", "title": "Recognizing Mr. Gerard J. Grimaldi on His Retirement and Expressing Appreciation for A Lifetime of Dedicated Service to Our Community", "date": "2025-02-27"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "(B) Availability.--A survey conducted under subparagraph       (A) shall be kept on file and available for public inspection       in the appropriate office of the Bureau of Indian Affairs.", "title": "Shingle Springs Band of Miwok Indians Land Transfer Act of 2025", "date": "2025-12-09"}, {"senator": "James Risch", "party": "Republican", "sentence": "In keeping with the committee's intention to see that relevant  information is still available to the full Senate, I ask unanimous  consent to have printed in the Record the notifications that have been  received.", "title": "Arms Sales Notification", "date": "2025-07-28"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "There are over 70 government programs available to a single parent  with low income, but you lose the benefits of these programs if you  marry the other parent who has a decent income of, let's say, $50,000 a  year.", "title": "Reshaping the American Family", "date": "2026-01-14"}, {"senator": "James Risch", "party": "Republican", "sentence": "In keeping with the committee's intention to see that relevant  information is still available to the full Senate, I ask unanimous  consent to have printed in the Record the notifications that have been  received.", "title": "Arms Sales Notification", "date": "2025-11-06"}, {"senator": "James Risch", "party": "Republican", "sentence": "In keeping with the committee's intention to see that relevant  information is still available to the full Senate, I ask unanimous  consent to have printed in the Record the notifications that have been  received.", "title": "Arms Sales Notification", "date": null}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "She also created an event known as the ``Funders Fair,'' a one-stop  shop where federal agencies and organizations came together to help  Idahoans learn about and apply for available grants.", "title": "Recognizing Linda Culver's Retirement", "date": "2025-06-20"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "As a first responder, I know there is more work to be done to harden  our defenses against bioterrorism, and this legislation will ensure  that DHS is utilizing all available resources and tools to do just  that.", "title": "Dhs Biodetection Improvement Act", "date": "2025-03-10"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Even the CDC agrees that whole milk is the healthiest drink available  for our children.", "title": "Nippon Steel and U.S. Steel Merger", "date": "2025-06-03"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "This tells  American manufacturing and energy leaders that no matter what you do,  you will always operate under the strictest regulatory standard  available.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "This bill will commission a report on the outreach and promotion of  existing veteran-focused small business programs to make sure that  veterans can access all the available resources, the capital, and the  counseling that they need to succeed.", "title": "Successful Entrepreneurship for Reservists and Veterans Act", "date": "2025-02-24"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "De La Cruz's bill makes HUD  take the necessary steps to publish key performance information, report  program outcomes in a timely manner, and makes the data available so  Congress and the public can better ensure Federal housing programs are  meeting their goals.", "title": "Hud Transparency Act of 2025", "date": "2025-12-01"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "The record of a witness's own testimony, whether in public or       executive session, shall be made available for inspection by       the witness or witness counsel under Subcommittee       supervision; a copy of any testimony given in public session       or that part of the testimony given by the witness in       executive session and subsequently quoted or made part of the       record in a public session shall be made available to any       witness at the witness's expense if requested.", "title": "U.S. Senate Permanent Subcommittee on Investigations Rules of Procedure", "date": "2025-02-24"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "(b) Report to Congress.--Not later than 18 months after the       date of the enactment of this Act, the Secretary shall--\n\n(1) submit to Congress a report containing the results of       the study required by subsection (a), with recommendations       relating to manufacturing in the United States products       identified under subsection (a)(3); and\n\n(2) make the report available to the public on the website       of the Department of Commerce.", "title": "Critical Infrastructure Manufacturing Feasibility Act", "date": "2025-04-28"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Wind and solar are viable, market proven,  widely available technologies.", "title": "Big, Beautiful Bill", "date": "2025-05-07"}]