[{"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Places like West Las Vegas, which became the heart of the city's  Black community during segregation.\n\nBlack-owned businesses and venues along the Black Strip on Jackson  Avenue allowed culture to thrive . . .\n\n. . . while entrepreneurship and homeownership helped local community  members begin to accumulate wealth.\n\nAnd breakthroughs, like the Sands…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…deliberative body anymore. Under this Republican  majority, Congress has become a rubber stamp for Donald Trump. This is  all about the ego of the man who lives at 1600 Pennsylvania Avenue.\n\nRepublicans think they work for Trump. They are obsessed with him. It  is pathetic.\n\nRepublicans are ruining this institution, Mr. Speaker. They are  destroying this institution.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the church in  Columbus.\n\nFounded in 1840 by enslaved individuals in the antebellum South,  First African Baptist Church began in a building located at the corner  of Third Avenue and Twelfth Street, just a few blocks from the  Chattahoochee River. This sanctuary was previously used by First  Baptist Church, which was established in 1829 as Columbus's…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…that shared the Garden State with America and America with the  world.\n\nEvery song on the album is a timeless classic: From ``Thunder Road''  to ``Jungleland,'' to ``Tenth Avenue Freeze-Out,'' to ``She's the  One,'' not to mention, of course, the title track.\n\nWhether from a turntable, cassette, the radio, or your phone, ``the  Boss'' sings for us all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694961/50th-anniversary-of-born-to-run"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…will enable the SBA and DOD to  successfully implement their joint Small Business Investment Company  Critical Technology Initiative.\n\nIn addition, this bill provides another avenue to extend private  investment to small businesses in rural and underserved communities,  something that lenders and policymakers have repeatedly fallen short  on. This additional…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697258/investing-in-all-of-america-act-of-2025"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Metropolitan Police  Department officers were called to resolve a private matter at  Representative Cory Mills' residence, where officers were called to the  1300 block of Maryland Avenue, Southwest, around 1:15 p.m. for the  report of an assault;\n\nWhereas, police reports obtained by NBC4 Washington confirmed that  the Washington, D.C., Metropolitan Police Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…President of the United States, no  one is above the law. No matter if you are struggling to pay rent or  your name is plastered in fake gold on the front of a building on Fifth  Avenue, no one can overrule the Constitution.\n\nListen, if the Trump administration actually believes there is an  ongoing credible threat of armed conflict, then they must bring their…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…measured in things like  cancer diagnoses. This gets personal pretty quickly when it is clean  air and health matters.\n\nInside the body, we have just opened an entirely new avenue for  mischief. It could be mischief by any 30 of us. Frankly, it could be  mischief by a minority of the majority who want to drive something  through that most of the majority…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…course, you  are sitting in the Speaker's chair. What was so remarkable about the  start of the Obama Administration and the Treasury Department right  there on East Executive Avenue is that it is basically a part of the  White House campus. The Obama administration officials came in and were  met by Bush administration officials. We tangoed. We worked…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…State.  You can fill up those hotel rooms that were taken over by ICE agents  and go visit incredible places in our State, where Prince got his  start.\n\nYou can go to First Avenue. You can go to the Mall of America. You  can go up north or down south in Minnesota and see the incredible bike  trails and beautiful places and Lake Superior, the most superior…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…founder of the Chevy Chase Land Company, which developed the Chevy  Chase neighborhood that touches D.C. and Maryland. Newlands was also a  segregationist. He built Connecticut Avenue and ran a streetcar up the  road to the newly built Chevy Chase Lake. However, homes on Connecticut  Avenue were purposely priced to keep working families out, and  covenants…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…need to do. We need to address the affordability crisis in  America, save healthcare, and fight the cost of the actual corruption  happening on the other end of Pennsylvania Avenue. Let's get back to  work.\n\nI commend my dear friend, Representative Garcia, for his long and  distinguished tenure in public life and as a devoted public servant. I  wish him…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Along with his  five brothers and sisters, Gerard grew up in the Crestwood neighborhood  and their family was active at St. Francis Xavier Catholic Church, just  off Troost Avenue. His parents, with strong Catholic roots, instilled a  deep sense of faith, public service, and commitment to others,  particularly the underserved, in all of their children.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…offenses and to expunge  their arrest records for other offenses if the offenses were committed  only as a consequence of their trafficking.\n\nThis bill would also provide an avenue of relief for victims and  survivors facing prosecution for certain Federal offenses relating to  their victimization by establishing a human trafficking defense. The  defense…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…march toward a more perfect Union in part  anchored in the pursuit of happiness, which decade after decade,  century after century, those leaders who sat at 1600 Pennsylvania  Avenue, leaders in this Congress on both sides of the aisle, tried to  bring about for the greatest number of Americans. That is not what this  one big, ugly bill is all about.\n\nAmerica…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Texas. Mr. Speaker, I move to suspend the rules and pass  the bill (H.R. 2175) to designate the facility of the United States  Postal Service located at 130 South Patterson Avenue in Santa Barbara,  California, as the ``Brigadier General Frederick R. Lopez Post Office  Building''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697744/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…GILL of Texas. Mr. Speaker, I move to suspend the rules and pass  the bill (H.R. 2466) to designate the facility of the United States  Postal Service located at 5225 Harrison Avenue in Rockford, Illinois,  as the ``Jay P. Larson Post Office Building''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697604/jay-p-larson-post-office-building"}, {"senator": "French Hill", "party": "Republican", "sentence": "…protected whenever  they engage with digital assets.\n\nMr. Speaker, I urge all my colleagues to join me in supporting this  bill and sending it forward to 1600 Pennsylvania Avenue for President  Trump to sign into law.\n\nMr. HILL of Arkansas.  I would like to address a few of those points.\n\nOne, I am so delighted to hear that it sounds as if my friend,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…and threatens our national security.\n\nOur government should not be spending tax dollars to procure  batteries from companies that profit from slave labor or provide  another avenue for the CCP to expand their surveillance apparatus here  in the United States. As an agency tasked with protecting the homeland,  the Department of Homeland Security should…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…efficiently, effectively,  safely, and cleanly produce more gasoline and diesel? You can't do it  without more refining capacity unless you decrease demand for it. That  is not the avenue we have to go, either.\n\nMr. GUTHRIE. Mr. Speaker, as I mentioned, other than the Commonwealth  of Kentucky, California is one of those beautiful States in our--they  are all…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Metropolitan Police  Department officers were called to resolve a private matter at  Representative Cory Mills' residence, where officers were called to the  1300 block of Maryland Avenue, SW, around 1:15 p.m. for the report of  an assault;\n\nWhereas police reports obtained by NBC4 Washington confirmed that the  Washington, D.C. Metropolitan Police Department…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Hageman).\n\nMr. Speaker, despite what my colleagues say, there is no hotline that  exists exclusively for small businesses. H.R. 4305 will fix that  problem. It will provide an avenue for small businesses to engage with  the SBA Office of Advocacy, a voice that is focused on advocating for  Main Street.\n\nThis bill passed out of the committee on a bipartisan…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…it.\n\nMembers of his political party will stand by his assertion. Some may  cast their actions today as an exercise of party loyalty. Some may even  be praised by Pennsylvania Avenue. But for those who care to listen  closely, within that praise will be heard a touch of disdain.\n\nIt is no secret that Congress lacks the fortitude to stand up for its  prerogatives,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…following:\n\n(1) The Department of Veterans Affairs outpatient clinic, a       state-of-the-art facility serving the region's largest       veteran population, located at 1055 Hooper Avenue, recently       opened in the Township of Toms River, Ocean County, New       Jersey, in the Fourth Congressional District.\n\n(2) The local community, including veterans, believe…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…of Texas. Mr. Speaker, I move to suspend the rules and pass  the bill (S. 2283) to designate the facility of the United States  Postal Service located at 201 West Oklahoma Avenue in Guthrie,  Oklahoma, as the ``Oscar J. Upham Post Office''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  S.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…to large midsized manufacturing tenants and is the  financial anchor of the Warren County Chamber of Business and Industry.\n\nJim also oversaw the development of the 300 2nd Avenue Bank Building  project, a key venture that now houses the Northern Pennsylvania  Regional College and is a multimillion-dollar economic development  rehabilitation project…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…elevators where access is limited to governors.                                Water Features\n\nThe Board's initial design included new water features for       1951 Constitution Avenue, but they have been eliminated.       Fountains that were original to the Eccles Building are being       restored.                            Rooftop Garden Terrace\n\nThe term…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…purposes.\n\n(d) Land Description.--The parcel of land referred to in       subsection (a) is the parcel--\n\n(1) comprised of approximately 3.62 acres located at 2956       Park Avenue, on the Paducah Memorial Army Reserve Center,       Paducah, McCracken County, Kentucky, including the       improvements thereon; and\n\n(2) conveyed by the Secretary to the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…touched everyone who knew her. Layla passed  away on August 7, 2024, after a heroic 2-year battle with cancer.\n\nLayla grew up in Pearl River, New York. She attended Lincoln Avenue  Elementary, Pearl River Middle School, and was a rising sophomore at  Pearl River High School where she earned High Honor Roll.\n\nLayla excelled on the varsity bowling team,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Committee for their  bipartisan and unanimous support.\n\nAs noted, my bill seeks to transfer ownership of a vacant Federal  building owned by the U.S. Forest Service at 1069 Fourche Avenue in  Perryville, Arkansas, to Perry County.\n\nThis property is no longer in use by the Forest Service, and there  are no plans for its utilization by them. That has been the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}]