[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…have not gotten liberation. Instead,  Americans have been saddled with a national sales tax. That is what  Trump's tariffs are, a national sales tax on Americans.\n\nThe average family--America, listen to this--the average family,  American family, is paying $2,000 more a year thanks to Trump's  tariffs. Our farmers are taking a beating.\n\nIn New York,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…are: taxes that will  increase the cost of living, your food, the car you need to drive to  work, your appliances, and your electronics. All of it will increase  what the average family will spend by more than $5,000 a year.\n\nTrump has launched a trade war that has united our allies and our  adversaries against us. I could go on and on about the absurd…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…in the world; and you cannot drive up prices, eliminate  jobs, and put in place a national sales tax that experts now predict  will altogether--the tariff tax--cost the average family nearly $2,000  per year.\n\nAnd they are seeing it every day in their grocery bills. They are  seeing it when they want to go out and buy tools. They see it when they  are…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…lowering costs, the Trump administration  is actively promoting policies that are poised to drive up costs even  higher.\n\nThe Trump tariffs alone will increase costs for the average family by  as much as $2,000 per year, simply to buy essentials like gas and  groceries. God forbid your family needs a new car or a home renovation  in the near future.\n\nMaking…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689057/voters-sent-us-to-congress-to-lower-costs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…first Trump administration on behalf of the  oil and gas industry. These updates were estimated to save households  nearly $1 trillion annually over 30 years and save the average family  at least $100 per year in lower utility bills. They were also estimated  to cut approximately 2.5 billion metric tons of carbon emissions over  30 years. That is the equivalent…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…the announcement.\n\nTrump has now unilaterally placed the highest sales tax on Americans  in the history of this country.\n\nThe impact? Higher prices across the board. The average family is  expected to pay an extra $4,000 this year alone. They cannot afford  that.\n\nTrump says: ``I couldn't care less.''\n\nMr. Speaker, we need to end this chaos.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689748/tariffs-lead-to-highest-sales-tax-on-americans-in-history"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…for their family economics. They wanted to see lower costs.\n\nMr. Speaker, I am perplexed that this House has yet to vote on any  legislation that lowers costs for the average family. In fact, we will  be voting this week on a bill that renames the Gulf of Mexico.\n\nNo one is clamoring for a newly named body of water. They want lower  grocery bills.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690668/no-action-on-lowering-costs"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…market has taken a  hit; 401(k)'s that are critical for a majority of Americans' retirement  have declined; there has been a launch of a trade war that could cost  the average family in America over $4,900 a year this year alone with  no trade agreements in sight, threatening a recession.\n\nRather than offering solutions, my Republican friends are at…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…cut of 15 percent, the highest of any income group.\n\nOn the other hand, failing to extend these tax cuts means the average  taxpayer will see a 22 percent tax hike.\n\nThe average family of four making $80,000 a year will see their taxes  go up almost $1,700. That is 2 months' worth of groceries.\n\nAmericans need certainty that relief is on the way. Workers…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…never  saw coming. Enough is enough. It is time we put patients back in charge  of their own healthcare.\n\nLet me tell you what is happening out there, Mr. Speaker. The average  family health insurance premium now tops $24,000 a year. That is more  than a lot of folks pay in their mortgage or rent. That is insane.\n\nBarack Obama stood right here in this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Federal, has put up barrier after  barrier to affordable housing. In fact, based on recent analysis, the  average home in Michigan costs almost double to build than what the  average family can afford.\n\nThe Housing for the 21st Century Act would help reduce Federal  barriers to building housing by expanding the Federal and local housing  systems. Now, the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699804/housing-for-the-21st-century-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…We will just give them some of  your money.\n\nIt makes no sense at all.\n\nIn addition to the previous costs, the Peterson Institute estimates  that tariffs will cost the average family $1,200 a year. The Budget Lab  at Yale University estimates that tariffs will cost the average family  $4,200 a year. In fact, according to the analysis, tariffs could…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…2021 to  September 2021, so we are actually doing the same snapshot of time, if  you lived in the Phoenix area, you functionally lost $1,597 to  inflation. That is for the average family.\n\nNow we come here to 2025. It is still not as good as we demand that  we get it to, but it is now $944, a $653 savings.\n\nThat is 1 year of the success of Republicans lowering…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…for working families, farmers, and small  businesses in U.S. history. Households making under $100,000 will see a  12 percent tax cut compared to what they pay today. The average family  of four will see nearly $11,000 more in their pockets each year. Real  wages for workers will rise by as much as $7,200 a year. A waitress  working for tips will keep…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…don't have free healthcare anywhere in this country. The freest  country in the world, and we do not have the freedom to go to the  doctor of our choice. We don't. The average family in this country is  paying $25,000 a year to go to insurance bureaucrats to tell them what  handful of doctors they can go to, what lousy deductible they get, what  ridiculous…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…strengthens and secures Medicaid for  expectant mothers, children, low-income seniors, and people with  disabilities.\n\nWithout passing the One Big Beautiful Bill Act, the average family in  my district would have faced a 25 percent tax increase next year. Our  bill prevented that tax hike by making permanent the 2017 Trump tax  cuts and built upon it.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…to inflation, and add a $500 increase, bringing the total tax  credit to $2,500. Changes to the tax code, including expanding the  child tax credit, will help save the average family more than $1,300 a  year. It is time to deliver real tax relief for working families that  they so desperately need.\n\nI call on my colleagues in the Senate to protect these…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692096/child-tax-credit"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Turns out, if you don't do it, you actually get probably a small  retraction, maybe a small recession, because people's taxes go up  rather dramatically.\n\nRemember, for the average family, didn't I just show you--$2,853. In  a district like mine, it is somewhere in the $3,000 range. I have a  higher income district. You also had the other thing. The most…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…10-year window in our models. I just  hope that starts to elevate a little bit of the economics discussion  instead of the storytelling.\n\nMr. SCHWEIKERT. Madam Chair, the average family would save $2,853.  That is your crumbs.\n\nI would argue, for the average family that has been crushed by the  previous 3 or 4 years in inflation, if you don't make 27 percent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…hike, the largest in history, and 62 percent  of American taxpayers will see a tax increase in 2026. Working parents  will see the child tax credit cut in half, and the average family of  four that earns $80,000 a year will face a $1,700 tax increase. Back  home in Texas, my constituents would see their taxes increase by $3,000  on average next year.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…standard deduction for all filers;  establishing savings accounts for newborns; and creating a new  deduction on Social Security benefits for senior citizens.\n\nFor the average family of four in North Dakota, this package will  help save an estimated $1,600 in taxes. That buys about 8 weeks of  groceries. This is American money staying with the American…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the working population.\n\nThis is the average. Understand that I represent the Phoenix and  Scottsdale area. For my folks, our math is $3,300, almost $3,400 a year  for my average family in tax hikes. For the country, it is $2,850.\n\nThat is the tax hike that is already in the law. That is already what  is coming at us. That is what the Democrats have been…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reconciliation budget? It comes down to one thing, at least  for  me. Our taxes are all going up next year.\n\nIn my district, it is over a couple of thousand dollars for an  average family. In some of my ZIP Codes--look, I represent a fairly  prosperous district; I represent Scottsdale and Phoenix--it is over  $3,000. For my average, it is a $2,062 tax increase…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]