[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…make sure  Federal spending reflects the needs we are hearing about in our States  and actually solves problems for people at home.\n\nNo one wants a shutdown, and the way we avoid that shutdown is by  working together. That is not a secret, not a surprise; it is a reality  we all know. As the majority leader noted recently, the math tells us  that it…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…consequences.\n\nThat is why it is incredibly important for SBA and its  entrepreneurial ecosystem to help small businesses understand the  potential pitfalls and learn how to avoid them.\n\nMadam Speaker, I am pleased to support this bipartisan bill, and I  reserve the balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I commend the sponsors for working…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699178/ai-for-main-street-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…accountability to their       workers. Businesses have long relied on subcontracting       arrangements--such as hiring workers through temporary       staffing agencies--to avoid their responsibility to comply       with the FLSA and NLRA, even though they maintain power to       control working conditions and that the workers are integral       to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…own rivalships alone would be sufficient to produce, but which  opposite foreign alliances, attachments, and intrigues would stimulate  and embitter. Hence likewise they will avoid the necessity of those  overgrown military establishments which, under any form of government,  are inauspicious to liberty, and which are to be regarded as  particularly hostile…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…for our Nation's elites.\n\nWhile I stand here on the Senate floor demanding answers, House  Republicans have run for the exit, ended their term early, skipping  town early to avoid taking up any more discussion about Epstein and the  files. They didn't just punt accountability; they literally fled  Washington, DC.\n\nWhile everyday Americans are struggling…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…53-day, taxpayer-funded  vacation, canceled 5 weeks of votes, and still have a long to-do list  before the end of the year. That list, I hope, includes figuring out  how to avoid another government shutdown in January.\n\nYou may wonder if my colleagues are spending time on polluter  giveaways to maybe distract from something; maybe something like the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…violating very young  children, such as infants and toddlers, who are too young to understand  that they are being filmed in sexually explicit scenarios could also  conceivably avoid prosecution under the pinched reasoning of the Howard  decision.\n\nMr. Speaker, H.R. 6715 would make clear that even the passive use of  a child in the production of child sex…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…about charity; it is a strategy. Appeasement is not a strategy, nor is  hope. Appeasement and reliance only on hope are the way to further  conflict, wider war, which we must avoid.\n\nUkraine has endured these 4 years standing strong for democracy, and  they are not only in this fight for themselves; they know that peace  going forward is also at stake.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…this instance, the declaration of an energy emergency, when we are  producing more energy than we ever have in our history, as a way to  give oil and gas an easy pass lane to avoid environmental regulation is  making our environment worse, our costs higher, and our economy weaker.\n\nSo, when we finish this debate on the floor tonight, I will ask my  colleagues…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…DOGGETT. Mr. Speaker, we all mourn the loss from the tragic  attack on two National Guard members here in Washington last week. Yet,  once again, the master of distraction seeks to avoid any accountability  for his role in this tragedy. Only 7 months earlier, the Trump  administration granted asylum to the assassin.\n\nBig unanswered questions for the President:…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697312/attack-on-two-national-guard-members"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…after almost 2 months, when Speaker Johnson had the House of  Representatives shut down because he didn't want to find a solution to  rising healthcare costs and he wanted to avoid a vote to release the  Epstein files, we could have been focusing on, behind the scenes, some  ways to lower costs and solve real problems, but they continue to bring  bills…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…putting this together as  part of the Inflation Reduction Act.\n\nEPA then applies a fee for wasted methane that exceeds these  thresholds, and the best part is that companies could avoid the fee  altogether by simply not wasting methane. Members should understand  that they don't even pay the fee if they don't waste the methane, and  we actually have a fund…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…keep this very simple.  We provided a lot of funding in the Inflation Reduction Act so that  those who have very sophisticated finances and very powerful advisers  that try to avoid ever paying their taxes don't get away with it,  because it is a fundamental fairness all across America.\n\nOrdinary working people have the money taken out of their paychecks…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688893/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…America's interests.\n\nThis administration's funding cuts for democracy and election  observation programs move us in the wrong direction. And directives  telling U.S. personnel to avoid speaking publicly about how elections  are run overseas only make it harder to call out abuses when they  occur. The United States should not be stepping back; we should be…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…They empower consumers to choose cheaper, more efficient  appliances. They drive competition. They create certainty. They help  the American people make informed choices and avoid confusion.\n\nThe rule that Republicans overturned was not a ban. It was not a  mandate. The rule didn't even change underlying efficiency standards.  This vote comes after two…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…direction or, arguably, with  the permission of this body. We fight over that sometimes when agencies  exceed the authority they were given.\n\nThere is a penchant here in Congress to avoid some of the hard  decisions and just ship it downtown, let the agencies have a lot of  running room. As a result of that, you get lots of decisions.  Sometimes, they are not…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…Trump administration  work to advance bilateral negotiations with Kenya, and I hope to see  continued progress with Kenya and other potential partners.\n\nAs the world works to avoid overreliance on unreliable single  sources, redundant supply chains for both inputs and markets for our  outbound products are key. Stronger partnerships across Africa can…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698901/agoa-extension-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…long-established term in establishing such a transition period.  After all, the purpose of a transition period is to allow industry time  to adjust to new rules and requirements and avoid market disruptions.\n\nAs the Department of the Treasury works to implement the One Big  Beautiful Bill, I urge agency officials to do so in accordance with the  statute as written…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Americans have access to affordable credit has never been more  important.\n\nOverdraft protection is an optional service that financial  institutions provide to help consumers avoid having purchases declined.  Instead of the transaction being denied, the bank or credit union  charges a flat fee to cover the check on behalf of that consumer. It  lets that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…procedures, some of which  are great and designed to have cooling effects, and some of which are  really stupid.\n\nYet, what we are doing is trying to find every which way possible to  avoid accountability and responsibility, and that is, as I have been  putting it around here to reporters and getting reported out, to do  basic math because that is, in fact, our…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it is my  way of just saying how disappointed I am with even my friends. I have a  couple of really good friends who are over in the Senate, and they were  just desperate to avoid doing what was difficult, so they threw it in  our lap.\n\nMr. Speaker, we as House Members get to make a decision: Are we going  to do what is right and moral and what actually…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…institutions involved in       wildfire management; and\n\n(2) shall, to the maximum extent practicable, consult with       the heads of other Federal departments and agencies to avoid       duplication of activities.\n\n(d) Prohibition.--\n\n(1) In general.--Except as provided in this subsection, the       Administrator may not procure an unmanned aircraft system…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…that out, just  without easily identifiable keywords such as ``Confucius,'' but what  else will take place. That is why we need these bills.\n\nUnder these bills, schools must avoid contracting with the CCP or its  agents. Schools must report gifts from or contracts with foreign  governments, and resources must be available for parents to review.\n\nWe know…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…well-capitalized institutions  involved. Unfortunately, because of the Biden regulation, this resulted  in a much more protracted process.\n\nExpedited reviews are essential to avoid prolonged, costly merger  review processes that hinder banks from maintaining their employee base  or investing in technology. Instead, long-drawn-out application  processes…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Management Act. None of  that permitting is waived in this bill, and I would dare say anybody  wanting to run one of these cables would say they are getting to do it  and to avoid all environmental laws and protections. I don't think  people running these cables want to do that.\n\nSecond, it removes the 5-year timeline for any special use permit  within…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…through fiscal year 2023, but, as I  mentioned, the authorization expired in September 30, 2023, and final  payments were paid in April of 2024. Congress must reauthorize this to  avoid critical funding shortfalls.\n\nFor example, in some of the counties of my district: Plumas County  relies on Secure Rural Schools for $3.7 million, Sierra County for  $942,000,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…floor in the United States House of  Representatives.\n\nSecondly, sometimes the simple truth is something, most especially in  Washington, D.C., that we here in Congress just avoid or don't see with  clarity. Here is the simple truth, and this is what Mr. Evans was  trying to get at: His resolution, yes, it is different than mine. Mine  focused purely…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…regulation begins in 2026--next year--by requiring affected  States to sell 35 percent electric vehicles. These cars will hit  showroom floors within the next few months. So to avoid the devastating  impacts of these waivers, we need to act now.\n\nThese unattainable standards, backed by a fine of $26,000 per  vehicle--I said $26,000 per vehicle--for noncompliance…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that a member should not send cash or       another form of currency or personal financial information to       another member.\n\n(D) Information regarding best practices to avoid online       fraud or being defrauded by a member of an online dating       service, which may be provided through a link to another web       page or disclosure.\n\n(E) Contact…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…for granting us this time.\n\nI am embarrassed for my own party today. I am embarrassed we withheld  swearing in a duly-elected Representative of the people for 49 days  just to avoid this vote that is finally going to happen today.\n\nI am embarrassed that my own party isn't going to yield me time to  debate this. Even though they say they support it and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}]