[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…throughout  the region.\n\nMs. Wilson's many contributions to public service have been  recognized throughout her career, including receiving the Katherine  Hanley Public Service Award for her extraordinary impact on Fairfax  County and her dedication to improving the lives of others, and  Leadership Fairfax's Non-Profit Leadership Award for her tireless…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Recovery  Initiative (PAARI), helping spread the importance of this work across  the country. Last year, he received recognition from PAARI and was  presented with the ``Leadership Award for Advocacy and Community''.\n\nI first met Chief Tate after becoming the Congresswoman for  Minnesota's 2nd Congressional District in 2019. Over the years, I've  sought guidance…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700084/congratulating-chief-jeff-tate-on-his-retirement"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Jayden Zalazar  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nJayden has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691463/recognizing-jayden-zalazar"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…willing to do it on the backs of the  American people.\n\nYou would rather see them--thank God for the people who are standing  up on your side. They deserve the Profile  in Courage award because they are able to stand up to a President who  would rather see 15 million people lose insurance and another 20  million see their prices double. Thank the Republicans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698786/breaking-the-gridlock-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Heyzel Perez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nHeyzel has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691009/recognizing-heyzel-perez"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…members of the community for  their contributions to the chapter and the community over the past  year.\n\nI include in the Record the following OKK awards recipients:\n\nTrailblazer Award: Lieutenant General (Retired) R. Scott       Dingle, U.S. Army\n\nTrailblazer Award: The Honorable Robert R. Rigsby,       Associate Judge, District of Columbia Superior Court…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Paige Bueckers who is going to be one of the greats  in the history of college basketball. She scored 17 points and had  numerous rebounds, steals, and blocks. She has had every award  imaginable for a college basketball player: ESPY Award, John R. Wooden  Award, and Naismith Awards, but winning that trophy which so far had  eluded her is just a storybook…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…a Church of 300 million people.\n\nLater this month, His All-Holiness will visit the United States to  receive the Templeton Prize, the world's most prestigious international  award at the intersection of religion and science. This honor is  awarded annually to those who advance Sir John Templeton's vision of  progress in religion through discoveries and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…GAO reports and recommendations.\n\nMr. Dodaro's accolades are known far and wide. He recently received  the Association of Government Accountants' (AGA) Lifetime Achievement  Award for a Legacy of Service, was inducted into Government Executive's  Government Hall of Fame, and received the AGA Chapters Award for  Extraordinary Service to the Nation in…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Alma Moreno Del  Valle for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nAlma has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691061/recognizing-alma-moreno-del-valle"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…been honored as the 2025 Library of  the Year by the National Library Service for the Blind and Print  Disabled, a division of the Library of Congress.\n\nThe Library of the Year award recognizes libraries that excel in  providing accessible reading materials and services to those with  visual, physical, or print disabilities. Libraries receiving this award…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to recognize David Neville,  owner of Capstone Farms in Kentucky, for receiving the prestigious 2026  Citizen Diplomat Award.\n\nOn 258 acres of land in Northern Kentucky, David has built not just a  farm, but a laboratory of ingenuity. Through hydroponic and aquaponic  growing systems, sustainable…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Springfield, Massachusetts, who recently  was honored by the Organization of American Historians (OAH) as the  winner of the prestigious 2025 Mary K. Bonstell Teacher of the Year  Award. He currently is a U.S. History and Government teacher at Gonzaga  High School in Washington, D.C.\n\nThe award was given at the OAH annual meeting last April in Chicago  and…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691693/recognizing-edward-l-donnellan-jr-as-the-winner-of-the-2025-mary-k-bonstell-teacher-of-the-year-award"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…everywhere.\n\nIn Tacoma, he highlighted notable Black figures and entrepreneurs  with celebrations of Black history, which led to his being the  recipient of the City of Tacoma Destiny Award.\n\nI thank Willie for his contributions to the international labor  movement, and I congratulate him on his well-earned retirement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695163/congratulating-willie-adams-on-his-retirement"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…PINGREE. Mr. Speaker, it is my distinct honor to recognize  Patrick Keliher as the 2025 recipient of the Atlantic States Marine  Fisheries Commission's Captain David H. Hart Award. This recognition  honors Pat's remarkable leadership and contributions toward improving  Atlantic Coast marine fisheries.\n\nAs former Commissioner of the Maine Department of…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Honoring Marlee Lauffer\n\nMr. McCLINTOCK. Mr. Speaker, on May 17, the College of the Canyons  Foundation will honor Marlee Lauffer with the 2025 Silver Spur  Community Service Award in recognition of her longtime philanthropic  work.\n\nI first met Marlee as a high school student leader in Tustin, and she  was my first and only choice as chief of staff when…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to recognize  the Susquehanna Regional Emergency Medical Service, which recently  received the 2025 Dick Ferneau Career EMS Service of the Year Award.\n\nThis is one of the top national awards in emergency medical services  and highlights organizations that exemplify outstanding care,  innovation, and commitment to the people…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699537/recognizing-susquehanna-regional-emergency-medical-service"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…first time in Warren County's  history, a middle school FFA chapter has earned the highest honor  possible from the National FFA Organization. Receiving the National  Chapter Award with a gold three-star rating places Warren County Middle  School's FFA among the very best agricultural education programs in the  Nation.\n\nA testament to the hard work, leadership,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize and celebrate Mr.  Steve Ledwell of Texarkana, Texas, and to present him with the  Congressional Patriot Award. Steve has dedicated his life to faithfully  serving his community and country.\n\nBorn and raised in Texarkana, Steve has spent his life building up  others and strengthening…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…demonstration, and commercial application  activities. This means that each project must have a certain funding  percentage, usually at least 50 percent, contributed by the award  recipient. However, DOE can modify or eliminate those requirements,  when necessary, which is an authority that can be critical to  supporting early-stage technologies.\n\nH.R.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688929/cost-share-accountability-act-of-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…people of the Fourth District of Kansas. She is a pillar in  Kansas politics and has been repeatedly recognized for her service,  most recently receiving the Spirit of Unity Award from the Sedgwick  County Black Republican Council. She has also twice received the Kansas  Republican Party's Huck Boyd Volunteer of the Year Award.\n\nShe has been an integral…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…sense of  community in the young minds she educates.\n\nAs an alumna of the University of Georgia--Go Dogs--she has received  several accolades, including the Outstanding Alumnus Award from the  College of Agricultural and Environmental Sciences and recognition as  the 2025 Milken Educator of the Year.\n\nMr. Speaker, I congratulate Rachel on her well-deserved…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692403/recognizing-rachel-kinsaul"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…designation in the 2025 Aspen Prize for Community College Excellence.  It also became the first Alabama community college ever selected as a  finalist for this prestigious award. Wallace State continues to fulfill  its mission of ``learning that transforms lives and communities,''  providing opportunities that strengthen individuals, families, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695474/recognizing-wallace-state-community-college-and-its-president-dr-vicki-p-karolewics"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Editorial Board, Board Member of the Lee-Russell  County Council on Aging, Active with People of Action for Community  Enrichment and recipient of the Arthur Hill Community Service Award  (2023).\n\nMr. Payne retired from the City of Opelika Engineering Department  (1990 to 2000) after previous employment with the Augusta Environmental  Company (1981 to 1989)…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Speaker, I rise today to congratulate Dr.  Michael Welsh, a University of Iowa professor of internal medicine, on  winning the 2025 Lasker-DeBakey Clinical Medical Research Award. The  Lasker Award is one of the most prestigious biomedical and clinical  research awards.\n\nDr. Welsh was recognized for his extraordinary research on cystic  fibrosis, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695572/congratulating-dr-michael-welsh"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…and RBI's,  carrying an impressive .521 batting average and .662 on-base percentage  this past spring.\n\nOff the field, Sadie is a two-time Hunterdon Art Museum Young Artist  Award recipient and has been featured in the Holland Brook School  Bobcat Bulletin. She also maintains straight A's in all core subjects.  I invite my colleagues to join me in honoring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695064/recognizing-sadie-pirez-chevrolet-play-ball-player-of-the-month"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Director of the  Association of Asian Pacific Community Health Organizations Jeffrey B.  Caballero, MPH, who has received the Hepatitis B Foundation's 2025  Community Leadership Award.\n\nPrior to becoming Executive Director of the Association of Asian  Pacific Community Health Organizations, Jeffrey began his journey at  the University of California, San…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…recognition. As owner/operator of Isler Genetics, he was  among the first to implement specific pathogen-free herd standards. A  recipient of the Ohio Pork Industry Excellence Award from the Ohio Pork  Council. Bill joins his brothers, Dick Isler and the late Gene Isler,  as a Hall of Fame member.\n\nThe late Steven D. Maurer of Botkins in my congressional…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694257/recognizing-the-2025-class-of-the-ohio-agricultural-hall-of-fame"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize and celebrate Mr.  Gary Singleton of Bowie County, Texas, and to present him with the  Congressional Patriot Award. Gary has dedicated his life to faithfully  serving his community and country.\n\nBorn in Texarkana, Texas, Gary attended school in the Texarkana and  Liberty-Eylau districts…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Mark Kipphut  of McLendon-Chisholm, Texas, and present him with the Congressional  Patriot Award. Mark has dedicated himself to faithfully serving our  community and country.\n\nAfter graduating from The Citadel with a political science degree in  May 1979, Mark commissioned…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}]