[{"senator": "Maggie Hassan", "party": "Democrat", "sentence": "The Senate should not pass a budget that rips healthcare away  from millions of Americans--60,000 of whom live in my State--just to  give tax cuts to billionaires, but that is what this budget will do.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "They must  abandon their efforts to take healthcare  away from millions to fund tax cuts for billionaires.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Al Green", "party": "Democrat", "sentence": "The cuts to Medicaid, Medicare, and the  Supplemental Nutrition Assistance Program (SNAP) alone will take health  care and food assistance away from millions of veterans, seniors, and  families across the country.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Despite those numbers, everything that we have seen from this  administration--from its tariff policy raising prices on cars to coffee  to the passage of the One Big Beautiful Bill--or betrayal, as I call  it--that ripped Medicaid away from millions of Americans to finance tax  breaks for billionaires--all of those actions has made the  affordability crisis for average Americans worse.", "title": "Cloture Motion", "date": null}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "The law ripped healthcare coverage away from millions  of Americans to give tax breaks and tax giveaways to billionaires and  megacorporations.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-04"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "I am a  ``hell no'' vote on any legislation that strips healthcare away from  millions of Texans.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Speaker, we are here in the dark of  night because President Trump has one goal: to pass massive tax cuts  for billionaires by cruelly stealing healthcare away from millions of  Americans.", "title": "One Big Beautiful Bill Act", "date": "2025-05-23"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "You cannot hide from the fact  that you are choosing to rip healthcare away from millions of  Americans.", "title": "Addressing Unworkable Funding Reductions in the Federal Budget", "date": "2025-04-07"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Republicans are actively taking healthcare away from  millions of Americans.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "This resolution will direct them  to cut Medicaid, ripping healthcare away from millions of Americans.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "If Republicans truly cared about pregnant women and families, we  would be debating how to undo their $1 trillion cut to Medicaid, which  rips healthcare away from millions of pregnant women, new mothers, and  children, and how to help the millions of women seeing their health  insurance premiums skyrocket due to months of Republican inaction.", "title": "Supporting Pregnant and Parenting Women and Families Act", "date": "2026-01-21"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Why are we taking telehealth away from  millions of seniors who are homebound or who have difficulty leaving  their homes?", "title": "Ban on Acceptance of Gifts From Lobbyists", "date": "2025-02-25"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "``Republicans       know their spin is a lie, and the truth is they have no       problem taking health care away from millions of Americans so       that the rich can get richer and pay less in taxes than they       already do.''\n\nYou see--stepping away from this--they are saying we are going to  make these cuts to balance the budget, but their budget blows a bigger  hole in our deficit.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "It is the largest cut in Medicaid in the Nation's health  history, ripping health insurance away from millions of Americans in  every single State.", "title": "Medicaid", "date": "2025-05-12"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "This week and into the next couple, Republicans are  plotting to rip healthcare away from millions of Americans to fund tax  cuts for 759 billionaires.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy- Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars Ii; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''; and for Other Purposes", "date": "2025-04-29"}]