[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…gentlewoman doesn't think that  that is in the interest of the American people, but my colleagues on  the Democratic side do. My colleagues think when Republicans are taking  away people's healthcare in this country, it is a big deal.\n\nThis bill, this tax scam bill, would literally take food out of the  mouths of kids, and take nutritious food from senior…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…always like to talk about limited Federal  Government. My Republican colleagues always like to talk about how  important local governance is. Yet, they want to rip it away from the  people in this city.\n\nMy question is: How many doors have they knocked on in D.C.? Have  they knocked on a single door? Have they spoken with a single resident,  a person…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…about due process. Due process,  the notion that you ought to be able to at least raise your hand and  say, hey, you have got the wrong person when you are being taken away  by people who have masks and are not properly identifying themselves as  members of the constabulary. You should be able to stop that.\n\nIn my opinion, people ought to be identified…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…hotter summers, flash floods, fires and disasters. It will  increase our reliance on fossil fuels, which make the air dirtier and  people sicker, all while we are taking away people's health care. This  Congress has earned an ``F.'' We do not deserve a better grade.\n\nI am ashamed to be a part of this Congress, but I will stay because  people need to…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…were  bursting with questions about how a bill that can change the tax code  for the next 10 years, that can intervene in terms of our healthcare  system, in terms of taking away people's health coverage, can happen  with no transparency and no public input.\n\nAs I said, it was being written in the dead of the night prior to the  vote on May 22. This is…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…our national hunger crisis is more than just a policy  failure. I think it is a moral outrage, one that Trump and Republicans  have made worse by ripping food assistance away from people so they can  give tax breaks to billionaires and canceling USDA's gold-standard  hunger report to bury the impact of their cruel cuts.\n\nMadam Speaker, this tour is about…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698923/end-hunger-now-tour"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…a gigantic tax  break for the wealthiest people in this country a la Elon Musk.\n\nIt is morally bankrupt to think about that, that transfer, about  taking healthcare away from the people in my district and across this  country and transferring it to the wealthiest Americans. It is also  fiscally reckless.\n\nDoing this will essentially collapse our healthcare…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…breaks to billionaires and corporations, people who absolutely don't  need any more assistance.\n\nIt is taking that money from people who desperately need help and  giving away to the people who don't.\n\nPeople who are just struggling to get by are having precious  resources taken away from them.\n\nRight now, across this country, Americans are trying to figure…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…of the aisle find the courage to stand up? Have they not  learned that cowering before this man only works until he decides you  are expendable?\n\nIt may be easy to look away when people are without welfare status,  when they suffer, or when people you don't like are targeted, fired, or  erased. It may be easy when the victims live in places like Cleveland,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…he has been there every day of the year helping people, every  day of the most recent years helping people because we know that people  have been in Chicago trying to take away people's lives, taking them  out of the country, people who are fine, wonderful people in the city  of Chicago.\n\nI say: Shame on you for deciding that this is the issue that you,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696779/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…has you covered. If you  have a child and something happens to you, that kid will get Social  Security benefits.\n\nDonald Trump and Elon Musk want to rip that protection away. Two  people who don't have the slightest clue how much Social Security means  to families are now threatening Americans' benefits in order to pay for  giant tax cuts for billionaires,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…a home health  aide.\n\nHowever, is their priority to make people's lives easier, to make  people's lives better? No. It has been totally focused on how you rip  that away and make people's lives more expensive.\n\nIt also means for the Gulf Coast we are still reeling from Hurricanes  Helene and Milton, just like other parts of the country, in Georgia and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…neighboring  congressional districts in Wisconsin. We have had record turnout.\n\nIn Belmont, Wisconsin, population 1,000, we had over 200 people show  up; and we had to turn people away. People were watching the townhall  through the windows. In Viroqua, a town of 4,500 people, 300 to 400  people showed up to voice their displeasure with the Republican agenda.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…she needs.\n\nThey are real people like Veronica, whose grandmother's last few days  in long-term care were only possible because of Medicaid.\n\nTaking healthcare and food away from people isn't bringing down  prices for families. It is telling people that your health and your  lives aren't worth as much as billionaires' bank accounts.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691411/gop-tax-scam-hurts-women-and-families"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…have done better.\n\nThe House had core components in it to reform Medicaid. My colleagues  on the other side of the aisle were saying we are going to be taking  Medicaid away from people. Medicaid goes up between 20 and 30 percent  under our budget over the next 10 years.\n\nMedicaid under our bill would be focused primarily on the vulnerable  population…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…causing the lawless to be walking among us.\n\nThat resulted directly in the death of a Ukrainian refugee who  thought she could live the American Dream. It was taken away from her  because people were purposely put on the street who are dangerous.  There is no other way to look at that. That is literally what happened.\n\nI know that there is going to be a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…the first time that they have used that phrase. They used  that when the State of Georgia put an ID requirement on voting. They  said it was going to be horrible and take away people's rights. It was  going to disenfranchise minority voters, Mr. Speaker. That is what they  said, but then what happened? We have actually got history to go look  at.\n\nAfter…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…they have opposed that bill is by mischaracterizing it  and outright misrepresenting what is contained in it. One of the  accusations made is that it will take away healthcare coverage from  people who need it.\n\nDemocratic Leader Senator Schumer said of the bill:\n\nThere is nothing beautiful about stripping away people's       healthcare, forcing kids to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…reason, take that as a right that we can have.\n\nThe Dobbs decision was one of the most important decisions of our  lifetime. For nearly 50 years, Roe v. Wade took power away from the  people and handed it to unelected judges, but Dobbs finally made it  right.\n\nThe Court didn't outlaw abortion, as my friends on the left tried to  claim. What it did was restore…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692891/dobbs-v-jackson-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Iran do not have to bear the cost of  this malevolence for much longer. It is my ardent hope that a better  future, one of  peace, freedom, and democracy, is not far away for the people of Iran.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698899/standing-with-brave-iranians"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…from evil is to put them side by side and to  trust the people to know the difference.\n\nNo central authority must ever be given the power to take this vital  freedom away from the people or to punish anyone solely for expressing  their opinions.\n\nWe have based our entire form of government on the assumption that,  when exposed to all sides and all viewpoints,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}]