[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…placing critical supply requests  for medication and equipment; support lines for caregivers that have  been reduced; Veterans Crisis Line employees fired and, after a public  backlash, maybe some rehired, as we heard today in a hearing of the  Veterans Affairs' Committee. But the impact is enduring because suicide  prevention has to be done in the moment,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…answer is, again: because their  agenda is so unpopular with the American people, and neither House--and  no Republican Senator--wants to be left holding this hot potato.\n\nThe backlash Republicans are getting from the public--whether it is  town halls, in the streets, or through dismal polling data--should  serve as a warning to our colleagues on the other…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Numbers don't lie. Look at the Congressional Budget Office's  analysis. The Republicans' math does not add up. Again, this adds  trillions of dollars to the debt.\n\nSince the backlash has been swift and deserved, Republicans are  scrambling to do everything they can to sweep it under the rug and  change the narrative. That is what these bills are about--political…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…with peaceful protests. I believe in peaceful  protest. I do not in any way condone persons who go out and harm other  people, and I have said as much.\n\nYes, I get all the backlash that others get when they say as much,  but I absolutely will continue to say peaceful protest is the way to  make change that can make the difference.\n\nI can do it through…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…provide information about the 30,000 individual workers who  are leaving and what positions they hold.\n\nBut here is what we know for sure. Only because of the blistering  backlash of veterans themselves, the veterans service organizations  that represent them, Members of Congress like myself, and the public,  is he, in fact, abandoning this cruel and…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…ability to  see a doctor is at stake. Their ability to put kids in daycare is at  stake. The longer DOGE is allowed to rain chaos on the American people,  the stronger the backlash will become.\n\nAnd let's not forget, even by their most optimistic projections--and  they have had to reduce them--the amount of money that DOGE will cut is  far less than…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…continue, they will find one time that Africa will       come to the other side.''\n\nThe Kremlin's interest in Libya is deep-rooted as NATO's       intervention prompted a severe backlash from Russian       President Vladimir Putin. who went on to double down on back       for another Soviet-era ally facing an Arab Spring revolt,       Syrian President Bashar…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and slavery to divide again, to wedge, to sow division, it is as old as  time.\n\nThe history of this country has been every time we make progress  towards the ideal, there is backlash, and it involves three things:  violence, propaganda, and voter suppression.\n\nMy great-grandfather lived through the first backlash. He was a man  born on a plantation. His…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…government.\n\nNext to this achievement in vital consequence will be the inability  of unworthy men of our own race to cheat their way into prominence.''\n\nThis was the first great backlash in American history to making  progress toward making the ideals of upon which our country was founded  true for everyone.\n\nEnter my own family history. My great-grandfather…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Kamala  High Prices.' ''\n\nHe had these signs all over America, promising low prices.\n\n``Almost two-thirds of Americans disapprove of Trump's handling of  tariffs, and a lasting backlash could be especially consequential for  Republicans in areas such as the Lehigh Valley, a perennial Rust Belt  battleground where Trump's campaign pitch resonated with many…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…SAVE America Act because it hurts the Democratic  Party's ability to cheat in our elections.\n\nJust think of all the things Americans need an ID for, yet face  absolutely  no backlash from the Democratic Party. For example, to exercise another  constitutional right, the Second Amendment, an individual must present  a government-issued photo ID to purchase…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…times of grave danger, such as       during the Holocaust. The prosecution of the Gaza War       following Hamas's barbarism both united and divided Israelis       with a backlash of antisemitism in the United States and       Europe. It is evident that events in Israel affect the Jewish       Diaspora, even as the author emphasizes the debt of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…investigator in the attorney general's office said. She said:\n\nThere is a perception that--\n\nI am quoting now.       --that forcefully tackling this issue would cause political       backlash among the Somali community, which is a core voting       bloc [for Democrats].\n\nIn fact, one of the other witnesses in the fraud investigation said:  Look, you told the prosecutors--let…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}]