[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…just to stay well--who will pay  for Donald Trump's giveaway to the top 1 percent.\n\nI cannot believe that my Republican colleagues are even considering a  plan that is so backward and so cruel for hard-working Wisconsinites  and seniors. This is wrong, and we must continue to fight back and say  loudly and clearly: Hands off Medicaid.\n\nMs. BALDWIN.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…precedent on hepatitis B vaccine recommendations  for babies.\n\nSecretary Kennedy's fascination with quackery has, once again, set  health, science, and medicine in America backward.\n\nThe new guidance says that only babies whose mothers test positive  for hepatitis B or whose status is unknown should receive the vaccine.\n\nFor every other baby, the committee…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697786/attack-on-childrens-health"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…tariffs and DOGE cuts.\n\nWhy did he visit Detroit yesterday when his insistence on continuing  these tariffs actually cuts investment in American manufacturing? It is  all backward, and it puts America backward and America's workers  backward.\n\nIn December, manufacturing jobs continued an 8-month decline that  began after President Trump falsely promised…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699062/manufacturing-jobs-lost-due-to-trump-tariffs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…make  decisions for their children is a massive violation.\n\nMr. TAKANO. Madam Speaker, jailing doctors and, in some cases,  parents for following best medical practices is backward, ignorant, and  dangerous.\n\nMy colleagues who support this bill are not vested with the power to  say that someone does not deserve medically necessary care. This body  has…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698352/protect-childrens-innocence-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Mr. Speaker, I came to Congress looking to do for the least of these  as well as every American, but Congress' priorities this year have not  been that.\n\nCongress bent over backward, congressional Republicans specifically,  bent over backward to provide permanent tax breaks for people who make  over $500,000 a year, but if you make $64,000 a year, or…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…economic power for decades.\n\nThis is the moment when the winners of the global energy race are  being decided, but instead of leading, the United States is being  pulled backward.\n\nOver the past year, more than 165,000 clean energy jobs have been  wiped out or delayed. Projects capable of powering roughly 13 million  homes have been canceled or frozen.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…from the marches in Selma to the  legislative victories in the sixties, seventies, eighties, nineties,  and beyond.\n\nTo push to eliminate DEI policies is a dangerous step backward in  this ongoing fight for justice and equality. It is no accident that  this movement to undermine DEI coincides with the resurgence of racism  and hatred, and this rhetoric…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…during the course of the campaign that in  the first year he would cut power bills in half. Instead, they keep  climbing.\n\nRight now, thanks to the congressional Republicans' backward energy  policies, electricity prices are climbing more than twice as fast as  inflation. More than 80 million Americans are struggling to pay their  utility bills, with many…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…be doing in our military, but we should also be doing the same in every  aspect of our economy.\n\nThat is why it is so disturbing that Republicans continue to want to  look backward rather than forward with regard to our energy future.  They refuse to engage, invest in, and celebrate the innovation that is  going on with regard to renewable energy and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…don't understand the priorities that Congress focused on this year.  I really don't. I don't understand how under H.R. 1, which I call the  big, ugly bill, Congress bent over backward, congressional Republicans  specifically, bent over backward to provide permanent tax breaks for  people who make over $500,000 a year, such as a permanent $15 million  gift…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…families.\n\nI don't understand it, Madam Speaker. President Trump promised to cut  Americans' power bills in half. Instead, he and Republicans are causing  them to soar with their backward policies and their war on cheaper,  cleaner energy. Since Trump took office, electricity prices are up 13  percent, and natural gas prices are up 8 percent. They simply don't…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…vote, 105 years ago this year. Instead  of celebrating its achievements and recognizing the benefits of these  grant programs, the Trump administration is trying to send us backward  in time, harming millions of women in the process.\n\nMr. Speaker, I am not going back. I encourage my colleagues on both  sides of the aisle to stand with me in support of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…doesn't end in prosperity; the sacrifice  of clean air doesn't end in making us healthy again. It ends in cancer;  it ends in an enfeebled economy; it ends in a country going backward  and shrinking in on itself. It ends in crisis. Let's not go there.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…committee over in the House to enact a provision in the energy law that  increased our Nation's fuel economy standards for the first time in 32  years. We were actually going backward by 2007, and the rest of the  world was zooming right past us.\n\nIt is one of the laws I passed which I am most proud of, and that is  what led to the rulemaking that promulgated…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…money. It is very clear.\n\nSo let me be clear. Money is not speech. I mean, who came up with  that? And corporations are not people.\n\nSo this moment isn't just about looking backward at a Court decision.  That is not what we are getting at. It is about deciding what kind of  Congress we want to be moving forward. Do we accept a system where  access is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…America's  ability to refine the energy we produce? Right now, unfortunately, the  answer is no, we are not.\n\nOver the last several years, America's refining capacity has gone  backward. We have lost more than a million barrels of capacity per day,  and several facilities have shut down altogether. The gentleman from  California mentioned one of them.\n\nIn…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…legislation  investing in that airspace to increase the safety and to make sure that  all who fly can be and are safe and feel safe.\n\nNow is not the time to take any steps backward, and that is what we  were worried and concerned about that the NDAA provision does.\n\nWhile Congress works to ensure in law the safety of our airspace, our  DOT and FAA leaders…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…responsibility, the new  majority, the new administration that has committed itself to actually  keeping the promises from the campaign trail in 2024. Instead of  bending over backward to help people who are breaking the law, they  want to look at it and say: How about those folks that were left  behind?\n\nThey were facing a constitutional crisis in the sense…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is the ACA. We are having the debate  because the Democrats actually did these enhanced subsidies on top of  the subsidies and those subsidies expire.\n\nLet me do this one backward, so there is a little more understanding  of the line.\n\nHow much of the healthcare population in America is actually in the  ACA? It is really important. Forty-eight percent…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…emissions below the major  source threshold, then they should reap the reward of more cost- effective and flexible requirements under the Clean Air Act, period.\n\nRepealing this backward rule is part of House Republicans' work to  unleash American energy and ensure that government red tape does not  stand in the way of creating jobs and growing our economy…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691588/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…happening in L.A., and the violence being perpetrated  against our law enforcement agents who are simply trying to uphold the  laws of the land.\n\nThat is how upside down and backward the Democratic Party has become.  You won't hear any of that. These people are risking their lives for  you and for me and our families and our communities to stop the flood…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "John Thune", "party": "Republican", "sentence": "…said at the time,  this bill joins other efforts to combat the fentanyl crisis that is  taking so many lives in our country.\n\nBut now Democrats seem to want to take a step backward in that fight.  They want to end the emergency that President Trump declared that  addresses the flow of fentanyl across the northern border from Canada.\n\nFentanyl moves in…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John James", "party": "Republican", "sentence": "…had access to public education. Today, millions succeed  because of IDEA.\n\nWith the IDEAL Act, we reaffirm our commitment. We finish the job. We  keep moving forward, not backward.\n\nI urge my colleagues to support the IDEAL Act.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Moscow's most useful idiots, has NATO's  existence and growth provoked Putin's aggression?\n\nLet's get a few things straight.\n\nFor decades, America and our allies bent over backward to welcome  Russian participation at NATO, including through the Partnership for  Peace program, and to integrate Russia into the global economy. America  sent billions of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]