[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Biden.\n\nInside the halls of the Capitol Building, the Capitol core team of  veteran JCCIC staffers Molly Stevens and Abby Stahl was joined by  Noreen Kassam and became the backbone of JCCIC execution on  Inauguration Day. They led multiple walkthroughs with principals and  senior staff and pivoted seamlessly when the ceremonies moved indoors.  Not only…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…business advocate and the entities  that the small business advocate will report on.\n\nSmall businesses, no matter where they are located or who they are  owned by, are the backbone of the American economy. Helping small  businesses should be about as nonpartisan as we can get here in  Congress. Lawmakers and regulators should be doing everything they…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…discretionary grant  funding for the agency. I am pleased to say that Congress exercised  its constitutional power of the purse and rejected cuts to an agency  that serves as the backbone of our Nation's response to the mental  health and addiction crises, which continue to take too many lives in  America.\n\nWe restored funding for homeless prevention programs,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Islands and  ensures our communities have access to healthy, locally sourced  seafood.\n\nThe impact is equally critical in American Samoa, where the tuna  industry forms the backbone of the territory's private sector and plays  an essential role in supporting families and sustaining the local  econony.\n\nPassing the South Pacific Tuna Treaty Act today will…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…structures in America. Most of NRCA's  members are small, privately held businesses that provide family- sustaining jobs for thousands of hardworking individuals who are the  backbone of our economy.\n\nProfessional roofing contractors provide vital services to their  communities, on and off the clock. NRCA members will recognize National  Roofing Week June…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…benefits. They  don't have the millions of dollars and the teams of consultants. They  get left behind despite their immense potential. For the small  businesses that form the backbone of our economy, navigating rapidly  challenging and changing tools like AI can be overwhelming.\n\nThis bill directs the National Institute of Standards and Technology  to establish…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700128/small-business-artificial-intelligence-advancement-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…don't think they realized or thought through  the effect of these policies on Main Street America.\n\nOver 45 percent of Americans are employed by small business. They are  the backbone of Main Street and our economy.\n\nThe administration and my colleagues on the other side have to think  through the consequences of this erratic behavior on Main Street  America.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691262/rising-costs-for-small-businesses"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican but one voted for the bill.\n\nMr. Speaker, here is the deal: Republicans are really good about  making statements and speeches, but that is about it. Yet, where is  their backbone? If my Republican colleagues believe some of the stuff  is bad, why didn't the majority vote against the bill?\n\nOne by one, my colleagues on the other side of the aisle caved.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…district that is home to Robins Air Force Base, Fort  Benning, and Marine Corps Logistics Base Albany. These installations  are more than just military sites. They are the backbone of communities  where servicemembers live, raise families, and eventually retire to  continue serving in civilian life.\n\nBecause of this, I have a deep and personal understanding…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…upgrades in foreign-controlled shipyards of adversaries,  we introduce unnecessary strategic risk. These ships support domestic  commerce, but they also arguably constitute the backbone of sealift  capacity that would be required during any military mobilization.  Second, the continued outsourcing of vessel modification and  construction undermines the U.S.…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…to rely on the Federal Government as partners in their effort  to produce the food that feeds our families, our neighbors, our Nation,  and the world.\n\nAgriculture is the backbone of Delaware's economy. From poultry farms  to vegetable growers to grain producers, Delaware farmers feed families  here at home and around the globe and contribute to an…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…at the heart of any future arms control effort,  and this is where America's scientific enterprise plays a critical  role. Our national laboratories provide the technical backbone for  verification, monitoring, and treaty compliance, and they are essential  to maintaining U.S. leadership in this area.\n\nAs co-chair of the Bipartisan National Labs Caucus,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…those who are sworn to serve and to their dedication to  public service to others.\n\nAs members of our community who have made great sacrifices, first  responders truly are the backbone of public safety. They are the heroes  and sheroes of our northwest Ohio community.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690783/national-fallen-firefighters-memorial-the-lyons-fire"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…into talent wherever we can  find it. Too often, small businesses are overlooked when it comes to  research and development opportunities.\n\nSmall businesses are not only the backbone of our economy, but they  also drive forward American innovation and ingenuity. The DOE and SBA  Research Act will help ensure that small business owners continue to  play…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…big beautiful budget bill.\n\nBecause of this law, many hospitals across Illinois and across the  country, especially in rural areas, may not survive. Rural hospitals  are the backbone of communities in my State and in many others. They  are the anchors of the local economy. Several hospitals that are barely  squeaking by today have told me they will fall…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…distant nations while throwing open our own borders to a  tidal wave of mass migration here at home. They shipped the good- paying, middle-class American jobs that once were the backbone of our  economy to places like Mexico and China, transforming once prosperous  towns and cities into hollow shells of their former selves, often  defined by addiction and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…historic firefighting artifacts, including those from local departments  and even pieces from the 9/11 Towers. It stands as a tribute to  volunteerism, which Dick regarded as the backbone of strong  communities. He often said, ``Communities cannot function without the  selfless sacrifices that volunteers contribute. We've got to encourage  more volunteers.''…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…and power that helped secure victory from tyranny and fascism. Walking  through the tunnels, it is impossible not to reflect on the generations  of workers who built this backbone of industry and defense.\n\nLike the town it belongs to, the World Museum of Mining has a long  and rich history. In 2024, the museum became the official home of the  Montana…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700162/recognizing-the-world-museum-of-mining-in-butte-montana-in-celebration-of-americas-250th"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…freedom  to grow, hire, and thrive.\n\nOver 70,000 small businesses stand to benefit. With our Rural  Advisory Council, I heard directly from Utah farmers and ranchers, the  backbone of our State. The bill raises the death tax exemption,  protects family farms, and strengthens food security for generations to  come.\n\nIn Fairview, I heard from rural Utahns…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and friends from California  and Washington, respectively, Representatives Cisneros and Gluesenkamp  Perez, for their support of this legislation.\n\nSmall businesses are the backbone of our economy. They are the  innovators, the job creators, and the driving force behind economic  growth.\n\nIn Minnesota, small businesses account for over 99 percent of all…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the Small  Business Artificial Intelligence Advancement Act, sponsored by my  colleagues, Representatives  Mike Collins and Haley Stevens.\n\nAmerican small businesses are the backbone of our economy, and it is  essential that they leverage cutting-edge innovations to keep the  United States at the forefront of the global economy.\n\nAs chairman of the Science,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…cattleman. He was raised on Stanfield Farms, which has been operated  for generations by the Stanfield family in southern Ohio.\n\nAmerica's cattlemen, farmers, and ranchers are the backbone of our  country. It is a great honor to advocate for them in Congress, and it  is my sincere hope that we can pass a full farm bill on their behalf.\n\nCurrently working with…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690854/recognizing-garrett-stanfield"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the Big First District of Kansas is home to  more than 20,000 small businesses who employ over 80 percent of working  adults in my district. These small businesses are the backbone of our  economy. Their stories, defined by sacrifice, hard work, and  determination, serve as a reminder of what the American Dream is all  about: that anyone, from anywhere,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Business Week, and I am recognizing the hard work  of our small business owners as something that we can all support from  both sides of the aisle. Small businesses are the backbone of our  economy, as I mentioned what it means to the State of Utah, and they  are critical to every local community across this country.\n\nIn this role, I am grateful to get…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…in strong support of H.R. 2965, the Small  Business Regulatory Reduction Act of 2025.\n\nFor 4 long years under the previous administration, America's small  businesses, the backbone of our economy and the heart of Missouri's  Fourth Congressional District, have been smothered by an onslaught of  overreaching Federal regulations that have made goods less…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and we won't touch Medicaid.\n\nOur budget contemplates Medicaid going up 25 percent. I am not going  to say whether that is good or bad, but can we at least just have the  backbone as the Republican Party to not allow our colleagues on the  other side of the aisle and the media to say that we are cutting  Medicaid when we are increasing Medicaid spending?…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…help guide public land management in a way that provides fuel, food,  and fiber for the Nation and conserves our natural resources.\n\nRMPs manage the resources that are the backbone of western rural  economies and support thousands of good-paying jobs. That is what makes  the Miles City Resource Management Plan amendment so egregious.\n\nThis RMP amendment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the entrepreneurs and innovators of our communities, the  farmers and ranchers, the sons and daughters carrying on the family  business. These hard-working Americans are the backbone of our economy  and a sign that the American dream is alive and working.\n\nSmall business is a big deal, and the Trump administration and  Republicans in Congress are working…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…collaboration, we  maximize our investments to maintain our competitive edge.\n\nDOE is our Nation's largest supporter of basic research in physical  sciences, while NSF is the backbone of the collaborative research  environment between government and academia. Together, these agencies  can fuel innovation across multiple disciplines, including physics,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…Review Acts against  the disastrous Biden-era electric vehicle mandates.\n\nThese create undue, burdensome rules, which impact our rural  communities. Rural communities are the backbone of our country. They  are the farmers, ranchers, teachers, and parents, and they are being  crushed by the costly and out-of-touch policies from Washington.\n\nThere is no doubt…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]