[{"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…important work  because rural small businesses are the beating hearts of communities  across America, and in every corner of my home State of New Hampshire.  They are the backbone of our economy.\n\nAs I have worked alongside and as I have listened to and learned from  rural small businesses across New Hampshire, from the family farmers of  our north country…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697281/office-of-rural-affairs-enhancement-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…advocate and the entities  that the small business advocate will report on.\n\nSmall businesses, no matter where they are located or who they are  owned by, are the backbone of the American economy. Helping small  businesses should be about as nonpartisan as we can get here in  Congress. Lawmakers and regulators should be doing everything they can  to support…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…They  don't have the millions of dollars and the teams of consultants. They  get left behind despite their immense potential. For the small  businesses that form the backbone of our economy, navigating rapidly  challenging and changing tools like AI can be overwhelming.\n\nThis bill directs the National Institute of Standards and Technology  to establish…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700128/small-business-artificial-intelligence-advancement-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…mediocre,  less than average, and need extra help because you can't compete?\n\nWell, don't come for Black America. Fix yourself.\n\nLet's talk about the workers who are the backbone of our economy, the  workers who run this government. I am always surprised when folks are  talking about unelected bureaucrats. Elon Musk is an unelected  bureaucrat. Keep it real.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…President George W. Bush enacted a series  of tax bills. I certainly believe that a good tax bill is one that  provides relief to middle-class families, which are the backbone of our  economy, and ensures that everyone pays their fair share.\n\nBut the tax cuts passed during the Bush era did just the opposite,  largely benefiting the highest income earners…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…because they are just going to be  branding themselves, as opposed to providing the healthcare for all  these hard-working families across our country.\n\nAnd when the backbone of our economy, small businesses, can no longer  afford their premiums, they will make tough decisions about hiring,  about growing, or even closing their doors for good--turning,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…innovation,  entrepreneurs, and the folks in our communities who employ our  neighbors and drive success and investment in their community. Small  businesses are the backbone of our economy, and Delaware is the State  of small businesses.\n\nMr. Speaker, I am grateful for Sayers Jewelers and congratulate them  on their continued success. I thank them for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…talent wherever we can  find it. Too often, small businesses are overlooked when it comes to  research and development opportunities.\n\nSmall businesses are not only the backbone of our economy, but they  also drive forward American innovation and ingenuity. The DOE and SBA  Research Act will help ensure that small business owners continue to  play a central…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…created jobs for other people.\n\nRepublicans love to say they support our economy. It is time to  actually support the healthcare of small business owners, who are the  backbone of our economy. Republicans also love to say the best option  for healthcare is a job.\n\nMy constituents have a job. They also provide jobs for more people,  but they all receive…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…ensure that  small businesses who need and deserve support get it, while cutting out  fraudsters seeking to exploit vital relief programs.\n\nSmall businesses are the backbone of our economy. They create jobs,  they foster innovation, and they drive our local communities forward.  They should be who we lift up and support, and they rightly are the  beneficiaries…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…in America. Most of NRCA's  members are small, privately held businesses that provide family- sustaining jobs for thousands of hardworking individuals who are the  backbone of our economy.\n\nProfessional roofing contractors provide vital services to their  communities, on and off the clock. NRCA members will recognize National  Roofing Week June 1-7,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…water nourishing  the first families. As Leeds developed, so did agriculture and small- scale manufacturing that proved to be not only self-sufficient but also  the backbone of its economy. By the mid-19th century, improved roads  connected Leeds to other surrounding communities that made it a center  for agriculture and, eventually, recreation. Today,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "Mr. WITTMAN. Madam Speaker, I rise today to highlight the importance  of critical minerals. They are the backbone of our economy, but the  U.S. has ceded supply chain dominance to China, our primary adversary.\n\nIn recent decades, China has overtaken the United States and our  allies in production,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Week, and I am recognizing the hard work  of our small business owners as something that we can all support from  both sides of the aisle. Small businesses are the backbone of our  economy, as I mentioned what it means to the State of Utah, and they  are critical to every local community across this country.\n\nIn this role, I am grateful to get to know…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…friends from California  and Washington, respectively, Representatives Cisneros and Gluesenkamp  Perez, for their support of this legislation.\n\nSmall businesses are the backbone of our economy. They are the  innovators, the job creators, and the driving force behind economic  growth.\n\nIn Minnesota, small businesses account for over 99 percent of all  businesses…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…farmers and ranchers and added she will be  going on six trade trips internationally over the next 6 months.\n\nFor Iowans, agriculture isn't just a way of life. It is the backbone  of our economy, and I am deeply committed to supporting Iowa's  hardworking farmers and producers.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…nations while throwing open our own borders to a  tidal wave of mass migration here at home. They shipped the good- paying, middle-class American jobs that once were the backbone of our  economy to places like Mexico and China, transforming once prosperous  towns and cities into hollow shells of their former selves, often  defined by addiction and death. All…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Business Artificial Intelligence Advancement Act, sponsored by my  colleagues, Representatives  Mike Collins and Haley Stevens.\n\nAmerican small businesses are the backbone of our economy, and it is  essential that they leverage cutting-edge innovations to keep the  United States at the forefront of the global economy.\n\nAs chairman of the Science, Space,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…First District of Kansas is home to  more than 20,000 small businesses who employ over 80 percent of working  adults in my district. These small businesses are the backbone of our  economy. Their stories, defined by sacrifice, hard work, and  determination, serve as a reminder of what the American Dream is all  about: that anyone, from anywhere, can…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "John Thune", "party": "Republican", "sentence": "…entrepreneurs and innovators of our communities, the  farmers and ranchers, the sons and daughters carrying on the family  business. These hard-working Americans are the backbone of our economy  and a sign that the American dream is alive and working.\n\nSmall business is a big deal, and the Trump administration and  Republicans in Congress are working hard…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…road, weathering the  impacts of COVID, high inflation, and burdensome regulations that have  made it harder to grow and compete. Yet, they continue to serve as the  backbone of our economy, driving innovation, creating jobs, and keeping  the American Dream alive.\n\nAccording to the Small Business Administration, firms with fewer than  500 employees account…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…on the global stage.\n\nMy home and my district of southern New Jersey represents--as so much  of the United States of America--a small business community that is the  backbone of our economy; driving innovation, creating jobs, and  strengthening communities.\n\nIn today's world, small businesses face competition not just from  their neighbors and other States,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…clothing, and  fueling our Nation.\n\nAccess to agricultural education is critical not only for our rural  communities but for the entire country.\n\nAgriculture is the backbone of our economy. As I often say, food  security is national security, and investing in the next generation of  producers ensures that there is food on our tables, clothes on our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…strong support of H.R. 2965, the Small  Business Regulatory Reduction Act of 2025.\n\nFor 4 long years under the previous administration, America's small  businesses, the backbone of our economy and the heart of Missouri's  Fourth Congressional District, have been smothered by an onslaught of  overreaching Federal regulations that have made goods less affordable…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}]