[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize South Metro  Fire Department Chief Bob Baker for his leadership and service over the  past 40 years.\n\nBob Baker has served with South Metro Fire Rescue as the Chief for  the last ten years. Last summer, when the Quarry…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…particularly offensive that  Republicans are seeking to ban this flag at DOD, given that one of the  earliest Pride flags was created by a former U.S. military officer,  Gilbert Baker.\n\nMr. Chairman, I believe the American people are fair and they support  inclusion. I think they view amendments like this one, dictating to  Federal employees and troops what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…person in this country, if you hear my voice. I have no greater right  to vote than any other person in this country, and neither does the  President. One person, one vote, Baker v. Carr. We have a duty and  responsibility and obligation to vote.\n\nToday, I am encouraging people to vote. Vote, vote, participate.  However, I have a very, very special…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…have seen Canadian  visitation drop. All States in the country have seen Canadian  visitation drop.\n\nThere are so many other stories that I hear out on the road. I was  with a baker in Virginia who has three pie shops--Mom's Apple Pie. We  were talking about this back in the spring after the tariffs had been  announced but before they had really bit.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Booker, and again  as a teenager when she started her journey with God. As an adult, she  shared her vision of becoming a Minister with her mother, Mrs. Sallie  Mae Sanders Baker, and other Pastors at Ebenezer, Reverend Lloyd  Roberts, Reverend Duane Kay, Reverend James Buck, and Reverend W.  Pierce Smith.\n\nFor over 60 years, Reverend Carr has been…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…was 9-5, set back, poker, Yahtzee, Uno, duckpin,       or Wii bowling. Nobody was going to stand in her way.\n\nMy grandmother was a prolific cook but was truly an iconic       baker. Pies: apple, blueberry, chocolate cream, banana cream,       lemon meringue, pineapple squares, Irish soda bread, cinnamon       tarts, red sauce (pretty good for an Irish…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, I rise today to recognize Jasmine Baker,  winner of a 2024 James Madison Fellowship from the James Madison  Memorial Fellowship Foundation. This fellowship is awarded to educators  who demonstrate an outstanding…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689665/recognizing-jasmine-baker"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. LARSEN of Washington. Mr. Speaker, I rise today to congratulate  Linda McCarthy on her retirement from Mt. Baker Planned Parenthood and  thank her for her many decades of service and dedication to the people  of Northwest Washington.\n\nSince 1977, Linda McCarthy has been an advocate for…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689685/recognizing-linda-mccarthy"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…celebration. We  congratulate the following team players: Cam Pacheco, senior guard  named Player of the Year; Tyler Sprague, named first-team Class 3A all- State; Landon Davis; Rylan Baker; Reese Fisher; Will Parlee; Tsenat  Tesfay; Cayden Price; Camden Langridge; Colin Regan; and Brennyn  Stobbs.\n\nWe congratulate the Spotswood Trailblazers on this historic win.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…Americans of all political persuasions have supported tighter  election laws for decades. In 2005, former President Jimmy Carter, a  Democrat, joined former Secretary of State Jim Baker, a Republican, to  form a Commission on election integrity. They identified voter ID laws  as the single most important reform that was needed--20 years ago.\n\nA vast majority…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  retirement of William John ``Bill'' Baker, mayor of the City of  Piedmont, Alabama.\n\nBill was born in Far Rockaway, New York, to Edna McCracken Baker and  Fred Stephenson Baker on October 27, 1949. He was awarded the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693645/recognizing-the-retirement-of-mayor-bill-baker"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Tommy Baker has made through his work with NAMI  Hernando. Tommy works as the Operations Manager of Meares Plumbing and  Electrical and former Board President of NAMI Hernando. He has…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Myers.\n\nVeterans of the Cold War: Marvin Clark and Charles Portz.\n\nVeterans of the Vietnam War: Leron Allred, Albert Amen, Walter  Anderson, Sammy Archer, John Babich, Clifford Baker, Virgil Barnhart,  Weslie Bater, Selby Batty, Richard Block, Louis Branch, Jr., Miles  Brekke, C. Brown, Charles Brown, John Bunning, Jens Burnett, Bruce  Carlson, Daniel Carson,…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…comes from the State of Hockey. There were 12  Minnesotans. There was Duluth hometown hero Phil Verchota. There was  Mark Pavelich, John Harrington, Buzz Schneider, and Bill Baker. The  list goes on and on from our great State of Minnesota.\n\nElise Stefanik said: Pete, you have made a great statement. Carry  that bill.\n\nRepresentative Stefanik has no…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…February       22, 1980, in the final round of the 1980 Winter Olympics       men's hockey tournament.\n\n(3) The 1980 USA Olympic men's hockey team roster       included--\n\n(A) Bill Baker (Grand Rapids, MN);\n\n(B) Neal Broten (Roseau, MN);\n\n(C) Dave Christian (Warroad, MN);\n\n(D) Steve Christoff (Richfield, MN);\n\n(E) Jim Craig (North Easton, MA);\n\n(F) Mike Eruzione…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Firefighter Aaron Wright of the Bradenton Fire Department,       Firefighter Jacob Dillard (2), Lieutenant Daniel Dunkum (2),       Battalion Chief Craig Madsen, Captain Steven Baker, Engineer       Ben Stasurak, Engineer Bret Kanapaux, Firefighter Chad       Strauser (2), Firefighter Maciej Borawski, Deputy Chief Paul       Wren, Battalion Chief Casey…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Alexandra: NBC NEWS; Baggini,       Abigail: CNN; Baharaeen, Renee: CNN; Baier, William: FOX       NEWS; Bailey, Jesse: HEARST TELEVISION INC; Bailey, Matthew:       SKY NEWS ARABIA; Baker, Leslie: FOX NEWS; Baker, Sarah: NBC       NEWS; Baktar, Reza: CNN; Baldwin, Daniel: ONE AMERICA;       Baldwin, Eric: EWTN; Baldwin, Lorna: PBS NewsHour; Balick,       Sarah:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize Junior  R. ``Skip'' Baker for an incredible 70 years of service to the Genesee  Township Volunteer Fire Department.\n\nIn 1955, Skip joined the Genesee Township Volunteer Fire Department  and has been…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690559/recognizing-junior-r-skip-baker"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Ashworth, Jerry: Thompson       Information Services; Atwood, John: CCH Inc.; Babbage, Sarah:       Bloomberg Industry Group; Bacus, Aaron: Townhall; Bade,       Rachael: Politico; Baker, Rebecca: Bloomberg Industry Group;       Baksh, Mariam: Inside Washington Publishers; Ballard Brown,       Tanya: Government Executive; Banerji, Olina: Education Week;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…has broader implications than just the Department of  Defense.\n\nThis turf war is, frankly, as old as the Defense Production Act, back  to 1950. When Chief of Staff James A. Baker, III, was navigating this,  he highlighted that tension. Since then, all kinds of things have taken  place with the Defense Production Act. This year is the first  opportunity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695242/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Mr. Speaker, I point out that in 2005, 18 of the 21  members of a bipartisan Federal commission headed by former President  Jimmy Carter and former Secretary of State James Baker came out in  support of photo ID requirements more stringent than what Indiana had  at that time. ``Voters in nearly 100 democracies use a photo  identification card without…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…is our way of  life. What this 1980 Olympic team did is unimaginable for the sport of  hockey.\n\nThose Minnesotans from my district were Buzz Schneider, Mark  Pavelich, Bill Baker, Phil Verchota, and John Harrington. Look at the  small towns where they came from: Grand Rapids, Eveleth, Babbitt,  Virginia, and Duluth. These players grew up loving the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…today to honor a man whose lifetime  of service and dedication to Cass City has left an indelible mark on  our community. It is with great admiration that I recognize James E.  Baker, II, as the 2025 Cass City Citizen of the Year.\n\nBorn and raised in Cass City, Jim Baker has lived a life defined by  generosity, leadership, and an unwavering commitment to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}]