[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…students face many       roadblocks, they can thrive when their educational       institutions listen to them, support them, and prevent       discrimination against them, While balancing their health,       caregiving responsibilities, and educational goals is       challenging, these added responsibilities often renew       students' dedication to their…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…opposition to these dangerous and  unprecedented resolutions. A resource management plan is not some  obscure rule. It is the playbook for how we manage America's public  lands: balancing energy, grazing, and recreation with protecting clean  water, wildlife, and the long-term health of the land.\n\nThe three plans under attack today took years to develop. They…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694910/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…KAPTUR. Mr. Speaker, the United States has not had a trade  surplus in over half a century. Trade deficits translate into lost jobs  and lost wealth for the American people. Balancing U.S. trade accounts  is an imperative and a worthy objective, but Trump administration  tariffs on the American people's purchases are taxes that cost them  more money on…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…going to back down. We stand with the  people from across the country who have reached out, inspired to see  somebody like them who is struggling to manage having a new baby,  balancing work, and having a work environment that does not support  their needs.\n\nOnce again, I thank Representative Luna for being a champion, as well  as Representatives Jacobs…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…responsible, sustainable management of our public lands.  RMPs are the product of extensive public input, rigorous scientific  reviews, and meaningful Tribal consultation. Balancing the activities  on our public lands from energy development to recreation is what these  plans do.\n\nThey reflect the needs of communities, industries, and ecosystems.  They…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…events.  This funding could be used to stand up cooling centers, purchase  medical equipment for heat illnesses, or many other critical services.\n\nFor families worried about balancing high-energy costs with high  grocery bills, I have been working to introduce the LIHEAP Parity Act.  The bill will fairly and fully distribute LIHEAP dollars to families…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Republicans in our  State should be embarrassed of.\n\nNow, Trump and Republicans want to make it worse. It is cruel, it is  reckless, and it is dead wrong.\n\nThis isn't about balancing a budget; it is about priorities. Donald  Trump's priorities are tax breaks for his buddies while working  families are told to tighten their belts. We should be expanding…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…entire life fighting against--we know that it is just not  true.\n\nDon't forget, they just passed a bill that is going to add $3  trillion to the deficit. They don't care about balancing the budget or  limiting waste. They want to cut services that American families depend  on so they can afford a bigger tax cut for the wealthiest Americans.\n\nIn addition…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…is important to understand. I mean, Donald Trump is in  office as the most powerful human on planet Earth as the President of  the United States. Rather than thinking about balancing the budget,  addressing economic free-fall, trying to figure out what to do with our  foreign adversaries, how to help the American people, engaging in the  debate on how…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…rule, and the old leasing program  did have serious legal deficiencies.\n\nContrast that with the existing record of decision, which followed  science, law, and public input and balancing environmental protections  and resource extraction in the Arctic National Wildlife Refuge.\n\nSo I hope we won't make an irrevocable, irredeemable mistake in the  Senate today…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to reintroduce the ``Balancing  Incentives Act'' of 2025, Bipartisan legislation to restore fairness  and integrity to America's patent system.\n\nInnovation is the beating heart of American progress. From…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696400/reintroduction-of-the-balancing-incentives-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…services, it would because the cost       of the cut would have to somehow be absorbed by State       budgets. That type of hole cannot be filled in via       more efficiency. Balancing the 10-year program budget cycle       on the back of the Medicaid program is not a good tradeoff       for the American people.\n\nAlan Morgan, who is the CEO of the National…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…new companies to access capital with less red tape while still  ensuring their investors have critical disclosures.\n\nThis bill ensures that EGCs are treated consistently by balancing the  need for financial transparency while also ensuring burdensome  regulations are not so high that it stifles innovation and hinders  growth.\n\nI thank Mr. Haridopolos…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693856/greenlighting-growth-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…spending, and my friends don't get to  have it both ways.\n\nInstead, it is a thoughtful process of House Members and Senators  talking to their communities about their needs, balancing those  priorities, advocating for inclusion in these bills, and delivering for  their constituents in a clear, transparent way.\n\nThese community projects have been posted…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…considerable time and resources into  making their submission the best it can be. They are also forced to  navigate a complex and time-consuming contracting process while  balancing their other important responsibilities.\n\nLast year, the Small Business Committee heard testimony from a small  business owner who said that solicitation proposals can cost…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…time attacking Moody's for downgrading us and telling the truth. The  problem is, if you actually read their document, it is the truth.\n\nFor everyone out there who thinks balancing the budget and doing  those things is simple, if you actually listen to folks from the last  administration, this administration, the fantasy goal is to get to 3  percent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…development and to strengthen U.S. critical       mineral supply chains vital for energy, defense, and advanced       technologies.\n\nThe challenge for the Trump administration is balancing       AGOA, which is a unilateral trade preference program, with       its strong preference for more bilaterally beneficial       economic statecraft instruments.\n\nQ5: What…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…everyday needs of its residents and visitors alike.\n\nUnder his leadership, New Hope continued to strengthen its position  as one of Bucks County's most recognizable destinations, balancing  tourism with quality of life for those who call the borough home. Mayor  Keller's service exemplified integrity, approachability, and a deep  respect for local government's…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Opelika Engineering Department  (1990 to 2000) after previous employment with the Augusta Environmental  Company (1981 to 1989) and Diversified Products (1976 to 1980), while  balancing his long and honorable military service in U.S. Army (1970 to  1971) and Army Reserve (1971 to 2000). He is supported by his loving  wife, BBB4 Wilbert D. Payne, Jr., and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Medicare.\n\nTo my friends on this side of the aisle: When are we going to get  serious about spending?\n\nThe House budget actually does a job of trying to get to budget  neutrality, balancing tax policy and spending policy. The Senate sent  over a joke, and we are going to capitulate to the Senate, knowing full  well that the Senate instructions carry the day.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689906/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…opportunities for the communities and people impacted  by those policies.\n\nAlaskans are some of the foremost conservationists in the world, with  a long-standing record of balancing conservation with responsible  resource and infrastructure development. On top of the jobs provided to  Alaskan residents, responsible resource development funds various…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…accordance with this subsection.'';\n\n(5) in section 4(e), by adding at the end the following:\n\n``(3) In the case of the sale of mineral materials       resulting from grading, land balancing, or other activities       on the surface of a parcel within the Apex Site for which the       United States retains and interest in the minerals--\n\n``(A) it shall be considered…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…From modest terraces to expansive  poolside retreats and vegetable gardens, Bucks Country Gardens has  helped countless homeowners turn their dreams into reality--always  balancing creativity, functionality, and responsibility.\n\nMr. Hebel, a proud graduate of Penn State University's Landscape  Architecture program, has long emphasized that landscaping…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…including the fish community objectives and fish       management plans described in the Joint Strategic Plan for       Management of Great Lakes Fisheries;\n\n(3) to assist in balancing predators and prey;\n\n(4) to support and improve the economic status of Tribal,       recreational, and commercial fisheries; and\n\n(5) to assist in evaluating the effectiveness…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…we are $37 trillion in debt as a  nation?\n\nIt is because too often my Republican colleagues have never met a tax  cut they didn't want to advance while then campaigning on balancing the  budget and cutting spending that they never want to vote for.\n\nWe can't do that.\n\nWe have to actually lead. In a Republican form of government there  are 435 of us representing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…promulgated during the first Trump  administration.\n\nI have long said that Alaskans are some of the foremost  conservationists in the world, with a long-standing record of balancing  conservation with responsible resource and infrastructure development.  Our oil fields on Alaska's North Slope offer a world-class example of  what it means to responsibly…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "French Hill", "party": "Republican", "sentence": "…arts degrees at the University of Arkansas Community  College at Morrilton in 2014 at age 33. She continued her education,  earning seven more degrees after leaving UACCM, balancing her time  between her studies and raising her 10 children. In 2025, she passed  the State board exam for the credential of family nurse practitioner.\n\nDr. Jackson's story…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…preservation  area.\n\nMr. Speaker, the people of Utah deserve better. They deserve a  government that listens, that respects their traditions, and  understands the importance of balancing conservation with access.\n\nGlen Canyon National Recreation Area is very popular, as my colleague  across the aisle pointed out. The Orange Cliffs area is not well  traveled.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Treasury versus how much you are spending  because my Republican colleagues love to spend.\n\nThey campaign on tax cuts. They deliver on most of the tax cuts. They  campaigned on balancing the budget and cutting spending, and never do  it, ever, in the history of ever, with the possible exception of the  late 1990s when the Gingrich Republicans, combined with…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]