[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…those who have laid their  lives on the line for all of us.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  intend to vote ``yes.'' I yield back the balance of my time.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…presented to  the committee.\n\nMr. Speaker, I ask all my colleagues to join me in passing H.R. 2334,  the Servicemember Residence Protection Act, as amended, and I yield  back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695470/servicemember-residence-protection-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…doesn't improve consumer choices. The only thing it does is create  chaos and confusion, from what I can see.\n\nFor all these reasons, I oppose the resolution, and I reserve the  balance of my time, Mr. Speaker.\n\nI just want to clarify some of the comments that we are hearing today  from the other side. My colleagues across the aisle said at one point  it…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Goodlander for their bipartisan work on this bill.\n\nMs. VELAZQUEZ.  Goodlander).\n\nMs. VELAZQUEZ. Mr. Speaker, I urge my colleagues to vote ``yes'' on  H.R. 832, and I yield back the balance of my time.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687954/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Earth. Nearly 25 percent of the ocean's fish rely on coral reefs for  shelter, food and breeding grounds. These reefs and  the species that inhabit them are critical to the balance and vitality  of our oceans.\n\nUnfortunately, coral reefs and the marine life living in them are  under threat due to the high demand for ornamental reef species. This  has…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…or wealth  requirements. It also  reconfirms Congress' mandate to the SEC that it must adjust the wealth  and income thresholds to account for inflation. This is the right  balance.\n\nI look forward to passing this bill, and I look forward to our  subcommittee and the full committee making other changes in the  definition of ``accredited investor.''…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…floor--my head goes,  first, to the financial corruption of the President, but there are  always other forms of corruption he has engaged in, in terms of  corrupting the basic balance of the separation of powers and the checks  and balances. But let me speak, first, to the financial corruption.\n\nOne thing that we have seen is that he is using the Presidency…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…producers deliver healthy  and affordable protein for American families.\n\nMs. RANDALL. Mr. Speaker, I urge my colleagues to support this  legislation, and I yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697640/cormorant-relief-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…having  this done to him. Surely he would want to do unto others as he would  want done unto him.\n\nMr. Chair, I urge strenuously the defeat of this amendment, and I  reserve the balance of my time.\n\nMr. HOYER. Mr. Chairman, I yield myself 1 minute.\n\nMr. Chairman, the gentleman has raised a point. He has carefully  drafted this amendment.\n\nMr. Chairman, his…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Downing, Mr. Pappas, and Mr. Bean for  their work on this bill.\n\nMs. VELAZQUEZ.  Morrison).\n\nMs. VELAZQUEZ. Mr. Speaker, I urge Members to support this bill, and  I yield back the balance of my time.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687927/rural-small-business-resilience-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…congratulate him on continuing to move this bill forward in an open  and objective manner.\n\nMr. Speaker, I ask my colleagues to vote ``yes'' on this bill, and I  reserve the balance of my time.\n\nMrs. DINGELL. Mr. Speaker, I urge my colleagues to support this  legislation, and I yield back the balance of my time.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694031/wabeno-economic-development-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…conversation that is still up for  debate, and one I look forward to continuing to work through with our  Senate counterparts.\n\nMr. Speaker, I support the bill, and I reserve the balance of my  time.\n\nMr. CISNEROS. Mr. Speaker, I will close by thanking the chairman for  his commitment to working on behalf of small businesses to open up  avenues of financing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…ground, famously       seized by the Nobel laureate scientist George Wald in a       widely reprinted 1969 anti-war speech at MIT. ``Nuclear       weapons offer us nothing but a balance of terror, and a       balance of terror is still terror,'' he said. ``We have to       get rid of those atomic weapons, here and everywhere. We       cannot live with them.''…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that banks fail to service roughly six percent of the       population. The FedAccount would be available to those whom       banks have failed to serve regardless of their balance. They       would be streamlined to provide access with immediate payment       clearing. There would be no fees charged. With such an       account, delivery of federal payments…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…food aid.\n\nThis so-called pause on lifesaving food aid is unnecessary and  unconscionable.\n\n``Anybody who tells you that we can slash foreign aid and that will  bring us to balance is lying to you.'' Foreign aid is less than 1  percent of our budget. That is a quote from Marco Rubio before he  worked for Donald Trump. This is not how we solve our budget…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692117/lifesaving-foreign-aid"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…of the aisle to save lives and support this amendment.\n\nMr. BRESNAHAN. Mr. Chair, in closing, I urge my colleagues to vote  ``yes'' on this amendment, and I yield back the balance of my time.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691881/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…504 loan program, a key program that promotes job creation  and small business growth.\n\nMadam Speaker, I urge my colleagues to support this legislation, and  I yield back the balance of my time.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…the committee earlier this year.\n\nMr. GARBARINO. Madam Speaker, I have no more speakers and am prepared  to close after the gentleman from Puerto Rico closes. I reserve the  balance of my time.\n\nMr. GARBARINO. Madam Speaker, I yield myself the balance of my time.\n\nI congratulate my colleague (Mr. Swalwell) on this bill. I am happy  to support it. I am…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696791/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Director, Congressional Budget Office.\n\nMr. HILL of Arkansas. Mr. Speaker, I urge a ``yes'' vote on this very  practical bill, and I yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Congresses, and I look forward to working with the Senate to  see it finally cross the finish line.\n\nMr. Speaker, I urge all of my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. BABIN.\n\nMr. BABIN. Mr. Speaker, I have no further requests for time, and I am  prepared to close.\n\nMr. BABIN. Mr. Speaker, as I said previously, commercial…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Nation's veterans.\n\nMr. CARTER of Texas. Mr. Chair, I yield 2 minutes to the gentleman  from North Carolina (Mr. Murphy).\n\nMs. WASSERMAN SCHULTZ. Mr. Chair, I yield myself the balance of my  time.\n\nMr. Chair, I want to add some further information because the  Veterans Crisis Line was referenced by the gentleman from Missouri.\n\nI want to make it very clear…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…communities. It is locally driven, not federally mandated.\n\nMr. Chair, I urge my colleagues on both sides of the aisle to support  H.R. 3898 and my amendment, and I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…stand with families  in defending the integrity of American education from foreign tyranny.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  yield back the balance of my time.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…farms in this, but it is only targeted at oil and gas.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time. I am  prepared to close, and I continue to reserve the balance of my time.\n\nI urge my colleagues to vote in favor of S.J. Res. 11. I thank my  colleagues across the aisle for actually making our point on why this  regulation that was…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…What comes next? What comes next? Are we to be at  risk of arrest if we threaten to ask a question or deign to interrupt?  Is our very service here as Senators hanging in the balance in this  moment? As we all learn more of the facts of what happened in Los  Angeles, the future of what will happen here in our country and in the  world will wait on your…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…empowers ranchers to expand  grazing, manage habitat, control wildfires, and meet market needs.\n\nMr. Chair, I urge my colleagues to adopt this amendment, and I  reserve the balance of my time.\n\nMr. BIGGS of Arizona. Mr. Chair, what I would suggest is that folks  come out West and take a look at the land. Take a look at land that has  been determined…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…wherever they might be, political correctness be damned. Americans are  better off under this approach.\n\nMs. FOXX. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, this majority continues to roll up its sleeves and  advance the core priorities of the American people and President Trump.  We are absolutely exercising…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…I thank Representatives Collins and Stevens for their  work on this very important legislation.\n\nMr. Speaker, I urge my colleagues to support H.R. 3679, and I reserve  the balance of my time.\n\nMr. BABIN. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, the time to use artificial intelligence in business is  now,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…16 SBLCs can and will be overseen effectively under  Administrator Loeffler's leadership.\n\nMr. Speaker, I urge all of my colleagues to support this bill, and I  reserve the balance of my time.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692069/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…urge my colleagues to vote for this amendment. It would defund an  unconstitutional and unworkable mandate that has already missed the  deadlines.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. MASSIE. Mr. Chair, I demand a recorded vote.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}]