[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…right to do anything I want to do. I am the President  of the United States.\n\nHe said it and laid it on the table in plain sight for all of us to  see. He wants no checks, no balances, not from the courts, not from  Congress, and not from the voters.\n\nIt is time to wake up, America, before it is too late.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…colleague, Representative Lizzie Fletcher (TX-08), to  reaffirm the principles of the Constitution of the United States of  America, including the separation of powers, checks and balances, the  independence of the judiciary, and the power of Congress to control  spending, declare war, and conduct oversight. This resolution also  reaffirms the key individual…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694144/introduction-of-a-resolution-reaffirming-the-principles-of-the-constitution-of-the-united-states"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…international community know what awaits them if progress  is not made or promises are not kept.\n\nRepealing the sunset provision of the ISA is also an issue of checks  and balances. Losing congressional authority  of this critical sanctions infrastructure would effectively cede more  authority to the executive branch, which has already proven to be more…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…when they set out some 237 years ago to write the United  States Constitution, that no one body would become so powerful that it  could do as it pleases without any checks or balances.\n\nLet me be clear, Mr. Speaker. This is not about partisan politics. It  is about the preservation of our Republic.\n\nWhen an administration past, present, or future believes…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692931/holding-power-accountable"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…weakened as the Congress itself has delegated so many of our  responsibilities to the Chief Executive. It is a terrible development  in our democracy where the checks and balances that were essential to  the well-being of our country, with the tug-of-war that goes on in  every generation about what is the right policy; the tug-of-war that  goes on in…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Appropriations Committee.\n\nI have a question for you about how critical a functioning Congress  and a functioning appropriations process is to our separation of  powers, our checks and balances, and, therefore, to our very democracy.\n\nThe Federal Government is currently shut down because Republicans who  control the House, the Senate, and the White House are hell-bent…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…need  to provide 2 years of audited financial statements across the board.\n\nLike other bills that Democrats and Republicans have come to  bipartisan agreement on, this bill balances the concern of those trying  to raise capital while also maintaining disclosures and financial  transparency that benefit and protect investors and thereby protect our  capital…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…population and 80% of the people released       through the Pretrial Services Agency are Black, due to       systemic overpolicing. Abolishing D.C.'s pre-trial system       which balances risk and safety and on an individualized       basis, and replacing it with a cash bail system which favors       release for wealthy defendants and imprisons those who cannot…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…supply and demand. Less power equals higher prices. And the  consequences of these policies are already taking effect.\n\nAccording to the Century Foundation, past-due utility balances have  jumped 10 percent this year. They are 10 percent more than they were  the year before. People can't afford to pay these utility bills.\n\nJust like SNAP cuts, Trump's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…now a crumbling illusion.\n\nOur country was created on the principle that it would not be ruled  by an all-powerful king but instead maintained by a system of checks  and balances to prevent tyrannical rule and provide power to the  people.\n\nBut now, Donald Trump is ceding power to an unelected billionaire at  home and appeasing a Russian dictator abroad.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the  Constitution, and I think that some of my colleagues on the other side  took an oath saying that they believe in it, too. We believe in our  democracy and checks and balances and accountability. We believe that  undermining our laws and processes make all of us less safe.\n\nWe continue to demand that this administration allow us to exercise  our…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…reasons why. One, the resource management plan  that was adopted replaced a plan that was nearly 40 years old. This  resource management plan provided a modern framework that balances  responsible energy and mineral development with the protection of  wildlife habitat, water resources, cultural sites, and recreational  opportunities. It provides a stable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…these illegal actions is a lasting threat  to the American people, to our global leadership, our national  security, our reputation around the world, and to the checks and  balances that are the foundation of our democracy.\n\nVermonters are outraged by what is happening. Dozens have already  lost their jobs. They want the United States to be a leader for…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…said ``many mortifying examples of the prevalency of foreign corruption  in republican governments.''\n\nSo here were our Founders, putting together this series of checks and  balances, separation of powers between a judiciary, an executive, and a  legislative branch, but they knew it could all be corrupted if you had  an Executive--that is, a President--who…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…tariffs that have increased prices and inflation and have  tanked the economy, President Trump's first 100 days have also  escalated this relentless assault on the checks and balances that have  been the foundation of our great Nation.\n\nOn day one, he pardoned more than 1,500 criminals who stormed this  very building on January 6. Hundreds of them were…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…My amendment says: Stop. No more welfare for refugees until there is  a nationwide investigation of the level of this fraud. No more welfare  for refugees until Congress balances the budget.\n\nAmerica can't be the world's sugar daddy when we can't even afford  welfare for our own citizens.\n\nMany refugees are good people--frankly, some of the best Americans…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699441/consolidated-appropriations-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…injunctions are a backdoor way for judges to actually  write legislation and to bring the decision of the executive branch to  a halt.\n\nThe executive branch does have checks and balances, as does the  legislative branch, as does the judicial branch. Those checks and  balances are clear. If the executive branch does something inconsistent  with the Constitution,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Odessa but also across America.\n\nThis Congressional Review Act is a tool that Congress uses to  overturn Federal agency actions, a direct example of congressional  checks and balances on the executive branch and one of Congress' most  important duties.\n\nMy CRA will not eliminate the program that collects this tax, but it  will remove the EPA's ability to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…challenges into an opportunity  for personal and academic growth.\n\nMara Johnson Anthony is a high-achieving high school student who  maintains a 4.0 GPA with AP courses. She balances academic rigor with  leadership in volleyball, the art club, and the Girls Inc. Eureka!  program.\n\nHer extensive history of community service includes the Open Door  Mission…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, I rise today to introduce a budget that  balances over 5 years. My budget, the Six Penny Plan, the Six Penny  Plan budget, cuts 6 percent of all spending to rebalance in just 5  years.\n\nI am able to introduce this budget…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…moving forward and allowing the American  people to stand up. Let's just look at it candidly: When you are  standing up exclusively for judges, you are not having a checks-and- balances system. You are putting one single judge above the American  public's popular vote, let alone the electoral college.\n\nI am so glad that this House said that we are going to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to more  fraud, and that is what we have seen happen. Enrollment went up without  people using or even knowing that they had coverage. This is something  we need checks and balances on.\n\nWhen they moved the original Obama subsidies--and those aren't going  anywhere. They are still in place. They are not expiring at the end of  this year. They have existed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…government shutdown that jeopardizes their paychecks and the  services military families count on. During Democrats' shutdown, the  President has had to scrape together unobligated balances within the  Defense budget in order to uphold the Nation's promise to  servicemembers through another pay period.\n\nI certainly hope he won't have to divert resources from…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696491/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…allow cameras into  the Federal courthouses, including the Supreme Court, to foster a  better understanding of the Federal judiciary and its role in our  system of checks and balances and in resolving legal disputes.\n\nKeeping C-SPAN's cameras rolling here in Congress keeps lawmakers  accountable to our constituents by providing a valuable conduit for  civic…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Sections 90003 and 100052 of Public Law 119-21       (139 Stat. 358, 387) (commonly known as the ``One Big       Beautiful Bill Act'') are repealed and the unobligated       balances of amounts made available under those sections (as       in effect on the day before the date of enactment of this       Act) are rescinded.\n\n(b)(1) Section 71107 of the Act…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…($ billions) ------------------------------------------------------------------------                                                              Balances ------------------------------------------------------------------------ Fiscal Year 2025........................................               0 Fiscal Years 2025-2029..................................…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…this  legislation provides funding for critical projects that support jobs  and local growth in our districts.\n\nThe Labor-Health and Human Services bill on the floor today balances  the need for responsible fiscal stewardship while maintaining key  investments in biomedical research, schools, and public health.\n\nThanks to the negotiations on a bicameral,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…so we       can secure Montana's economic future and maintain America's       hard fought energy independence.\n\nReturning to the 2015 RMP--and allowing leasing that       balances energy security with environmental stewardship--will       yield these immediate results:\n\nA surge in local capital investment as energy companies bid       on new leases,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…things out.\n\nI am a strong supporter of EERE. EERE received over $16 billion from  the Infrastructure Investment and Jobs Act, of which there were  billions in unobligated balances remaining. In other words, they got a  ton of money in these big largesse bills that were passed by the last  administration. They got $16 billion, and they can't spend it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…emergency  rule, I decree there will be no gasoline-using cars. We will have only  electric cars.\n\nThat is what we are preparing ourselves for. Every distortion of the  checks and balances of powers gets worse. Every time a party changes  hands, they say: Well, you guys did this, so we are going to leapfrog  and do this. And it goes back and forth until the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]