[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…fistfuls of money as the rest of America struggles just to put food on  the table.\n\nThe excess is so great that Trump is literally tearing down the White  House to build a golden ballroom. He is sending $40 billion to bail out  Argentina and his billionaire buddies and has even hosted Great Gatsby- themed parties at Mar-a-Lago.\n\nThis resolution is a huge waste…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…since  he took office last year. How much can one family treat the Presidency  like a piggy bank before Republicans finally step up and do something  about it?\n\nWhy is his ballroom being funded by billionaire donors? What are they  looking for?\n\nWhat about the Epstein files? There has been no transparency there.  We had to force a vote in Congress. He…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…except for President Donald Trump.\n\nThe reason I say that, Senator, is, this week, all President Donald  Trump seems to care about is breaking ground on this $250 million  ballroom.\n\nSome constituents have reached out to my office and have asked: Well,  what does that mean?\n\nI have told them: Well, the President allowed a bulldozer to go and  knock down…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…healthcare crisis that is pending upon us.\n\nI think this is what Americans want us to do as opposed to bailing  out Argentina or figuring out how to finance a $300 million ballroom  that will dwarf the size of the White House.\n\nWhat Americans are concerned about is premiums that are climbing.\n\nWhat Americans are concerned about is the increase in their…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…constituent  of mine, a lifelong educator, has been told that her premiums will jump  from $383 to nearly $1,000.\n\nMeanwhile, Trump and Republicans can find money for a fancy ballroom.  They can give tax breaks to billionaires. They even included millions  of dollars in cash payments in this bill for eight Republican Senators.  If anyone else in government…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696719/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…this time he has  called the affordability crisis a hoax? Well, he paved over the Rose  Garden. He has torn down the East Wing of the White House to make way  for a grand ballroom funded by people who have business in front of the  Federal Government.\n\nI haven't been over to the White House, but all of the pictures show  24 karat gold ornamentation…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…trying to get groceries. That is the real- world consequence of Trump's decision.\n\nAnd while he is manufacturing two crises here at home, where is his  focus? Overseas, on a ballroom, on sending $40 billion to Argentina.\n\nThere is money for Argentina but not for SNAP? And the Argentina  money far exceeds the money needed for SNAP by at least a whole month.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…take us out of the  healthcare crisis? No. He was giving the White House a makeover. He  tore down the entire East Wing to make way for a 90,000-square-foot,  $300 million ballroom, funded by corporations that have a lot to gain  monetarily; and he had ``Great Gatsby'' parties at Mar-a-Lago with  dancing girls. It is just mind-boggling.\n\nBack to electric…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…the majority do, Mr. Speaker?\n\nThey found $40 billion for certain people in Argentina, but no  healthcare for American families. They found $300 million for a new  gilded ballroom where the East Wing of the White House used to be. The  ballroom keeps getting bigger and bigger, so I can't describe the  dimensions of it, but it is going to have a marble…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…that began in Boston.\n\nSmall businesses have no lobbyists, no Mar-a-Lago, no golden gifts  for President Trump, no margin for error. There will be no invitations  to the new ballroom, but I am not going to back down. I am going to  continue to stand up for small businesses across the country, across  Massachusetts, from red States to blue States, who are…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…as their tariffs  are costing people an extra 1,200 bucks per year.\n\nRegular people can't afford the rent, and Republicans are letting  Trump gild his bathroom and build a ballroom to host the rich and  powerful elites who own the GOP.\n\nThese guys are bailing out Argentina. They are giving $40 billion to  an entirely different country rather than helping…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…72,000 manufacturing jobs since  Liberation Day, after years of gains.\n\nWhat is the President focused on as working people struggle? He is  focused on building himself a new ballroom, naming the Kennedy Center  after himself, trying to take over Greenland, and selling  cryptocurrency out of the White House to enrich himself. None of this  creates jobs…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699065/2025-economic-report-and-manufacturing-jobs"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…living. They are crying out for help. But Donald  Trump can't hear them over the sound of the bulldozers that are  demolishing a chunk of the White House to build his brandnew ballroom,  a $250 million ballroom--a monument to Donald Trump himself, paid for  by big corporations that are trying to suck up to the administration  for special favors.\n\nThe American…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…families are already being squeezed by the rising cost  of living, from groceries to rent to utilities, President Trump is  focused on renaming the Kennedy Center, building a ballroom, running a  foreign country, and the water pressure in his showers.\n\nRepublicans in Congress, instead of focusing on lowering healthcare  costs, are debating the definition…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…assistance right before  Thanksgiving, and letting Trump spend his days pardoning  insurrectionists, enriching billionaires, cozying up to dictators, and  building himself a new ballroom, all while taking food away from  families in need.\n\nNow Senate Republicans want to reward themselves with a taxpayer- funded handout. It is shameful. House Republicans should…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696740/continuing-appropriations-and-extensions-act-2026"}]