[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…responsibility to reject this SAVE Act, to keep Federal law  enforcement away from polling locations, and to make clear once and for  all that elections and our sacred right to the ballot box belongs to  the people.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…accountable; dismantled so that the political opposition  never has enough room to maneuver meaningfully.\n\nThere are still elections. The Executive doesn't try to stuff the  ballot box. Occasionally, at lower levels, the opposition still wins.  But what happens is that those structures of accountability are either  so degraded or so completely co-opted…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…constant attempts by  Republicans to clamp down on voter fraud solves a problem that doesn't  exist. I couldn't disagree more.\n\nThe problem is that Republicans are losing at the ballot box. They  are losing young voters, voters of color, and women. So there is a  problem, that no one is buying into Republican ideas and policies and  the only solution is for…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…to vote only in local  elections--namely, for Mayor, members of the city council, the State  Board of Education, attorney general, advisory neighborhood  commissioner, and ballot measures.\n\nThe D.C. law does not allow noncitizens to vote in Federal elections,  which is a crime under Federal law.\n\nRegardless of your views on the merits of noncitizen…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Columbia of  full legislative power.''\n\nThe council has 13 members. If D.C. residents do not like how the  members vote, residents can vote them out of office or pass a ballot  measure. This is called democracy.\n\nCongress has 535 voting Members. None are elected by D.C. residents.  If D.C. residents do not like how the Members vote on local D.C.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…we will continue to make clear that the  contributions of Black Americans will not and cannot be erased,  undermined, or undone.\n\nWe will continue to fight for access to the ballot box, fair  representation, diversity initiatives, and our fundamental freedoms,  which are, sadly, under threat each and every day.\n\nAs the conscience of the Congress, we will…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…residents by mail. Public health statistics seriously understate the  burden of disease in our town, and other survey data also misrepresent  us. A high percentage of absentee ballot applications that we were  required by law to send out . . . were returned--not because the people  weren't in town, but because the USPS computer scanning system rejected…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…going  to have to drive miles and miles and miles, hours out of their way, to  stand in line at a local election agency.\n\nThe SAVE Act does nothing to make it easier to cast a ballot; it only  succeeds in making it harder for Americans to register to vote and to  exercise their rights.\n\nThis is not theoretical. Kansas tried to implement its own State- level…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…deliberately. They placed elections close  to the people. They rejected centralized control because they  understood that democracy cannot survive when the Executive controls  the ballot.\n\nThat principle is not optional. It is structural. It is foundational.  It is what the Founding Fathers built into the system to make sure that  we did not have a King, that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…person, the right to access Americans' personal voter information.\n\nMr. Speaker, as elected officials in this House, we should be  fighting to protect and expand access to the ballot box, not restrict  it. As old battles have become new again, we in the Congressional Black  Caucus have remained committed to ensuring and defending the sacred  right to vote.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…division, and  fear amongst us. In fact, the very foundation of our democracy is built  on the idea that the voices of our people are our most powerful tool,  exercised at the ballot box, the debate podium, and in our communities.  That is how we come together as a nation to form a more perfect Union.\n\nIndeed, the very concept of democracy was forged in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695522/violence-nor-silence-is-the-answer"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…elections; it is about silencing voters. It is voter suppression, plain  and simple. The so-called SAVE Act is also attacking, of course, voting  rights and our access to the ballot box.\n\nThis bill would create unnecessary new barriers that would  disenfranchise millions of Americans. This bill would also increase the  purges of registered voters, literally…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans have blocked--get  this--debate on amendments that would protect SNAP and Medicaid for  millions of Americans and debate on amendments to protect access to the  ballot box, the foundation of our democracy.\n\nThey even blocked debate on bipartisan amendments which would provide  a permanent pay fix for Federal wildland firefighters and allow…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Holder  decision in 2013. The bill would expand automatic voter registration  and allows for same day voter registration and protects against race- based discrimination at the ballot box. Democrats passed the John Lewis  Voting Rights Advancement Act through the House in 2021, but it was  blocked by Republicans in the Senate. The House Republican majority…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…from  other nations around the world is the right to vote. It is a right that  everybody in this body cherishes, as do the American people. Every  person who approaches the ballot box generally has confidence that  their votes are going to be counted and their voice will be heard.\n\nBut, as we stand here, this cherished right is coming under attack  because,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…these attacks and  all who seek to harm our elected officials, regardless of party or  ideology.\n\nIn this country, we resolve our differences through spirited debate,  the ballot box, and by working through an intentionally designed  constitutional system left to us as our Founding Fathers' greatest  legacy.\n\nThe victims of this horrible attack were…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…difficulty doing so. That is where he has made use of yet  another tool that is available to the one-party rule that we have in  California, which is to commit fraud on the ballot itself.\n\nNow, that might sound like strong language. ``Fraud'' might seem a  little strong, but it is not an exaggeration. The definition of  ``fraud'' is lying to people in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…BEAN of Florida. Mr. Speaker, I thank the chairman for yielding  me time.\n\nMr. Speaker, I rise today in support of the SAVE America Act, to show  an ID before you cast your ballot.\n\nMr. Speaker, I have heard on the other side of the aisle in this very  debate that it is already illegal to cast a ballot when you are not  eligible to vote. It is already…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…will be       passed on to families and small businesses. A vote in favor       of H.J. Res. 35, will be considered an NFIB Key Vote for the       119th Congress.\n\nIn a recent ballot, more than 88 percent of small business       owners support streamlining regulations to facilitate the       production and transport of oil, natural gas, and other…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…the 117th Congress, where they basically codified a COVID-era and  fraud-ridden election law. They included, ironically, prohibiting voter  ID essentially. It also included ballot harvesting, promoting mass  voting by mail, and taking taxpayer dollars to fund political  campaigns.\n\nLet's be clear. Democrats believe Congress has the power to ban voter…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700003/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…I always say that we make this job way too complicated. It is pretty  darned simple. What did Members tell the voters they were going to do  when they put their name on the ballot? If they get elected, go do what  they said.\n\nThe American people elected us, a majority in the House and a  majority in the Senate. There were 77 million people who voted…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Indeed, I think a good part of the reason why it  passed is because they actually put this provision, this sentence,  right there in the description that people saw on the ballot when they  voted, which is the proposition that established a State policy of  supporting independent redistricting nationwide. While it, on the one  hand, brings back gerrymandering…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…that I come from a State that is the most unique  State in the country because we have been, for years, requiring proof  of citizenship when a person registers for a State ballot. We have to  do that in Arizona, and we have had no suppression. We are the only  State that does it because the Supreme Court ruled that way. Somehow,  we can't do it for…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699942/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Unfortunately, there is a lot of misinformation out there being  spread by the media and my friends across the aisle. House Republicans  and President Trump want to protect the ballot box and ensure integrity  in our elections across this great country.\n\nOnly U.S. citizens should participate in the election process. The  laws we create in Congress affect…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700006/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Mr. Burchett  to make sure you understood that we have addressed this in New York,  and we have established that only citizens can vote. We want to make  sure we secure the ballot and know that citizenship in this country has  value.\n\nThere is nothing more profound or important for the preservation of  our constitutional Republic and to keep the power…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…so let us  review the numbers before us as we debate this legislation.\n\nMr. Speaker, 83 percent of Americans favor requiring a government- issued photo ID in order to cast a ballot. By party, 95 percent of  Republicans favor requiring photo ID to vote, and 71 percent of  Democrats, the party across the aisle, favor requiring photo ID to  vote. Hardly…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…seen, meaning fewer polling  places, fewer notifications to voters, and at least at first a digital- only voter guide.\n\nSecond, the Governor is committing outright fraud on the ballot  itself, describing the proposition in terms designed to fool voters  into thinking ``yes'' is ``no'' and ``no'' is ``yes.''\n\nTo justify all of this, to clothe naked political…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…drew. Yet, apparently, someone told  him that that would get immediately struck down in court.\n\nWhat they are now plotting is a special election where they will use  confusing ballot language and other means of deception to try to  convince voters--to fool voters--into dismantling the very independent  commission that they recently established.\n\nThe point…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…They  are tired of wondering whether their votes matter. They are tired of  wondering if those who have no right to vote--those who are  noncitizens--are actually packing our ballot boxes with illegal votes.\n\nI am more determined than ever to secure our elections, but in an age  of progressive, suicidal empathy, basic concepts such as voter ID and  proof…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…integrity of our elections.\n\nWe have already seen what happens when Washington refuses to act. We  have seen the chaos at the border. We cannot let that chaos spill over  into the ballot box. The SAVE America Act helps prevent that.\n\nThis bill delivers on one of President Trump's top priorities, and  that is to secure our elections and to make sure only citizens…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]