[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…the wealthiest  of individuals and big corporations.\n\nEarly in my career, I was a public school teacher. I know that a  hungry kid cannot learn. That is why, when I became Baltimore County  executive managing a $5 billion budget that I had to balance every  year, I prioritized food security and especially prioritized food  security for our children.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…year. He began his career in public service as  an Assistant State's Attorney in Prince George's County in 2001,  primarily prosecuting violent crimes, before transferring to Baltimore  City in 2004 and continuing in this position until 2006.\n\nThe next phase of his career was at the Department of Justice, as a  Trial Attorney in their Criminal Division.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…proved them wrong. We were  quickly and efficiently able to perform a controlled demolition in May.  By June, we reopened the Fort McHenry Federal Channel and the Port of  Baltimore, and last month, we revealed the design for the new Key  Bridge--the State's first cable-style bridge--which will stand 40 feet  taller than the original bridge and is set…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, I rise today on behalf of Mark Falkenhan, a  Baltimore County volunteer firefighter and Secret Service agent who  perished on the third floor of an apartment building in 2011.\n\nI rise on behalf of Nathan Flynn, a Howard County…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…they start high-speed chases in D.C.,  they go into Prince George's County, Montgomery County, or Northern  Virginia, and we lost someone during a high-speed chase on the  Baltimore-Washington Parkway; another stolen car case.\n\nWhen we make these decisions about when a chase is permitted or  should be permitted or not, we need to keep in mind that there…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…competent CTE  graduates.\n\nI am proud to co-lead this effort as someone who prioritized  workforce development as well as career and technical education in my  prior roles. As Baltimore County executive, I helped implement a $3.3  billion school improvement plan with a strong emphasis on CTE. I  created the Public Health Pathways Program, connecting residents…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691768/supporting-cte"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…certificate for all to see. I am a proud immigrant.\n\nShe came to this country at the age of 2. Her mother did not speak  English but brought three children on a boat from Germany to Baltimore  and ultimately to Illinois, where I grew up and my mother spent her  life. It was an indication of the American dream, as far as I am  concerned. Her son not only got a…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…New Haven saw a 39-percent drop in homicides. As  I think I said, overall, in Connecticut, we had 167 homicides in 2023.  In 2024, we had 63. It is wild.\n\nThis happened in Baltimore, and this happened in Chicago. In most of  the major cities in this country and in rural areas as well, we saw  this dramatic, dramatic decline. So it is just something to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…administration's devastating cuts to FEMA's BRIC program, otherwise  known as the Building Resilient Infrastructure and Communities grants.\n\nTowns like Crisfield in Maryland, Baltimore, and dozens of  communities across this Nation, rely on this funding to ward off the  very real and very devastating effects of flooding.\n\nNot only do these programs save…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690467/cuts-to-fema-bric-grants"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…T.R.I.G.G.E.R. Project.\n\nThe Washington Legal Clinic for the Homeless; Thrive Under       25; Trial Lawyers Association of Metropolitan Washington,       D.C.; University of Baltimore School of Law Center for       Criminal Justice Reform; University of the District of       Columbia Law School; Volare; VYTL Inc; Washington Lawyers'       Committee for…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…aid.\n\nOf deep concern to myself and Marylanders, President Trump has  threatened to rescind funding that is vital to the reconstruction of  the Francis Scott Key Bridge in Baltimore, a project critical not only  to our local economy but to the Nation as a whole.\n\nI urge my colleagues to insist that any budget we pass categorically  reject any further…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…trick the elderly,'' one Social Security staffer wrote to       colleagues Thursday, referring to the agency's announcement       of the in-person verification program.\n\nIn Baltimore, an employee who works on critical payment       systems said nearly a quarter of his team is already gone or       will soon be out the door as a result of resignations…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…MARYLAND\n\nMaryland Department of Public Safety and Correctional       Services\n\nBladensburg Police Department\n\nUniversity Park Police Department\n\nUniversity of Maryland, Baltimore Police Department: The       `Use of Force Pyramid' says tasers are a Level 5 of 6 (6       being ``deadly force'').                                MASSACHUSETTS\n\nQuincy…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…RebuildingTheCommunity, Reframe Health and Justice, School       Justice Project, Scrofano Law PC.\n\nSeeding Stories/Sembrando Historias, Tzedek DC, University       of Baltimore School of Law Center for Criminal Justice       Reform, Volare, Ward 3 Democratic Committee, Ward 3 Democrats       Statehood Task Force, Washington Lawyers' Committee for…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…remarkable career  at the Free State's world class colleges and universities. She's earned  degrees at the University of Maryland-College Park, Hood College, and  the University of Baltimore School of Law. On behalf of a grateful  Nation and the residents of Maryland's beautiful 8th District, I wish  Maryam Azarion nothing but the best as she begins a new chapter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…fellow at Harvard University  in 1959.\n\nMr. Murphy went on to serve as the editor and publisher of the San  Francisco Examiner, and then he became the publisher and CEO of The  Baltimore Sun.\n\nThroughout his life and career, Mr. Murphy stayed true to his morals  and strong ethical compass.\n\nMr. Murphy is survived by his wife, Diana; daughters, Karen and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Adelle: Religion News Service; Baptiste, Nathalie: Huffington       Post; Barber, Charles: Wall Street Journal/Dow Jones; Barber,       Rachel: USA Today; Barker, Jeffrey: Baltimore Sun; Barnes,       Julian: New York Times; Barone, Michael: Washington Examiner;       Barrett, Raymond: S & P Global; Bartash, Jeffry: MarketWatch;       Bastow, Keely:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…soon emerged as a center of diverse agricultural production. In  addition to citrus, settlers in Coleman raised cotton, cattle, sheep,  and hogs, with wool even shipped to Baltimore for processing. By 1923,  Coleman had earned national recognition as the ``Cabbage Capital of the  World'', attracting buyers from across the country.\n\nToday, the City of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Global Energy  Institute for the United States Chamber of Commerce after receiving his  bachelor's degree from Elon University and his Juris Doctorate from the  University of Baltimore School of Law. In 2020, Jake came to the United  States of House of Representatives as Policy Advisor and Counsel to  Congressman David McKinley (WV-01) before becoming General…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Washington, $69 million;\n\nWashington, D.C., $15 million--we know about the crime that has  happened in this city; and of course, in the ranking member's home  State of Maryland, Baltimore cut their police department $22 million.  Now they are saying: Oh, make sure the Federal money keeps coming.\n\nLook, I am not against some of these grant programs. We will…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}]