[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…their household costs are going to go up $1,200 this year?\n\nI want families and businesses to know that the whims of this  President are not going to cause them to break the bank on everyday  items they need to get by. That is why I introduced the Protecting  Americans from Tax Hikes on Imported Goods Act. It is a simple change,  really. It says that…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…support for international investment in the training and equipping of  an eventual Palestinian security force. He should be supporting  confidence-building measures in the West Bank, which empower the  Palestinian Authority contingent on the PA embracing and implementing  real reforms. He should not be enacting an annexationist vision while  the plague…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…river to the sea, not in those exact words. They  said west of the Jordan. That is the river, and west of the Jordan is  Gaza. From the river to the sea, west of Jordan, West Bank, from the  river to the sea.\n\nIf you say ``from the river to the sea,'' you will be sanctioned by  this Congress. We can't say that. The Knesset in Israel can pass in  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…help them navigate it.\n\nIn just 1 week from today, they are pretty much going to shut off  phone service for Social Security beneficiaries who are trying to sign  up with their bank information to get on Social Security. This is  something that has been normal practice, using very precise identifiers  to make sure that waste, fraud, and abuse do not occur.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…of EV charging funding.\n\nNo. 41, tried to rename the Gulf of Mexico.\n\nNo. 42, illegally rescinded $80 million in congressionally  appropriated FEMA funding for New York City bank accounts.\n\nNo. 43, fired--and then rehired--over 300 staffers at the National  Nuclear Security Administration, jeopardizing  the security of the U.S. nuclear stockpile.\n\nNo.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…fine print of  that bill was something very disturbing and troubling: a very brazen  payoff of millions of taxpayer dollars that could quietly be  transferred to the personal bank accounts of eight Republican Senators.  These are Senators who may have had knowledge or even participated in  efforts to overturn the 2020 Presidential election.\n\nAt a time…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…who  have served our country with honor.\n\nThis is completely unacceptable, and I urge every Member to oppose  this abomination of a resolution that uses veterans as a piggy bank to  pay for a billionaire tax break.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…option. The  exorbitant fees, sometimes $35 for every overdraft, would further push  them into debt.\n\nIt is a shame the Republicans are attacking poor people just to help  greedy bank CEOs get richer, the shame and the sham of it all.\n\nI oppose this resolution and encourage everyone to stand with working  people who are struggling to make every single dollar…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…sophisticated sex trafficking and  child abuse rings in history.\n\nRelease of the file will expose the role of everybody who facilitated  and covered up these crimes like JPMorgan Chase, Bank of America,  Deutsche Bank, and Bank of New York Mellon, which executed billions of  dollars in transactions related to these offenses, as well as any bank  executives who participated…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…The venture capital industry provides vital funding for early-stage  startups at points in their life cycle when they are generally deemed  to be too risky for traditional bank financing or for raising money on  the public market. This basically means that if we are going to have a  growing and innovative economy, then we have to have a healthy venture…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697192/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Development Companies to  facilitate capital formation and get that capital to small- and medium- sized businesses. I want to point out that, as we have had tighter and  tighter bank regulations, banks have been reluctant to lend money to  small businesses except where their risks are guaranteed by the Small  Business Administration. SBA loans are, of course,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Taiwan. If  China chooses to do so, the United States would be required to oppose  China's participation in a number of international financial  organizations, including the Bank for International Settlements and the  Basel Committee on Banking Supervision.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699847/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…before the due dates. I don't know what       to do for my son. Please help me.''\n\nAnother constituent asked our office, ``Do you think I       should remove my money from the bank?''\n\nThese are only a few samples that showcase the widespread       fear, panic, and instability being experienced by families       who have spent years building safe and productive…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…percent increase, respectively,  more expensive than they were a year ago.\n\nThe average new car price just crossed $50,000 for the first time in  our Nation's history. Investment bank UBS reports that tariffs have  increased home construction costs by $9,000, and we have an affordable  housing crisis in the United States in every State.\n\nAnd Ashley Furniture,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…independence of the Fed is essential to the respect that our country  commands in terms of our own economy throughout the world. The Chairman  of the Fed is the Chair of the central bank and serves as the Chair of  the central banks globally. It can't be a party hack. It can't be  somebody who is there because the President wants to create interest  rates. That…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…legislation. It eases the burdens for de novo banks so  that new banks can get off the ground. It tailors regulatory  requirements for the smallest community banks, and it reforms the bank  resolution process.\n\nMr. FLOOD. Mr. Speaker, the bottom line is that the Housing for the  21st Century Act is a comprehensive, bipartisan housing reform package  that will…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…had a successful political career, serving three terms in  the Alaska House of Representatives. And he is a great philanthropist  in Fairbanks--a key player in Fairbanks Food Bank and doing so many  other things in terms of philanthropy.\n\nOn top of all this, Jay says his greatest legacy, he believes, will  be something he recently did--which I think is…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Federal Reserve Act to prohibit the Federal reserve banks       from offering certain products or services directly to an       individual, to prohibit the use of central bank digital       currency for monetary policy, and for other purposes, as       passed by the House, as new matter at the end of H.R. 3633;\n\n(b) conform the title of H.R. 3633…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Code, of the rule       submitted by the Office of the Comptroller of the Currency of       the Department of the Treasury relating to the review of       applications under the Bank Merger Act. All points of order       against consideration of the joint resolution are waived. The       joint resolution shall be considered as read. All points of       order…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…for a digital future that protects  freedom and financial privacy.\n\nAt the center of that effort is the Anti-CBDC Surveillance State Act.  This bill ensures that no central bank digital currency will be created  under the Federal Reserve. We have seen what that looks like in  Communist China where the CCP uses it to track, monitor, and control  their…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693727/anti-cbdc-surveillance-state-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…grab that cash and realize you don't have to pay interest on  it anymore, talent-based, MA reform, you just paid for our  reconciliation bill and put some more money in the bank.\n\nMy point is that if we would actually think about policy, the  modernization, doing things better, faster, cheaper--next week we are  going to do a--I think one of our Democratic…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…large midsized manufacturing tenants and is the  financial anchor of the Warren County Chamber of Business and Industry.\n\nJim also oversaw the development of the 300 2nd Avenue Bank Building  project, a key venture that now houses the Northern Pennsylvania  Regional College and is a multimillion-dollar economic development  rehabilitation project in the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…truly make the world a  better place.\n\nVictoria's project, ``Pet Resource Central,'' in partnership with the  Community Resource Center of Punta Gorda, the Harry Chapin Food Bank,  the Animal Welfare League, the Suncoast Humane Society, and peers at  Port Charlotte High School, was an excellent endeavor to address food  insecurity and animal welfare…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690466/recognizing-victoria-morton-gold-award"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…financial inclusion, as well as financial  literacy and  awareness. Frankly, this rule isn't going to accomplish that. My  friends on the other side of the aisle know it.\n\nAfter the bank failures of 2023, community financial institutions  lost consumers and remain at a disadvantage. Again, any rule that leads  to greater consolidation in the banking industry…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…therapeutic activities, in a camp setting,  and help children share their stories with peers, whereby strengthening  their ability to cope. Kimberly was Branch Manager with a local bank  which donated backpacks to all campers. When Kimberly married Robert  Brooks, she quickly recruited him to become a Camp Volunteer. Kimberly  and Robert use ``Lifelines'',…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…to buy a six-pack or a can of Skoal or  a scratch-off, then I have to produce an ID.\n\nMr. Speaker, when you purchase a firearm, when you board a plane, and  when you open a bank account, if I put $100 in the bank and right then  ask for $20 of it back, I have to show a dadgum ID.\n\nWhy can't you vote for an elected official without one, Mr. Speaker?…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700006/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, the Biden administration  started us down the road of adopting a Central Bank Digital Currency  issued by the Federal Reserve without the consent of the American  people or their Representatives here in Congress.\n\nToday, we are saying no. We are not the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693728/anti-cbdc-surveillance-state-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…bill is simply a reversal of an irresponsible change made by the  Biden administration's SBA, which raised concerns on both sides of the  aisle.\n\nUnlike a traditional community bank, small business lending  companies, or SBLCs, are regulated by the SBA. Historically, the SBA  recognized that they had finite resources to conduct oversight of the  SBLCs,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692069/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…American taxpayers want that. We  continue to pledge to see if we can find wasteful spending and  eliminate it altogether.                 Recognizing Terry Forcht of the Forcht Bank\n\nMr. COMER. Mr. Speaker, I rise today to recognize Terry Forcht,  Forcht Group of Kentucky chairman and CEO of the Forcht Bank, for an  impressive 40 years of service and dedication…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…2025, again, D.C. spent almost $2.3 million on the  Office of Lesbian, Gay, Bisexual, Transgender, and Questioning Affairs.  That same year, they spent $7 million for the Green Bank. In fiscal  year 2025, they spent $441,000 for the Medical Cannabis Social Equity  Fund.\n\nMr. Speaker, we support fiscal responsibility. This is not fiscal  responsibility.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}]