[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Club. Every  day, they live out their voluntary efforts of the Rotary Four-Plus-One  Test, ensuring truth, fairness, good will, benefit, and fun in their  activities under the banner of service above self.\n\nRecently, the club raised needed funds for their community service  projects, completing a 25-hour-plus marathon filibuster, assisting  families in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699979/recognizing-yonkers-east-yonkers-rotary-club"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…streets of Minneapolis, where two American citizens  have been gunned down in as many weeks, where tear gas flies through  the air and doors fly off their hinges under the banner of this  administration. In those streets stand Agencies backed by billions of  dollars still to be spent--billions that can arm them, billions that  can detain and oppress.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…constant here in the Senate. I can think of four major  bipartisan bills here in the Senate. And I remember my friend John  McCain running for President, carrying the Republican banner into that  Presidential election with a completely solid and respectable climate  platform.\n\nWell, right after Citizens United, all of that stopped. The barrage  of fossil…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…this is the President who is all about  workers first, which is why I had to drive down to the city to the  Department of Labor and see the President's face on the big, old  banner.\n\nWhy are we spending money on these banners but cutting money to  farmers? Because dismantling USAID and cutting USAID is more than just  what is happening in other countries.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…thriving, two-campus district, East Leyden and West Leyden, now serving  more than 3,300 students with over 200 dedicated teachers.\n\nRooted in blue and gold and soaring under the banner of the eagle,  Leyden's commitment to academic and artistic excellence has inspired  pride, unity, and spirit across the district's communities.\n\nTrue to its mission to educate,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…of the Capitol. It is  super creepy, the idea that we have Mao- and Stalin-like banners of the  President of the United States surrounding the U.S. Capitol. But next  to the banner of Donald Trump on the Department of Labor building is a  banner depicting the image of Teddy Roosevelt. I guess it is an attempt  by the President to draw an equivalency between…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Nation. At this staffing level, it would take up  to 4 years to thoroughly research and release a report after each line- of-duty death.\n\nThat was until 2 months ago.\n\nUnder the banner of government efficiency and the claim to reduce  waste, DOGE has fired three of the five investigators, which means  longer wait times for our first responders who deserve…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…also eliminating SAMHSA altogether  without congressional reauthorization. It will be combined with other  agencies that the Trump administration doesn't care about under the  banner of a larger make America healthy again office.\n\nThese critical programs to treat mental health and substance abuse  will be deprioritized or eliminated in favor of Secretary…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…remember the last time a Republican  President misled the Nation about WMDs, using vague evidence to drag us  into a war in the Middle East? He stood under a mission accomplished  banner, and then we were at war for nearly a decade, and it cost  trillions of dollars and thousands of lives.\n\nI guess the 2025 version of a mission accomplished banner is a Truth…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…use disorder, increasing access to treatment, and promoting  recovery.\n\nIt will be combined with other agencies that the Trump administration  doesn't care about under the banner of a larger make America healthy  again office. Now, these critical programs to treat mental health and  substance abuse will be deprioritized or eliminated in favor of  Secretary…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…and Times of Frederick Douglass,''  Douglass wrote that he ``urged every man who could enlist to get an  eagle on his button, a musket on his shoulder, and the star-spangled  banner over his head,'' and ``there is no power on Earth which can deny  that he has earned the right to citizenship in the United States.''\n\nDouglass believed the Civil War offered…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…international soccer world.\n\nToday, 56 teams and 800 athletes, known as the ``Ukie Nation''  proudly wear blue and yellow and play under the Philadelphia Ukrainian  Nationals Banner. Travel and club teams, including all skill levels,  are offered for boys and girls all year round. The UASC Tryzub is not  only notable for their achievements, but for giving…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…keeps making their premium payments, the more money you make. They were  incentivized.\n\nWe had one of the lead medical officers from a healthcare system in  Arizona called Banner talking about how they are trying to align a  system that actually they get rewarded for helping populations be  healthier and the technology they are using to do it.\n\nThe…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…George: WJLA-TV/NEWSCHANNEL 8; Ball, Homa: WTTG-FOX       TELEVISION; Ballou, Jeffrey: ABC NEWS; Banda, Eshwar: ASIAN       NEWS INTERNATIONAL; Banks, Joshua: FOX NEWS; Banner, Jillian:       WASHINGTONPOST.COM; Bannigan, Michael: FOX NEWS; Bannister,       Craig: CNSNEWS.COM; Barbash, Jack: WDCW.\n\nBarcenas, David: HEARST TELEVISION INC; Barillas,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…congratulate Gracyn Stevens  from Kirklin, Indiana, who won the 13th annual National Cattlemen's  Beef Association National Anthem Contest. Gracyn will sing ``The Star- Spangled Banner'' at CattleCon 2026 in Nashville, Tennessee. She will  also sing before both ``Cowboys Night at the Opry'' shows at the  historic Ryman Auditorium.\n\nGracyn said that it was…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697999/congratulating-gracyn-stevens"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…delivered DOGE-era USAID cuts while still  funding national security investments. In fact, I was honored to help  Chairman Diaz-Balart retain some of these programs under the new banner  of national security investment programs at the State Department under  the direction of Secretary Rubio.\n\nThe bottom line, sir, is if it is not having to do with our national…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699059/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…parish       communities. He especially enjoyed being chairman of the Red       River Valley Billy Graham Crusade in 1987, and being a member       of the Lutheran Health and Banner Health Systems boards from       1990-2005. Being on these boards sparked his love of travel,       taking trips to the British Isles, Scandinavia, Europe, the       Middle…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…is who she really is. In fact, I have been known as a  fiscal hawk throughout my time in public service, but she is pretty  comparable, giving me a run for my money on that banner.\n\nDebbie has also been a bridge builder and mentor. Even when factions  arise, Kansans continue to trust her leadership and count on her to  help bring people together. It…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}]