[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…to President  Trump and their own party on this critical issue. Sadly, Speaker  Johnson decided to go a different direction. He tucked language into a  procedural vote that bans these Republican and Democratic resolutions  from coming to the floor for a vote--not even a vote. He is trying to  avoid Republicans going on record against supporting Trump's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689930/enough-of-trumps-chaos"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…realities with the ultimate goal of appeasing the anti- abortion advocates parading around Washington this week as countless  women suffer and die under extreme Republican abortion bans. Their  priorities are clear and profoundly misguided.\n\nI urge my colleagues to vote ``no.'' Mr. Speaker, I reserve the  balance of my time.\n\nMs. CHU. Mr. Speaker, I would like…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…that bigoted, discriminatory policy to drive them out of  the military.\n\nThis is about healthcare for children experiencing gender dysphoria.  What this amendment does is it bans that healthcare treatment for  children experiencing gender dysphoria.\n\nI made a series of arguments on the other amendment about why that is  such a bad idea, but the bottom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…government that further  urgent action is needed.\n\nThat is why, along with my colleagues from New Jersey and New York, I  introduced the Improving Helicopter Safety Act, which bans all  nonessential helicopter traffic within a 20-mile radius of the Statue  of Liberty.\n\nIt is clear that the helicopter industry is not a good actor or one  willing to proactively…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…President or any one of us.\n\nSo here is the fact: We are right now debating a bill dealing with  cryptocurrencies, so this is the time to debate and vote on an  amendment that bans these corrupt practices.\n\n2307 postcloture, that the pending  amendment No. 2310 be set aside so I may offer my amendment No. 2349,  which would stop the corruption in stablecoins…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…administration's agenda is       misinformation and confusion. Federal healthcare and public       health institutions are facing unprecedented censorship and       harassment. Bans for external communications have crippled       international collaborations, with special exceptions given       at random and many that have not been restored. Websites with…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…offer an  amendment to the rule to bring up H.R. 12, the Women's Health  Protection Act, to restore the rights of women to an abortion  nationwide and undo extremist abortion bans in States across the  country.\n\nMr. Speaker, since the Supreme Court's Dobbs decision, 13 States have  imposed complete abortion bans and many more have imposed extremely  short…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…relationship with virtually any Chinese  university.\n\nThat is why Democrats on the House Homeland Security Committee have  worked to bring H.R. 881 more in line with the funding bans found in  previous legislation by including a waiver for the Secretary of  Homeland Security like those the past legislation had for the Secretary  of Defense and National Science…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…technology known as blockchain to record everything and  everybody who owns tokens. Open it up. Let us know who the big issuers  are.\n\nThere are two types of CBDCs, and this bill bans both of them. A  retail CBDC is made available directly to consumers from the Federal  Reserve, from a bank, or other Federal institutions. A wholesale CBDC  is not available…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…account for more  than 315,000 jobs in our State. We have proven in Nevada that if you  pay workers what they deserve, everybody wins.\n\nI am especially proud that our State bans subminimum wages for tipped  employees. That means, whether an employee has a good or a bad tipping  month, an employee can still earn an honest living.\n\nMore needs to be done…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698969/tipped-employee-protection-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…withhold information that could save women's lives.\n\nMr. SCOTT of Virginia.  Bonamici).\n\nMr. Speaker, in closing, since the Supreme Court overturned Roe v.  Wade, State abortion bans have undermined healthcare for pregnant  women, causing women to experience life-threatening health conditions  and complications, with some women tragically losing their lives…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Republican Party had been the  premiere champion for civil rights. But that is not the way it worked  out.\n\nThe Democratic Party, with Johnson, took the lead in overturning the  bans on voting participation by minority Americans. The Democratic  Party, although being the party that had long oppressed and suppressed  civil rights, became the party that pushed…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…costs. It does nothing to  help families afford prenatal care, childbirth, or postpartum care. It  does nothing to address the deadly consequences of extreme Republican  abortion bans that are forcing women to delay care and risk their  lives.\n\nMr. Speaker, if we defeat the previous question on this rule, my  Democratic colleagues and I will offer my bill,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699219/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…in 2022, one-half  century of reproductive freedom was stripped away when the conservative  majority on the Court overturned Roe.\n\nSince then, we have seen extreme abortion bans enacted across the  country, including in North Carolina. Today, Republicans at all levels  of government are waging an all-out war on Americans' access to care,  pushing healthcare…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699244/womens-health"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to suspending these applications for Afghan nationals, the  Trump administration paused all asylum refugee decisions.\n\nThe Trump administration has extended broad immigration bans to  anyone from 39 different countries, including individuals from those  countries who are already in the United States. Going through an asylee  claim, a refugee claim, playing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Thankfully, President Trump and his administration are working day  and night to save this country through mass deportation, revoking  immigrant visas, and implementing travel bans on majority-Muslim  countries that support the radical Islam crowds who chant ``Death to  America.''\n\nWe continue to see more evidence come out of Muslim third world  foreigners…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…message: We reject the Biden administration's  radical energy mandates.\n\nThis resolution expresses congressional disapproval of the Department  of Energy's rule that effectively bans certain natural gas water  heaters which burdens families with higher costs while stripping them  of consumer choice.\n\nHouse Republicans will continue fighting to protect American…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688295/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…approximately 40 percent of the  tankless gas water heaters currently available, forcing consumers to  purchase significantly more expensive or less efficient models.\n\nNot only do bans on gas appliances infringe on consumer choice, but  it also increases strains on our Nation's grid, which cannot sustain  such massive and rapid amounts of forced electrification…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Res. 140 recognizes our need to support domestic       industries with a responsibly extracted supply of American       minerals. In order to do so, we must address unnecessary bans       that inhibit industrial growth.\n\n``We thank Rep. Stauber for his continued leadership and       commitment to alleviating the hurdles that keep our members       from…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…are only two sexes, male  and female.\n\nThis is a position grounded in biological reality, not gender  ideology. Last month, the President also signed an Executive order that  bans biological males from competing in women's sports.\n\nIt was an honor to join President Trump at the signing ceremony along  with the brave young women and girls who have spoken…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…statement so they can't be deported.\n\nIt creates a private right of action so that Americans who are harmed  by a removable alien in a sanctuary city can sue for damages.\n\nIt bans student visas in sanctuary jurisdictions. You do not get to  continue profiting off of importing foreign students if you won't even  deport the dangerous illegal aliens on your…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…identify and publicly name individuals and entities  involved in forced organ harvesting in China. It imposes targeted  sanctions under the Global Magnitsky Act, including visa bans and asset  freezes, against those responsible. It strengthens reporting  requirements for the State Department, ensuring that U.S. foreign  policy fully accounts for the scope…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…delegation is stepping up. I  stand shoulder to shoulder with Congressman Zinke and Senators Daines  and Sheehy. We introduced the Stop Russian Market Manipulation Act.  This bans imports of critical minerals from Russia.\n\nWe are creating a competitive market for U.S. mineral producers not  driven down by dumping from foreign actors and extending a vital…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…lock up America's resources, kill jobs, and undermine energy  security.\n\nThe Miles City Resource Management Plan amendment, combined with the  Buffalo RMP amendment in Wyoming, bans future coal leasing across the  Powder River Basin, which holds roughly 30 percent of our Nation's coal  reserves.\n\nThe Powder River Basin does not just power Montana and Wyoming,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…raise, expanding childcare, increasing family  separation allowances, expanding and reauthorizing special pays and  bonuses, and expanding convalescent leave.\n\nThis bill also bans cell phones in DODEA schools, prevents the  downsizing or closing of childcare centers without congressional  notification, expands access to healthcare, prevents the elimination…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697792/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…on economic factors.  It ensures proxy voting and shareholder rights are exercised solely in  the financial interest of plan participants, not to push radical  policies. It bans discrimination in selecting plan fiduciaries and  service providers based on race, religion, sex, or national origin. It  almost sounds American in its idea. It improves transparency…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Department of Energy relating to energy conservation  standards for consumer gas-fired instantaneous water heaters.\n\nThe rule we seek to overturn with this legislation effectively bans  certain natural gas water heaters from the market, placing unnecessary  financial burdens on consumers, especially seniors and low-income  households.\n\nH.J. Res. 35 provides…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…schedule I substances like fentanyl  analogues, we can better understand how these substances work and how  we can prevent potentially harmful impacts in the future. The temporary  bans, Mr. Speaker, did not deal with the research component. So without  this bill, we cannot legally do the research on the analogues that may,  someday, be found to have medical…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}]