[{"senator": "Al Green", "party": "Democrat", "sentence": "…it is called quite often-- and I concur with the persons who would call it such; the historic 18th  Congressional District--the 18th Congressional District, the district  of Barbara Jordan, the district that had the great Craig Washington,  Mickey Leland, Sheila Jackson Lee, Sylvester Turner, the 18th  Congressional District, a historic Congressional…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Central Coast who have made a meaningful impact  in our community through the Women of the Year Award. This year, it is  my pleasure to recognize JoAnne Meade Young of Santa Barbara,  California, for her outstanding contributions to education and  community leadership.\n\nJoAnne's lifelong commitment to educational equity was shaped early  in life. Born…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…package that steals $400 million from PEPFAR, a  lifesaving global health program.\n\nLet me remind my colleagues that PEPFAR is a bipartisan effort first  led by Congresswoman Barbara Lee and signed by President George W.  Bush. It has been reauthorized on a bipartisan basis four times.\n\nRight now, Republicans who are supportive of PEPFAR are calling the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692543/rescissions-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Clarke of the University of California,  Berkeley, along with Professor Emeritus John M. Martinis and Professor  Michel H. Devoret--both of the University of California, Santa  Barbara--were all awarded the Nobel Prize in Physics for their  groundbreaking research in quantum computing. Their work will advance  evolving technologies in everything from drug…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…his constituents and bringing this bill to the  floor. I encourage my colleagues to join me in honoring the life of  Brigadier General Lopez by naming a post office in Santa Barbara,  California, after him.\n\nMs. RANDALL. Mr. Speaker, I have no further speakers, and I urge the  passage of H.R. 2175. I yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697743/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…seamless garment of existence, a multicolored cloth, which we believe  to be woven in its entirety by God.'' The world, he told a 1997  conference of environmentalists in Santa Barbara, California, ``is not  ours to use for our own convenience. It is God's gift of love to us,  and we must return his love by protecting it and all that is in it.''\n\nTo back…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…trip  to our country during which he will receive the prestigious Templeton  Prize for his environmental advocacy.\n\nThe ``Green Patriarch's'' landmark 1997 speech in Santa Barbara--in  which he first posited the notion of ecological sin--is striking for  how revolutionary it was then, and how prescient it remains today. In  particular, one line from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695502/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…every morning, what keeps them up at night.  Still, she remains determined to advocate for families like hers who  deserve stability, dignity, and hope.\n\nOr an urgent call from Barbara, who begged us not to back down from  this fight.\n\nLaura from Brick, who called and urged Democrats not to back down  from this fight and was able to say how concerned she…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, I rise today to pay tribute to an  extraordinary American and beloved member of the Santa Barbara  community, Paul David Lopez, as he celebrates his 100th birthday on  June 22, 2025.\n\nBorn in Santa Barbara, California, in 1925 in a home his father built  by hand, Mr. Lopez's…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, I rise today to encourage every Member of  this Chamber to support this legislation honoring one of Santa Barbara  County's own, Brigadier General Frederick R. Lopez.\n\nMy bill would name the South Patterson Avenue post office in  recognition of General Lopez's distinguished legacy of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…took over after the passing of our colleague,  Sheila Jackson Lee, who we all remember for her tenacity.\n\nThis is in a district that was once represented by the legendary  Barbara Jordan. This is also a district with a long legacy of fighters,  fighters for justice. I am confident that Christian Menefee will carry  on that tradition.\n\nHe was raised…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Resources Board to more comprehensively address the  severe air pollution and its consequences.\n\nThen, some of you may remember a catastrophic oilspill off the coast  of Santa Barbara. Californians rose up and demanded stronger  environmental protections, and this became the birth of the modern-day  environmental movement and eventually the first Earth…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…and  Congress has not yet authorized those wars, nor will it. They will have  to come to Congress for that power.\n\nI am honored to take the baton from former Congresswoman Barbara Lee  in  carrying this legislation forward. I thank the lead across the aisle,  Representative Roy, for getting this past the finish line.\n\nThis bill also includes legislation…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…current Commander in Chief, on his social media account a day or  two after the attack in Iran, put up a music video with lyrics that  were matched to a Beach Boys song, ``Barbara Ann,'' but the music video  contained these lyrics: ``Bomb bomb Iran; bomb bomb bomb bomb bomb Iran  . . . ; went to a mosque, gonna throw some rocks . . . ; time to turn…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Medicaid, CHIP, and other government programs.\n\nOnce in my lifetime, we defeated this amendment in the House, a  testament to activists, organizers, and my mentor, Congresswoman  Barbara Lee.\n\nMr. Speaker, in my lifetime, we will defeat it once and for all  because everyone deserves access to fundamental healthcare, and that is  exactly what abortion care…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693925/access-to-abortion-care"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…becoming a citizen of  the United States in 1973.\n\nAfter over 40 years in the home furnishings industry, working side by  side with both his wife, Nancy, and his daughter, Barbara, he and Nancy  retired in 2008.\n\nIn 2009, they moved to Grass Valley. They were not entirely sure what  they wanted to do in retirement, but they met some wonderful friends…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Media Group in Los Angeles after forty-three years of  dedicated service.\n\nAfter earning his bachelor's degree in English Literature from the  University of California, Santa Barbara, Terry became increasingly  drawn to the copywriting and music industry. Born into a family of  salesmen, Terry began his career in broadcast as a sales representative  for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691791/recognizing-the-service-of-mr-terry-fahy-on-the-occasion-of-his-retirement"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass  the bill (H.R. 2175) to designate the facility of the United States  Postal Service located at 130 South Patterson Avenue in Santa Barbara,  California, as the ``Brigadier General Frederick R. Lopez Post Office  Building''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697744/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise today to celebrate Dr. Barbara J.  Finlayson-Pitts who was recently recognized as the North American  laureate of the 2025 L'Oreal-United Nations Educational Scientific and  Cultural Organization (UNESCO)…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692467/recognizing-the-achievements-of-dr-barbara-j-finlayson-pitts"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Awareness  month. October is the month that we bring attention to the plight of  those who have had breast cancer and educate others on the importance  of early detection.\n\nMy wife Barbara is a 38-year breast cancer survivor. We are fortunate  that her breast cancer was detected very early. We know with certainty  that early detection can dramatically increase…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia.\n\nMr. Speaker, I thank Mr. Barth for all his hard work and for being a  trusted and compassionate professional in his field.                         Honoring Nurse Barbara Harn\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Barbara  Harn, a breast health nurse at Northside Hospital Cherokee, who has won  the 2025 James Shepherd…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…all the values the Scottish Rite  stands for.\n\nI thank the generous donors: Illustrious Brother Albert Nelson, Jr.,  and Lady Nellie; Dr. and Sir Knight James Arnold and Lady Barbara;  Illustrious Brother Charles White and Lady Nordene; and Brother Morgan  Derst and Lady Pam for their kind contributions.                     Honoring Science Teacher Bill…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Collins, Leslie: C-SPAN;       Collins, Maxine: BBC; Collinson, Stephen: CNN; Colombo-      Abdullah, Andrea: AP-BROADCAST; COLON PEREZ, Emelys: WFDC-TV       Univision; Colpi, Barbara: SWISS BROADCASTING; Colvin,       Rhonda: WASHINGTONPOST.COM; Comparan Cuadras, Nanitzia: WRC-      TV/NBC-4; Compatangelo, Daniele: LA7 ITALIAN NEWS NETWORK.\n\nConant, Daisy:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…back-to-back champions.\n\nSports brings communities together from one generation to the next.  As loyal UNI Panther fans and proud boosters for Dike-New Hartford  athletics, Barbara and I would say that sports are like glue that  sticks, a refreshing antidote in these polarizing times.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…memorials. His room at Maplebrook Assisted Living  was decorated in tribute to his naval service.\n\nLeroy was born August 2, 1928, in Farmington and is survived by his  sister, Barbara Cornellson, and his children, Cathy Mana, Mary  LeTourneau, Nancy Rariden, Greg Wade, Diane Byrd and stepdaughter  Kellie Grief. He is also survived by 12 grandchildren and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, it is my privilege to present a  Congressional Veteran Commendation to Lieutenant Colonel Barbara  MacMillan, U.S. Army, Retired. Her life and career reflect hard work,  selfless service, and dedication to her Nation and Central Texas.\n\nLTC MacMillan served from 1976 to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…are always really generous with your  time for the former Members. Thank you so much.\n\nMs. EDWARDS. We appreciate that, Mr. Speaker.\n\nThe Chair now recognizes the Honorable Barbara Comstock of Virginia,  who is president of the Former Members of Congress Association to  address the Members.\n\nMs. EDWARDS. I want to add my congratulations to FMC's past…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Barbara Sprague has made to our community  through her work with the Community Food Bank, leading the charge in  our fight against food insecurity. Since Barbara joined the  organization,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}]