[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Following what history has come to label as the end of the civil rights  movement in 1968, in 1969, four young men had been intentionally  recruited to break down a color barrier at the University of Alabama's  law school.\n\nEight young men walked through the doors of the University of Alabama  School of Law in the fall of 1969. Among them was a young…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…the 2025  National Hero of the Year by the National Association of Letter  Carriers.\n\nOn April 18, 2024, Mr. Deyasso witnessed a car drive off the highway  and crash into a barrier, erupting into flames. Without hesitation, he  rushed to the scene. Joined by a group of Good Samaritans, Mr. Deyasso  worked tirelessly to pry the car door open, fighting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690461/recognizing-the-extraordinary-bravery-of-tesfaye-deyasso"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…other high-powered ``less-than-lethal       projectile devices'' that today are classified as       firearms. Moreover, once they obtained such weapons, there       would be no barrier in federal law to obtain the necessary       parts to modify them into lethal projectile weapons.\n\nThe purpose of this bill is truly perplexing. Not only will       H.R. 2189/S.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…with love. The vote is power.  The vote is our voice.\n\nThe vote is sacred, and I will not rest until every hand that reaches  for a ballot is met with a promise, not with a barrier.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…claims that the D.C.       Admission Act is vulnerable to a constitutional challenge in       the courts. For the reasons set forth below, there is no       constitutional barrier to the State of Washington, Douglass       Commonwealth (the ``Commonwealth'') entering the Union       through a congressional joint resolution, pursuant to the       Constitution's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…claims that the D.C.       Admission Act is vulnerable to a constitutional challenge in       the courts. For the reasons set forth below, there is no       constitutional barrier to the State of Washington, Douglass       Commonwealth (the ``Commonwealth'') entering the Union       through a congressional joint resolution, pursuant to the       Constitution's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…day. I have kept it for nearly  50 years because the fight isn't over.\n\nThis week, I stood with powerful women in Congress to introduce a  resolution that removes our final barrier: the arbitrary deadline set  decades ago. If it passes, the ERA becomes the 28th Amendment.\n\nWe must pass this resolution. We must remove all barriers to women  because our…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…negotiations didn't start until last month.\n\nThere are many areas of overlapping priorities between the majority  and minority on this bill. We share a desire to lower the barrier to  entry for new entrants and bridging the valley of death for the most  promising ideas.\n\nHowever, there are some outstanding issues we are working through  that will take…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Mercury is quickly absorbed into the body through  inhalation and skin contact. It moves quickly across the placenta and  into a human fetus and can also cross the blood-brain barrier and  remain in blood cells for decades.\n\nThis is why it is linked to developmental deficits in children. It  can impact the heart, lungs, central nervous system, reproduction,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and       refuge systems. We also took the lead in developing a new       approach to protecting some 700 miles of undeveloped       coastal areas--the dunes, beaches, and barrier islands       that are some of our most beautiful and productive natural       resources.\n\nNow--\n\nReagan said--       there are some who want you to believe that commitment…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…business owners in Orange County that  the main reason they do not apply for Federal contracts is that the  barriers to entry are simply too high.\n\nH.R. 787 will address this barrier facing small business owners and  mandate Federal agencies to use clear and accessible language in their  contracting opportunities.\n\nI am proud to co-lead this bill, and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691852/plain-language-in-contracting-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…all from the reports I have heard.\n\nHis also suggesting that military personnel can enforce the laws of  the United States violates the Posse Comitatus Act, which has been a  barrier to police powers by the military since the 1870s.\n\nI assume, like myself, you are particularly disturbed that he is,  again, not only weaponizing data, but he is weaponizing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Court honored the history that came before it. It honored the struggles  of the past and the men and women who fought for a future where skin  color and gender are no longer a barrier to full participation in  American society, voting, or seeking the highest positions in our  government.\n\nAmerica's history is defined by our enduring effort to bridge the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…on the side of the road at 100-plus miles an hour was  come across debris on the road, and he tried to swerve to avoid it.  When he did that, the car jumped over the Jersey barrier between the  two lanes and took him into the opposite lane of oncoming traffic.\n\nThe car jumped over, hit the top of a car coming the opposite  direction, and killed two men…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…course, be allowed them.''\n\nSince 1802, Congress has established various types of local  government for D.C. In 1953, the Supreme Court held: `` . . . there is  no constitutional barrier to the delegation by Congress to the District  of Columbia of full legislative power.''\n\nThe local D.C. Legislature, the Council, has 13 members. If D.C.  residents do not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…people and places have inspired my legislation, H.R. 1190,  the Expanding Access to Capital for Rural Job Creators Act.\n\nAs any small business owner can attest, the number one barrier to  growth is access to capital. Through my own experiences, I know how  difficult it can be for businesses to secure the funding that they need  to grow. I have built businesses…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692758/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…throughout rural America, families, farmers,  students, and small business owners still struggle with slow or  unreliable internet access. It is not just inconvenient, it is a  barrier to opportunity, to education, to healthcare, and to economic  growth.\n\nWhen Congress invests in rural broadband, we must ensure those  dollars are getting where they are intended…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690152/rural-broadband-protection-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…include the following:\n\n(A) Measures to ensure that authorized staff of the Coast       Guard have system interface access to the Database, and a       description of any barrier to such access.\n\n(B) Measures to ensure that authorized staff of the Coast       Guard Academy have system interface access to the Database,       and a description of any…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…who realized-- getting the appropriate quote--realized the negative impacts of high  tax rates. Indeed, roughly 60 years ago, President Kennedy warned:  ``The largest single barrier to full employment of our manpower and  resources and to a higher rate of economic growth is the  unrealistically heavy drag of Federal income taxes on private  purchasing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…us commit to supporting all  Americans living with autism, ensuring they receive the necessary  resources, opportunities, and respect they deserve. Autism should never  be a barrier to success or happiness.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…reserved  only for American citizens.\n\nThe SAVE America Act also requires voters to show a government ID  when casting a ballot. Now, I have heard some claim this is too high a  barrier. Let's be serious. We ask Americans to show an ID to buy a  beer, to board a plane, to donate blood, to apply for benefits, to even  get married, but when it comes to electing…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…VETERAN                     EMPLOYMENT.\n\nTitle 38, United States Code, is amended--\n\n(1) by striking ``employment handicap'' each place it       occurs and inserting ``employment barrier''; and\n\n(2) by striking ``employment handicaps'' each place it       occurs and inserting ``employment barriers''.\n\nMr. BOST.  2625.\n\nMr. BOST. Mr. Speaker, I urge all of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693933/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…cut through the red tape and the bureaucracy of  the VA and focus on the veterans themselves and, with that, making the  entire government better. Removing the bureaucratic barrier and  allowing more veterans to be served on college campuses across the  country is in lockstep with that mission.\n\nThis bill would also establish a VR&E hotline that would…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…second. How long do we think we can keep that up?\n\nYet, if we get our taxes from a regulatory system and legalize, once  again, creativity, legalize productivity, instead of barrier after  barrier--those barriers may be great politics. They show up in our  fundraisers and help us. Maybe we can get a union to vote for us, but  it is crap economics.\n\nMr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…passage of Amendment 27, submitted       by Representative Crawford, pertaining to compensatory       mitigation. Compensatory mitigation has become a significant       cost and barrier for builders: Representative Crawford's       amendment takes meaningful steps towards reducing mitigation       costs through simple, commonsense reforms that maintain…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…respect to their dependents.\n\nIt also makes the adoption tax credit partially refundable up to  $5,000 to help children find permanent, loving families by removing  income as a barrier to adoption. That is key.\n\nThe concept of refundability is a sticking point. Republicans  constrained that a little bit more. Democrats want to overextend it.  There is debate…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…only drilling tunnels now, but they are also putting folks on jet  skis and in Panga boats, taking them out into the Pacific and trying to  be able to come around the maritime barrier and be able to drop off  somewhere around the California coast.\n\nJust this week, we had a smuggler that was smuggling folks in a Panga  boat just on that exact route that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…underrated travel destinations in the U.S.\n\nThey evaluated over 1,500 vacation destinations worldwide and ranked  them across numerous categories. St. Simons Island, the largest barrier  island on Georgia's Golden Isles, offers low-hanging Spanish moss,  salty air, and warm ocean water. It is home to pristine beaches, miles  of walking paths and trails, ice…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692260/recognizing-st-simons-island"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the  Democrat political consultants are saying, oh, good, more attacks.\n\nThe immorality of this place to not want to tell the truth about our  demographics and the complete barrier we have built legally on  innovation--I have a couple of really geeky things here, but I am going  to skip them and go to something that is a little crazy.\n\nEvery week when…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…not coming to  our office to say: David, adopt technology. Lower the price of living.  Lower the price of healthcare.\n\nIt is: We want more money, or we want you to build a barrier to entry  to our competition.\n\nWe call it rent-seeking, if you remember your high school economics  class.\n\nLet's take a look here. I need you to understand how rough our…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}]