[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Every year, the purified water is thrown back  into the lake when it leaves the plant. That city throws into Lake Erie  the equivalent of a waste heat load of nearly 400,000 barrels of oil  annually. Think about that. That is waste heat that we, as a country,  could be capturing.\n\nThat is just one untapped location along just one great lake, Lake  Erie.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…colonists were increasingly flouting. The British ship began       to abruptly board colonial vessels off the coast of Rhode       Island and seize their cargo, such as barrels of smuggled       rum. Accusations soon proliferated that the Gaspee's crew was       stealing sheep and hogs from local farmers, and cutting down       their fruit trees…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…story  before. Mr. Speaker, 10 years ago, Congress removed the ban on  exporting American crude oil. I already mentioned that. Before that, we  were only sending China 420,000 barrels of oil each year. We now send  China more than 160 million barrels of oil a year.\n\nClearly, Republicans have learned nothing from that, despite  constantly proclaiming the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…have to be this way. The last time we faced an energy  crisis in the United States, it was the 1970s. Energy prices were  skyrocketing because of the 1973 oil crisis, when barrels of oil--then,  our most in-demand energy source--quadrupled in price. U.S. energy  production could not meet domestic demand, and the country saw  blackouts and brownouts.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…been able to increase crude oil production by 60  percent over the same time period.\n\nWhen I was Governor of North Dakota in 2000, our State was producing  less than 100,000 barrels a day. We took that up to 1.5 million barrels  of oil a day. This doesn't just happen overnight. It is because we work  to provide the regulatory certainty to empower innovation…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Mr. Speaker, the law is clear. The science is clear, and the economic  reality is undeniable. The U.S. Geological Survey estimates the coastal  plain contains 10.4 billion barrels of recoverable oil, a resource that  can strengthen America's energy security at a time when geopolitical  instability is rising and global energy demand is surging.\n\nPresident…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…unconstitutional relic that has infringed on  these liberties for far too long. We must take this historic  opportunity to ensure both taxation and registration on suppressors and  short barrels are gone for good.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…under       this title, tow only--\n\n``(i) another vessel or a device, including a bladder,       designed to carry oil or oil residues with the capacity of       less than 250 barrels; or\n\n``(ii) oil spill response equipment, including boom,       skimmers, or other response equipment;\n\n``(B) carry--\n\n``(i) temporary storage containers on board for recovered…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…hydrocarbon  potential of any place on the planet. It is home to the Prudhoe Bay oil  field, the largest conventional oil field in North America, which has  produced over 13 billion barrels of oil since production began in 1977.  On either side of Prudhoe Bay are two Federal areas, one being the  Arctic National Wildlife Refuge and the other being the National…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Maduro's  allies and enablers are united in their commitment to undermine our  Nation: China, Russia, Iran, Cuba, even Hezbollah. Communist China was  buying half a million barrels a day of oil from Venezuela--day after  day, after day. In exchange for that oil, the Chinese Communist Party  loaned Venezuela over $100 billion. Just hours before his arrest,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…land.\n\nNorth Dakota is a top 10 coal-producing State and the number 3 oil  and gas producer in the Nation. According to State estimates, North  Dakota produces 400 million barrels of oil, 1.1 trillion cubic feet of  natural gas, and 27.5 million tons of lignite coal annually.\n\nTo put this in perspective, North Dakota produces enough natural gas  to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…can reliably  produce enough refined products domestically. The Energy Information  Administration projects global demand for liquid fuels to increase by  about 20 million barrels per day by 2050. Alarmingly, over the last  several years, North America has lost an estimated 1 million barrels of  fuel per day due to low refining capacity.\n\nThe last report…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…declined due  to burdensome Federal and State policies.\n\nI know this bitter reality all too well in my home State of  California.\n\nFrom 2020 to 2022, we lost more than 1 million barrels of production  capacity per day, and refinery closures are projected to slash that  capacity by 20 percent over the next year. Twenty percent of our  refining capacity is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Speaker, I rise today in support of H.R.  3109, the REFINER Act.\n\nFor too long, America has fallen behind in refining capacity. In  fact, we have lost an estimated 1 million barrels of fuel per day due  to low refining capacity.\n\nThe Biden administration declared war on American energy by  suspending oil and gas leasing on Federal lands, delaying permits…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697032/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…administration, when this was going on, it was ``drill, baby,  drill'' in New Mexico. New Mexico, with the Secretary of the Interior's  help, increased oil production from 1 million barrels to 2 million  barrels a day on Federal lands. Yet the Senator from New Mexico and the  Secretary of the Interior and Joe Biden said: We are going to shut this  place down.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…predictable, and durable, a process that can't be undone with the  stroke of a pen. The Keystone XL Pipeline should have been a wake-up  call. It would have carried 800,000 barrels of oil each day from Canada  to refineries in the Midwest and Texas. It would have meant real  opportunity for North Dakota communities: more jobs, more tax revenue,  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…interesting that  President Obama, when he--the gentleman from Georgia, Buddy Carter,  mentioned the Keystone pipeline. It would have come into my district in  Texas, 830,000 barrels of oil a day. That is what we are talking about  refining on the Gulf Coast of Texas. If you transfer that to 18- wheelers, it is about 5,253 18-wheeler tankers on the road…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…known as ANWR.\n\nThe 10-02 area of ANWR was specifically set aside by Congress for its  oil and gas potential and is estimated to hold anywhere between 4.25  and 11.8 billion barrels of recoverable oil.\n\nPrior to the passage of the Working Families Tax Cut law, which  requires four lease sales to be held over a 10-year period, Congress  had previously…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Plain  area. The Coastal Plain showed remarkable prospects for oil  development. The U.S. Geological Survey concluded in 1998 that the  Coastal Plain held at least 4.3 billion barrels of technically  recoverable oil, reporting: ``Technically recoverable oil within the  ANWR 1002 area (excluding State and Native areas) is estimated to be  between 4.3 and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}]