[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…coal and gas. It is just very sad.\n\nMadam Speaker, I urge opposition to the amendment, and I yield back  the balance of my time.\n\nMr. MOORE of West Virginia. Madam Speaker, baseload energy in this  country is absolutely quantified and defined by natural gas, nuclear,  and coal. That is baseload energy in this country.\n\nThe reason green energy was ever…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…blows like crazy out  on the ocean; it is highly reliable.\n\nIn fact, Iowa, which has the biggest wind component of its electric  grid, has actually treated wind as reliable baseload energy because  where one turbine might not be spinning, there are plenty of others  that are. So the people who plan for making sure that the lights don't  go out--technical…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…seventies. That was actually true. The person wasn't  lying. It is just that we have figured out a lot of this. It is not  that we don't continue to need dispatchable power or baseload power; it  is that grids are getting really, really smart and capable of handling  high penetration of intermittent renewable energy. And when you layer  them on top of each…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…from  groundbreaking advances in nuclear technology to remotely operated  aircraft, and electromagnetic systems.\n\nFusion energy will provide a source of virtually limitless baseload  power and a clean and safe pathway for true energy security. It is no  wonder countries across the globe are racing to achieve fusion first,  and San Diego is leading the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694165/recognizing-general-atomics"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…coming from adversarial nations like Venezuela.\n\nBusinesses and consumers rely on the affordable and reliable natural  gas underneath our feet. By putting new taxes on this baseload power,  the Biden-Harris administration put the interests of their far-left  base ahead of the needs of the American people.\n\nMr. Speaker, I urge my colleagues to support…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688177/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…technologies we can count on around the  clock.\n\nThis is not a political statement. It is simply a matter of physics.  We don't need to imagine the consequences of retiring these baseload  energy resources. Spain, just a few weeks ago, experienced nationwide  blackouts, and their economy came to a grinding halt.\n\nSpain relied on wind and solar for 80 percent…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…He expanded coal leasing,  rolled back Biden-era rules targeting coal-fired power plants, and  restored commonsense permitting.\n\nCoal remains critical for grid reliability, baseload power, and  national energy security. I am proud to fight side by side with  President Trump to ensure that our miners can go back to work, our  lights can stay on, and our…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…than 20 percent. Together, the  coal industry supports hundreds of thousands of jobs, lifts up small  communities across the country, and provides affordable and reliable  baseload power that helps keep prices stable.\n\nPremature retirements of coal plants are being driven by Federal and  State policies that intentionally attack their financial viability,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…production and 40 percent of overall coal production in the entire  United States.\n\nCoal is reliable and affordable, and we know we are going to need  this critical resource of baseload power as electricity demands  continue to skyrocket. If your State has coal, we should be developing  it, not burying it under bureaucracy. No one produces coal cleaner or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…makes no sense to be closing down any kind  of electrical generation, especially one where the infrastructure is  already built, working, and producing reliable and affordable baseload  power.\n\nMr. Speaker, I urge my colleagues to support Representative Valadao's  legislation, and I yield back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693461/amendment-to-kaweah-project-provision"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…The Colorado Public  Utilities Commission and statewide Democrats have been enacting one bad  policy after another, from shutting down power plants that provide  reliable baseload power to mandating so-called beneficial  electrification which seeks to ban natural gas for residential heating  by 2050. The results have been catastrophic. A nonpartisan…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…supplies,  primarily driven by energy-intensive users such as data centers and  domestic manufacturing.\n\nThe timing of projected demands is occurring as historic levels of  baseload power are leaving the system due to a confluence of State and  Federal actions that have attacked fossil fuels and subsidized  preferred sources of intermittent generation.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…hardworking  families.\n\nMr. Speaker, unfortunately, both the Obama and Biden-Harris  administrations were guilty of using the EPA to promote radical policy  designed to drive out baseload generation in favor of wind and solar,  which simply cannot assure adequate grid reliability. It increases the  risk of rolling blackouts.\n\nH.R. 3616 will correct that very…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…3628 is fuel neutral and focused on attributes that are  essential to reliability and affordability, such as frequency and  voltage support. This legislation ensures that baseload and  dispatchable resources, such as natural gas, hydropower, coal, and  nuclear, are sufficiently considered as part of any 10-year plan.\n\nThere is a road for a diverse energy…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…of modest growth in electricity consumption, the next 5  years could see upwards of 128 gigawatts of new demand. The vast  majority of this demand growth will require new, baseload, dispatchable  power, and natural gas will fill that gap.\n\nUnfortunately, the build-out of interstate natural gas pipeline  infrastructure has faced significant challenges.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…geothermal  resources. Yet, the time it takes to get the permit to build a  geothermal plant is prohibiting us from developing some of the  resources and getting clean, reliable baseload power online that this  country needs now and will need even more in the future.\n\nThese three bills are not all of my bills, but I wanted to highlight  those three today because…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…million acres--nearly 99 percent--of Federal coal, impacting  development at all of North Dakota's major lignite coal mines.\n\nThese restrictions will drive up supply costs for baseload coal-fired  powerplants--costs that will be ultimately passed on to electric  customers across the region. We supply a large region of the Midwest  with electric power.\n\nThis…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…infringe on consumer choice, but  it also increases strains on our Nation's grid, which cannot sustain  such massive and rapid amounts of forced electrification without new,  baseload generation coming online.\n\nPresident Trump, understanding the serious concerns unjustified  energy efficiency standards pose for consumers, issued an executive  order on day…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…intermittent, unreliable sources, often at the expense of on-demand,  dispatchable resources like fossil fuels, have made the grid operators'  jobs nearly impossible.\n\nWe know that baseload and dispatchable power resources provide the  essential reliability services necessary to maintain the stability of  the electric system at an affordable price. This legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}]