[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…new furnace and water heater, but they will not help  in mitigating the toxins and the mold that can be created if they don't  get rid of the water in order to clean out the basement.\n\nIn southeastern Michigan, we have seen that firsthand. We had two  national emergency declarations.\n\nWater damage, as you know, can lead to long-term issues created by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…independent living.\n\nIDEA addresses past failures to educate students with disabilities. I  am old enough to remember a time when students with special needs were  educated in the basement of schools or outright denied entry. Before  IDEA, millions of children with disabilities were denied an education  and often refused admission to schools or even programs.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…``Trump First'' or it might be ``Chevron First,'' but it is not  ``America First.'' And we just saw the revelation that a major donor to  President Trump bought at bargain basement prices a Chevron subsidiary  and can stand to make literally billions of dollars. Should our foreign  policy be about pure profits, as opposed to pure benefit for the  American…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…known around here as being the Ph.D. physicist in Congress.  Before that, I was a manufacturer.\n\nWhen I was 19 years old, my little brother and I started a company in  our basement with $500 from my parents. That company now manufactures  more than half of the theater lighting equipment in the United States.  Our company does hardware, software, sheet…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…exposed to serious health risks like  mold and mildew and moisture damage.\n\nOne of my residents, a 90-year-old woman, had no hot water, a broken  furnace, and toxic mold in her basement.\n\nThere are people recovering from disasters, and many of them are on a  fixed income. They are seniors who cannot afford the thousands of  dollars in repairs to their basement.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694123/disastrous-floods"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…of these people?\n\nWe have heard stories, at least under the Medicaid cut debate, we  heard Speaker Johnson say, well, these are young men who are living in  their parents' basement playing video games. Who are we talking about?  Who are these families who are going to see their health insurance  premiums spike? They are restaurateurs, beauticians, landscapers,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Service agent who  perished on the third floor of an apartment building in 2011.\n\nI rise on behalf of Nathan Flynn, a Howard County firefighter who  tragically died in the basement of a large house fire in 2018.\n\nI rise on behalf of Frederick County firefighter Captain Josh Laird,  who we lost in 2022 when he, too, fell through a floor and into a  basement…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…upon, this position--implementing strategies and  policies that continue to this day. From making constituents feel at  home to battling the rats in the House Office Building basement, Ben  proved there was no challenge he could not face.\n\nBen's unique abilities, professionalism, and dedication are apparent  to all who across paths him. Throughout the nearly…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692875/recognizing-departing-staff-member-benjamin-hong-starr"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the  growth in national enrollment has come from Texas, Florida, Georgia,  and North Carolina.\n\nWho are these folks? They are not the 29-year-old sitting in his  mother's basement playing video games. They are restaurateurs,  beauticians, landscapers, mediators, chiropractors, funeral directors,  farmers, ranchers, freelancers, contractors, and gig…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Faith United Methodist  Chuich on 35 years of spiritual worship and leadership in our  community.\n\nTrinity Faith blossomed from humble beginnings. Founded in 1918 in  the basement of a building under construction on Twelfth Street, just  eleven devoted charter members came together, united by a vision of  faith and service. Their commitment and love…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…for first responders. It is also responsible for  EMS licensing across the State.\n\nThe trauma conference came from humble beginnings. The first  conference was hosted in a basement room. Throughout the years, the  conference grew in size and popularity as a respected source of  education and information.\n\nOver the years, the Office of Emergency Medical…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "John Thune", "party": "Republican", "sentence": "…transparency.\n\nTo hear the Democrat leader tell it, you would think the Senate was  going to start approving nominees in the dead of night, behind closed  doors in the Capitol basement. I didn't notice the Democrat leader  objecting to a lack of transparency when we approved packages of Biden  nominees, some of which probably did happen in the dark of night,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…sitting at home playing video games are going to have to now  go get a job. That is right. By the way, that is a good thing for them.  Their mom doesn't want them sitting in the basement playing video games  anyway. Now it no longer will be crowding out Medicaid for the truly  needy people who deserve it. The disabled people will not be getting  crowded out…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}]