[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the  64-year-old mother who was gardening in New Orleans, the father of  three marines who had been working in the United States for decades, or  yesterday when ICE raided a baseball summer camp. This is not the best  use of our Federal law enforcement agents.\n\nI am a former Federal and State prosecutor. I deeply respect the rule  of law and understand…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…an insult? There is no insult to my children to  learn about Jimmy Doolittle. Why is it an insult to learn about Chappie  James?\n\nWhy is it okay for everybody to enjoy the baseball skills of Jackie  Robinson? It is all right to put his contributions to sports in books.  Before Jackie Robinson ever set foot on Ebbets Field, he was in the  military. He…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Road Youth       Club, Parent: Angela Santizo, Soccer. Braddock Road Youth       Club.                             Dranesville District\n\nMale Athlete: Brady Britt, Football/Baseball, Great Falls       Little League/Langley High School Braddock Road Youth Club;       Female Athlete: Ayla Sayd, Volleyball, Marshall High School/      Coach Khayla Williams,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…amend it. Just pass it.\n\nMr. Speaker, you might think that Republicans might be cautious about  taking financial policy directions from someone who has a side hustle  selling baseball hats and Bibles and who has filed bankruptcy six times  in the past 20 years. Sadly, Mr. Speaker, you would be mistaken.\n\nThis bill significantly weakens the U.S. dollar,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693842/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…memorable moments like Senator Ted Kennedy's  speech in July 1987; then-Senate Majority Leader Harry Reid and then- Senate Minority Leader Mitch McConnell's fireside chat about baseball  in 2010; the first time Senator Duckworth brought her baby to the floor  after Senator Blunt and I worked to change the rules to allow parents  to bring brandnew infants…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…to authoritarianism. What makes  their cowardice and greed so stark is the courage we have seen from  everyday Americans.\n\nWhen ICE agents started interrogating kids on a baseball diamond in  Harlem, Coach Youman Wilder was the only thing that stood between those  agents and his young players. Despite threats, he stood up and told the  agents that they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…with a TASER, repeatedly       shocking her in the face and head. While she was still       suffering the effects of the TASER, he repeatedly hit her in       the head with a baseball bat, punched her multiple times in       the face, and then sexually assaulted her. In 2018, a New       Jersey man threatened his girlfriend repeatedly with a TASER…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…democracy.  He floated in books. Steve was a lifelong student, earning degrees in  literature, history, business administration, and law. He never stopped  learning.\n\nHe loved baseball. Do not get in his way when there is a baseball  around and basketball, as well. He was at one time the ``beloved Little  League coach of Celina, Ohio.''\n\nHe was always reading,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…for sale'' sign flashing its lights  on the lawn of the White House. He is selling access and influence  through two types of cryptocoins: a meme coin which is a digital  baseball card, and he invited the 220 people who gave him the most  money for these digital baseball cards called a meme coin to come to a  dinner where he would feed them at his fancy…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Birmingham, we will have a variety of events including a unity  breakfast on Friday hosted by DA Danny Carr and the League of  Gentlemen.\n\nWe will also welcome Major League Baseball back to Birmingham,  Alabama, for the second consecutive year. On June 19, 2025, Major  League Baseball will return to the Magic City for the 2025 East-West  Classic game…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…remarkable group made local history by advancing all the way to  the 2025 Little League World Series, a testament to their dedication,  discipline, and work ethic.\n\nLike so many baseball fans across the country, I was inspired by  their determination and spirit. They have certainly captured our  hearts. While they may have fallen short of the ultimate prize,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695094/recognizing-clarendon-hills-little-league-team"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…tariff policies. He changes his mind every 15  minutes. Is it 10 percent? Is it 15 percent? Is it 100 percent? Wait a  minute. The Premier of Ontario just ran an ad during a baseball game.  Let's raise tariffs on products from Canada by 50 percent. Is that any  way to run a country? Already, families in Illinois have paid more than  $700 just this year,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…using the unregulated crypto industry  to enrich himself and his family. Three days before he took office,  President Trump launched his meme coin, a novelty item similar to  baseball cards or Beanie Babies. Yet they hold no intrinsic value.\n\nMeme coins are risky and highly volatile. Despite the risk, many  investors purchased President Trump's meme coin,…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…cherished tradition in my district, the kickoff of the Burbank National  Little League season. This year is special as it is the 70th year of  its existence.\n\nAs a lifelong baseball fan, there is nothing quite like watching  young players take the field. Their energy and determination fill me  with joy and hope for the future.\n\nSports are more than just…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689732/congratulating-burbank-national-little-league"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "Ms. SANCHEZ. Mr. Speaker, first and foremost, I congratulate Coach  Roger Williams and the Republican team on their victory in this year's  Congressional Baseball Game.\n\nI have to say that I was very proud of the hard work and dedication  of the Democratic team. We came out, and we played hard. More  importantly, we raised a record…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694188/republicans-win-record-setting-game"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, I rise today to recognize the incredible season  of the Coastal Carolina University baseball team. With grit, heart, and  determination, these young men made the Chanticleer Nation, the Grand  Strand, and all of South Carolina incredibly proud.\n\nThey battled their…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I rise to congratulate the Pierz Lakers  in winning the Minnesota Baseball Association's amateur State  championship.\n\nThe Lakers fought valiantly through the Class C tournament, defeating  the Le Sueur Braves 11-1 to win their first-ever State championship.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694903/congratulating-pierz-lakers"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…they are at record highs.\n\nThat is the kind of enthusiasm that people have, once again, for  America. The chants of ``USA, USA'' will permeate not just, of course,  at the baseball stadium tonight but across America because we believe  that America is back. The respect is back, especially after the  failures of what happened in Afghanistan.\n\nWith this…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I rise today to congratulate the  Aledo Bearcats on their decisive 8-1 victory in the 2025 UIL 5A  Division I State baseball championship.\n\nThe Bearcats concluded a historic season with their second State  title, securing the win for the first time in 11 years. This team began  the season with a…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, Satchel Paige, a great Hall of  Fame baseball player, in 1948 won two games of a doubleheader. When he  was in the locker room talking to the press, the press said: Satchel,  you won both games today. What was your best…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694187/republicans-win-record-setting-game"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…the Country Music Hall of Fame.\n\nHe was born in Knoxville. Kenny is a graduate of Gibbs High School,  which is not a mile from my house, where he had a storied career in  baseball and football. He went on to graduate from East Tennessee State  University, Mr. Speaker.\n\nKenny has cemented himself in American history with his timeless  hits. While I know…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689157/recognizing-kenny-chesney-on-his-birthday"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…students to connect with and contribute to an  ever-changing world.\n\nCompeting in NCAA Division III, its athletic program has won national  and conference championships in baseball, basketball, golf, soccer, and  softball, instilling excellence and pride across generations of  Panthers.\n\nPoint University was originally founded as Atlanta Christian College…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694895/recognizing-lagrange-college-panthers-and-the-point-university-skyhawks"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…national  security, energy independence, and preventing a tax hike of $4 trillion  set to hit at the end of the year if we don't act.\n\nThink of the reconciliation process as a baseball scrimmage. The  House and Senate can't take the field and start crafting the budget  until we step out of the dugout. Approving this framework gets us into  the game.\n\nYes,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689887/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Recognizing Lance Restum\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to recognize Lance  Restum, director of community relations for the Arkansas Travelers  baseball team.\n\nLance has been with the championship-winning Travelers since 2006 and  is the founder of the Arkansas Travelers Youth Foundation.\n\nSince 2021, the foundation has been…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…parish's Knights of Columbus chapter provides even more  opportunities for parishioners to engage in charitable outreach,  sponsoring events such as spring pancake breakfasts and baseball  outings that bring people together in fellowship and service.\n\nIt is my honor to celebrate 75 years of faith, generosity, and  service at Assumption BVM. Bucks County is…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to honor the  Frederica Academy baseball team who won the program's first-ever State  championship this season.\n\nSince 1969, Frederica Academy has earned 76 State titles across all  its athletic programs, except…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Mammoth. They have already hosted the Winter  Olympic Games and are set to host another in 2034.\n\nIf you travel across the State, Mr. Speaker, you will find  communities with baseball fields, football fields, soccer fields,  pickleball courts, tennis courts, swimming pools, ski resorts, and golf  courses. Utahns value sports, and we are good at them.\n\nUtah…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Danny Wild-- until Danny's passing in 2025.\n\nSince 1994, Mac called play-by-play for Brainerd Warriors sports,  covering over 2,000 games in football, basketball, hockey, baseball,  and more. In 2017, he was inducted into the Brainerd High School Hall  of Fame for his remarkable coverage.\n\nOff the air, Colin served tirelessly--co-chairing United Way…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…today in proud recognition of four  Corona High School students, Seth Hernandez, Billy Carlson, Brady Ebel,  and Ethin Bingaman who were selected in the 2025 Major League Baseball  Draft. Seth Hernandez, Billy Carlson, and Brady Ebel were selected in  the First Round on Sunday, and Ethin Bingaman was selected in the  Twentieth Round on Monday. This…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693755/recognizing-seth-hernandez-billy-carlson-brady-ebel-and-ethin-bingaman"}, {"senator": "Julia Letlow", "party": "Republican", "sentence": "Ms. LETLOW. Mr. Speaker, I rise to congratulate the Louisiana State  University baseball team for taking home their eighth national title.\n\nUnder the leadership of Coach Jay Johnson, LSU captured their second  title in 3 years. The Tigers triumphed through their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692910/congratulating-lsu-baseball"}]