[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…include veterans. Many of them are working full time and can't  afford to put food on the table. This benefit helps them provide for  their families.\n\nMy Republican friends have basically gone on an attack on this most  basic, effective program that is about food. You can live without a lot  of things, but you can't live without food.\n\nMr. Speaker, for those…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…we have enforcement ability from agencies like the  Consumer Product Safety Commission, they are not going to mean much  because they require enforcement and investigation. Basically the  agencies are the ones that make sure that this type of legislation is  effective.\n\nI hope that my Republican colleagues will see fit to speak out  against the abolition…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…is about. This is about DOGE  having access to the more than 70 million Social Security recipients  and everybody who, in fact, is on Social Security, which will include  basically the whole Nation.\n\nWhy they need this data they don't make clear, but then again, they  have never been vetted. They have never had to go through a Senate  process. They…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…should not at all discount  how precarious that situation was for our country. It was the result of  a decision by Iran to turn the other cheek, to disregard the attacks  and basically not escalate. I am so glad they did, and the President  showed temperance there himself. But we can't be putting ourselves in a  position where our future and whether we…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…recorded vote.\n\nMr. SMITH of Washington. Mr. Chair, I claim the time in opposition to  the amendment.\n\nMr. SMITH of Washington. Mr. Chair, I yield myself 2 minutes.\n\nMr. Chair, basically, what this amendment says, as the gentlewoman  was saying, is that we are a compassionate nation. She is saying that  she wishes we weren't, basically, and that we need to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…was working on a  clinical trial in measles. The idea was to figure out how to address  the measles outbreak that has just been happening.\n\nOn that front, think about this: Basically, measles had been  eradicated in the United States. At this point, though, last I heard a  few days ago, we have 2,000 people in the United States who are now  suffering…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…will get an $80 million tax credit, and the 25 million  people in this country who are relying on enhanced tax credits so they  won't lose their health insurance, they are basically saying to them:  To hell with you.\n\nThat is where their priorities are.\n\nWe don't share the same values when it comes to making sure the  people in this country have healthcare…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…assets, used one of the tools regulators rarely use--and I repeat:  Rarely is this used--to impose an asset cap on the bank until the bank  cleaned up its act.\n\nWhat it said basically was: You can't keep doing this and making  money. You can't keep doing this and profiting off of the backs of your  customers. You can't keep doing this and getting richer…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…say--when we asked him about the children  starving, the images we had all seen on television, he said: That is  not true. That is a United Nations' narrative.\n\nThen we asked him basically: If there is such a difference of opinion  about what is happening in Gaza, why don't you allow international  journalists to come into this area and report to the world…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…good game. They are  going to be tough on the budget. They are going to make cuts to make  sure we can balance the budget, except they don't. They add another  $3.3 trillion, basically to give tax breaks to billionaires.\n\nWho does that? Who thinks that is a good idea? I don't think I know  any billionaires. I am hard-pressed to find somebody out there who…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…early-stage  startups at points in their life cycle when they are generally deemed  to be too risky for traditional bank financing or for raising money on  the public market. This basically means that if we are going to have a  growing and innovative economy, then we have to have a healthy venture  capital sector.\n\nHistorically, venture capital earns investor…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697192/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…working  together.\n\nSo rescissions, yes. We do them all the time. But they are done on a  bipartisan basis in the spending committee, not in a partisan special  bill, one-sided, basically bailing on the deal struck last year-- because this strategy is a recipe for disaster, destroying the bond of  trust on a deal made with each side having its priorities in…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…shorter hours and longer  lines because they are trying to get a claim that they have earned. Who  tells a 75-year-old, a 68-year-old, an 80-year-old grandparent to go  suck it--basically, figure out how you are going to survive. We are  going to cut all of this from you, but I still want to visit you on  Easter. I don't know what people say. I don't know…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…have a  plan. And our plan is going to be able to be implemented immediately.\n\nWhat is more important than having millions of Americans lose their  health insurance? And then basically say, ``We don't really care about  this, when we already are teetering on so much inflation, so many  affordability issues, so much of people struggling.'' And if people…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President, last week, both the House and the Senate  voted to pass what is known as a rescissions bill. That is a term which  a lot of people aren't familiar with. What it basically means is that  Congress appropriates money, the President signs that appropriations  request into law, and it is the policy which is supposed to guide,  under the Constitution,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, the One Big Beautiful Bill Act,  some say it is the bee's knees. What is the buzz?\n\nBasically, it brings better jobs, bigger paychecks, and booming  communities. The One Big Beautiful Bill Act is about boosting wages,  backing small businesses, bolstering border security,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693038/buzz-from-break-rooms-to-backyards"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…where these resources reside. While they are doing that,  the previous resource management plan would be in existence.\n\nAgain, it is just fear-mongering to say that there will basically be  no rules if this resource management plan gets removed under the  Congressional Review Act.\n\nAgain, I thank the gentlewoman from North Dakota for her leadership  on this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Committee and the members of the House Agriculture Committee  for all the work that they have put in on both sides of the aisle. It  was significant hours for multiple years, basically the last three  Congresses, in thinking through what is the future of digital assets,  how are they best regulated, what is the role of United States  Government in oversight,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things here. I have only had  time to produce a couple of boards from the new CBO report, and then we  will try to tie these into what else is going on.\n\nThis year, we are basically going to spend 3.3 percent of the entire  economy on interest--interest. Once again, this interest number is just  the interest to publicly sold debt.\n\nRemember how I was…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…threatening  military force to people who want to undercut this effort.\n\nHe is taking the oil and selling it and creating an account for the  benefit of Venezuela, which is basically out of money. He is telling  those people who are holdovers from the regime: I want to work with you  to get to where we need to go, which is to rebuild the country and have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…members, all of  them. Their dedication, their endless hours, and their hard work made  this all possible.\n\nI thank the White House Office of Legislative Affairs, who have  basically lived with us now for the last few weeks. Their patience and  persistence and their professionalism is greatly appreciated. Our  country's incredible Cabinet Secretaries…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…bit more of a flavorless type of meat. I like this KC strip  here.\n\nSo, again, the whole concept is what? It is to eat some of these, but  more of these and a lot of these--basically, substituting more protein  for less carbohydrates.\n\nWe spend a lot of time here on the floor talking about healthcare  reform. But this is the biggest day in healthcare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone ever bothers to read them, but you go through there, and it  should light your hair on fire. For the last year, The Wall Street  Journal has done a series of articles basically showing hundreds of  billions of dollars of waste, fraud, misallocation, just misalignment  incentives in something we call Medicare Advantage.\n\nWalk with me through. In…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…majority of what we are talking about. Homeland,  what is that? That is the agencies that take up the lion's share of  this sort of stuff.\n\nAs the chairmen, we would like to basically think that by having  those meetings, talking across the aisle and with our staffs, that what  we have produced is a bedrock model for going forward and getting us  out of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…in Tennessee, was devastated by severe flooding following a levee  failure. The disaster displaced hundreds of my constituents and left  the town of Rives in Obion County basically underwater.\n\nAfter the initial flooding, I visited Rives with our Governor of  Tennessee, Bill Lee, to survey the damage and to meet with local  officials and residents.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Minnesota. Under State Democrats, billions of taxpayer dollars were  stolen by front groups that pretended they were providing social  services. But they padded their pockets. They basically took this money  from vulnerable individuals--programs that were intended for children,  for the elderly, for individuals with autism. So basically, they were  robbing the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…is only one equation, and that is inflation.\n\nLook at the difference between an inflationist and real wage growth.  Those are the two things we have to compare.\n\nThis bill basically takes 2017 and says we have seen this work.  Democrats looked at the tax policy in 2017, when they had the White  House, House, and Senate. They said: We like the standard…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…elections.\n\nDemocrats know this, Mr. Speaker. They must think the American  people, though, have forgotten about their for the politicians act in  the 117th Congress, where they basically codified a COVID-era and  fraud-ridden election law. They included, ironically, prohibiting voter  ID essentially. It also included ballot harvesting, promoting mass  voting…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700003/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…left are: Well, just raise taxes.\n\nI will show over and over here, Mr. Speaker, that if you look at  times when we had high marginal tax rates, low marginal tax rates, we  basically always get about 17 to 18, sometimes 18\\1/2\\, percent of the  economy in tax receipts.\n\nThere is our problem, it is that split. Right now if we are sitting  in the almost…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker, here we are on September 19, House Republicans passed  legislation which would have funded government through November 20.  Here we are on November 12, and we are basically where we would have  been had we just passed the bill that we passed in September.\n\nWhat did we get for all of that? What happened over all these days?  Well, my colleagues…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]