[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "Mr. SCHATZ. Mr. President, I thank the Senator from Rhode Island for  his leadership and his clarity, and I want to underscore one of the  most basic points that has to be made. And this is how times have  changed.\n\nWe have changed what we are talking about because energy systems  change, prices change, needs change, and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…Speaker, I rise today in support of my bipartisan  bill, the Baby Changing on Board Act. This is a simple, commonsense  bill, and it is long overdue.\n\nEvery parent deserves the basic dignity of a clean, safe space to  change their baby's diaper, no matter how they travel. Right now, many  long-distance trains can go for hours without a single stop.\n\nFamilies…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692156/baby-changing-on-board-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…mayor, and he mentioned government-owned grocery  stores. First of all, my colleague won't admit that groceries are too  high and that families cannot afford the cost of eggs and basic good  foods to have great nutrition for their families.\n\nBy the way, let me remind my colleagues of something. My then-husband  was stationed at Camp Carson in Colorado. Mr.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…my colleagues across the Chamber, but it  is clear this Republican leadership is not only failing to deliver on  their promises but they are selling out at the expense of the basic  needs of the American people.\n\nMr. McGOVERN. Mr. Speaker, I don't think we ought to be lectured by  somebody who, over the years, has been the king of government shutdowns…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the President should live up to it, right?\n\nRight.\n\nPeople get that a deal is a deal. It is not a complicated theory of  government or an argument about democracy; it is just basic fairness  that when parties reach an agreement and shake hands, that both parties  have to honor it.\n\nSo what I am looking for very significantly in these discussions is  an…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…here smacks of a bargain: dismissal  of the indictment in exchange for immigration policy concessions.'' He  called Mr. Bove's position ``fundamentally incompatible with the basic  promise of equal justice under law''--a quid pro quo deal. But Mr. Bove  said it was fine.\n\nEven more disgracefully, he said a court cannot review, at all, a  dismissal of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…it.\n\nBut the other reason is the extraordinary process that is being used  to make this change and the impact it would have on the ability of this  body to perform its most basic functions. If passed, this bill would  represent the first time this rescissions process would be used to pass  completely partisan rescissions, and in doing so, we would undo…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…children all across  this country were denied access to schools and educational  opportunities. Federal programs were duplicative and wasteful, and  States regularly violated the basic civil rights of students.\n\nIf our colleagues want to stand with students, want to stand with  schools, and want to stand with educators, then we should be fighting  to protect…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697300/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…engagement. These grants fund critical music and arts programs and  integrate technology into the classrooms so students can develop  digital literacy skills.\n\nFinally, Adult Basic and Literacy Education grants help provide  integrated education and training services that promote essential  skills for the 21st century workforce.\n\nThese are all programs…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…identities are concealed. Most disturbingly, ICE and  Kristi Noem accept no responsibility for the actions of their officers.\n\nWe are discussing reforms now in Congress, and the basic reforms that  should be made are that any Federal Agency, including ICE, should have  to abide by the standards that apply in Alabama or in Vermont to our  local law enforcement…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…They were never there.\n\nFrankly, I don't want to go into this in any great deal or depth  today, but the bottom line is that I and most Democrats believe that  healthcare is a basic right and that we, as a Congress, have a  responsibility to make it so that most people, if not all Americans,  can have health insurance because, otherwise, they can't see…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…over healthcare for  the people who need it the very most.\n\nInstead of expanding Medicaid like we should have done over a decade  ago, Republicans are trying to dismantle this basic-needs program  altogether.\n\nI won't stand by while they try to take healthcare away from Texans  who need it most. I will fight tooth and nail to protect Medicaid, to  protect…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…single member of  the Department of Defense team. This Secretary seems more concerned  with his own public image than the safety of our servicemembers because  he has violated basic security protocols.\n\nWe are talking here about an official who will be responsible for  securing our national intelligence. When this Secretary, in effect, has  jeopardized…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…when  the first strike was taken on the 4th of September, we wrote a letter  to the President, as the article I branch charged with the power of  declaring war, asking him a basic series of questions: Give us the  evidence that these boats were actually carrying narcotics. Give us the  legal rationale for striking them without coming to Congress. If…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the cost of healthcare. It is really not  fair.\n\nNow, let's get back to household electricity. Prices are up 10  percent this year. One in three households is cutting back on basic  necessities just to pay their rising electric bill. People are very  concerned, and they should be, because over 100 gas and electric  utilities are proposing higher rates…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…recognize the  contributions of Mr. Charles ``Charlie'' Webb. Charlie graduated high  school in Colorado in May 1970 and in August 1970 reported to Fort  Knox, Kentucky. for Basic Training and Advanced Individual Training at  the Armor School. He was assigned to the 2nd Armored Cavalry Regiment  in January 1971 in Bind Lach serving as border patrol between…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker, a little while ago you saw a beautiful little baby here.  Last week, when we were here, I had my 2\\1/2\\-year-old that we have  adopted with me.\n\nHere are some basic pieces of math. For my 2\\1/2\\-year-old, when he  is 24, 25 years old, every U.S. tax rate has to have been doubled, all  of them, just to maintain baseline services.\n\nThe whole…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…studies and  legislative affairs, respectively. During his 16-year career in the  Army, Rob served in key tactical and strategic positions. He has  successfully completed the Basic Officer Leader's Course, Air Assault  School, Marine Expeditionary Warfare School, and the Marine Command and  Staff College. Upon commissioning, Rob became a military police…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…honor of  this body is not partisan. It is not Democrat. It is not Republican.  Standing against a convicted predator's influence in our proceedings is  not partisan. It is basic decency.\n\nWe cannot pretend this didn't happen. The American people deserve  better.\n\nMr. NORMAN. Mr. Speaker, before I yield time to my good friend from  Louisiana, to Representative…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…government decisions are  fair, trust that agencies are transparent, and trust that the American  people come before politics.\n\nThe Information Quality Assurance Act reinforces a basic principle.  Better information leads to better policy, and better policy leads to  better outcomes for the American people.\n\nMr. Speaker, I am proud that this effort brings…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700101/information-quality-assurance-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…representative  form of government.\n\nIncreasingly, however, civic knowledge is on the decline.\n\nA recent survey by the U.S. Chamber of Commerce found that 70 percent  fail a basic civic literacy test.\n\nAnother survey found that nearly 17 percent of Americans could not  name any branch of government.\n\nThis should be concerning for all of us.\n\nI would…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693285/civic-education"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…for his storied career in Marion  County.\n\nA native of Auburn, Alabama, Jeffrey joined the U.S. Navy in July  1977 after completing his high school studies. He completed his basic  training in San Diego, California and his first duty station was Naval  Air Station Pensacola where he worked as a plane captain for A-4s and  T-2s. While there he qualified…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…I stand here--as we stand here--uncertain about what this Saturday  morning in August is going to produce, I just had some thoughts. My  first thought seems probably pretty basic, and it is to the Democrats  in the Chamber--specifically, their leadership.\n\nBreaking news: Donald Trump won the election. He is the President of  the United States. You don't…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…soliciting her for various sexual acts. It caused him to  ask himself: What are we doing at these tech companies? Is there no  amount of decency? Is there no respect for the basic privacy and  security of our children? Our children are not safe online.\n\nAnd I also want to say that this bill is based on another important  principle, a simple one, which…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to come  before  this body and say: Oh, we want to give subsidies to people who make  $225,000 a year. That is what they are arguing for. The ObamaCare  subsidies are not the basic subsidies. These are add-on subsidies that  started 2 years ago. If you make $100,000 a year, the Democrats want to  give you $13,000. Meanwhile, people who make $20,000 and…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Slope. It virtually guarantees to set us back on our journey toward  self-determination by requiring further reliance on the Federal and  State government to provide for the basic needs of the people on the  North Slope.''\n\nUltimately, the Biden administration stymied energy production within  the NPR-A and failed to offer leases in a manner that would…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…need have led the Community Food Bank to grow from supplying 1-2  million meals each year to over 5 million nutritious meals and critical  supplies to fill the meal gap and basic needs for over 70,000 of our  neighbors in need. She has taught the entire team to ``BELIEVE that  they will end hunger because they are BETTER TOGETHER!'' With Barbara's…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…input from the public or their elected  representatives?\n\nAt its core, this bill is about ensuring the preservation of personal  financial freedom. The American people have a basic right to financial  privacy. They have the right to spend, save, and manage their money  free from surveillance or interference.\n\nA CBDC would explicitly threaten that right…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "James Risch", "party": "Republican", "sentence": "…requirements. Germany will have no difficulty absorbing these       articles into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractor will be RTX Corporation, located       in Arlington, VA. At this time, the U.S. Government is not       aware of any…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…noncitizens--are actually packing our ballot boxes with illegal votes.\n\nI am more determined than ever to secure our elections, but in an age  of progressive, suicidal empathy, basic concepts such as voter ID and  proof of citizenship have been attacked as suppression. Let me be  clear: Nothing could be further from the truth.\n\nVoter ID, voter identification,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}]