[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…who have been at       my facility for over 4 years, to lost employment       authorizations. CNAs are the backbone of our industry. They       care for our residents' most basic needs, personal care,       grooming, toileting, feeding. These are not jobs that can be       easily filled, and require a personal relationship between       the staff and the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…part of a sacred obligation to ensure  that those who have defended our freedoms can live with dignity,  security, and opportunity.\n\nWhen veterans struggle to meet their basic needs, it is not just a  personal burden. It is a national moral failure.\n\nEnsuring that benefits keep up with the cost of living isn't just the  right thing to do. It is the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…healthcare for  the people who need it the very most.\n\nInstead of expanding Medicaid like we should have done over a decade  ago, Republicans are trying to dismantle this basic-needs program  altogether.\n\nI won't stand by while they try to take healthcare away from Texans  who need it most. I will fight tooth and nail to protect Medicaid, to  protect…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…The link is: https:/ /house.app.box.com/s/xpixugm5qpckl4kxrc4h4u55i3to8roy\n\nMr. Speaker, right now across the country, workers are struggling to  pay their bills and meet basic needs, let alone save for retirement. It  is incredibly hard for workers to do much on their own for retirement  when, according to the Federal Reserve, many would struggle to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…that Congress can act responsibly,  that we can protect our families, that we can deliver on the promises  to ensure that no one has to choose between healthcare and their basic  needs of the safety net that is a contract that we have with the  American people.\n\nMr. Speaker, our constituents are counting on us. Let us not fail  them. Americans deserve…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…lose jobs.  Some won't survive. It's not an exaggeration. It's reality.\n\n``This bill doesn't cut waste. It cuts the heart out of programs that  help Americans meet their basic needs: healthcare, nutrition, essential  services. There's nothing excessive about needing insulin or a  wheelchair or therapy. This isn't luxury. It's survival. My son is on…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to come from.\n\nSadly, we are further from that goal today than we were a year ago.  The Trump administration and the Republicans in Congress have taken a  sledgehammer to basic needs programs that help regular people afford  food. They have completely ignored rising costs and the needs of real  people, instituting the largest cuts to healthcare and food…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…don't have a car, does he understand that?\n\nDonald Trump is in his bubble, and he kept making fun of the word  ``affordability.'' People are struggling. They can't afford basic  needs. And Donald Trump keeps making fun of it by calling it all a  giant hoax. But Americans know affordability is not a hoax. They see it  as very real every time they go to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…of people who will lose access to food under the GOP tax scam.\n\nMr. Speaker, we demand better. It is time for House Republicans to  stand up and join us in protecting the basic needs of the people  instead of  prioritizing massive tax breaks for billionaires.\n\nI stand with Monica.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691425/gop-tax-scam-hurts-women-and-families"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…away from Stephanie's 11-year-old son.\n\nFor what? Why are we doing this? Why are we causing so much pain  across so many families in this country who depend on support for basic  needs?\n\nIt is so that Trump and his friends can have a huge tax cut.\n\nThe other thing that is deeply concerning is we have an incredibly  large deficit, and all the Republicans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…hardworking Americans who just want a fair shot at a better future,  these are the people who stand to lose the most under the Republican  bill.\n\nThese are the folks who rely on basic needs programs like SNAP and  Medicaid. These folks aren't lazy. They don't want something for  nothing. They just want to feed their families and to take care of  their kids.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and affordable child care, and increased funding       for on-campus child care\n\nAccess to early education and pre-kindergarten services\n\nTransportation access\n\nSupport for basic needs, including food, housing, clothing,       etc.\n\nFlexible school attendance policies\n\nLactation accommodations\n\nLess stigma and shame around young parenthood\n\nIncreased accountability…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…future.\n\nThere is no doubt that the aspirations of the people of Cuba are  stymied by their own government. It denies them fundamental human  rights. It does not meet their basic needs. It must do better, much  better, to listen to what people are asking for and address their  concerns in a real way, and our government in the United States isn't  helping.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…may only have a meal to eat  because of WIC or food stamps, or they may live in subsidized housing.\n\nIf tomorrow's servicemembers are worried today about having their  most basic needs met, then they are being held back from their fullest  potential, and that weakens our national security.\n\nIn the bill before us, rather than working with House Democrats…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…It is       our community's lifeline, and we cannot afford for any part       of it to be cut.\n\n(Mr. BANKS assumed the Chair.)\n\nThe Jesuit Conference:\n\nPrograms that meet basic needs such as SNAP, Medicare and       Medicaid, health insurance premium tax credits, and Social       Security should be protected and remain as robust as       possible. We…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…need have led the Community Food Bank to grow from supplying 1-2  million meals each year to over 5 million nutritious meals and critical  supplies to fill the meal gap and basic needs for over 70,000 of our  neighbors in need. She has taught the entire team to ``BELIEVE that  they will end hunger because they are BETTER TOGETHER!'' With Barbara's  continued…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Slope. It virtually guarantees to set us back on our journey toward  self-determination by requiring further reliance on the Federal and  State government to provide for the basic needs of the people on the  North Slope.''\n\nUltimately, the Biden administration stymied energy production within  the NPR-A and failed to offer leases in a manner that would…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}]