[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…many sectors.\n\nIn their time at Rappahannock County High School, they have achieved  a lot of great things, including bringing home a Class 1 State title  for the women's basketball team and winning a Scholastic Bowl regional  championship. Whether on the field, in the classroom, in the drama  club, or as part of one of Rappahannock County High School's…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today to recognize Paige Bueckers  for her accomplishments in women's basketball and for leading the  University of Connecticut women's basketball team to victory in the  NCAA championship.\n\nPaige Bueckers graduated from Hopkins High School in 2020. From an  early age, she was known across Minnesota for her stellar basketball…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689924/recognizing-paige-bueckers"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Robert  ``Bob'' LeGrand, a pioneering figure in Texas basketball who passed  away on July 19.\n\nFrom 1976 to 1987, Coach LeGrand, also known as ``Snake,'' led the  UTA men's basketball team, guiding them to their first 20-win season  and a historic NIT berth in 1981.\n\nSnake was known for his energy, his drive, his showmanship, and his  humor. His legacy goes…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693978/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, I rise today to celebrate a stunning,  dominant victory by the UConn women's basketball team yesterday over a  very good University of South Carolina team by a margin of 23 points,  which actually is lower than really where it was for most of the second  half.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Academy boys, who  finished their 21-4 season when they won the Division 4A championship.\n\nLast, but certainly not least, I congratulate Uniontown's own R.C.  Hatch boys' basketball team. In February, the Bobcats set a new record  for boys' basketball in the State of Alabama when they took home their  11th State title as Division 1A champions.\n\nAs the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I rise to say Go Bulldogs and Go Jaguars,  better known as Malcolm X Shabazz High School's boys basketball team  and Arts High School's girls basketball team, the champions of Newark  Board of Education's Annual Holiday Basketball Tournament.\n\nI wish I had been there to see Arts…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698891/champions-of-newark-board-of-educations-holiday-basketball-tournament"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…was a member of the National Honor Society, the California  Scholarship Foundation, and the National Art Honor Society. She was a  dedicated member of her high school's basketball team that finished  seventh in the Nation.\n\nOutside the classroom, Kendall volunteered at the Ronald McDonald  House and supported the Deaf Mass in Orange County. Clearly,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise today with great pride to  congratulate the Baldwin High School girls' basketball team on winning  the New York State AA State Championship.\n\nOn behalf of New York's Fourth Congressional District, I take this  opportunity to commend and celebrate these young…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689286/congratulating-baldwin-high-school-girls-basketball-team"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…cancer awareness; Jason Jayanth of Academies of Loudoun and John  Champe High School, who tutored students and volunteered at animal  shelters while also playing on the basketball team; and Caitlyn Murphy,  a sophomore at James W. Robinson Secondary School, who swam, played  violin, and created and delivered more than 800 cards for seniors in  local…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…countless organizations.\n\nThanks to Fred Smith, Memphis acquired the NBA's Grizzlies in 2001  when he committed to purchasing the naming rights for the future home  of the basketball team, the FedExForum.\n\nJust 2 years ago, when The University of Memphis was ambitiously  pursuing stadium upgrades for the football team, Fred Smith and his  family committed…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate and recognize  the Linville Hill Christian School boys' basketball team on winning the  Class 2A PIAA Championship on March 28, 2025.\n\nA small Christian school at the rural eastern edge of the 11th  Congressional District, Linville Hill Christian…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689659/congratulating-the-linville-hill-christian-school-boys-basketball-state-champions"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Madam Speaker, yes, we are fired up for March  Madness in northeast Florida, and, no, I am not just talking about the  No. 1 seed Florida Gators basketball team. I am talking about Papa  Seans Pizza in Baldwin.\n\nPapa Seans just sliced up the competition in a bracket-style  tournament held by radio station WQIK. Papa Seans beat…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689287/congratulating-papa-seans-pizza"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…are making a deep run in the  tournament in the men's college basketball tournament this month, they  need to look no further than across town at the East Lansing boys'  basketball team to see another championship team in East Lansing.\n\nThis championship is the result of countless hours of practice and  years of hard work, and it serves as a capstone…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689005/congratulating-east-lansing-trojans"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Kentucky, basketball royalty is a highly coveted currency at the  collegiate level, something that Wayne Martin obtained at multiple  institutions. As head coach of the men's basketball team at his alma  mater Morehead State University (MSU) from 1978 to 1987, he led the  Eagles to two NCAA tournaments. During his stent as head coach and  athletic director…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…tackle new challenges.\n\nI congratulate Makennah on her fourth State title. I wish her the  best in her very bright future.    Congratulating Portsmouth High School Girls' Basketball Team on Ohio                           Division V State Title\n\nMr. TAYLOR. Mr. Speaker, I rise today to congratulate the Portsmouth  High School girls' basketball team on winning…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Peninsula when facing profound economic hardship from  the decline of iron and copper mining industries throughout the 1960s.\n\nOn January 21, 1966, the Bessemer Speedboys basketball team ended a  42-game losing streak, at that time, the longest ever recorded in Upper  Peninsula high school basketball history. Even in the face of such an  arduous stretch,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699253/recognizing-mr-thomas-l-pelissero-for-authoring-bring-one-home"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Congratulating Roanoke Valley Christian Schools Eagles\n\nMr. CLINE. Mr. Speaker, I rise today to congratulate the Roanoke  Valley Christian Schools Eagles varsity boys' basketball team for  winning the 2025 VACA State championship, securing back-to-back titles  and etching their names into school history.\n\nAfter graduating eight seniors last year, expectations…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…beginnings.\n\nAt 16, Doug's family moved from Jonesboro, Arkansas, to Bentonville.  The eldest of three children, Doug was a guard on the Bentonville High  School Tigers basketball team. I had the privilege of watching him play  high school sports with no way of knowing where his dreams and  ambitions would take him.\n\nHe began his career at Walmart as…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school basketball  team in Ohio's Fifth Congressional District. The young women of the  Columbus Grove High School girls' basketball team have represented  their school ably on their way to achieving…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690078/recognizing-columbus-grove-high-school-winning-the-division-vi-state-girls-basketball"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…staff, and the incredible Front Royal  community, Skyline has made history. I am proud to honor their  achievements today.\n\nCongratulating the Spotswood High School Boys' Basketball Team\n\nMr. CLINE. Mr. Speaker, I rise today to honor the incredibly special  achievement of the Spotswood High School Boys' basketball team, which  captured the State championship…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…salute to Bessemer, but the tough, resilient  communities across Michigan's Upper Peninsula and middle America.\n\nMr. Speaker, 60 years ago this week, the Bessemer Speedboys  basketball team ended a 42-game losing streak, at the time, the longest  in Upper Peninsula high school basketball history.\n\nThe people of Bessemer always showed up, cheered, and stood…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699192/recognizing-thomas-pelissero"}, {"senator": "John Rose", "party": "Republican", "sentence": "…feel compelled to do the same.                       Congratulating the Upperman Bees\n\nMr. ROSE. Mr. Speaker, I rise today to congratulate the Upperman High  School boys' basketball team on securing the first State championship  in program history last month. The historic matchup was a nail-biter as  the game was tied up for much of the night. Nonetheless,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Botetourt High School's 2025 VHSL Title Victory\n\nMr. CLINE. Mr. Speaker, I rise today to recognize the exceptional  achievements of Lord Botetourt High School Lady Cavaliers basketball  team, who were recently crowned the 2025 Class 3A State champions.\n\nThe Lady Cavaliers capped an extraordinary 26-3 season by toppling  previously undefeated James Monroe,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school basketball  team in Ohio's Fifth Congressional District. The young women of the  Bellevue High School girls' basketball team have represented their  school ably on their way to achieving…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689987/recognizing-bellevue-high-school-winning-the-division-iv-state-girls-basketball"}]