[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…able  to buy the equipment, the innovative equipment, that it needs to adapt  quickly so that our warfighters can have what they need to meet the  challenges of the modern battlefield. It is way too slow right now, too  many programs, way over budget, and not delivering as advertised.\n\nSpeeding up that process and delivering a better product is an  enormous…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…new medical cures and treatments and  produce them on-demand near the front lines; to engineer biological  sensors that can detect pathogens and chemical threats on the  battlefield in real time; and to better extract critical minerals from  domestic mining deposits, reducing our dependence on China for rare  earth mining.\n\nThat, again, Mr. Chair, is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…internal combustion engine--but think of the national security  implications of falling behind in batteries and advanced manufacturing.  We see in Ukraine that the future battlefield is electrified.\n\nWe need to be pressing forward, not just in electric vehicles and  batteries, but on all fronts. We should be investing in new forms of  transportation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…almost 7 years ago, I came to Congress to  serve my community, my State, my fellow veterans, and the country that  I deeply love in a different way than I served it on the battlefield.  When I put the uniform on as a teenager, I swore an oath to the  Constitution, and I stand here today to uphold that oath.\n\nI came here to represent a State that has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…It is the people  on the other side of the aisle. It is not too late. All we need are  four Republicans to join us and to show John McCain levels of courage,  not on the battlefield as he did in such an extraordinary way. Yes,  John McCain was an American hero and patriot.\n\nHe was an American hero and patriot. I may have disagreed with him on  a whole…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…International law says that is not allowed.  It is a crime to starve a population to get what you want from your  enemy. It is illegal and cruel to starve children to obtain a  battlefield advantage.\n\nYet the Israeli government, under Prime Minister Netanyahu, has said  that it is doing that; that is what it is doing.\n\nIt is so long past time for us to say…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…political ambition over the well- being of those who have dedicated their lives to serving this country.\n\nLet me be clear. Healthcare for veterans should not be an ideological  battlefield. Yet, this bill accelerates the shift to privatized care at  a time when we should be investing in the VA system itself.\n\nVeterans overwhelmingly want to be treated in VA…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…50th  anniversary of Black April.\n\nAs Pulitzer Prize-winning author and one of San Jose's favorite sons,  Viet Nguyen, has written: ``All wars are fought twice; once on the  battlefield and a second time in memory.''\n\nOn this day, 50 years ago, fathers, mothers, sisters, and brothers  looked out across a vast ocean as Saigon was falling behind them. Among…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Martin  Luther King, Jr.'s historic march from Selma to Montgomery in 1965 when  he wore a lei gifted to him by Reverend Abraham Akaka of Hawaii.\n\nIt existed even on the battlefield. Senator Daniel Inouye was a proud  and decorated member of the legendary 442nd Infantry Regiment. He  recalled how he sustained injuries in combat, which resulted in the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688016/aanhpi-history-and-black-history-bonded-together"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…projects each year at  both the Defense Department labs and outside research institutions,  including at many American universities, to study everything, again,  from cancer, to battlefield wounds, to suicide prevention.\n\nIn 2024, $130 million was specifically appropriated in a bipartisan  way in this body--incredibly good Senators of good conscience coming…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…duty to his country.\n\nAfter the war, he continued to serve, answering the call again during  the brutal Korean war. He answered the call. His legacy extended beyond  the battlefield. He became an educator, beloved, a mentor and champion  for the desegregation of the United States military.\n\nThe impact of Harold Brown and his fellow Tuskegee Airmen is…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, H.R. 1550 redesignates Saratoga  National Historical Park as the Saratoga National Battlefield Park.\n\nThe site in Stillwater, New York, marks the location of a critical  pair of battles known as the turning point of the American  Revolutionary War.\n\nAmerican forces…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…breakthroughs are going to begin, breakthroughs that our  automakers are going to rely on, breakthroughs to compete in the global  marketplace, and also breakthroughs to win on the battlefield.\n\nWe are in a race for technological and, frankly, innovation  dominance. These cuts that have come through from the stroke of a pen  in the Oval Office have sincere, grave,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…community, the  Geneva Conventions. It stated that collective punishment is a war  crime; militaries would not be any longer allowed to use food as a  weapon in order to press a battlefield advantage. And war may not be  avoidable, but those waging war have limits on what they can do in  waging even a just war.\n\nSo this is not just about Gaza. If we relinquish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…different  races could serve as comrades in combat abroad, they could live as  neighbors at home.\n\nThe quest for racial equality extended far past the barracks or on  the battlefield, but that same quest for racial equality returned home  with Black soldiers.\n\nI often think about our former colleague, the late Congressman  Charlie Rangel. At the age…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…once fought on by coordinating all travel, lodging,  and transportation. In addition to helping share the stories of WWII  Veterans, he has had the distinct honor of leading battlefield walks  for Iraq and Afghanistan Veterans.\n\nMr. Tarr has demonstrated a steadfast commitment to ensuring that the  sacrifices of our Nation's heroes are not forgotten by…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…wasn't ready to  care for your wounds, seen and unseen.\n\nToday, Vietnam veterans across my district and across the country are  still fighting. This time, the enemy isn't on a battlefield overseas.  It is a silent killer, bile duct cancer, caused by a parasite known as  the liver fluke.\n\nMultiple studies have confirmed what these veterans have suspected…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…accountability. We know that they are here  to steal our secrets. We know that they want to undermine us. As we go  into the next phase of warfare that is not just on the battlefield but  is cyber war and its capabilities therein, we know that China is  aggressive in these spaces. They are in our universities. They are on  our campuses. They want to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the Nation's path toward emancipation,  making his impact felt today at Howard University, which he founded.  The Howard brothers' commitment to freedom spanned beyond the  battlefield by bringing escaped slave George Washington ``Wash'' Kemp,  who served in the Union Army alongside both Howard brothers, back to  Leeds, making it his eventual home.\n\nAnother…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "James Risch", "party": "Republican", "sentence": "…local sustainment       capabilities to maintain high operational rates for U.S.-      provided vehicles and weapon systems. The spare parts will       directly contribute to battlefield effectiveness with higher       overall operational rates, improved logistics, and a reduced       financial burden as a result of a more resilient and rapid       repair…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699891/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…from enclosures or       covered fighting positions. The Javelin missile also has a       minimum smoke motor thus decreasing the likelihood of its       detection on the battlefield.\n\n3. The Javelin Weapon System is comprised of two major       tactical components, which are a reusable Lightweight Command       Launch Unit (LwCLU) and a round contained…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…States Marine Corps, Scott played a  vital role in working with the Department of Defense. Here, he led  teams responsible for providing essential gear to troops on the  battlefield. In 2013, Scott then transitioned into the pharmaceutical  industry, applying his college education and background to become a top  sales representative. Scott focused on…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Iran-backed terrorism  as Hamas brutally murdered over 1,200 innocent people in Israel.\n\nIran has been sponsoring Hamas for years. They were sponsoring  terrorists on the battlefield that I and many of our colleagues  participated in, just as it has been sponsoring Hezbollah and the  Houthis to attack Israel just over this past weekend, amassing  ballistic…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…actors like China, Russia, North Korea, and Iran would gladly seek to  use our very own goods and technologies against us, whether in military  engagements or on the economic battlefield.\n\nAmerica's open, competitive economy has allowed us to become the  global leader in cutting-edge technologies,  but in order to maintain this advantage, we must be able…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…rapidly. Breakthroughs in artificial  intelligence, unmanned systems, hypersonic weapons, next-generation  aircraft, and space-based capabilities, they are all reshaping the  battlefield. At the same time, we live in a political environment that  is too often partisan and divided.\n\nYet on this issue, I believe most of my colleagues agree that we must  confront…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…assessed, over the course of       the last couple of months that Russia has almost completely       reconstituted militarily. And after the initial setbacks on       the battlefield delivered to them by a brave and hearty group       in Ukraine, with the support of China in particular, dual use       capabilities and a variety of other efforts, industrial…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…succeeding in feet rather  than miles, and it is coming at considerable cost to the future of his  country. This is no time to permit him to claim a victory, either on  the battlefield or at the negotiating table. We must share the resolve  of Ukrainian people and make certain that Putin's invasion remains the  blunder it was when it started 4 years ago.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Lomell destroyed the weapons with thermite grenades       and used his rifle butt to smash the sights of the guns.\n\n(9) First Sergeant Lomell subsequently received a       battlefield promotion to Second Lieutenant, and was awarded       some of the       Army's highest honors, including the Distinguished Service       Cross, Purple Heart, and Silver…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 1550) to redesignate Saratoga National Historical Park as  Saratoga National Battlefield Park.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1550\n\nBe it enacted by the Senate and House of Representatives…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…lieutenant and served through the  whole duration of the Civil War with the New York 60th Infantry. And on  a bipartisan visit by a group of Senators to that Gettysburg  battlefield, I was challenged to think anew about what it meant that  50,000 Americans were the casualties of that pivotal conflict on the  fields at Gettysburg.\n\nPresident Lincoln,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}]