[{"senator": "George Whitesides", "party": "Democrat", "sentence": "…moments in history. He served  as a radio operator, one of the Army's most dangerous and essential  roles, and in 1943, as a Tech 5th Grade with the 347th Field Artillery  Battalion of the 91st Infantry Division, known as the Wild West  Division in Italy. He contributed to the Allied victory that preserved  freedom for future generations.\n\nAs we mourn…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699857/in-memory-of-donald-l-kuehl"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…enlisted in  the Navy and became a Navy corpsman, serving on the USS Long Beach  (CGN-9), and her marine detachment, where I was assigned to the Third  Marines 1st Medical Battalion. I was blessed. I lived through two  tours, giving medical care to my shipmates.\n\n``Every other day I was assigned to flight ops to transfer or pick up  the wounded and dead…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…administration in 2000 and a master's of professional studies in  strategic leadership in 2013 from the University of Memphis. She rose  through the ranks as a driver, lieutenant, battalion chief and division  chief, deputy chief of logistics and deputy director until she was  appointed Fire Chief by former Mayor Jim Strickland on January 1, 2016.  In interviews…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…forward and do those things that will make  a difference.\n\nShe was the first Black woman officer in the Women's Army Corps,  commanded the 6888th Central Postal Directory Battalion, the only all- Black, all-female unit deployed overseas during World War II. Stationed  in Europe, her battalion was tasked with clearing a massive backlog of  undelivered…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Black  trained at Marine Security Force School before deploying aboard the USS  Forrestal (CV-59) in support of Operation Just Cause. He deployed again  in 1990 with the 3rd Battalion, 5th Marines to Kuwait during Operation  Desert Shield and Desert Storm.\n\nFrom the beginning, Sergeant Major Black distinguished himself not  only through valor in combat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Committee on Veterans' Affairs.\n\nToday, I rise to recognize one veteran in particular, my great uncle,  Manzo Takahashi.\n\nUncle Mon served in the legendary 442nd Infantry Battalion and gave  his life in service to our Nation on this very day 80 years ago. He  gave the last full measure of devotion while his family, my  grandparents and parents, were…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690036/protecting-the-promise-of-america"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…77th Sustainment Brigade, Joint  Base McGuire-Dix-Lakehurst, New Jersey; The 655th Regional Support  Group, Westover Air Force Base, Massachusetts; The 359th Transportation  Battalion (Terminal), Fort Eustis, Virginia; and Headquarters Company,  55th Materiel Management Center (Theater Sustainment Command), Fort  Belvoir, Virginia.\n\nWhile in command of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…served as an instructor for the  Noncommissioned Officer Academy at Fort Lee, Virginia. While deployed  to Iraq as a Platoon Sergeant and First Sergeant with the 65th Engineer  Battalion, Master Sergeant King earned the Bronze Star for his  leadership and valor. He personally planned and led 72 combat logistics  patrol missions throughout Iraq in support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Fire Department and Kootenai County Fire & Rescue who answered  the call of duty and paid the price for their courage in an act of  senseless and evil violence.\n\nMr. Speaker, Battalion Chiefs John Morrison and Frank Harwood were  not only respected leaders in the fire service, they were pillars of  the Coeur d'Alene community. They were proud husbands,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…modernization work at Fort Knox, leadership roles at Fort Drum  with the 10th Mountain Division, and recruitment duties where he was  recognized as a top recruiter in the Great Lakes Battalion. His  innovations in integrating advanced battlefield  technologies helped propel the Army into a new era of digital warfare.\n\nSergeant First Class Leidlein's service also…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…one serving as a Military Police Officer and  the other as a Combat Engineer. He entered as a Delta 19, which meant  riding motorcycles. He served in the Scout Platoon, 4th Battalion, 64th  Armor during Operation Desert Storm displaying outstanding tactical and  technical skills. His proficiency enabled the Scout Platoon to quickly  in advance friendly…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…earlier--his family has proudly served in the  Newtown Fire Association since 1915. Service is in his blood.\n\nOver the years, Glenn has worn many hats--President, Trustee,  Battalion Chief, Safety Officer. At every level, he's brought steady  leadership, tireless work ethic, and a deep love for this community.\n\nBut Chief Forsyth's public service didn't…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691839/recognizing-chief-glenn-forsyths-50-years-of-service-with-the-newtown-fire-association"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Johnson, North Carolina where he earned the Military Occupational  Specialty (MOS) of 0151 Administrative Clerk.\n\nFollowing his training, Timothy was assigned to the 2nd Battalion,  1st Marines, where he served as an Administrative Clerk. During his  time with the unit, he completed two Western Pacific deployments. His  dedication and preparedness…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Precinct in the South Bronx.\n\nIn 1990, Pieter continued his career by joining the FDNY where he was  later assigned to Engine Company 3 in Chelsea and later transferred to  Battalion 7, serving with distinction until his retirement in 2018.\n\nPieter devoted 45 years of volunteer service to the Blauvelt  Volunteer Fire Company, serving as president, chief…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Army  Military Police Corp/Regiment. During his service, his assignments  included Military Police instructor, Platoon Sergeant, Senior Drill  Sergeant, First Sergeant and Battalion Operations Sergeant. He was  honorably retired in 1995.\n\nMr. Folks came to work for the City of Anniston on April 10, 1995, as  Recreation Leader. In July of 1996, he was…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688463/recognizing-the-retirement-of-steven-d-folks-sr-as-city-manager-of-anniston-alabama"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the School of Infantry.\n\nDuring his military career, Domenico served as an Infantry Rifleman  and later as a Small Unmanned Aircraft System Operator. He was assigned  to 1st Battalion, 8th Marines, Bravo Company, where he served as an  Automatic Rifleman and advanced to become a Senior SUAS Operator. He  later transferred to 6th Marine Regiment Headquarters…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…duty at Camp Pendleton, California in May of  1966 at twenty-one years of age. He served with honor and heroism  during the Vietnam War, serving in the Mortar Battery, 3rd Battalion  13th and 5th Divisions of the Marine Corps. His service instilled a  resilience and commitment to mission and purpose he has carried all  throughout his life.\n\nRichard served…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…there were two special Marine Corps balls that I cared a  lot about. One--the one I really care about--was in Anchorage, AK,  hosted by Delta Company, 4th Law Enforcement Battalion. I was very  honored and set to be there as a guest of honor last night. This is the  Alaska Marine Corps ball. We have such a great time. I have been going  to that ball…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Americans who served in World War II are still living today. The  veterans of the Italian campaign, including my father SSG Raymond Moran  of the 603rd Armament Maintenance Battalion are dwindling in number. My  father dedicated 2 years of his life to the liberation of Italy,  repairing rifles and other small arms weapons under the regular threat  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…duty. Those early assignments prepared him for service in the 75th  Ranger Regiment, where he served as an operations officer and later  commanded the 4th Ranger Training Battalion, helping to shape the  Army's toughest trainees into elite warriors.\n\nThroughout his career, General Mingus was repeatedly entrusted with  greater responsibility. This was…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Operation Enduring Freedom, Marc and I were  in it together.\n\nHe was the heart and soul of our company, Alpha Company ``Wolfpack,''  and the 2-135th General Support Aviation Battalion ``Blackjacks.'' An  amateur photographer and a true patriot who was a 9/11 first responder  and who gave his life to his Nation for more than 30 years, the passage  of this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Tennessee Wesleyan College,       Second Lieutenant Lomell was drafted into the Army, serving       first with the 76th (Liberty Bell) Infantry Division. When       the 2nd Ranger Battalion was formed in April 1943, Leonard       Lomell was invited to be the First Sergeant of D Company.\n\n(5) On D-Day, June 6, 1944, First Sergeant Lomell's platoon       landed…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}]