[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Guard on this important issue.\n\nMadam Speaker, this bill will also strengthen our national security  and support the men and women I met at the Coast Guard Station in Jones  Beach. This bipartisan bill will ensure  that the Coast Guard has the resources that it needs to keep our shores  and our communities secure.\n\nI am especially glad that this legislation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Estate Planning & Elder Law PLC; Legal Aid Bureau of Buffalo;       Legal Aid Justice Center; Legal Key Partnership for Health       and Justice; Leung Law PLLC; Long Beach Alliance for Clean       Energy; Lyons & Salky Law, LLP; Lyons Legal Group; M. Ali       Zakaria & Associates, PC; Margaret Mazanec Law Office, LLC;       Margolis & Cross;…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…at large, and we urge residents  in the area to listen  to guidance from local law enforcement.\n\nThen, just a few hours later, on the first night of Hanukkah, on a  popular beach in Sydney, Australia, two terrorists opened fire on  Jewish Australians who gathered in celebration. At least 15 were  killed, another 29 injured. Among the murdered was a…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…affordable for all Americans because a single mother in Lauderhill who  is rationing her medication to keep the lights on is counting on us.  The disabled veteran in Riviera Beach who is working two jobs is  counting on us. The recent college grad in Tamarac who makes enough  money only to pay rent is counting on us.\n\nWe must deliver and extend the ACA…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698415/we-must-extend-aca-tax-credits"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…solar deployment. Now we are in the top 10. Offshore wind was  nowhere in the United States. Now we are nearing completion of an  offshore wind farm off the shores of Virginia Beach, VA, and we will be  the leaders in the Nation and begin producing components that can help  us lead in the world when it comes offshore wind.\n\nSo where is the emergency? I…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Silencers are not something out of a movie.  They cause real pain in our communities.\n\nIn 2019, a gunman attached a silencer to a handgun that he used to  kill 12 people in Virginia Beach. Survivors of the shooting said they  did not flee because they didn't identify the muffled sounds as  gunshots.\n\nIf the cost of American lives does not move my colleagues…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…reflecting on this lesson in the  wake of the two awful acts of violence that took place this past  weekend.\n\nOn Sunday night, in Australia, hundreds of people gathered at Bondi  Beach to celebrate the first night of Hanukkah. Two men opened fire on  the crowd. The attendees at Bondi Beach were targeted for simply one  reason: They were Jewish, and they were…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…culture of safety and connection in  our schools, one relationship at a time. I thank him and the Cape  Henlopen School District.                      Honoring North Shores Beach Patrol\n\nMs. McBRIDE. Mr. Speaker, I rise today to honor the extraordinary  heroism of the North Shores Beach Patrol lifeguards who, while off  duty, sprang into action to save…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…representation in the workplace. This is unfair,  and it is wrong. Workers deserve the right to make their voices heard  with a union.\n\nMr. Speaker, I was the mayor of my city of Long Beach, California,  before I came to Congress. I am so proud to partner with our city  unions, always making sure that the city and services ran effectively.  Our Federal unions…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…participation in the       Mitigation Response Team to assess and overcome military       impacts from your proposed Revolution Wind project off the       coast of Squibnocket Beach in Chilmark, Massachusetts. In a       letter dated October 27, 2021, the Department of Defense       (DoD) described the potential impacts to military operations       for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…especially hard. In Florida, more than 4 million  people rely on the ACA and face premiums that are doubling or tripling.\n\nA self-employed mom recovering from cancer in Lake Worth Beach is  dropping her coverage as her premium tripled overnight. A 62-year-old  waiter in West Palm Beach is going without insurance because it now  costs more than his rent.\n\nHere…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Moultrie, Fort Sumter, the Reconstruction  Era National Historical Park--six big tourist attractions.\n\nI just read the other day that already tourism and visitations at  Myrtle Beach are down over 15 percent already. Why? Because this is the  time of year that the Canadians come. They aren't coming this year.  Why? Because of this foolishness, this big…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…wrote to us and says: ``I was drafted in  1970. My choice was incarceration or militarization, so I enlisted in  the Navy and became a Navy corpsman, serving on the USS Long Beach  (CGN-9), and her marine detachment, where I was assigned to the Third  Marines 1st Medical Battalion. I was blessed. I lived through two  tours, giving medical care to my…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…propped up, perhaps even fake. And if it loses that  insurance market and Florida is a region in which nobody can get a  mortgage any longer, well, that may be fine for Palm Beach billionaires  who are swapping mansions with their extra money, but for a working  person who has to get a mortgage to afford a house or for a working  person who has a house…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…national  crises. Together, we have worked on projects to reduce storm and  coastal flood risks to protect residents, properties, and  infrastructure. He has overseen vital beach replenishment, dredging,  and flood control projects, working in coordination with federal,  state, and local entities. It has been an honor to work with Joe to  protect our…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…not  only the years he has lived, but the legacy he has built through  courage, service, and unwavering patriotism. On June 9, 1944--his 24th  birthday--Floyd stepped onto a beach in Normandy, France, carrying only  a .45 pistol and a sawed-off shotgun. He was one of nearly 133,000  Allied troops who took part in the D-Day invasion. That historic day…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…determination, the team  demonstrated remarkable resilience by winning four consecutive games to  capture the championship title. I am especially proud to note that Izzy  is from Myrtle Beach and was the only member of the Women's Junior Team  from South Carolina, making her achievement even more meaningful for  our state and the Grand Strand community.\n\nTheir accomplishment…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Mr. BURCHETT. Mr. Speaker, I rise today to honor 21 Christian men who  were murdered for their faith.\n\nIn 2015, ISIS dragged them onto a Libyan beach, forced them to kneel,  and beheaded them on video. In that horrific moment, they did not show  fear. They showed faith.\n\nMr. Speaker, 20 of these men were Coptic Christians…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688172/meaning-of-religious-freedom"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Madam Speaker, I rise today to recognize an incredible  public servant and a great friend, Mayor Marilyn Hatley of Myrtle  Beach, South Carolina, who is retiring after two decades of public  service.\n\nMarilyn has been a constant force for many years, leading with  strength, dedication, and a genuine…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694053/recognizing-mayor-marilyn-hatley"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, I rise today to speak on my  bill designating the United States Postal Service facility located at  1225 Kempsville Road in Virginia Beach as the Colonel Edward Shames  Post Office Building.\n\nColonel Shames was a proud Virginian and a member of Easy Company,  101st Airborne Division, notably featured in the hit…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699640/colonel-edward-shames-post-office-building"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…JT Chevallier, and the entire team at ECO-CLEAN Solutions  for reaching a record-breaking milestone, 1 million square feet of Lake  Tahoe shoreline cleaned up by the team's beach-cleaning robot, BEBOT.  Congratulations to JB Harris and JT Chevallier for this amazing  accomplishment.\n\nJB and JT, two longtime friends from Las Vegas, were drawn to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…they halted the project, and they even  demanded $2 million in fines.\n\nOn top of that, the commission has blocked a desalination plant that  had been proposed in Huntington Beach. It has stood in the way of  housing, contributing to the housing crisis that we have in California,  and it even tried to stop SpaceX from launching rockets out of  Vandenberg.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "John Thune", "party": "Republican", "sentence": "…impacted industries or businesses;\n\n``(III) increases in monitoring and management       expenditures, including costs incurred for event response and       clean-up (such as for beach clean-up following an influx of       biomass or a fish-kill) by public or private sectors; or\n\n``(IV) impacts to subsistence resources, including       nutritional, resource…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…from Jeffery Epstein's private jet.\n\nIn addition, I also requested Ghislaine Maxwell's little black book  and all video surveillance footage from Epstein's residence in Palm  Beach, FL. After years of stonewalling by former Director Wray, we  still do not have all the necessary information regarding Jeffrey  Epstein's crime, who his associates were, and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, I rise today to recognize a  very brave young woman from Virginia's Second District. Vada Carawan is  an 11-year-old Virginia Beach native who recently showed courage beyond  her years when she saved her father's life. On November 23, 2024, Vada  was spending time with her father, Clinton, when he started…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690307/recognizing-vada-carawan"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…wife Diane, and an incredible father to their four sons,  John, David, Michael, and Andrew. In retirement, John will continue to  serve his community, enjoy his summers at the beach, and complete his  10th Boston Marathon.\n\nI want to extend my sincere congratulations to John for his  distinguished career and significant contributions to John Deere--which…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…taxpayer dollars. So we pay higher premiums, and the taxpayer is  getting ripped off as well.\n\nHere are just some recent examples. In November, a Federal jury in  West Palm Beach convicted two individuals in a $233 million ObamaCare  fraudulent enrollment scheme. Earlier this year, the Centers for  Medicare and Medicaid Services identified 2.8 million…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…It has grown from humble roots to a thriving community, celebrating a  strong economy, welcoming neighborhoods, and stunning environment. From  the pristine shores of Vero Beach to the citrus groves of Fellsmere,  Indian River County embodies the very best of Florida living.\n\nMr. Speaker, today, we recognize and celebrate a century in paradise.  I…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694133/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…look at this map, this is an example along the  California coast. These pink areas are national marine sanctuaries. You  have this one zone down here by Morro Bay and Grover Beach, where  cables can actually leave the shore. You can see the concentration of  all of the existing cables in this area.\n\nMr. Speaker, it is possible to put a cable across a…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…as Sergeant Billy O'Leary, who was,  indeed, a giant of a man in northeast Florida.\n\nMr. Speaker, I rise today to celebrate the life of Sergeant Billy  O'Leary, of Fernandina Beach, Florida, a man who dedicated himself to  service, leadership, and community that few people can match.\n\nBilly's passing was tragic and sudden. It hurts. It leaves an  undeniable…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}]