[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…of our budget. That is  more money than we spent on law enforcement, education, science, and  transportation combined.\n\nNow, it is going to get worse because this one big, beautiful bill  coming up is going to explode the deficit so we can give tax cuts to  billionaires and the largest corporations while also slashing Medicaid,  food assistance, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, this so-called big, beautiful bill is  nothing but a big, ugly betrayal of Alabama families and a big handout  to billionaires.\n\nThere is nothing beautiful about stripping healthcare from working  families.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693197/one-big-beautiful-bill-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Madam Speaker, thousands of Minnesotans and millions of  Americans are facing unaffordable healthcare costs. Because of their  cruelly named One Big Beautiful Bill Act and Speaker Johnson's refusal  to act, the Republican majority is creating a healthcare crisis that  will literally dismantle American public health.\n\nAmericans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…effort to reduce the deficit since the  Budget Control Act passed 11 years earlier. But, unfortunately, my  Republican colleagues reversed course again by passing the ``Big  Beautiful Mess'' earlier this summer.\n\nNot only did this bill that was passed here this past summer kick  millions of people off their healthcare and make it harder for families  to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Madam Speaker, for the last 5 months, across the  country, people have been waiting with bated breath to see what this  big, beautiful bill is that the Republicans have been working on behind  closed doors, much of it down in Florida putting it together,  particularly America's healthcare sector. It has…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Weatherization Assistance Program.\n\nSince taking office, Trump has been jeopardizing clean-energy jobs in  Minnesota by terminating clean-energy incentives in his so-called ``One  Big Beautiful Bill,'' canceling grants and illegally withholding funds  from state, local and tribal governments. These actions are stalling  clean-energy projects and eliminating high-wage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…administration urging a reversal of these shortsighted decisions. We  are still waiting for a response.\n\nIn my district, a wonderful, nonpartisan organization called Keep  Indianapolis Beautiful has helped people and nature thrive. They work  with local government, businesses, community groups, and schools to  plant trees, clean up litter, and transform vacant lots…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…President Trump has told his party, don't even bother working with  Democrats. Congressional Republicans wanted to go it alone when they  passed President Trump's One Big Beautiful Bill Act.\n\nThe American people are now finding out it is really a pretty big,  ugly mess, especially when it comes to their healthcare and their  everyday lives.\n\nRepublicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…this is not normal. We have to ring  the alarm bells. We have to praise the 7 million people who got out  there and said: No Kings in the United States. And that is such a  beautiful, short way of saying: No authoritarianism; we  want our Republic back, and we are going to fight to make that happen.\n\nMrs. MURRAY. And we want our voices to be heard. That…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…$6 billion, but making the system healthier and less expensive. So why  do my colleagues on the other side of the aisle not understand that we  can't just cut, in the Big Beautiful Bill, these important healthcare  programs. We can't try to repeal the ACA 70 times and then, all of a  sudden, believe that you can just cut people off of the ACA program…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…damaging U.S.  competitiveness.\n\nMr. Speaker, the links for this analysis and two other analyses are  as follows:\n\nHttps://energyinnovation.org/wp- content/uploads/One-Big-Beautiful- Bill-Senate-Reconciliation- Analysis_July-2025.pdf\n\nHttps://earthjustice.org/wp-content/uploads/2025/08/grid- strategies_cost-of-federal-mandates-to-retain-fossil- burning-power-plants.pdf…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, I have news for insomniacs. Republicans  have scheduled a Rules Committee meeting on their one big, beautiful  bill at 1 o'clock in the morning.\n\nThis is the bill that will cause millions of Americans to lose their  healthcare and nutrition assistance in order the pay for tax breaks…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691511/one-big-beautiful-bill"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…billionaires like  Elon Musk. And even after all these cruel cuts, their budget will still  burden Americans with trillions of dollars in new debt.\n\nPresident Trump's `Big Beautiful Bill' doesn't do anything to address  the high cost of living or fix the economic mess created by the  President's trade war. In fact, it adds more burden for Minnesota…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, in the Republican ``Beautiful For  Billionaires'' bill that Senator Sanders was just referring to, there  were a great many dirty tricks tucked in there to hurt people and make  billionaires wealthier…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…direction.\n\nDespite those numbers, everything that we have seen from this  administration--from its tariff policy raising prices on cars to coffee  to the passage of the One Big Beautiful Bill--or betrayal, as I call  it--that ripped Medicaid away from millions of Americans to finance tax  breaks for billionaires--all of those actions has made the  affordability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…largest tax cut in our Nation's history for  middle- and working-class families, strengthened the farm safety net,  and voted to get our country back on track.\n\nThe One Big Beautiful Bill Act gave a lifeline to the agricultural  community by updating reference prices, expanding crop insurance, and  saving millions of family farms from the death tax. The…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…additional borrowing.  They basically decided that, over the next decade, let's add another  third of debt.\n\nWhat are we going to do? For those of us in the House who give these  beautiful speeches that it is immoral to do this to our kids and crush  people's future retirements, what are we going to do? Are we going to  step up and say: Look, Republicans, we…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and Social Security, but in my district, I will share two  perfect examples of why this legislation really helps people.\n\nThe made in America tax provision in the One Big Beautiful Bill Act,  the working families tax cut bill, resulted in immediate investment. A  $2.5 billion investment in Harrodsburg, in Mercer  County, Kentucky, in my district where…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "Mr. ESTES. Mr. Speaker, I rise today on behalf of the Kansas  families, workers, and small businesses who will benefit from the One  Big Beautiful Bill Act.\n\nBy extending and improving the TCJA, working-class families in my  district will pay $10,900 less in taxes and see increased wages of  $7,200 on average. It contains…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693193/one-big-beautiful-bill-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…in the bay area in a couple  of years, and we will figure out an opportunity to come there. My  family tries to go to California as much as we can. I know he is from  the beautiful bay area. Actually, when I was talking about the high  price of gas, it was down in southern California, which has its own  beauty, as well.\n\nI am a fan of California. Other…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…largest coal reserves in the United States.\n\nMany who are watching, when you think about Montana, you think about  our amazing fly-fishing streams, our national parks, our beautiful  mountains, our wilderness areas, the tremendous hunting and hiking  opportunities we provide, but many don't know that Montana has more  recoverable coal than any State…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696070/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…craft reconciliation legislation  that fully delivers on the promises the President and House Republicans  have made the American people.\n\nMr. Speaker, if we look in this beautiful Chamber, I have only  located one quote from our past that is displayed here, and it is up  above you up close to the ceiling. We are getting close to celebrating  the 200-year…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, I thank Chairman Smith for yielding.\n\nMr. Speaker, I rise in strong support of the One Big Beautiful Bill  Act.\n\nPresident Trump inherited a disastrous open-border policy from the  Biden-Harris administration. There were nearly 9 million encounters at  the southern border…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693161/one-big-beautiful-bill-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…they want to have much of anything to do with  us going forward. We need to be making sure that that is a firm yes  instead of a no.\n\nGreenland is an amazing place. It is a beautiful place. Again, I have  had an opportunity to visit it multiple times. It reminds me of Alaska,  my home State. It is extraordinarily beautiful in so many ways. It is  also,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…this figure of $1.5 trillion? Well, the first  thing the socialists and Congresswoman Ocasio-Cortez is asking us to do  is to repeal the healthcare reforms in the One Big Beautiful Bill. We  just passed them. We just passed them. Here it is, subtitle B, Health,  in the One Big Beautiful Bill.\n\nWe didn't cut Medicaid in the One Big Beautiful Bill. In…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…while  I was able to be home. For the fifth year in a row, I visited all 60  counties in the Big First District, and I had the chance to hear about  the impacts the One Big Beautiful Bill Act will make on our families  and communities.\n\nAs I visited companies and families across the Big First District,  stop after stop, my fellow Kansans expressed their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694904/no-place-like-home"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and  offering strength and clarity through life's many trials and triumphs.\n\nToday, Helen enjoys her daily walks and gathering flowers from the  community gardens to create beautiful floral arrangements for her  suite. A woman of few words, Helen loves sipping a good, hot cup of tea  while reminiscing on her past. Helen's ideal way to spend her birthday…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…to shore up the grid, which will have  positive impacts on the utility bills of Americans. When combined with  what this majority did for energy development in the One Big Beautiful  Bill Act, we are shoring up centuries of energy production.\n\nWe cannot survive in this country without Wyoming coal, the majority  of which is produced in the Powder River…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…advocacy or community. She reminds us that when we support  our veterans and military members, we strengthen our communities.\n\nI am proud to have Lisa Duckworth representing our beautiful State  and thank her for her continued service. I thank Lisa for all she does  to ensure a supportive environment for our veterans in Utah.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695481/recognizing-lisa-duckworth"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the previous administration,  and a nation primed and ready to enter the golden age.\n\nOne of the many strong reinforced byproducts of our Republican vision  is the One Big Beautiful Bill Act. It is one of the most consequential  pieces of legislation that any party has ever passed and for good  reason.\n\nThe provisions interwoven in this legislation are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}]