[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…eldercare, and emergency  response. To protect against this, numerous States have passed laws to  decouple their tax code from the tax provisions in the so-called One  Big Beautiful Bill Act. This includes States like Maine, Virginia,  Pennsylvania, Michigan, Colorado, and Alabama. This also includes the  District of Columbia.\n\nTo avoid a more than $600 million…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "Mr. GOMEZ. Mr. Speaker, it is about damned time that this bill is  actually going to get a vote. Here is why. The Republicans in the  summer passed their One Big Beautiful Bill Act, which I am glad they  are not trying to rebrand anymore. It cut Medicaid by almost $1  trillion. It took away food stamps. Then they refused to extend the ACA  subsidies…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…and put the agency's capacity  to write such a report in doubt. If Republicans are concerned about  energy supply chains, they should start by repealing the One Big  Beautiful Bill Act, which attacked tax credits and programs designed to  strengthen our supply chains.\n\nH.R. 3616 would grant the Federal Energy Regulatory Commission (FERC)  unprecedented…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…used in this reckless manner.\n\nHouse Republicans already passed, and the administration implemented,  unprecedented giveaways to the coal industry through the One Big  Beautiful Bill Act, including slashing the royalty rates for coal from  12 percent to 7.5 percent and opening more than 13 million acres of  public lands for coal leasing.\n\nYet, even with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…lose their  insurance. Everyone else on an ACA plan will pay more for worse  coverage, while billionaires sit comfortably and enjoy their tax breaks  from the One Big Beautiful Bill Act.\n\nRemember in the summer and fall, when Republicans told us that this  wasn't the right time to negotiate these subsidies over the shutdown,  they said: Don't worry.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698373/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, today is June 24, and it is almost exactly  a month ago that in this House, the misnamed One Big Beautiful Bill Act  was passed in the dead of night after hours and hours of debate while  the American people were asleep at home. With the rush of events that  take place every single…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692841/stop-this-insane-attack-on-healthcare-that-affects-every-single-american"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…President Trump has told his party, don't even bother working with  Democrats. Congressional Republicans wanted to go it alone when they  passed President Trump's One Big Beautiful Bill Act.\n\nThe American people are now finding out it is really a pretty big,  ugly mess, especially when it comes to their healthcare and their  everyday lives.\n\nRepublicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Madam Speaker, thousands of Minnesotans and millions of  Americans are facing unaffordable healthcare costs. Because of their  cruelly named One Big Beautiful Bill Act and Speaker Johnson's refusal  to act, the Republican majority is creating a healthcare crisis that  will literally dismantle American public health.\n\nAmericans are being…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…billionaires could pay for everyone's  debt in the United States and still be superrich.\n\nNow, this may have gotten worse in 2025 in large part because of the  One Big Beautiful Bill Act that spent trillions and trillions of  dollars on tax cuts for the superwealthy at the expense of millions and  millions of Americans and that cut over a trillion dollars…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…would make the District of Columbia eligible for  funding under the Rural Health Transformation Program (Program). The  $50 billion Program was established by the One Big Beautiful Bill Act  (H.R. 1). While the Program's title refers to rural health, H.R. 1  permits the Program's funds to be used for health care services,  providers and technology outside…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694752/introduction-of-the-equal-treatment-of-the-district-of-columbia-under-the-rural-health-transformation-program-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…obvious reality, the Education Department's  designation is putting a hard cap of $100,000, with no indexing, on  graduate student loans for nurses, all part of the One Big Beautiful  Bill Act, which my Republican colleagues passed in June. It is a  healthcare monstrosity, which cut $1 trillion from Medicaid, cut out  premium subsidies for 22 million Americans…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…legislation, and I will continue to daylight  concerning provisions buried in it over the coming weeks.\n\nBut today, I want to focus on section 60002 of the so-called ``One  Big Beautiful Bill Act,'' which repealed and rescinded all unobligated  funds from the Greenhouse Gas Reduction Fund. There has been some spin  put on this section, including in court filings.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…established  a child tax credit, increased an existing earned income tax credit, and  decoupled D.C.'s tax code from some of the tax provisions in the so- called One Big Beautiful Bill Act.\n\nThis disapproval resolution would repeal the D.C. law. Let's be  clear: The D.C. law changed only the D.C. tax code. It did not, and  could not, change the Federal…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…uncertainty that has been created by the chaos from this  administration.\n\nMy constituents know exactly that this economic pain and unfairness  stems from the so-called One Big Beautiful Bill Act. You can't fool  hardworking people. They see the truth as clear as day.\n\nYes, there are tax breaks on tips and overtime but only for 3 years.  This is at the same time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695037/temporary-benefits-for-working-families"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…under this  bill would increase household energy costs by more than $100 per year  on top of the cost increases already burdening families under the  Republicans' One Big Beautiful Bill Act, i.e., the big, ugly law.\n\nLet's be clear. H.R. 1949 is a substantial giveaway to major oil and  gas corporations, billionaires, and executives at the expense of  working…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, I thank Chairman Smith for yielding.\n\nMr. Speaker, I rise in strong support of the One Big Beautiful Bill  Act.\n\nPresident Trump inherited a disastrous open-border policy from the  Biden-Harris administration. There were nearly 9 million encounters at  the southern border under…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693161/one-big-beautiful-bill-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Madam Speaker, I rise today to highlight the many ways that Texans,  hardworking families, and small business owners across America are  benefiting from the One Big Beautiful Bill Act.\n\nThis is one of the most profamily, prosmall business, proworker  legislation ever signed into law. As a small business owner myself and  chairman of the House Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today in strong support of the  rule to consider H.R. 1, the One Big Beautiful Bill Act.\n\nThe stakes for the American people could not be higher. We are  rapidly approaching a fiscal cliff. If we do nothing, the Trump tax  cuts, the most progrowth tax reforms…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…time?\n\nToday, we can see the technology that can do it. With artificial  intelligence, it is even quicker. We are here, talking about an AI  provision in the One Big Beautiful Bill Act that stays. No matter what  else they rule out, they seem to find a way for the AI provision to be  there for more surveillance on more people.\n\nWe have got to stop this.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, the One Big Beautiful Bill  Act marks the most significant investment in our farm economy in  decades and delivers the most sweeping reforms to SNAP since the  program's creation.\n\nWe are saving nearly…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693176/one-big-beautiful-bill-act"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, I rise today to highlight the already tremendous impact  of the One Big Beautiful Bill Act.\n\nDuring the August work period, I traveled across all 11 counties in  my district, hitting over 40 stops, meeting with Hoosiers where they  live and work.\n\nI heard from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694794/promises-made-promises-kept"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…a few moments, we will remind the world why the American  experiment still endures today and why its best days are still ahead of  us.\n\nMr. Speaker, with the One Big Beautiful Bill Act we are going to make  this country stronger, safer, and more prosperous than ever before, and  every American is going to benefit from that.\n\nToday, we are laying a key…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise today to highlight how the One Big  Beautiful Bill Act will strengthen and protect Medicaid for those who  need it the most. This legislation focuses on eliminating waste, fraud,  and abuse that have historically plagued…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694200/protecting-medicaid"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, the One Big Beautiful Bill Act,  some say it is the bee's knees. What is the buzz?\n\nBasically, it brings better jobs, bigger paychecks, and booming  communities. The One Big Beautiful Bill Act is about…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693038/buzz-from-break-rooms-to-backyards"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I thank the gentleman for yielding time.\n\nMr. Speaker, today I rise in support of the One Big Beautiful Bill  Act, which includes the work of the House Committee on Energy and  Commerce, to unleash American energy, promote innovation, and protect  healthcare for the most vulnerable…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…these drugs in our  communities. President Trump has done his part to secure our border,  and Republicans will supply him with more resources to do so in the One  Big Beautiful Bill Act. Through the SUPPORT for Patients and  Communities Reauthorization Act, we will combat the existing opioid  crisis in our communities.\n\nI am proud to stand in support…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…minimize it.\n\nWe have known about it for decades, even when we went after some of  the waste, fraud, and abuse in ObamaCare, and guess what. After we  passed the One Big Beautiful Bill Act, the CBO stated that healthcare  premiums would go down as a result of our work.\n\nWe went after Medicaid fraud, especially involving illegal  immigrants. By the way,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…American citizens?  Yet, that is precisely what my colleagues on the other side of the  aisle would wish us to continue to do.\n\nMr. Speaker, let's address the One Big Beautiful Bill Act issue. My  friends on the other side of the aisle are raising the prospect of $3  trillion of additional deficits. I have been very open in my belief  that this bill…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…working in a bipartisan way to build a bipartisan  coalition for this moment.\n\nThere has been a lot of talk, Mr. Speaker, made in this term of  Congress about the One Big Beautiful Bill Act. It is a historic piece  of legislation, no doubt. It is going to supercharge our economy. It is  jet fuel for our economy. They are the biggest tax cuts we have ever…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I thank the chairman for yielding  time.\n\nMr. Speaker, I rise in strong support of H.R. 1, the One Big  Beautiful Bill Act. For too long, government spending has gone  unchecked.\n\nLast November, American voters sent a clear message. We need to rein  in government spending. Our Financial Services…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693152/one-big-beautiful-bill-act"}]