[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…point.\n\nFamilies depend on estuaries for clean water. Fishers depend on them  for healthy stocks. Small businesses depend on them for tourism,  recreation, and the natural beauty that draws people to our coasts.  When estuaries thrive, local communities thrive. The National Estuary  Program makes that possible.\n\nFor more than three decades, NEP partnerships…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Sylmar, we have Nevaeh Cortez' piece, ``Heavy Minded.'' This piece  shows how your inner thoughts can sometimes feel heavy. However, this  piece also shows how to appreciate the beauty in the things that you  find joy in. This piece will proudly be on display in the Cannon tunnel  for the next year.\n\nMr. Speaker, I am proud of all the students who submitted…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692266/congratulating-californias-29th-districts-congressional-art-competition-winners"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…families and this former preschool teacher--someone you might refer to  as just a mom in tennis shoes--who had the final say on how these  taxpayer dollars got spent.\n\nThat is the beauty of America. The people elect this Congress and  their representatives--preschool teachers, doctors, farmers, lawyers,  and even astronauts. We all come together, and we--Congress--decide…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…believe we should strive hard to protect it. It is  so unique. People do want to travel there. But many would like to  ignore the fact that it is a fragile and irreplaceable beauty that  lives along the Coastal Plain in order to search for oil and gas that  may lie beneath.\n\nThe battle has been the subject of many intense congressional debates  for decades.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…grandmother,  Annette.\n\nI had the pleasure of meeting Addelynn and Annette. As you can see,  Mr. Speaker, she uses bright, exciting colors that showcase her  grandmother's beauty and bright smile.\n\nAs the winner of our district's Congressional Art Competition,  Addelynn's artwork will be proudly displayed on the walls of the  Capitol where visitors…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690574/champion-of-the-week-addelynn-ferguson"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…law, Mr. President, every citizen  will be able, in his productive years when he is earning, to insure  himself against the ravages of illness in his old age.''\n\nThat was the beauty of Medicare. You pay into it. It is an earned  benefit, and you can reap the benefits in your golden years.\n\nPresident Johnson went on to say: ``This insurance will help pay…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "…for L'Oreal Paris in the United  States. She continued to foster her passion and built the L'Oreal  flagship brand from a small indie brand in the 80's into the No. 1  global beauty brand worldwide, behind the iconic phrase ``Because I'm  Worth It.''\n\nIn 2008, Carol transitioned from mass to the world of luxury beauty,  taking the helm as U.S. President…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690596/congratulating-the-work-and-dedication-of-carol-hamilton"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Caribbean communities in northwest Detroit, as well as in the  city of Inkster and throughout western Wayne and Oakland County, have  created powerful legacies through food, beauty businesses, fresh  markets, and nonprofits working to care for our families and new  immigrants.\n\nCaribbean Community Services in my district, a nonprofit  organization, has…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…for introducing and reintroducing this bipartisan bill. I urge  everyone to vote ``yes'' on H.R. 359, and I reserve the balance of my  time.\n\nMr. Speaker, it is a thing of beauty to watch Mr. Obernolte and Mr.  Foster legislate together. I have seen it for a number of years on the  House Committee on Science, Space, and Technology. It is one of the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688930/cost-share-accountability-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…have noticed that the signs have been coming       down that used to warn people not to fish or swim.\n\nWe came to Washington committed to respect the great bounty       and beauty of God's creation. We believe very strongly--\n\nReagan said--       in the concept of stewardship, caring for the resources we       have so they can be shared and used productively…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Well, we have had these tools, and deaths in the Presiding  Officer's State, deaths in my colleagues' States, and deaths in my  State have continued to go up.\n\nNow, here is the beauty of the conversation we are having and why we  should be passing the temporary one to let us go back to work, and I  know this because I know his heart and I know your heart.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…generations by the largest body of freshwater on Earth.  Ours is the longest U.S. coastline with numerous ports, energy  resources, cultural endowments, and unrivaled natural beauty.\n\nThe American and Canadian economies are totally intertwined. Robust  supply chains on both sides of our northern border make, grow, and  transport everything from autos to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699953/ending-the-trump-tariff-on-canada"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Science Center for another 5  years, helping to ensure that they are able to continue conducting the  critical research that ensures future generations can enjoy the same  beauty, biodiversity, and economic opportunities for our Great Lakes  for many years.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this  legislation.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…outreach,  ICAN DFW has consistently demonstrated what it means to lead with  purpose and pride.\n\nThe Igbo Day Celebration stands as a vibrant reminder of the strength  and beauty of the Igbo spirit. It is a time to reflect on the Igbo  heritage, honor ancestors, and inspire future generations to carry the  legacy forward.\n\nMr. Speaker, I am proud of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…wealthiest county in America, and that is to say that our auto  industry really had continued into the late 1900s to propel the  economic engine of this Nation.\n\nIt is a thing of beauty because it wasn't the haves and have-nots.  People were making money, not just the executives. Of course, we have a  very strong, vibrant, and incredible UAW, United Auto Workers…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…town had grown to more than 500 residents and had  farms, two sawmills, five schools, a gristmill and limestone quarry.  Centuries later, the town retains the charm and rugged beauty that  attracted the first settlers. The town's economy was originally  dominated by forests and farms. Today, the town attracts outdoor  enthusiasts from throughout Maine and…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…mid-19th century, improved roads  connected Leeds to other surrounding communities that made it a center  for agriculture and, eventually, recreation. Today, Leeds' natural  beauty has led to the rise of boating and fishing on Androscoggin Lake,  turning quaint farmstands into a seasonal retreat in central Maine.\n\nThe proud history of Leeds is etched…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…away. On Tybee Island, vacationers can enjoy the serene  beaches, outdoor activities, and coastal relaxation.\n\nSavannah's distinctive blend of cultural richness and coastal beauty  makes it an ideal destination for newlyweds.                            Honoring Robert Headley\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor Mr. Robert  Headley,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Daily Debt, and it basically does this math for you. It  tells you here is what we borrowed over the last 12 months, and here is  what we have borrowed this fiscal year.\n\nThe beauty of this is you can say: Over the last 12 months, we are  borrowing $74,400 every second. So far this fiscal year, so 4 months  in, we are borrowing $85,000 every second.\n\nStart…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…constitutional oversight over  this Federal District, as it should be.\n\nAs President Trump declared in his March 2025 executive order, if  D.C. won't act, we must, restoring order, beauty, and safety to our  Capital.\n\nThis bill isn't about politics. It is about protecting lives.  Republicans are delivering real reform, tougher accountability,  transparent juvenile…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695562/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…stunning, Mr. Speaker, when you consider everything  that our State has to offer, not only being a place that has a greater  diversity of natural wonders and attractions and beauty than just about  any place on Earth, but it also has so many dynamic and thriving  industries, so many incredible companies and employers. It has such a  rich history of innovation…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Riverview reflects the heart of St. Marys. Its veranda  overlooking the river and its proximity to the ferry for Cumberland  Island connects visitors with the history and natural beauty of our  coastal region.\n\nToday, we honor the Riverview Hotel for preserving tradition,  welcoming families and travelers, and contributing to the vibrant life  of southeast…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…not going to allow that. What  was the reason they cited? It had nothing to do with preserving the  coast, which is their mission. It had nothing to do with maintaining  the beauty of the California coast, one of the most beautiful places in  the world, which is their mission.\n\nNo. The commissioners explicitly said during their meeting that the  reason…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…counties in the entire  country. The county's location, infrastructure, and pro-business  environment are key factors in its expedited growth and in its  development.\n\nThe beauty of Pinal County is diverse. With a landscape including  both mountains and desert valleys, Pinal County is home to the Casa  Grande Ruins National Monument, Picacho Peak, and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Anniversary\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to recognize the  recent celebration of the 100th anniversary of Petit Jean State Park, a  landmark of natural beauty and historical significance in central  Arkansas.\n\nEstablished in 1923 and dedicated in 1925, Petit Jean was Arkansas'  first State park and helped inspire and initiate the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…into a city rich in heritage, resilience, and charm. Over the past  century, Port Richey has served as a gateway to Florida's Nature Coast,  offering a unique blend of coastal beauty, community spirit, and small- town values.\n\nThe city's early founders envisioned a place where families could  thrive, businesses could grow, and the natural environment could…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…expert evaluations of course design,  conditioning, and overall quality, highlighting Georgia as a premier  golf destination. This distinction showcases both Georgia's natural  beauty and wonder in our State's renowned golf courses.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…recognize  the upcoming National Trails Day, a celebration of America's vast and  scenic trail system.\n\nJune 7 is National Trails Day, a call to get outside and enjoy the  natural beauty that surrounds us.\n\nI am especially proud to highlight a true gem in my district, the  Trails at Jakes Rocks, located in the heart of the Pennsylvania Wilds.\n\nThis stunning…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692129/national-trails-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Department has leaked out, making announcements of not only civil suits  but criminal suits, criminal investigations that are going on, maybe  this place should pay attention.\n\nThe beauty of it is, this type of scale for waste and fraud being the  largest in the entire country--remember, our preliminary score from CBO  of Medicare Advantage is $1.840 trillion,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…romance of the West. She loved the open range  and never tired of participating in the cowgirl life from baking bread  to moving cattle. Juli was particularly fond of the natural beauty and  wildlife we are blessed with in Wyoming.\n\nHer fondness for the West led Juli to work towards preserving the  history and legacy of Wyoming, and Juli and her husband, Hort,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687885/recognizing-the-legacy-of-juli-spitzer"}]