[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…following over four decades of leadership and  advocacy in the labor industry.\n\nAfter graduating from Minnesota's own Hennepin Vocational Technical  Education Center, Nelson began his career with the International Union  of Painters and Allied Trades (IUPAT) in 1982.\n\nIn 1992, Nelson began the first of numerous leadership roles, when he  was elected as a trustee…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…PETTERSEN. Mr. Speaker, I rise today to recognize Annette Stolba  of Buena Vista, Colorado for her 42 years of service with the Chaffee  County Communications Center.\n\nAnnette began her career as a public safety dispatcher in 1983 before  911 emergency services were available. Over the next 40 years, Annette  helped countless Chaffee County residents in their…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688126/recognizing-annette-stolba"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…lifelong educator  whose 36 years of service in public education have profoundly shaped  the lives of students, families, and educators across California.\n\nParvin Ahmadi began her career as a classroom teacher in San Jose  before taking on administrative roles in Fremont and ultimately serving  as Superintendent of the Castro Valley Unified School District…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…husband, father, son, and  brother, Chandra was the embodiment of joy and a well-lived life. He  was a pillar of every community and organization that he was a part of.\n\nHe began his career as a network engineer before transitioning into  cybersecurity. Over the past 20 years at Visa, he rose to become  director of cybersecurity, where he not only was a respected…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…to recognize the service of  Orange City Fire Chief Sean deMetropolis, who is retiring from the city  of Orange after 30 years of stellar service.\n\nChief deMetropolis began his career in 1995 and worked his way up to  be fire chief. In addition to serving our community, Chief deMetropolis  also stepped up to serve our great country by serving on FEMA's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…dedication to ensuring that low-income children, children of color, and  students with learning disabilities received equitable access to  learning and support.\n\nJoAnne began her career in Ohio, where she served in Title 1 schools  as a Primary Language Development Specialist and later as a Library  Media Specialist. Her talent for instructional leadership…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Jewish communal life, and progressive social change.\n\nAfter earning her B.A. from City College and a Master's in Health  Services Administration from the New School, Anita began a career that  would span urban planning, public health, and groundbreaking social  advocacy. From her early work at the New York City Planning Department  and Montefiore Medical…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…and in  the bay area, and a wonderful human being, a dedicated public servant  from Walnut Creek, California, in the East Bay of the San Francisco  Bay.\n\nGwen Regalia began her career as a fourth grade teacher--she was a  teacher all her life in many ways--before serving on the Walnut Creek  School District governing board for almost a decade.\n\nGwen…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697386/recognizing-gwen-regalia"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…over 50 years at United Missionary,  enjoying the choir and participating in various church activities.\n\nAfter attending Jones Commercial in downtown Chicago, Mrs. Pough  began her career at the Illinois Department of Public Aid, which later  became the Illinois Department of Human Services. Mrs. Pough worked for  the Department for nearly 47 years and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…moved to the Little Village  neighborhood of Chicago in the 1960s and never left. After earning his  citizenship in 1977, Representative Garcia graduated from college and  began his career in public service with a community-based housing  initiative.\n\nSince his time as a member of the Chicago City Council, the Illinois  State Senate, and Cook County Board…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…days, and then that was  followed by an appointment by the judges of the court. But his initial  appointment into the role was by the Trump administration.\n\nMr. Siebert began his career as a DC police officer and then served  for 15 years as a prosecutor in one of the most important positions in  the U.S. Attorney's Offices nationally.\n\nSenator Warner…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…15 years, let us celebrate the work he  has done to defend workers' rights, raise workplace standards, and  expand union access across numerous industries.\n\nMr. Thomas began his career in the labor movement with Laborers Local  264 in May 1996, earning promotions to Laborer Foreman and Crew  Supervisor. In these positions, he was responsible for managing…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Ms. Maryam Azarion has given over 26 years of her career to  serving our Nation's veterans and advancing scientific innovation  across the federal government.\n\nMaryam began her career as a microbiologist and inventor before  finding her way to the law and federal service. She has dedicated her  professional life to making government a force for good,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…Mr. Barron earned his Juris Doctor from the prestigious George  Washington University Law School in 1999 and earned admission to the  Maryland Bar that same year. He began his career in public service as  an Assistant State's Attorney in Prince George's County in 2001,  primarily prosecuting violent crimes, before transferring to Baltimore  City in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…worked to uplift vulnerable populations  throughout her life in my community in the East Bay of the San  Francisco Bay Area and throughout the State of California.\n\nGwen began her career as a teacher in Louisiana, working with high  school students seeking vocational services.\n\nShe later moved to the San Francisco Bay Area where she served Contra  Costa…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692306/recognizing-gwen-watson"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Deputy Chad Blair of the Sacramento  County Sheriff's Office for his unwavering commitment to serving and  protecting the community of Sacramento, California.\n\nDeputy Blair began his career in 2019, working in the Investigation  Service Unit where he collaborated with the California Department of  Corrections and Rehabilitation to gather intelligence from…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…more than just  accomplishments, they are the foundation of opportunity for countless  Texans.\n\nHis impact on the community spans beyond Lamar State College. Johnson  began his career as an officer in the Houston Police Department, where  he served in a variety of patrol and administrative positions before  retiring from a 20-year law enforcement career.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…teacher at Copper View Elementary  School in the Sahuarita Unified School District.\n\nTiffani received her bachelor of arts and masters from the University  of Arizona and began her career in general education, later finding  that her true passion resides in special education. Fifteen years  later, Tiffani has now taught in three Arizona school districts,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Mr. SCALISE. Mr. Speaker, this week, we say good-bye to a longtime  member of my staff, Lauren Fine.\n\nLauren began her career here on the Hill on the Senate side with  Senator Joni Ernst before coming over to the House and joining Team  Scalise, where she has worked with me for over the last…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694933/recognizing-lauren-fine"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Literature from the  University of California, Santa Barbara, Terry became increasingly  drawn to the copywriting and music industry. Born into a family of  salesmen, Terry began his career in broadcast as a sales representative  for two stations in Santa Barbara--99.9 KTYD-FM and 990 KBLS-AM. As a  testament to his sales development, leadership, and organizational…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691791/recognizing-the-service-of-mr-terry-fahy-on-the-occasion-of-his-retirement"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…dedicated himself to faithfully serving our  community.\n\nA native of Gunter, Sean earned his bachelor's degree in Agricultural  Economics from Texas A&M University and began his career as a claims  adjuster for State Farm Insurance and equipment salesman. For over 25  years, he has distinguished himself through public service as a  volunteer firefighter,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…County Chamber of Commerce.\n\nSince joining the Chamber in 1980, Susan has been instrumental in  supporting business and leadership development in Lower Bucks County.  She began her career in the Chamber's front office, supporting groups  such as the Golf and Transportation committees and the Miss Bucks  County Scholarship Pageant. Over the years, Susan…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…president and CEO of the WellSpan Evangelical Community  Hospital in Lewisburg, Pennsylvania. Kendra retired earlier this month  after 30 years of dedicated service.\n\nKendra began her career at Evangelical Community Hospital in the  early 1990s. Kendra left the hospital for a position at Capital Blue  Cross, but returned in 1999, and stayed there ever since.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698973/congratulating-kendra-aucker"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Kate O'Connor Harper  for her service to the House Committee on Energy and Commerce.\n\nA native of Chicago, Illinois and a graduate of the University of  Chicago, Kate began her career as a Staff Assistant for Senator Mark  Kirk (IL) before becoming Legislative Assistant and Correspondent for  Senator Dan Sullivan (AK). In 2018, Kate joined President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695125/recognizing-kate-oconnor-harper"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…July 2025, Major Fregoso exemplified the Army's  core values of duty, honor, and selfless service, leaving a lasting  impact on every unit she served with.\n\nMajor Fregoso began her career as a Medical Logistics Specialist with  the 349th General Hospital and later served with distinction in the  349th Combat Support Hospital and the 349th Field Hospital.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…college, Emily volunteered her time as a Court  Appointed Special Advocate in Lexington and served as an intern in my  Washington, D.C. office. Upon graduation, Emily began her career in  Washington, D.C. and joined my team to serve the constituents of  Kentucky's 2nd District as my Staff Assistant in the summer of 2024,  where she gave phenomenal tours,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Education from DePaul  University in 2011. While completing her Masters of Art/Ph.D in  Measurement, Evaluation, and Assessment from the University of  Connecticut, Kristen began her career in Washington, D.C. as a Student  Trainee for the U.S. Government Accountability Office before becoming  an Analyst and Senior Analyst. In March 2023, she joined the House…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691958/recognizing-kristen-pinnock"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Jake Tyner for his  career in the United States Congress.\n\nA Towson, Maryland native, Jake began his career in Washington, D.C.  in 2016 as Director and Associate Policy Counsel of the Global Energy  Institute for the United States Chamber of Commerce after receiving his  bachelor's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Chihuahua, Mexico, and immigrated to the United  States at a young age. She attended school in Rosemead, California, and  became a naturalized citizen at 18 years old. Carmen began her career  as a night attendant for American Airlines and worked as a ticket  office manager. She co-founded Steve Roberts Custom Builders, a very  successful home design and construction…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…president of the Civil Service Employees  Association who passed away this week at the age of 46.\n\nBorn in Flushing, Queens, Anthony graduated from New Paltz High  School and began his career at SUNY New Paltz in 1999. Not long after,  he stepped up as a union activist in CSEA's SUNY New Paltz Local  working as a shop steward and grievance representative, driven…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}]