[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise with profound gratitude and  humility as I begin my service on behalf of Virginia's 11th District.\n\nAs a lifelong Northern Virginian, I am honored by the trust my  community has placed in me. I am deeply grateful to my wife,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695221/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…when we are home.\n\nHere is what people forget, though. I know in Nevada we already don't  have enough providers in Medicaid. We don't have enough providers in  the program to begin with.\n\nExpanding the number of healthcare providers in Nevada really has  been a priority of mine. That is why I am leading legislation-- bipartisan legislation--with my colleague…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…programs  by hundreds of billions of dollars in order to pay for tax breaks for  the billionaires club.\n\nLet's look at another claim by Donald Trump:\n\nThe next economic boom will begin the instant . . . Donald       J. Trump has won 4 more years.\n\nThat is his quote. He said:\n\nThe next economic boom will begin the instant . . . Donald       J. Trump has won…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is America. This is  unacceptable.\n\nA uniformed code of conduct will rein in aggressive and excessive  immigration enforcement to bring about accountability and, hopefully,  begin the long process of restoring trust. When the immigration agents  fail to follow the code of conduct, the Department of Homeland Security  must coordinate with State and local…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…came on. And you have to get way out here before the price spikes when  those polluting, expensive, fossil fuel plants have to come on at 80- plus megawatts of load to even begin to match the prices from 6 years  earlier.\n\nClean wind and solar power save consumers money. So when the Trump  administration says it is going to inhibit, hinder, injure clean…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…watershed that has been producing  minerals without incident. I am beginning to worry that my colleagues  don't understand basic hydrology and how water flows and moves. To  begin rebuttal, I include in the Record two articles on New Gold:\n\nhttps://www.northernontariobusiness.com/ industry-news/mining/new-gold-fined- for-2016-discharge-772366\n\nhttps://www.tbnewswatch.com/local-news/new-gold-inc-fined-100000-…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…million in energy and conservation funds that would  be withheld from farmers in my district.\n\nIf you want to put the American people first, we must reject this  debacle and begin on a real bipartisan basis to pass a budget that fits  the American people.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688104/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…anti-environment  lobby, the fuel and oil and gas lobby--that has so infiltrated and  permeated our government, including, now, the Environmental Protection  Agency.\n\nAnd so let me begin by highlighting for people who care, and that  should be everyone. It really should be everyone who has children, who  will inherit the mess we are creating. It should be everyone…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…cases  and dismantle these exploitation efforts.\n\nMrs. McBATH. Mr. Speaker, when the law is clear, justice can move  more swiftly and more effectively, allowing  victims to begin the long process of healing with the knowledge that  their government is standing with them and for them.\n\nThis legislation is about protecting the most vulnerable among us.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698896/child-predators-accountability-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…poetry competition was different than all the other poetry competitions  we have had with pages. First of all, they were recalcitrant. Very few  of them even participated, to begin.\n\nSo we did something we never, ever did before. We extended the  deadline, and then I bullied and badgered--I admit this on the Senate  floor. I bullied and badgered some…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…fraud-free system. In Colorado,  we are the first State in America to complete a risk-limiting audit,  the gold standard for verifying the integrity of election results to  begin with, and it entails counting and comparing a representative  sample of ballots to the reported result.\n\nTo prevent hacking, none of our voting machines are attached to the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…children and motherhood. All of us should be  coming together about this maternal health crisis, but what is  happening now, again, is the very program that has helped us to begin  to address this is under attack.\n\nWhen we invest in Medicaid, we are investing in the future. Children  will grow up to be healthier, and seniors will age with dignity in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…going to fight any  effort by our President or my colleagues on the other side of the aisle  to put barriers in our way and to remove the very policies that help  save lives to begin with.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…the painful.\n\nErasing history doesn't make it disappear. It makes us more likely to  repeat it. History shows us in this country and around the world that  when governments begin scrubbing uncomfortable truths from public  spaces, they are often moving toward something darker and more  dangerous.\n\nPeople don't visit our national parks to not only marvel…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…behalf of a grateful Nation, I offer my deepest thanks and best  wishes to Sergeant Major Troy Black, to 1st Sergeant Major Stacie  Black, and to their entire family as they begin this well-earned new  chapter.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that we are now paying more for interest on the national debt  than we are on defense, in a very dangerous world--perhaps the most  dangerous since World War II.\n\nSo we have to begin the process of controlling our spending, and the  only way we do that is by looking at everything that the Federal  Government spends.\n\nThe Federal Government spends about,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…what actions the Biden  administration took or did not take that risked their safety. At this  afternoon's hearing, we will give the American people the answers or at  least begin to give them the answers that they and we deserve.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…additional 30.\n\nMining them here is better for our economy, our national security,  our allies, and the environment. H.R. 4090 will help close America's  mineral production gap and begin to end our dependence on foreign  minerals.\n\nMr. Speaker, I urge my colleagues to support this commonsense bill,  and I yield back the balance of my time.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and whatever their American dream may be.\n\nI want to take some time today to talk about how Republicans' agenda  is at work in my home State of South Dakota, and I want to begin with  the tax relief that Republicans have delivered.\n\nWhether I am visiting a small business in Isabel, SD, or talking to  farmers at Dakotafest, higher prices are a concern…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…70 percent of the cost of your apartment building, of  course the building becomes more lavish, which, of course, makes the  property developer wealthy as well.\n\nAnd you can begin to see, as we work our way through here, that the  developer is the big beneficiary here.\n\nThen what happens is the building is sold to a syndicate of a variety  of wealthy…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…on the appropriations bills for fiscal  year 2026. We have got a looming deadline of January 30 that is fast  approaching. And I think it is good news that we will be able to begin  that process to advance this next minibus, these three bills--my  Interior subcommittee appropriations as well as CJS, and Energy and  Water--be able to advance those.\n\nBut…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…we can ensure  only America and its allies lead in the development and maintenance of  this technology.\n\nI urge my colleagues to support Representative Kean's fine bill to  begin this process of protecting this critical and vulnerable  infrastructure.\n\nMr. BAUMGARTNER. Mr. Speaker, the Undersea Cable Control Act will  ensure America, not the Chinese…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…maiming of livestock and in the  failure of the government to properly pay the costs of its decision to  reintroduce the wolf.\n\nI will address the lack of management first. Let me begin my  discussion of failed management by showing several pictures, which are  graphic illustrations of the reality that my ranching families face all  too often.\n\nMr. Speaker,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…we learned the tragic news that there were no  survivors. Of those who perished, seven were Kansans.\n\nKiah Duggins, a civil rights attorney and a Wichita native, was set  to begin teaching at Howard University School of Law.\n\nLindsey Fields, a professor at Butler Community College and the  president-elect of the National Association of Biology Teachers,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…comprehensive       and uniform method for documenting test outcomes, identifying       root causes of failures, and categorizing types of       vulnerabilities detected;\n\n(2) begin conducting quarterly analytical reviews of covert       testing data to identify trends, recurring deficiencies, and       opportunities for operational improvement across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…for working families. I hope our Democratic colleagues will join us in  those efforts.\n\nThis budget resolution kicks off the reconciliation process and  allows our work to begin. Once adopted, our committees and the entire  House will begin detailed work to achieve these important goals for the  American people.\n\nMr. Speaker, this rule also provides…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…bill that I have offered  with the gentleman from California (Mr. Liccardo) that does a temporary  extension with reforms and cost controls to provide runway, so then we  can begin the real hard work of fixing our healthcare system in this  country.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…their  own districts know exactly what I mean.\n\nFor communities that have been impacted by disasters, it is critical  that they have timely access to the support they need to begin the  recovery process and get their lives back on track.\n\nThis also, Mr. Speaker, includes regulatory relief. Filing season can  be long, and it can be burdensome for many…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…bill does exactly that. It permanently reschedules fentanyl and  its analogues as a schedule I narcotic, and it gives our law  enforcement agencies the tools that they need to begin dealing with  this problem.\n\nThat is why I am proud to be a cosponsor of the House version of this  legislation, and I urge my colleagues to vote in support of it.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Hortmans' two children, now left without  parents, and all their loved ones. At the same time, I continue to hold  Senator Hoffman and his wife, Yvette, in my prayers as they begin the  long and difficult  road toward healing. Their survival is nothing short of a miracle, and  I thank God they remain with us today.\n\nI am also thankful to all of our brave…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}]