[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Lydie Ngoie and the members of Trinity Faith United Methodist  Chuich on 35 years of spiritual worship and leadership in our  community.\n\nTrinity Faith blossomed from humble beginnings. Founded in 1918 in  the basement of a building under construction on Twelfth Street, just  eleven devoted charter members came together, united by a vision of  faith and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…foster this growth  of product delivery that speaks to the quality of life of people across  this great world.\n\nWe as a nation have been a leader. I think back to the humble  beginnings of this Nation. In the 1800s, there was a development of the  Erie Canal in upstate New York that is still looked to as perhaps the  first tech corridor.\n\nThe eastern mouth…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…proud to reflect on the deep roots this company has in  our state through the history and legacy of Northwest Airlines. Founded  in 1926, Northwest Airlines grew from humble beginnings into a global  carrier headquartered in the Twin Cities. Northwest played a central  role in shaping Minnesota's economy, creating tens of thousands of  good-paying jobs,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…before on the floor of this body on the fundamental  importance of public education in my own life, having come here as an  immigrant speaking no English from very humble beginnings.\n\nI thank my teachers at Kaahumanu Elementary School, Koko Head  Elementary School, and especially the librarian at Koko Head Elementary  School who awakened my love of reading.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…has  nurtured generations of Stockton families, offering not only a place of  worship, but a community rooted in compassion, justice, and shared  purpose. From its earliest beginnings in the aftermath of the Civil War  to its continued presence today, the church has grown alongside  Stockton, adapting and expanding to meet the spiritual and civic needs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…said. The fourth freedom is a freedom from fear,  which in our country of great wealth, no one should fear their  healthcare going away.\n\nWe have known from our country's beginnings and throughout that we  must do all we can to provide for our people, and we have tried to do  that over the years from the Social Security Act of 1965, which created  Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…us to discover more about the nature of subatomic  particles known as neutrinos, which could help us understand  fundamental questions about the origins of matter and the beginnings of  the universe. It will also search for previously undetected modes of  proton decay, the subject for which I received my Ph.D. thesis many  moons ago.\n\nThis legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…celebrate his remarkable and purposeful  life was held on Saturday, February 7, 2026, in Dawson, Georgia. Born  August 17, 1946, in Dawson, Georgia, John Bowens grew from humble  beginnings into a leader whose steady hands and steady heart guided a  community for more than three decades.\n\nI have had the honor of representing many remarkable public servants,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Esperanza in  Morro Bay, California. This was followed by the first permanent  Filipino settlement in the United States in St. Malo, Louisiana in  1763.\n\nSince those early beginnings, our Filipino American community has  grown to nearly 5 million people and is the third largest Asian  American and Pacific Islander group in the United States. Many of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…education  in my own life. As an immigrant from Japan, I arrived in this country  speaking no English.\n\nI started off by trying to learn how to count from 1 to 10--very  humble beginnings. But it was the public education I received at  schools like Koko Head Elementary and Kaimuki High School that enabled  me, an immigrant from very humble beginnings, to learn…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Sacramento County Fire Protection District.\n\nToday, Metro Fire is a vital safeguard for the lives of over 720,000  Sacramentans across a 359-square-mile area. From humble beginnings, it  has evolved into one of the largest and most responsive fire agencies  in California, operating 41 state of the art fire stations  strategically positioned across the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Mr. CORREA. Mr. Speaker, I rise today to recognize Charlie Zhang for  his philanthropy and his induction into the Orange County Hall of Fame.\n\nCharlie comes from humble beginnings. He came to this country  penniless and unable to speak English but with a dream. With hard work,  he started a number of businesses, and he achieved the American Dream.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689745/recognizing-jessie-echaury"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…with integrity and a profound commitment to upholding the rule of law.\n\nWhether it was expanding others' understanding of the judicial  system, celebrating families' new beginnings through National Adoption  Day events, or demonstrating compassion in the Scotts Bluff juvenile  drug court, he exemplified a judicial career built on the conviction  that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699724/recognizing-and-thanking-judge-james-worden-upon-his-retirement"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Texas.\n\nFounded in 1873 during the turbulent years of Reconstruction, St.  Mary's has stood as a steadfast place of worship and community for a  century and a half. From its beginnings under the leadership of Dr.  Thomas S. Denny and a small group of faithful families, the church  persevered through frontier hardships, local feuds, floods, and  economic…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…founded on February 10, 1971, when Mr. Harvey L.  Hall began responding to medical aid calls from his home in Bakersfield  using a single Cadillac ambulance. From these humble beginnings, Mr.  Hall built a trusted emergency medical service by forging strong  relationships with patients, emergency room nurses, physicians, and  public safety personnel throughout…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…officer of Fortune 1,  Walmart, in Bentonville, Arkansas.\n\nDoug's is a story of incredible American success. Much like the  company he has led, his journey started with humble beginnings.\n\nAt 16, Doug's family moved from Jonesboro, Arkansas, to Bentonville.  The eldest of three children, Doug was a guard on the Bentonville High  School Tigers basketball team.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Daniel Flores has made to our community through his  work with New Beginnings Youth Shelter, which serves homeless kids aged  10-17 who are between foster homes; abandoned, or homeless. The whole  team jumps in to take care of the kids who have no…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690224/recognizing-daniel-flores"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…critical training, support, and  continuing education for first responders. It is also responsible for  EMS licensing across the State.\n\nThe trauma conference came from humble beginnings. The first  conference was hosted in a basement room. Throughout the years, the  conference grew in size and popularity as a respected source of  education and information.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Felicia Jones has made to our community through her  work with New Beginnings Youth Shelter which serves homeless kids aged  10-17 who are between foster homes, abandoned, or homeless. Led by  Felicia, the whole team jumps in to take care of the kids…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690657/recognizing-felicia-jones"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…opened its doors in 1919 after  being founded by C. W. Taubert, an immigrant from Germany who grew  enamored with the cowboy spirit and the allure of the West.\n\nFrom its beginnings as a hardware store catering to the local  agricultural community, Lou Taubert has grown to be a cornerstone of  the Casper community. Now, over 100 years later, it does…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699737/recognizing-lou-taubert-ranch-outfitters"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…friendship between teachers and pupils would be  encouraged, and where a boy would be prepared not only for college, but  for life beyond high school.''\n\nFrom those humble beginnings, Solebury School opened its doors in  rented quarters in September 1925 with just four boys and four  teachers. One year later, the founders purchased the historic Michener…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Carol Smith has made to our community through her  work with New Beginnings Youth Shelter, which serves homeless kids aged  10-17 who are between foster homes, abandoned, or homeless. The whole  team jumps in to take care of the kids that have no…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690147/recognizing-carol-smith"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Cutler, an early settler from  Massachusetts, is a beacon of Maine's nationally renowned beauty and a  stronghold for Maine's traditional lobstering sector. From its humble  beginnings to a booming fishing industry, Cutler remains a great pearl  of the State of Maine.\n\nDuring the mid-19th century, Cutler Harbor fostered substantial  growth in the town's…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699424/200th-anniversary-of-the-town-of-cutler"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…County and starting with just seven acres  and a mobile home, they built both a ranch and a family--raising two  daughters, Rebecca and Audra--while transforming their modest  beginnings into a thriving cattle operation spanning thousands of  acres. Together, they built Mazak Ranch into a successful cattle  operation with land in both Florida and Texas.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and, most importantly, unite.\n\nI am proud to join my colleagues in supporting a resolution  recognizing today, September 17, as Constitution Day, highlighting our  Nation's beginnings as we approach our 250th anniversary.\n\nMr. Speaker, let us celebrate the principles that make our Nation  great on this Constitution Day.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695645/recognizing-constitution-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Krystal Martinez has made to our community through  her work with New Beginnings Youth Shelter which serves homeless kids  aged 10-17 who are between foster homes, abandoned, or homeless. The  whole team jumps in to take care of the kids that have no…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691063/recognizing-krystal-martinez"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Pricilla Cruz-Seado has made to our community  through her work with New Beginnings Youth Shelter, which serves  homeless kids aged 10 to 17 who are between foster homes, abandoned, or  homeless. The whole team jumps in to take care of the kids that have…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691746/recognizing-pricilla-cruz-seado"}]