[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…children and motherhood. All of us should be  coming together about this maternal health crisis, but what is  happening now, again, is the very program that has helped us to begin  to address this is under attack.\n\nWhen we invest in Medicaid, we are investing in the future. Children  will grow up to be healthier, and seniors will age with dignity in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…not only felt in Washington, D.C. They affect all of  our constituents.\n\nJust a few months ago, states across New England, including my state  of Connecticut, were ready to begin an ambitious and collaborative  effort to increase energy transmission capacity across our region, to  build resiliency and lower energy bills.\n\nNearly $400 million was going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…necessity of Ukraine winning the  war  against Russia's invasion. I will be joined by Congressman   Mike  Quigley of Illinois and Congresswoman Madeleine Dean of Pennsylvania.\n\nAs I begin, please let me remind the President of our country, our  Vice President, and Secretary of State that freedom means never  surrender. Liberty must never capitulate to dictatorship.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…which marks the adoption of the Universal Declaration  of Human Rights in 1948.\n\nAfter the atrocities of World War II, world leaders understood that  large-scale abuses do not begin with mass violence. They begin when  governments cut off basic rights, freedoms, and silence their own  people. The declaration was an effort to build a more stable and  predictable…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Government, 1 percent.\n\nWe do a lot of trade with Canada, and in Florida's 21st District, the  chairman's district, exports to Canada support 1,650 jobs. Many of them  will begin to lose their jobs. This is about affordability. This is  about job creation and the economy. I wonder what he is going to say to  those 1,650 people in Florida's 21st District.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…with the  Department, and our school districts repeatedly sought engagement. We  were ignored.\n\nOver the holidays, the Department informed us that the cuts were  final and will begin immediately.\n\nOver the next 3 years alone, schools in our district will lose  millions of dollars promised and planned for. The program has already  shown positive educational…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…administration accountable for the terror that they are forcing  families to live through each day.\n\nMr. Speaker, I am glad that Benjamin is home, and I hope he and his  family can begin the healing process.\n\nWelcome home, Benjamin.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697953/benjamin-guerrero-cruz-is-home"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…primarily due to financial constraints.\n\nThis bill would revise certain repayment terms to provide additional  flexibility for local stakeholders to help finance the project and  begin delivering clean, reliable water to rural communities.\n\nMy Democratic colleagues and I are committed to addressing the  barrier that rural communities face in securing clean…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693877/finish-the-arkansas-valley-conduit-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…History Month  is not just an opportunity to reflect on our past, but it is certainly  an opportunity to uplift our present and renew the cause to fight for  our future.\n\nI begin with a story because Black History Month is often thought of  as a time to recognize those historical figures that we all know: the  Martin Luther Kings of the world, the John…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…hateful agenda that has taken hold.\n\nDr. King devoted his life to reminding us that silence in the face of  injustice is not an option. As he so powerfully said: ``Our lives begin  to end the day we become silent about the things that matter.''\n\nThe Congressional Black Caucus refuses to remain silent in the face  of the pain this administration inflicts…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…from my Republican colleagues who  have expressed pride in this accomplishment. I ask the question: If  Republicans were so proud of this one big, ugly bill, why did debate  begin at 3:28 a.m. in the morning?\n\nRepublicans are once again, Mr. Speaker, as has been the case through  every step of this journey, trying to jam this bill through the House…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…the painful.\n\nErasing history doesn't make it disappear. It makes us more likely to  repeat it. History shows us in this country and around the world that  when governments begin scrubbing uncomfortable truths from public  spaces, they are often moving toward something darker and more  dangerous.\n\nPeople don't visit our national parks to not only marvel…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…from the great State of Ohio,  the very honorable Marcy Kaptur.\n\nMs. HOULAHAN. The gentlewoman is very welcome. It is my privilege.\n\nMr. KENNEDY of New York. Mr. Speaker, I begin by thanking my friend  and colleague, Representative Houlahan, for convening this Special  Order.\n\nMr. Speaker, I rise today to support our ally, Ukraine, and speak up  against…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…behalf of a grateful Nation, I offer my deepest thanks and best  wishes to Sergeant Major Troy Black, to 1st Sergeant Major Stacie  Black, and to their entire family as they begin this well-earned new  chapter.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Washingtonian, Ms. Manatt graduated from the University of  California, Berkeley, where she studied political economy. After  graduation, she returned to the District of Columbia to begin her  career in public policy and international affairs.\n\nMs. Manatt served as a professional staff member on the House  Committee on Foreign Affairs, where her portfolio included…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that we are now paying more for interest on the national debt  than we are on defense, in a very dangerous world--perhaps the most  dangerous since World War II.\n\nSo we have to begin the process of controlling our spending, and the  only way we do that is by looking at everything that the Federal  Government spends.\n\nThe Federal Government spends about,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…taxpayers  would see their taxes go up if Democrats had their way and the  temporary tax provisions in the Tax Cuts and Jobs Act had expired.\n\nBut it is important for us to begin to chip away at that national  debt. I have said, time and time again, that we are spending more money  on interest on the national debt than we are on defense, which is an…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…additional 30.\n\nMining them here is better for our economy, our national security,  our allies, and the environment. H.R. 4090 will help close America's  mineral production gap and begin to end our dependence on foreign  minerals.\n\nMr. Speaker, I urge my colleagues to support this commonsense bill,  and I yield back the balance of my time.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…been invoked, the motion the Democrats just voted against. It would  have meant open debate, further deliberations, further modifications.  But the Democrats refused to even begin that debate.\n\nI don't know what Democrats would change about the process this bill  has gone through. It had a 3-hour markup in the Banking Committee that  considered 40 amendments.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690892/genius-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…think our education would improve if we had kids who  are doing a better job of focusing at school?\n\nIt is high time, in the second bill that this Congress passes, that  we begin to address this problem. We can't address it by giving every  married couple $25,000 a year because we don't have that kind of money  and would probably only encourage more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…on the appropriations bills for fiscal  year 2026. We have got a looming deadline of January 30 that is fast  approaching. And I think it is good news that we will be able to begin  that process to advance this next minibus, these three bills--my  Interior subcommittee appropriations as well as CJS, and Energy and  Water--be able to advance those.\n\nBut…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…we can ensure  only America and its allies lead in the development and maintenance of  this technology.\n\nI urge my colleagues to support Representative Kean's fine bill to  begin this process of protecting this critical and vulnerable  infrastructure.\n\nMr. BAUMGARTNER. Mr. Speaker, the Undersea Cable Control Act will  ensure America, not the Chinese…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…maiming of livestock and in the  failure of the government to properly pay the costs of its decision to  reintroduce the wolf.\n\nI will address the lack of management first. Let me begin my  discussion of failed management by showing several pictures, which are  graphic illustrations of the reality that my ranching families face all  too often.\n\nMr. Speaker,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…we learned the tragic news that there were no  survivors. Of those who perished, seven were Kansans.\n\nKiah Duggins, a civil rights attorney and a Wichita native, was set  to begin teaching at Howard University School of Law.\n\nLindsey Fields, a professor at Butler Community College and the  president-elect of the National Association of Biology Teachers,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…comprehensive       and uniform method for documenting test outcomes, identifying       root causes of failures, and categorizing types of       vulnerabilities detected;\n\n(2) begin conducting quarterly analytical reviews of covert       testing data to identify trends, recurring deficiencies, and       opportunities for operational improvement across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…simple governing  philosophy: freedom of choice, fiscal responsibility, regulatory  clarity, and a government that focuses on the American people, not  bureaucracy.\n\nLet me begin with the appropriations package. Beginning with H.R.  6938, the Commerce, Justice, Science; Energy and Water Development; and  Interior and Environment Appropriations Act of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…bill that I have offered  with the gentleman from California (Mr. Liccardo) that does a temporary  extension with reforms and cost controls to provide runway, so then we  can begin the real hard work of fixing our healthcare system in this  country.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…their  own districts know exactly what I mean.\n\nFor communities that have been impacted by disasters, it is critical  that they have timely access to the support they need to begin the  recovery process and get their lives back on track.\n\nThis also, Mr. Speaker, includes regulatory relief. Filing season can  be long, and it can be burdensome for many…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…bill does exactly that. It permanently reschedules fentanyl and  its analogues as a schedule I narcotic, and it gives our law  enforcement agencies the tools that they need to begin dealing with  this problem.\n\nThat is why I am proud to be a cosponsor of the House version of this  legislation, and I urge my colleagues to vote in support of it.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…has already coordinated with  the municipality of Anchorage to rezone the land in anticipation of  this project. Once the bill is signed into law, construction can and  will begin immediately.\n\nThis is a commonsense measure that supports Tribal self- determination. It empowers a proven provider to serve its community  with up-to-date infrastructure.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}]