[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…other Cryptocurrencies, which       are not money, and whose value is highly volatile and based       on thin air. Unregulated Crypto Assets can facilitate       unlawful behavior, including drug trade and other illegal       activity.\n\nThat is a quote from the President in his first term. Once the  President figured out how to personally make this…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President has threatened the possibility of additional strikes in  Venezuela if Venezuela does not ``behave.'' And by ``behave,'' I think  we have to acknowledge that the behavior the President expects is for  that country to share access to its oil wealth with American oil  companies. Many of those companies are dubious about investing in  Venezuela.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…dangerous people. We also don't spend enough time trying to unwind  some of the reasons young people, in particular, get into lives of  really risky and potentially violent behavior.\n\nSo we came together in 2022, and we passed the Bipartisan Safer  Communities Act. It was a big bipartisan vote. It wasn't close. The  final tally was 65 to 33, with nearly…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Roll Call No. 287, H.R. 2659--The Strengthening Cyber  Resilience Against State-Sponsored Threats Act; and\n\nYea on Roll Call No. 288, Table H. Res. 878--Disapproving the  behavior of Representative Jesus G. ``Chuy'' Garcia of Illinois.                             PERSONAL EXPLANATION", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696780/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…papers they have.\n\nThis is not the America that I learned about as a child or that I  taught about as a social studies teacher. This is what we learn about  when we study the behavior of dictatorships and how they rule with fear  and oppression. I ask my colleagues to believe your eyes, not the lies.  This is what we are seeing and experiencing in Minnesota,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…will be, what the Miranda warnings may be, this is totally unusual. The  ICE agents are making it all up. They are ignoring the law and ignoring  the Constitution.\n\nIn the behavior characteristics of the Trump administration, people  find only silence when they asked what happened to that person just  swept up off the street.\n\nThe family had to resort…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…message as intended. I think that it will cause him to  become a greater bully and to do more and say more things that are  unacceptable to try to normalize his dictatorial behavior.\n\nIt is dictatorial in that he believes that the law should be followed  when he sees the law on his side and that it should be somehow avoided  when it is not.\n\nMr. Speaker,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…of time you examine, IPOs from about $30 million up to  about $200 million are always subject to a 7 percent fee. Now, all of  us who observe markets know that that is odd behavior in what should be  a competitive market.\n\nThis is money, of course, that goes to the investment banks that  underwrite these IPOs. I know this because I spent many years working…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693905/middle-market-ipo-cost-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…revere and, notwithstanding recent events, that I  have great respect for.\n\nMr. Speaker, I rise today in response to a censure, a censure that  took place as it relates to my behavior. I have been told by some that  they did not have an opportunity to hear the actual resolution as it  was read. I have here H. Res. 189, the censure resolution as it relates…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…The President was not censured for calling Members lunatics  at a joint session of Congress. He has not been reprimanded in any way.  We have allowed him to normalize his behavior.\n\nI was censured. I had to stand in the well. I accepted my punishment.  I accepted it. I never criticized the notion that it was improper for  me to be removed. I did say…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…been audited, 0.3%       were found to have issues. Half of that was reclaimed. That       is not an enterprise that has been, you know, utterly driven       by, criminal behavior.'' Dr. Atul Gawande, former Assistant       Administrator for Global Health, USAID                cuts are increasing health risk for americans\n\n``The safety of Americans…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…necessary to hold officers accountable           for serious misconduct\n\nBefore the Act, D.C. had no effective mechanism to remove       officers who engaged in egregious criminal behavior. A 2021       audit revealed that at least 64 officers were found by       internal investigators to have committed criminal misconduct.       The department attempted to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…damaged one of the most  successful small business capital access programs in the Federal  Government. By giving the SBA the tools and authority it needs, we can  root out bad behavior and minimize fraud without punishing loan agents  that are acting in good faith on behalf of their clients and helping  small businesses access the capital they need to grow.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691856/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…better manage students and students better manage their  finances.\n\nNamed after STEM High School's mascot, Beak Bucks allow teachers to  award points to students for positive behavior in the form of paper  money that they can redeem for prizes, but Kaxten, Bastian, and Luke  felt this was inconsistent and susceptible to forgery and fraud.\n\nTheir app, Eagle…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698016/champions-of-the-week-kaxten-mcgrew-bastain-nowak-and-luke-hinkelman"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…in our country.\n\nMs. PELOSI. Mr. Speaker, going to the Supreme Court for that means  that ``cruelty'' has not even come close to the word that is needed for  that kind of behavior. This is the worst President for children that  America has ever seen.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696718/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…burdens on       claimants, we concluded that the manual met CRA's third       exception.\\46\\\n\nIn contrast, rules that are directed at and primarily       concerned with the behavior of non-agency parties do not fall       within this category.\\47\\ Thus, in B-274505, Sept. 16, 1996,       we declined to apply CRA's third exception to a Forest       Service…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Advocate Enhancement Act gives the NTA the  authority to hire her own lawyers, who will report directly to her,  rather than be accountable to the IRS, the very agency whose behavior  the advocate exists to scrutinize and defend against.\n\nThe American people have a well-founded fear of the IRS given its  dismal track record of violating the rights of taxpayers.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…100 people were detained and arrested for criminal  activity. There was trafficking of adults and trafficking of children.  There were drugs. There was all sorts of illicit behavior there.\n\nThe men and women of the El Paso County Sheriff's Office, the  Colorado Springs Police Department, the Drug Enforcement  Administration, and many others worked hand…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…used to monitor and restrict its  citizens' spending. The data is being used to develop a social credit  system that rewards or punishes individuals based on their spending  behavior.\n\nIn Canada, the former Trudeau administration demonstrated the power  of Federal financial surveillance and control when it froze the bank  accounts of hundreds of truckers…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…environment.\n\nInstead, $660 million was spent on people who came here illegally.  That is a substantial amount of money, and we  will never get it back. Again, it rewards bad behavior.\n\nHow the system works is very frustrating. Mr. Speaker, if you pay  taxes in America, you are paying for illegal immigrants to get  healthcare, whether you like it or not.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…justice--hopefully so--as he goes through our  court system.                                     NATO\n\nMr. President, I am also here to talk about what I think is  amateurish behavior with respect to the treatment of our NATO allies.  It has to start with an interview that I saw with one of the  President's senior policy advisers, Stephen Miller, on CNN,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…imposing new burdens on claimants,       we concluded that the manual met CRA's third exception.\n\nIn contrast, rules that are directed at and primarily       concerned with the behavior of non-agency parties do not fall       within this category. Thus, in B-274505, Sept. 16, 1996, we       declined to apply CRA's third exception to a Forest Service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…imposing new burdens on claimants,       we concluded that the manual met CRA's third exception.\n\nIn contrast, rules that are directed at and primarily       concerned with the behavior of non-agency parties do not fall       within this category. Thus, in B-274505, Sept. 16, 1996, we       declined to apply CRA's third exception to a Forest Service…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of  thousands of them are dangerous individuals who have committed crimes  in their home countries, who are trafficking narcotics, and who have  been engaging in criminal behavior in the United States of America.\n\nWhat do my Democratic colleagues do? They stand up in defense of  criminals, of criminal illegal aliens, and are in constant attack on  the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…trajectory, it promises enhanced people-to-people ties, military  cooperation, and encourages an improved bilateral relationship.\n\nThe United States should reward partners for good behavior. This bill  is not an attack on the Georgian people. It seeks to support them by  punishing rogue officials who are taking them further away from the  United States.\n\nThe…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…eligible for Federal funds,  full stop. The message is straightforward and simple to education  administrators who don't understand the concept of American patriotism.  This behavior will not be tolerated and no longer subsidized by the  American taxpayers.\n\nUnder this Republican majority and this Trump administration,  American education will be protected…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…military facilities  in hospitals and schools and in mosques, they use the people of Gaza as  human shields, and they steal the food the  people of Gaza need. It is despicable behavior. These are not good  people, and it is in the interest of America and the world to see this  terrorist group destroyed.\n\nI couldn't agree more with my colleagues who want…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694433/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…are trying to maintain power over their people  after this attack. People in Iran are getting fed up with the  Ayatollah. Instead of listening to the people and changing the behavior  of the regime, the regime is engaged in a terror campaign of  extrajudicial killings, imprisonment, and beatings to suppress the  people. And I think this body and the civilized…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…country who are born out of  wedlock. It did not happen by accident. It happened because the Great  Society programs in the 1960s were designed to encourage this sort of  behavior.\n\nMadam Speaker, you may say, who wants to discourage people who are  married from having children?\n\nIn fact, Karl Marx, of course, was very opposed to the traditional  family.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…reserve banks, such as the Fedwire Funds Service       and FedNow Service;\n\n``(viii) the impact of mobile banking and instant       communications technology on depositor behavior and liquidity       risk posed to financial institutions, including how the       discount window can--\n\n``(I) help financial institutions better respond to rapid       liquidity…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}]