[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…served our country honorably in the United  States Army from 1950 to 1953 during the Korean Conflict.\n\nIt has been said that ``Education is the passport to the future; it  belongs to those who prepare for it today.'' Cliff dedicated a  significant part of his life to preparing young people for their  futures, embarking on a distinguished 41-year career…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…actions fully and  hold accountable those responsible for unlawful killings carried out in  the name of the United States.\n\nThe Constitution is clear: the power to authorize war belongs to  Congress, and Congress alone. No President gets a blank check to wage  war by decree. That is why today, I proudly voted for two War Powers  resolutions to block further…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…and funds corruption. It is brazen and disgusting and an  effort to legalize corruption. Anyone who votes for this CR is  complicit in that corruption.\n\nIf government still belongs to the people and not the powerful, then  we must reject this self-serving scam.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696697/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…words. This is cheating. It is cowardice. If we allow  it, we are telling Missourians that their voices don't matter. Our  democracy doesn't belong to partisan mapmakers. It belongs to the  people.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695339/missourians-serious-concerns"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…history, to  redefine whose histories count, whose languages count, whose cultures  count, whose identities count, whose personhood counts, whose very  civil rights count, and who belongs in this great country.\n\nWe see it in this Chamber this week with a GOP that is trying to roll  back the voting rights of Americans across the country, and we see it  in the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Promoting partisan legislation that fails to address the full  healthcare needs of students does not promote academic success.\n\nAgain, Mr. Speaker, this is a decision that belongs to the pregnant  student, not to Members of Congress.\n\nMs. BONAMICI. Mr. Speaker, I hope my colleagues will join me in  voting for the motion to recommit.\n\nMs. BONAMICI. Mr.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…missed you every day that you were apart. You are  together again, but you never should have been separated. We will do  everything we can to keep him home with you where he belongs.\n\nMadam Speaker, I rise today for 9-year-old Susej. The world has heard  your pleas from behind the walls of the Dilley Detention Center. You  have been imprisoned for over…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…for what the people  of Ohio's 13th Congressional District made clear when they sent me here  because this Congress does not belong to party leaders or special  interests. It belongs to the people.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Crow era that we used to prevent immigrants and minorities  from voting. It should not be controversial to say that no one who has  argued for reviving racist Jim Crow laws belongs on the Federal bench,  let alone for a lifetime.\n\nMr. Divine also referred to himself as a ``zealot'' for the anti- choice movement. Now, whether you are pro-choice or pro-life,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…reject this SAVE Act, to keep Federal law  enforcement away from polling locations, and to make clear once and for  all that elections and our sacred right to the ballot box belongs to  the people.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…is filthy, and we have to put an end to it.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this resolution.  Let's take back the power and authority that rightfully belongs to  Congress and put an end to the lawlessness that makes us all less safe.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698443/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…wake. In replacing the name       of a Confederate general with that of Black excellence       embodied, the Army didn't just change a sign; it declared       that the future belongs to those who can lead, regardless of       their background. Until his passing in August 2024, Gregg's       living presence at ceremonies and military events reminded us…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…disability benefit in the event of injury. It is also a  survivorship benefit, an insurance benefit for families if the earner  becomes ill or is fatally hurt and dies.\n\nThis belongs to all Americans who work. Workers pay into this earned  benefit system, and they do it through their FICA taxes. It comes out  of a check every month. Social Security is…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…trillions to help  people with housing, healthcare, and education. It will help us pay  down the debt. It will fix nearly everything that is broken in this  country.\n\nThe economy belongs to all of us, not just the superwealthy. Fixing  and reversing Citizens United will allow us to fundamentally improve  the lives of every American and fundamentally improve…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Westchester County executive, I signed legislation to protect  women from harassment and intimidation when seeking an abortion because  this decision is deeply personal and belongs to a woman and her doctor,  not to politicians, not to protesters, not even to the Supreme Court.\n\nThat is why I am a sponsor of the Women's Health Protection Act.  Congress…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692893/third-anniversary-of-dobbs-decision"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…last five  seasons, it was only fitting that the trophy finally returned to the  home of the Treasure State.\n\nThe young men in blue and gold made Montana proud. Their victory  belongs not only to this university but to an entire State.\n\nMr. President, if you are watching, we would love to see them in the  White House. Go, Cats, go.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698834/congratulating-montana-state-university-bobcats"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…bill also cuts taxes on tips. Whether you are a waitress earning  tips or a nurse working overtime, this legislation will make sure that  your hard-earned money stays where it belongs: in your pocket.\n\nThe legislation also benefits those who give to charitable causes,  including tithes or religious contributions, allowing individuals who  do not itemize…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…says. The Founding Fathers vested in  Congress the power to declare war, but they were equally clear that the  power to defend the homeland from foreign and domestic threats belongs  to the President as Commander in Chief.\n\nTherefore, President Trump does not need congressional permission to  kill terrorists at sea who are bringing cocaine and fentanyl…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…themselves off of Russian gas.\n\nH.R. 1949 fixes that. This bill removes outdated restrictions on  natural gas imports and exports and puts decisionmaking authority back  where it belongs--with FERC, not some bureaucrats using climate reviews  or climate change as a backdoor veto.\n\nSome of you have seen that even the Microsoft founder, Bill Gates, is  now backing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…equals billions  and billions of dollars sitting in accounts?\n\nIf we are going to be adults, be professionals, and do our jobs--I am  sorry--every single one of these line items belongs in this budget,  being modernized, reviewed, and determined whether it is still needed.\n\nMr. Chairman, I yield back the balance of my time.\n\nMr. SCHWEIKERT. Mr. Chair, I demand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…abstractions--jobs,  wages, deficits, growth. We talk as if these things are numbers and  graphs. We forget that every job lost to China and every factory moved  to Mexico belongs to a real, flesh-and-blood American, with a life and  a family and a home. Each and every data point is a fellow citizen, a  neighbor, a son or daughter of this great Republic.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Our Founders knew what it meant to challenge an  authority that refused to listen. They understood what it meant to  stand up, too often alone, and declare that sovereignty belongs to the  people.\n\nThey risked their livelihoods, Mr. Speaker, their reputation, their  families. They risked everything so that future generations might  inherit a nation grounded…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Worst of all, it  cost millions of innocent lives.\n\nIn overturning Roe, the Supreme Court rightly corrected a grave legal  error and returned authority to the States where it belongs. That  restoration of constitutional order was long overdue.\n\nI also bid hello and welcome to my friends from the Center for  Arizona Policy who are in the gallery today.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…and fascism. Walking  through the tunnels, it is impossible not to reflect on the generations  of workers who built this backbone of industry and defense.\n\nLike the town it belongs to, the World Museum of Mining has a long  and rich history. In 2024, the museum became the official home of the  Montana Mining Hall of Fame, further cementing its role in…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700162/recognizing-the-world-museum-of-mining-in-butte-montana-in-celebration-of-americas-250th"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…how this new deduction will make everyday life better.\n\nFor seniors living on fixed incomes, every dollar counts, and this  policy puts more of their own money back  where it belongs. Many seniors will be impacted by ending the double  taxation of Social Security. These deductions to their Social Security  taxation will benefit 88 percent of seniors.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…our bellhops, and  our hairstylists. They are going to keep 100 percent of their tips and  overtime pay. That is money they earned. It does not belong to the  government. It belongs to them, and they deserve to keep it.\n\nSmall businesses that want to build and expand new factories, do you  know what they can do now? They can write off 100 percent of their…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…package will  help save an estimated $1,600 in taxes. That buys about 8 weeks of  groceries. This is American money staying with the American family,  which is exactly where it belongs.\n\nThis bill is also pro-business. The one big, beautiful bill also  includes a long list of reforms and investments that will make America,  including our small businesses,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…inducement of sympathy and interest.  Citizens by birth or choice, of a common country, that country has a  right to concentrate your affections. The name of American, which  belongs to you, in your national capacity, must always exalt the just  pride of patriotism more than any appellation derived from local  discriminations.\n\n``With slight shades of…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…ice. This success could not have been  achieved without everybody who contributed.\n\nWe watched that team compete with resilience and grit to keep the  Stanley Cup where it belongs, which is, of course, in the great free  State of Florida. Our entire South Florida community celebrates with  the entire State, who all kept faith in this team. Everyone's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694088/commending-and-congratulating-the-florida-panthers-on-winning-the-2025-stanley-cup-final"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…legislation and policies that put Americans first.\n\nJust last week President Trump issued an executive order that puts  decisions about our students' education back where it belongs, in the  hands of parents and the States.\n\nAs the father of four young boys, I know firsthand that those closest  to educating my children--the teachers, administrators, and…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}]