[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Republicans' policies, families across  the country paid an average of over $1,600 more due in everyday  expenses. Californians are paying over $2,300. However, do you know who  is benefiting from the Trump administration? Billionaires.\n\nWith the big, ugly bill, Trump and Republicans have implemented the  largest cuts to healthcare in the history of our country…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…universities. The Johnny Isakson and David P. Roe, M.D.  Veterans Health Care and Benefits Improvement Act, authored by  Representative Mike Levin, created these Shopping Sheets, benefiting  student veterans around the country who now know more about what a  school offers and charges.\n\nThis legislation further refines the sheets so that they can be  better tailored…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689601/veterans-education-transparency-and-training-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…Federal resources.\n\nAs a matter of fact, at a time when mobile phones weren't working-- most communications were down--it was only these local radio stations,  which were also benefiting from the transmitters from public  broadcasting, that were able to communicate with so many constituents.  These communications are now under attack by congressional Republicans…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…in this Chamber own stock in war  manufacturing, Mr. Speaker. That is a direct conflict of interest. So  every time they increase the budget for defense, many of them are  benefiting personally from that increase.\n\nThere are no increases to helping the poor or helping the hungry,  many of whom are in both Republican and Democratic districts.\n\nAgain, many…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…families, which are the backbone of our  economy, and ensures that everyone pays their fair share.\n\nBut the tax cuts passed during the Bush era did just the opposite,  largely benefiting the highest income earners in our country, and in  the process increased the Federal debt by trillions--trillions--of  dollars. In fact, in just 3 years, these tax laws caused…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…allowed to  trade stock. This should be a no-brainer. Members of Congress should  not be allowed to profit off of their service. When Members are in a  position of directly benefiting from the manipulation of the stock  market, and they profit off of their position, it is corruption, plain  and simple.\n\nJust last month, numerous Members and Cabinet officials…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691226/stock-trading-ban-for-members-of-congress"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…military in times of conflict.\n\nBut today that argument, if it has any merit at all, is being  dangerously undermined, and not by our adversaries, but by the very  companies benefiting from the monopolistic protections of the Jones  Act.\n\nSpecifically, Jones Act loopholes allow for supposedly minor parts  fabrication and supposedly minor repairs to be conducted…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…son has effective treatment       options available to him that were not available even just a       decade ago. But there is still so much to learn.\n\nAgain, another person benefiting from our research, benefiting from  the funding that is now being threatened and cut.\n\nBeth Tinlin from Nevada; Shelly Meitzler; Ron Heffron; David and  Brooke Carpenter,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…has already been paid for by the American taxpayers  that could be used to feed starving children who are victims of war and  famine, but instead, it sits in a warehouse benefiting no one.\n\nWe need the funding that this Congress provided to go through now  because starving children can't wait. To make matters worse, the  administration's fiscal year…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…reduction targets. We worked with the industry  to put this together. They are cooperating with us. It is the opposite  of the idea that somehow they are harmed. They are benefiting. They are  actually making money from it.\n\nOverall, the Methane Emissions Reduction Program recognizes the  cleanest performers, holds companies responsible for their own…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…passed this one big, ugly bill, initially in late  May, devastating Medicaid, devastating nutritional assistance, and  devastating the clean energy economy. Actually, it is benefiting red  State after red State after red State in the United States of America.\n\nMembers of the House Republican Conference wrote to Majority Leader  Thune and Chairman Crapo.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in the cost  of the operation and rebate any profit to the hardworking American  taxpayers. The military operations amount to billions of dollars, so  any energy company benefiting from the heroism of our military should  pay an energy tax refund to U.S. taxpayers. Think about it.\n\nU.S. energy prices are rising and even doubling across Ohio, our  Buckeye…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…aligning employee interests with a company's success. This  model promotes a stronger sense of ownership and community and keeps  investment and wealth in local economies, benefiting workers and their  families.\n\nIn Hawaii, we've seen firsthand the benefits of ESOPs. Hawaii is home  to the second-oldest ESOP chapter in the Nation, underscoring the  success…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690133/introduction-of-the-esop-funding-for-sba-position-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…been posting       on social media the names and phone numbers of child care       providers, including in San Diego County, suggesting without       evidence that they are benefiting from public funding but not       actually providing child care.\n\nSeveral local providers say that since then, they have       begun seeing people loitering outside their…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…source of innovation but also a pillar of the  American economy, fueling growth in both high-tech and blue-collar  industries, as I mentioned.\n\nSmall businesses are also benefiting from this emergence. Just a few  weeks ago, I had the honor of visiting a small company called Eta  Space. It is a company in my district that employs 20 people, but they…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…advances U.S. interests. Prosperity in our hemisphere enhances security  right here at home.\n\nRenewing HOPE and HELP supports nearshoring and more resilient supply  chains, benefiting American workers and businesses, while reducing  reliance on distant and unreliable sources.\n\nI commend Dr. Murphy for his leadership on this issue. Through his  numerous…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…identifying $1.6 trillion in wasteful  spending for savings, ends taxpayer-funded transgender surgeries, and  implements real work requirements for able-bodied adults who are  benefiting from Medicaid or food stamp programs.\n\nIt unleashes American energy by reversing Biden's anti-energy  mandates and brings back American jobs. It strengthens our national…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…rooms in this building, if they  need to balance the budget, think about getting rid of the low-income  housing tax credits and use the $13 billion a year that is primarily  benefiting some well-connected and wealthy property developers and use  it somewhere else. I think that is one of the things that we have to  look at carefully.\n\nThere was another topic…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…get that. Yet, because  they were the number one economic nation in the world from roughly 1650  to 1700, there are still people and families in the Netherlands who are  benefiting. Notwithstanding the fact that they moved their headquarters  to London, they are benefiting from the fact that, at one time, their  nation was the number one economic nation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…know, of course, it is not just about economic competition. We know  that China has a strategy of military-civil fusion, which means that  these investments are not simply benefiting China's economy and  consumer tech sector; they are directly helping build China's military  strength.\n\nIt is not too dramatic to say that as I stand here, U.S. dollars are…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…restart the process, and legal hurdles so steep that a single  denial can derail an entire multistate project or kill it altogether.\n\nMeanwhile, these very same States continue benefiting from the  affordable, reliable energy produced in other parts of the country,  even as they obstruct the pipelines needed for our Nation's  development, economic security,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…available.\n\nMr. President, the Democrat leader can spread all the disinformation  he wants. The Rural Health Transformation Program is in effect, and  every State in the Union is benefiting. Republicans will continue to  work to make healthcare more comfortable and accessible for American  families.\n\nI want to thank Dr. Oz and his team at the Centers for Medicare…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…of rapid prototyping and integrated  hardware for aviation and missile programs since opening its doors in  June 2002.\n\nThe PIF personifies fast and efficient contracting, benefiting from  its unique government-owned, government-operated, and contractor- supported model.\n\nI encourage the Army to keep this effort going and to apply this same  contracting…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691922/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…holding those involved accountable.\n\nNo one benefited from the failures of the Biden administration.  However, that does not mean that elected officials should be  financially benefiting from those failures now.\n\nThese provisions are not the right path to address the concerns, true  concerns, over the separation of powers. Remember, Congress serves the  American…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…know, of course, it is not just about economic competition. We know  that China has a strategy of military-civil fusion, which means that  these investments are not simply benefiting China's economy and  consumer tech sector; they are directly helping build China's military  strength.\n\nIt is not too dramatic to say that as I stand here, U.S. dollars are…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…chairwoman for her  leadership.\n\nMadam Speaker, I rise today to highlight the many ways that Texans,  hardworking families, and small business owners across America are  benefiting from the One Big Beautiful Bill Act.\n\nThis is one of the most profamily, prosmall business, proworker  legislation ever signed into law. As a small business owner myself…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…charity boxing  event was created to spread mental health awareness, particularly among  young men.\n\nWhat began in Athens now spans across eight universities with the  proceeds benefiting the Sam Asbury Foundation in Atlanta Georgia, and  other local charities.\n\nSam Asbury was a proud graduate of the University of Georgia and a  diehard Bulldog. He lit up…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…access and threatening the existence  of eye care practices in all of our districts.\n\nIt is concerning that some VBM patient and doctor mandates appear to  be aimed solely at benefiting the optical products labs, patient data  gathering, and mass retail operations built around them.\n\nThe growing VBM acquisition and control over independent eye care  practices…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693946/addressing-the-growing-abuses-of-vision-benefit-managers"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…stability,  attracting top talent and fostering a skilled workforce in Alaska.  Moreover, the increased investment in space operations has generated  economic ripple effects, benefiting local businesses, housing markets,  and service industries.\n\nAlaska's role in space operations is poised for even more significant  expansion. The State's infrastructure…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}]