[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…leaders.\n\nWe miss John. His impact will stretch far beyond his ranch. He helped  shape the agriculture of our region, and his legacy of innovation,  integrity, and service will benefit generations to come.                       Honoring the Life of Joel Nelson\n\nMr. COSTA. Mr. Speaker, I rise to honor Joel Nelson, a proud son of  the San Joaquin Valley who…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…When we talk about programs like SNAP, I have a news flash for you.  The majority of people on SNAP who are able to work, work. They earn so  little they still qualify for the benefit.\n\nBy the way, the benefit is on average of about $2 per person per  meal. You can't buy a cup of coffee in the United States Capitol  Complex for $2.\n\nThen what my friends…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…need more affordable healthcare,  upgrades to our transportation infrastructure, expansion of U.S.  manufacturing capacity, and to focus our taxpayer dollars on things  that benefit the American people and that make our communities safer.\n\nMr. Speaker, I am happy to work with any of my colleagues to develop  a commonsense approach to limiting our nuclear…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…a  year of tax breaks to the millionaires and billionaires. Those are the  facts.\n\nLook, CBO did an analysis, and they said that the top 10 percent in  America are going to benefit enormously from this bill. If you are in  the top 10 percent, if you make over a million dollars, over a half a  million dollars, you should applaud.\n\nThe bottom 10 percent,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bill does is make that problem worse by ensuring there are  zero restrictions on how much of our own LNG we are shipping out to  other countries. The only ones who stand to benefit are fossil fuel  companies, proving that Republicans care more about padding the profits  of their rich fossil fuel friends than they do about lowering costs for  the average…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…warning. It undermines  economies built on tourism, shipping, and fisheries.\n\nSlashing the budget of NOAA doesn't save money. A 2019 analysis shows  NOAA provides $11 in economic benefit for every dollar we invest. That  is not charity, it is infrastructure. NOAA's ocean observation system,  for example, drives economies and saves lives.\n\nCaptain Dan Jordan,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Kremlin are  adversaries of the United States. They would like nothing more for our  Nation to falter, but they are also self-interested.\n\nBoth the United States and Russia benefit from a stable, controlled  nuclear regime. That mutual self-interest lies at the heart of why New  START was signed in the first place. To throw it all away would be a  mistake…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…privilege, Mr. Speaker, that can just  be signed away. It is a fundamental right. When working people have a  voice on their job, services improve, accountability grows, and we all  benefit. The bill doesn't just restore fairness, Mr. Speaker. It  restores dignity and due process.\n\nMr. Speaker, I urge my colleagues to support Protect America's  Workforce Act.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697997/protect-americas-workforce-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…physics, and chemistry.\n\nJust last month, the Nobel Foundation announced the annual recipients  of their world-renowned awards, recognizing those who ``conferred the  greatest benefit to humankind.'' In 2025, a record-breaking number of  them came from one public university system: the University of  California. Today, it is my honor to recognize each of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…other side of the aisle might say, there is no  guarantee that the precious minerals that were just talked about  produced from this mine would actually stay in the U.S. and benefit the  American economy or American national security at all.\n\nAntofagasta sends most of its minerals to China, where they are then  sold on the global market, likely the same…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the cash payment  but also non-wage compensation and presently includes the value of  child or dependent care services when employers decide to provide them  as part of the benefit package.\n\nExisting law already provides incentives for these benefits, allowing  employers to deduct them as a cost of doing business and offering tax  preferences for certain…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…option.\n\nRight now they are worried about whether that option is going to be  available. What does that mean for the people that I represent? In  Virginia, about 350,000 people benefit from the enhanced premium tax  credits.\n\nFor a family of four that earn just under $130,000 a year, they will  see their premium go up 43 percent, to $4,675.\n\nFor a family…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Federal agencies against his businesses, allowing his companies and  himself to evade oversight. He was able to help place key personnel in  agencies that now are looking to benefit his companies financially.\n\nMr. Speaker, going back to the data privacy point, Elon Musk and DOGE  have allegedly used Musk's AI chatbot, Grok, within Federal agencies.  This…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to 2 years,  the future of our civil service--they are firing, and so many of them  are veterans who have worn the uniform, served and sacrificed, and want  to continue to benefit the country with the skills and dedication they  have demonstrated as members of our U.S. Armed Forces.\n\nPublic service has long been a preferred path for military-affiliated…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…bill actually does is create a new loophole that will flood our  communities with more weapons and new ghost guns.\n\nAxon and other companies that make and sell weapons will benefit from  this bill, but none of us will benefit from it. Our communities will be  less safe.\n\nEvery time the government creates a new opening, the gun industry  will take advantage…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699906/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…this Chamber to function  don't have to worry about getting paid until September 30 of next year.\n\nObviously, military construction and, more importantly, veterans rely  on benefit commitments we have made. Passage of this bill makes sure  that we fulfill those commitments between now and September 30 of next  year, and we buy the time to sit down to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…policies, so we  functionally buy HMO policies for--the technical term is our indigent  population. We actually do it really well. We were the first ones to do  pharmaceutical benefit management and those sorts of things.\n\nIt is an interesting intellectual argument, and I wish we could  actually have a little more highbrow discussion here. Should a State…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…because I knew that 2025 would be a major tax policy year. Known as the  Super Bowl of tax colloquially, I believe that we have a real  opportunity to extend tax policies that benefit hardworking Americans  and that support families.\n\nLet's remember that the child tax credit was $1,000 pre-2017, and  Republicans doubled it without a single Democrat vote…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…future bank regulators cannot repeat  this ill-conceived rulemaking, and that financial institutions can  continue to make strategic, innovative decisions that will ultimately  benefit American consumers.\n\nAlso, the rule provides for consideration of S.J. Res. 31, providing  for congressional disapproval of the rule submitted by the Biden EPA  relating to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…communities across our country. Our men and women seeking new  employment after transitioning back to civilian life bring incredible  skill sets and expertise to the table that could benefit companies of  all kinds.\n\nBy incorporating new consideration for DOE to evaluate the potential  for transitioning servicemembers into the workforce as part of H.R.  3638,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…who have far inferior environmental and labor standards.\n\nA natural gas tax is a completely misguided tax on the working  American people that will hurt their bottom line and benefit Vladimir  Putin. I urge my colleagues to join me in supporting this resolution.\n\nMr. Speaker, the Biden administration has been the most antidomestic  energy-producing administration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688187/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…visa or other documentation to       enter the United States; and\n\n(iii) otherwise ineligible to be admitted or paroled into       the United States or to receive any other benefit under the       Immigration and Nationality Act (8 U.S.C. 1101 et seq.).\n\n(B) Current visas revoked.--\n\n(i) In general.--An alien described in subsection (b) is       subject…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…five decades of distinguished service  as a law enforcement officer.\n\nIn addition to his law enforcement career, Lane is heavily involved  in community service initiatives to benefit North Texans. He serves as  the President of the NCT 911 Board and the Chairman of the Wise  County's Santa's Deputies to deliver toys and food to families in need  during…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690196/recognizing-congressional-patriot-award-recipient-sheriff-lane-akin"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…area-wide leasing.\n\nDisregards congressional limits on habitat closures and       surface disturbance.\n\nUndermines ANCSA village lands specifically conveyed to KIC       for local benefit.\n\nRemoves opportunities that Congress intended to support       Inupiat economic self-determination.\n\nThreatens the revenue streams, jobs, and infrastructure our       community…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the U.S. Government to have veto power over  critical business decisions, President Donald J. Trump has fully  protected our national security.\n\nThis merger will be a huge benefit for the Pennsylvania economy and  for our workers, as it not only includes a massive investment in U.S.  Steel's operations already present in Pennsylvania but also includes…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…proxy voting.\n\nUnder current practices, some fiduciaries use the shares held in  retirement plans to push political policies through proxy votes,  whether or not those policies benefit the workers whose money is at  stake.\n\nH.R. 2988 stops that. It makes clear that exercising shareholder  rights, including proxy votes, must be done in the economic interests…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…low-      emissions cement, concrete, and asphalt production processes,       including through the reuse of waste as a resource in other       industrial processes for mutual benefit.\n\n``(C) Increasing the overall energy efficiency of low-      emissions cement, concrete, and asphalt production processes,       including through life cycle assessments.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and nonprofit organizations. Through the Red Mule Pub, he has  hosted and participated in numerous fundraising efforts, donating time,  resources, and space to causes that benefit the less fortunate,  veterans, first responders, and community programs. His generosity has  directly impacted countless individuals and families in need,  reinforcing the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…One Big Beautiful Bill Act also helps hardworking Americans by  cutting taxes on overtime pay. Around 22 percent of all employees in  Utah regularly work overtime and could benefit from this tax break.\n\nThe bill also cuts taxes on tips. Whether you are a waitress earning  tips or a nurse working overtime, this legislation will make sure that  your hard-earned…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…rural healthcare access and the expansion of  community wellness programs. Jim grew the foundation's endowments from  $3 million to an astounding $150 million, funds that will benefit the  community for generations to come.\n\nJim also played a key role in introducing innovation and excellence  in Montana health services, helping to bring new cancer, cardiac,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693079/congratulating-jim-duncan"}]