[{"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…bill. And, once  again, that bill would cut the social safety net programs like Medicaid  and food assistance.\n\nAnd so we came here to bear witness to who we are at our best as a  nation. And as we gathered in the Rotunda, the Capitol Police gathered,  and we were singing, and we were praying. And they said: Sorry, you  can't sing, and you can't pray…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…weeks now. They are wrong, and much of  what they are built on is a lie. And they are dehumanizing.\n\nThis is, in fact, a witch hunt. Our civil servants are among the best  of what our Nation has to offer. They serve with no political  motivation. Many have served for years under Democratic administrations  and Republican administrations. They have one…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Honoring Robert ``Rex'' Baumgartner\n\nMs. KAPTUR. Mr. Speaker, I rise to honor Robert ``Rex'' Baumgartner,  a true American hero, a man of the law. Rex embodied the very best of  our Nation: honor, respect, bravery, duty, and unwavering courage.\n\nBorn in east Toledo, Rex answered the call to serve early, joining  the United States Air Force and serving…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…the first 100 days is losing, the kind of  losing that will be felt in this Nation for years to come.\n\nOne hundred days in, look at how they have treated the very best of  us--this Nation's civil servants, the Federal workers who serve with  absolutely no political motivation. I have met them. I know them. Close  to 160,000 of them live in the State…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…crew of Apollo 11. As a  nation, we have been lucky that people of this caliber have stepped up  and stepped into the cockpit.\n\nMr. Speaker, these veterans are some of the best our Nation has to  offer. They are expertly trained to maintain, fly, and fight in their  airframes. Aviators get the mission done, and they get it done no  matter what. They do…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…These are Americans who put their lives on the line to defend this  country. They took up a job to continue to serve the people of this  country. They represent the very best of our Nation, and we need them  in our Federal workforce.\n\nI am calling today on the administration to reinstate these veteran  employees immediately.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…congressman Bill Natcher, used to say: ``As long  as you take care of the health of your people and the education of your  children, you'll continue to live in the strongest and best nation on  earth.''\n\nMr. Speaker, that is exactly what Melanie Lundquist and the  partnership for LA Schools are doing.\n\nAnd for that, they have my thanks and the gratitude of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…was a warrior for justice on many fronts and an unwavering  patriot. He was always happy. His story is one of resilience,  excellence, and service, embodying the very best of our Nation's  ideals.\n\nFrom a young age, Harold dreamed of soaring through the skies. I  don't know where he got that idea, but just at 19 years old, he turned  that dream into…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…legacy and promoting a free and  prosperous Indo-Pacific.\n\nAUKUS is an important way to bolster our alliance structure in East  Asia and the Pacific and do what we do best as a nation: work with our  allies toward a common cause, in this case, a free and open Indo- Pacific.\n\nThe AUKUS agreement accomplishes these ends by providing Australia  with additional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694780/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…expanded opportunity, and is a common theme throughout our  shared American story.\n\nIn a time of rising division, these stories call upon us to remember  who we are at our best: a nation that does not just tolerate  differences but draws power from them.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Richard Reagan  Horn, of Huntsville, Texas, with a Congressional Veteran Commendation.  His servant's life reflects the hard work and dedication that  exemplifies the best of our Nation's values.\n\nRichard entered active duty at Camp Pendleton, California in May of  1966 at twenty-one years of age. He served with honor and heroism  during the Vietnam…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Navigator flying in  B-25 Mitchell Bombers with the U.S. Army Air Corps during World War II.  His servant's life reflects the hard work and dedication that  exemplifies the best of our Nation's values.\n\nLt. Col. Wagamon entered active duty in Philadelphia, Pennsylvania in  September of 1944 at twenty years of age and served an important role  during period…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…are Active Duty, but also to those who have previously  served as aviators.\n\nI am an Air Force fighter pilot with over 20 years of service, and I  fought alongside the best that this Nation has to offer. I have also  stood beside too many of my brothers and sisters as they face their  toughest battles--not in  the air, but when they got home, in hospital…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Crockett, Texas, as a distinguished recipient of the  Congressional Veteran Commendation. His servant's life reflects the  hard work and dedication that exemplifies the best of our Nation's  values.\n\nDelman answered the call to service when he enlisted in the United  States Army in March 1989, right out of high school. He followed in his  older brothers'…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the signing of the Declaration of Independence and the  founding of our Nation. We want this to be an anniversary that really  brings us together, that celebrates the best of our Nation and reminds  us that we are just so blessed to be Americans.\n\nI have spoken about so many of the broad national impacts of this  bill, but for folks back home that may…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…to the region during the holiday season.\n\nI encourage everyone to experience this celebrated market while it is  open, and I thank all who worked to make it one of the best in the  Nation.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Oconee, McLemore, and St. Simons  Island also earned national recognition.\n\nGeorgia is home to hundreds of golf courses, but our resort golf  courses stand among the very best in the Nation.\n\nThese rankings are based on expert evaluations of course design,  conditioning, and overall quality, highlighting Georgia as a premier  golf destination. This distinction…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…John Battista Airola, of Huntsville, Texas, with a  Congressional Veteran Commendation. His servant's life reflects the  hard work and dedication that exemplifies the best of our Nation's  values.\n\nColonel Airola entered active duty at Quantico, Virginia in August of  1955 at twenty-one years of age and served with honor and heroism  during the Vietnam…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…of duty, perseverance, and  selfless service. His contributions to the United States Air Force and  his continued efforts to support veterans in need reflect the very best  of our Nation's values. His legacy of service is an inspiration to all  who know him.\n\nMr. Speaker, let us express our deepest gratitude to Robert Longo for  his military service…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, today, I recognize and honor seven  remarkable Americans whose military service embodies the very best of  our Nation.\n\nColonel Mark R. Baaden, Colonel John W. Mansur, Sergeant Raymond L.  Burkard, Chief Warrant Officer Thomas W. Thompson, Sergeant Jeff  William Patterson, Specialist…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…extraordinary American, Richard ``Dick'' Burbine\n\nMr. KILEY of California. Mr. Speaker, I rise today to honor an  extraordinary American, a man whose life story reflects the very best  of our Nation's character, courage, and commitment to service. Richard  ``Dick'' Burbine represents a generation that answered history's call  with quiet resolve and uncommon bravery.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…is renowned for excellence in all aspects of  pediatric medicine, and according to U.S. News & World Report, many of  Nicklaus's specialty programs ranking among the best in the Nation  since 2008.\n\nThe tremendous impact Nicklaus has is not felt in District 27 alone.  Nicklaus Children's Health System, the parent organization of Nicklaus  Children's…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}]