[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Gonzalez. And now our President has committed to running  Venezuela for years in order to exploit its oil resources.\n\nToday, we have the opportunity to exercise the power bestowed on us  by our Framers to authorize the use of force--or decline to do so--but  to reassert some constraint on an Executive grown too fond of the use  of military power.\n\nWe…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…through his       music, delivering a powerful message of hope and resilience;       and\n\nWhereas, Apostle Dr. Dana Carson was recognized by       President Barak Obama and was bestowed the Lifetime       Achievement Call to Service Award, was honored as one of the       Top 50 influential Leaders Worldwide in Pentecostalism and he       is an active member…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…religious freedom, and  environmental stewardship.\n\nPart of his visit to the United States is to receive the  distinguished Templeton Prize in New York City. This recognition,  bestowed previously on figures such as Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu, acknowledges his lifetime of service in  advancing the harmony of faith and reason,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in the world. His All-Holiness is  visiting Washington, D.C. in conjunction with his acceptance of the  distinguished Templeton Prize in New York City--an honor previously  bestowed on Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu,  among others. While here, he will visit both the White House and the  Congress.\n\nElected in October 1991 as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…called into question the veracity of the account of events which formed  the basis of a recommendation that Representative Cory Mills receive an  award of a Bronze Star, bestowed in 2021, for his service under enemy  fire in Iraq in 2003;\n\nWhereas, in August 2024, Representative Mills provided the Daytona  Beach News with documents purporting to prove…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…his engagements with  parliaments, heads of state, and religious leaders have earned him  honors from the United Nations, the European Union, and this very  Congress, which bestowed upon him the Congressional Gold Medal beneath  this Capitol dome.\n\nMr. Speaker, in honoring Patriarch Bartholomew, we recognize a man  whose life's work has been the building…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…well as city and  community leaders as they gather to honor our dear friend, Steven  ``Steve'' Dargan, as West Haven's 2025 Irish Person of the Year. This  special award is bestowed annually on a West Haven resident or couple  of Irish descent who personifies service in the city's close-knit Irish  community.\n\nSteve hails from an ancestry whose legacy…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…through September 17 and will meet with President Trump at the White  House. This visit coincides with his receipt of the Templeton Prize, a  prestigious award previously bestowed upon renowned figures such as  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nFor decades, His All-Holiness has been a steadfast advocate for  religious freedom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…have called into question the veracity of the account of  events which formed the basis of a recommendation that Representative  Cory Mills receive an award of a Bronze Star, bestowed in 2021 or  afterwards, for his service under enemy fire in Iraq in 2003;\n\nWhereas in August 2024, Representative Cory Mills provided The  Daytona Beach News with documents…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…profound respect and admiration for  His All-Holiness in 1997 when it awarded him the Congressional Gold  Medal, Congress' highest honor. This distinguished award has been  bestowed upon such luminaries as George Washington and Winston  Churchill. Remarkably, the legislation for His All-Holiness's Gold  Medal attracted more of the Members of Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Gajecki, Rex Giberson,  and Jack Ross--earned silver for their individual performance.\n\nFive Garden Spot FFA alumni also received American FFA Degrees in  2025, the highest honor bestowed to FFA members, and were recognized at  the convention. These individuals were Gracie Albright, Sydney  Albright, Kayla Frey, Jaclyn Martin, and Katelyn Ranck.\n\nWith their…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698930/congratulating-the-garden-spot-future-farmers-of-america"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Area School District\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor the  Huntingdon Area School District on its selection as a Great  Pennsylvania School.\n\nBestowed by the Pennsylvania School Boards Association, this  designation recognizes school districts across Pennsylvania for  academic excellence. As Superintendent Jennifer Mitchell…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…partnership with the Florida State Fair Authority, has  recognized an outstanding Woman of the Year in Agriculture. Last March,  Commissioner of Agriculture Wilton Simpson bestowed this distinguished  honor upon Reba Y. Mazak in recognition of her lifelong dedication to  advancing Florida agriculture.\n\nReba is a fifth-generation Florida cattle producer…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…below the  phrase ``In God We Trust'' here in this Chamber.\n\nIf we dare to leave the faith that built this country, then this  country will lose the blessings that have been bestowed upon it. We are  ever thankful to live in a country where we are free to believe what we  want, where we can think what we want, and where we can say what we  want for the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Agriculture Committees.\n\nHis accomplishments continue to be recognized by his alma mater,  receiving the 2024 Houston Christian University Emerging Leader Award,  an honor bestowed upon alumni from the past decade who have achieved  early career success and made a positive impact in their communities.\n\nToday, Bryan continues to serve our country as a…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…two millennia of Christian history, he  stands as a symbol of faith and resolve. His visit comes as he receives  the distinguished Templeton Prize in New York, an honor once bestowed  on Mother Teresa, the Dalai Lama, Archbishop Desmond Tutu, and Nelson  Mandela--leaders whose lives have testified to the power of faith to  transcend borders.\n\nAs a Catholic,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…the highest ranking an  FFA chapter can receive. Three of their students--Vita Failla, Molly  Gehr, and Carly Railing--also received American FFA Degrees, the  highest honor bestowed to FFA members.\n\nThe Manor FFA excelled during the 98th National FFA Convention &  Expo, which was held from October 24, 2025 to November 1, 2025, in  Indianapolis, Indiana.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…will  return to Washington as part of his visit to the United States, where  he will also receive the distinguished Templeton Prize in New York  City, an award previously bestowed upon Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. This honor recognizes his lifelong  commitment to faith, peace, and science.\n\nMr. Speaker, it is fitting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…low- and moderate-income residents through the innovative use of  Community Development Block Grant (CDBG) and HOME Investment  Partnership funds.\n\nThe Audrey Nelson Award is bestowed annually on only a limited number  of projects nationwide. This year, just seven projects were selected,  making Pasco County's achievement especially noteworthy. Pasco County…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…is not just a quest for  pleasure or power but of meaning. Meaning and happiness is found when  one is dedicated to a cause greater than oneself. The servant nature is  not bestowed and cannot be taken away; it is who one is deep inside.  Once this is recognized the servant intentionally chooses to lead.  American Classical Servant Leadership is about…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]