[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…bill upholds a simple principle: When we give local experts the  tools they need, they protect the ecosystems that protect us.\n\nThis legislation reflects a strong bipartisan, bicameral commitment  to support these critical ecosystems and recognize their significance.\n\nI thank Representative Figures for leading this effort. I thank, as  well, Representative…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…signing of  the Declaration of Independence, to be opened on our Nation's 500th  anniversary in the year 2276.\n\nThe items in the capsule will be determined by bipartisan, bicameral  congressional leaders and include written materials relating to the  anniversary, representations of notable legislative and institutional  milestones, and a message from…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…bills.\n\nThe Appropriations Committee is the lifeblood of the government. It  is a place where you can only achieve work on behalf of the American  people through bipartisan, bicameral legislation. Without it, we know  what happens: the catastrophe with the continuing resolutions that go  on forever, or the government shuts down. That is not a path to success…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…including leveraging our shared capabilities  to shape a free and open Indo-Pacific and to counter the rising threat  that China poses.\n\nI recently returned from a bipartisan, bicameral codel to Australia  and the Indo-Pacific, and all were eager to build on the AUKUS  framework.\n\nThis legislation will strengthen the AUKUS collaboration and joint  operability.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694781/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…$500,000 per violation of damages to a handful  of Senators. I very much appreciate Senator Graham for doing that, but  I don't believe that it gets to the full bipartisan-bicameral solution  that we need.\n\nSenator Graham, I am sympathetic to the arguments you have made here.  I can rebut some of them, but I don't want to get into that debate  right…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Constitution vests this body  with authority over matters of war and peace. That power has too often  been ceded to the executive branch.\n\nEarlier this month, on a bipartisan and bicameral basis, we repealed  outdated authorizations for use of military force to prevent Presidents  of either party from abusing it. We cannot now abandon our  constitutional duty…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…States, violating his right to due  process. There are many individuals whose stories deserve to be told,  so today I am going to highlight just a few.\n\nLast week, I led a bicameral codel to two ICE detention facilities in  Louisiana where Mahmoud Khalil, Rumeysa Ozturk, and Wendy Brito are  being held.\n\nMahmoud Khalil is a lawful permanent resident…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…the strength of the Appropriations  Committee and its work on behalf of the American people are the  heartbeat of the U.S. Government. I am proud to support the bipartisan,  bicameral bill that we have fashioned and, again, give credit to both  our Republican chairs and our Democratic ranking members for the great  work and their negotiating skills to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, that we in the House of Representatives  voted for on an overwhelming bipartisan basis and that the Senate  overwhelmingly voted for on a bipartisan basis. We had bicameral  passage and presentment to the President. The President signed it into  law. The Department of Justice got the funding. The Department of  Justice programmed the funding,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…but I really  compliment Chairman Rogers and the majority staff for having worked  with us throughout that process and worked with the Senate. I thought  we had a very good bicameral, bipartisan agreement this year.\n\nThe chairman is right. The highlight of this bill is acquisition  reform, something that our committee has worked on for quite some time.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the guiding framework of the Pacific  Islands Forum, the region's premier multilateral organization with  eighteen members across Oceania.\n\nSpecifically, this bipartisan, bicameral bill would require the  President to develop and submit to Congress a Strategy for Pacific  Partnership, extend diplomatic privileges and immunities to the Pacific  Islands…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "Mr. GOTTHEIMER. Mr. Speaker, I rise in support of the bipartisan  GENIUS Act. This legislation builds on the bicameral negotiations that  Chairman Hill, former Chairman McHenry, Chairman Steil, and I, and so  many others, have worked so hard on for the past years.\n\nThe GENIUS Act is smart…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693833/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…all.\n\nIn the Senate, the introduction of the ROAD to Housing Act highlights  growing bipartisan cooperation on housing. I look forward to  negotiations with the Senate on a bicameral product that can make it to  the President's desk for signature and, above all, a product that would  deliver tangible results for the American people.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699796/housing-for-the-21st-century-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…have  the solution to prevent healthcare costs from skyrocketing even further  overnight.\n\nThat is why a number of my colleagues and I have worked in the Senate  to introduce bicameral legislation that would permanently extend the  enhanced premium tax credits, those benefits that allow so many  Americans--our neighbors, our small businesses, our friends--who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the Judiciary Committee's traditional practice. This  bill is essentially what we call a visa sanctions bill. For decades, we  have relied on pre-negotiated, bipartisan, and bicameral texts for  every such visa sanctions bill. This legislation today departs from  this bipartisan practice by directly amending the Immigration and  Nationality Act, the INA,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…violence. They were worshiping. They were serving God. And for that  action, they are being treated as enemies of the communist state.\n\nLast week, I introduced a bipartisan, bicameral resolution to condemn  the abduction of Pastor Jin and the Zion Church leaders and to demand  their immediate release. This resolution is designed to pressure  Chinese leadership…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696588/expressing-condemnation-of-the-chinese-communist-partys-persecution-of-religious-minority-groups"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Main Street. I am concerned about the 772,047 individuals that I  represent. That is what we should be here about, not trying to get rich  on trading stocks.\n\nMy bill is bicameral. It is bipartisan. As I said before, it is led  in the Senate by Senator Josh Hawley. President Trump has announced  that he will support this legislation to make this law.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…3771 of title 18, United States       Code.\n\nMr. FRY.  4323.\n\nMr. Speaker, H.R. 4323, the Trafficking Survivors Relief Act, is a  strong, bipartisan piece of legislation--and bicameral, actually--that  will help one of our most vulnerable populations.\n\nThis legislation passed the House Judiciary Committee by a voice vote  earlier this year, and I am looking…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…create a  congressional time capsule in commemoration of the semiquincentennial.  I think it should be clearly pointed out here that this bill is truly  bipartisan, and it is bicameral. It is a piece of legislation  that requires the four corners of congressional leadership to agree on  the contents of the capsule including a joint letter.\n\nI look forward…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699841/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Alabama.  1071.\n\nMr. Speaker, I am proud to present the final National Defense  Authorization Act for fiscal year 2026.\n\nThis is a good product that was worked in a bipartisan, bicameral  fashion.\n\nThis year, we focused a lot of our efforts on fixing the Pentagon's  broken acquisition process, which is failing our warfighters. The  fiscal year 2026 NDAA includes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…a process that requires steady, deliberative progress. I am proud  to say we are doing just that.\n\nToday marks the second time this month that we are bringing  bipartisan, bicameral bills to the floor. We promised the American  people a responsible Member-driven process, and that is precisely what  we are delivering.\n\nThis two-bill package reflects Member…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…that ESG factors often charge steeper fees, carry higher  risks, have lower returns, and are well-known underperformers. That is  precisely why this rule garnered bipartisan, bicameral disapproval in  the form of a Congressional Review Act resolution that passed both the  House and Senate.\n\nHowever, the Biden-Harris administration vetoed the resolution,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…bill, and I think that the support that we have seen by  way of the votes is proof positive of that.\n\nWe had a 26-to-2 vote in committee last summer, and then, after weeks  of bicameral negotiation, our colleagues in the House passed this  minibus last week by a resounding vote of 397 to 28--so pretty strong;  actually pretty powerful. And then, to have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…employee protections, making the job  more difficult despite rising crime in the District.\n\nWhen the D.C. Council passed this law, Congress acted swiftly in a  bipartisan, bicameral fashion to overturn it. The House and Senate  passed H.J. Res. 42, which would have overturned the entire D.C. law,  with 14 House Democrats and 6 Senate Democrats joining…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…this bill works to ensure our priority programs receive  funding without any poison pills. We had to make some tough decisions,  but I am proud that this is a bipartisan, bicameral bill that both  parties and Chambers see as a benefit to the American people. I urge  its adoption.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John James", "party": "Republican", "sentence": "…hospital or to a doctor's office, he ought to be able to know  what the heck something costs: No more games, no more surprises, and no  more $47 aspirin.\n\nThis is bipartisan, bicameral, and commonsense stuff. In literally  every part of life elsewhere, buying a car, groceries, or a cell phone,  you know the price before you swipe your card and before you…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…separate appropriations bills through the committee and on the floor,  we have returned this week to continue our work. H.R. 7006 was  negotiated in good faith on a bipartisan, bicameral basis.\n\nPresident Trump's priorities, alongside the priorities of the  American people, are interwoven within this important package.\n\nLet me make this abundantly clear,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…not just in this Congress, but for a long time advocating for this  moment. He deserves a tremendous amount of credit for persevering and  working and marshaling bipartisan, bicameral support. I thank him for  his tremendous leadership.\n\nI thank the gentleman from Wisconsin (Mr. Steil) for being a subject- matter expert and working in a bipartisan way…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…colleagues in the Senate to make the  legislation reaching the President's desk as strong as possible. That  is why I am urging a ``yes'' vote on the GENIUS Act.\n\nThe bipartisan, bicameral legislation creates a robust framework for  payment stablecoin issuance in the United States. It encourages the  innovation and development of Web3 businesses here in the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…also enact Rep. Pete Stauber's (R., MN),       H.R. 4090, to codify some of the minerals directives in       President Trump's executive orders, and the bipartisan and       bicameral Mining Regulatory Clarity Act (S-544 and H.R. 1366)       to reduce the uncertainties about whether federal lands can       be used for mining support facilities stemming…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}]