[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…number of times  here in Washington, DC, and I will never forget my first meeting with  him shortly after he was offered an escape. Do you remember what he  said to President Biden when he offered a helicopter to exit the  country: Don't send me a helicopter; send me ammunition--that courage  and determination in the face of Russia coming within just…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Ambassador Rudd spearheaded  Australia's push to advance the landmark AUKUS security pact, expanding  the broad bipartisan support and securing the endorsements of both  President Biden and President Trump and advancing investment in  limitation strategies both here in the United States and back in his  home in Australia.\n\nHe negotiated a critical minerals…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Awdah was shot by a settler terrorist Yinon Levi, who has been  sanctioned by the UK, Canada, and the European Union and previously  sanctioned by the United Sates under the Biden administration for  perpetrating violence against Palestinians. The world knows how  dangerous and reckless he is. Yet, on the first day of President  Trump's second term,…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694532/awdah-hathaleen"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…countless mistakes that he, Elon, and the crew have made over the past  100 days. When the stock market is up, that is because of him. When the  stock market tanks, that is Joe Biden's fault. If it doesn't get  better, that is Joe Biden's fault, too.\n\nMr. Speaker, no parent would accept this behavior from their child,  so why do we accept it from the President?…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…bank failed.\n\nUpon learning of Silicon Valley's failure, Ranking Member Waters  organized Member briefings with the Treasury Secretary and banking  regulators. We encouraged Biden's regulators, led by former Secretary  Yellen, to use their emergency tools to mitigate the damage, which they  successfully did.\n\nWe worked with our former chairman, Mr. McHenry,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…average, Illinois households are paying more than $1,500  annually for lights and heat in their homes--up more than 15 percent  from last year. Cause and effect.\n\nUnder President Biden, with the support of a Democratic Congress, we  signed into law the Inflation Reduction Act. This historic law provided  tax credits to help households and businesses install…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…check on Article I  executive actions. That is something we may be able to bring up again  next year, although I think it was more popular in certain places when  President Biden was the President, but it is still an important bill.\n\nThis is a commonsense bill. It is bipartisan, and I am happy to be a  cosponsor. I look forward to the gentlewoman from…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697207/count-the-crimes-to-cut-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…take so that our  communications networks are secure, reliable, and compatible with each  other.\n\nCSRIC has been in existence since 2009 and was rechartered in 2024  under the Biden administration and former FCC Chairwoman Rosenworcel  for another 2 years. It has served the FCC well by operating in a  collaborative manner with representatives from private…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…enforcement experience, gained at both the state and federal  level, had Mr. Barron well-prepared for his subsequent role as Counsel  and Special Advisor to then-Senator Joe Biden, serving on the United  States Senate's Judicial Committee's Subcommittee on Crime and Drugs.  Soon after, he was a member of the Justice and Civil Rights Review Team  for…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…President, I rise to speak in support of legislation  to strike the provision in the Federal funding package that would give  a windfall to a handful of Republican Senators who the Biden  administration investigated in connection with Trump's effort to try to  overthrow the government on January 6, 2021. This provision would give  those Senators $500,000 for…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697046/unanimous-consent-requests"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Americans struggles to pay their electricity bills--one  in four Americans. So what is Trump doing about it? Well, it is  definitely worse than nothing.\n\nThe criticism about Biden during the inflation crisis was that he  wasn't doing enough about inflation, but this is a different criticism.  This is deliberate policy choices to drive up the cost of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 4233. The AUKUS Agreement  established by the Biden administration was a historic accomplishment,  and Congress has played an important and constructive role in laying  the legislative foundation for closer cooperation between…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694780/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Bureau of Labor statistics,  2025 was the worst year for job growth in this country since the last  Trump administration. 2025 had 3 months of job losses. Meanwhile,  President Biden had 48 consecutive months without a single loss. At  this point in President Biden's term, he had already created millions  of jobs. At the end of the first year, President…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and  study in places that value and respect their heritage.\n\nWhile there is no simple solution to end this extremist hate, we all  can take steps to end this violence.\n\nIn the Biden administration's national strategy to counter anti- Semitism, the U.S.' first-ever blueprint, it called on all aspects of  society to commemorate JAHM and use it as a tool…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and  Republican allies have increased the prices of prescription drugs-- including cancer and heart medications, as well as vital antibiotics-- delayed the implementation of a Biden administration rule that barred  medical debt from showing up on credit reports, cut NIH grants, halted  all studies and activities within the NIH relating in any capacity…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…currently being held in check by a President and by leadership in the  administration who are devoted to doing it, that are empowered to do  it. However, all of the ways in which Biden-Mayorkas and that entire  administration allowed our border to be wide open and have 10 million  people flood our country, all of those things still remain in place  statutorily.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Bureau of Land Management's misguided resource management  plan, or RMP, amendment for the Buffalo Field Office in Wyoming, which  was finalized in the twilight hours of the Biden-Harris administration.\n\nWyoming's Powder River Basin currently supplies 40 percent of the  Nation's coal. The RMP amendment in question effectively halted future  Federal coal…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…few years, the cost of regulations for small  businesses has been out of control. The previous administration created  more than 1,100 final rules costing $1.8 trillion. The Biden  administration's regulatory costs were 600 times higher than that of  the first Trump administration and 3.7 times higher than that of the  Obama administration.\n\nI have been…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Mr. CRAMER. Mr. President, in a little while, we are going to vote to  proceed to S.J. Res. 62, which I introduced with Senator Hoeven to  repeal the Biden administration's Bureau of Land Management resource  management plan for North Dakota.\n\nOf course, H.J. Res. 105, which mirrors our bill, introduced by  Congresswoman Fedorchak,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Clerk read the title of the joint resolution.\n\nMr. WESTERMAN.  Res. 140.\n\nMr. Speaker, I rise in support of this Congressional Review Act  resolution, which would overturn the Biden administration's reckless  withdrawal of more than 225,000 acres in the Superior National Forest  from mineral exploration and development.\n\nMr. Speaker, at issue is the Duluth…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…rise in support of H.R. 2056, the District of Columbia  Federal Immigration Compliance Act.\n\nThe House Oversight Committee has held multiple hearings on the  failings of the Biden-Harris administration to secure our borders and  protect our citizens. In March, the committee heard from sanctuary city  mayors, who offered carefully crafted, lawyerly statements…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…American energy producers immediately supplied Europe and our allies  with LNG. The U.S. was the number one supplier of LNG to Europe in  2023. Unfortunately, in 2024, the Biden administration took politically  motivated actions to place an indefinite ban on LNG export permits to  appease the climate lobby. This legislation ensures that future  administrations…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I rise today to urge my colleagues to  reject the Biden administration's unlawful attempt to stifle Alaska's  congressionally mandated oil and gas leasing program in the Coastal  Plain of the Arctic National Wildlife Refuge, ANWR.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Guardsmen just steps  from the White House. Just before Thanksgiving, SPC Sarah Backstrom and  SSG Andrew Wolfe were on patrol near the White House when they were  attacked by Biden-imported Afghan Islamists. A 29-year-old jihadist  radically, viciously attacked them, killing Specialist Backstrom and  leaving Staff Sergeant Wolfe in critical condition.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…for 3 years,  detailing the agency's financial projections and budget management  strategy.\n\nAfter the Veterans Benefits Administration's shortfall crisis  manufactured by the Biden administration cost the government billions  of dollars, increasing the frequency of these conversations will help  Congress execute its constitutional oversight and appropriations…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…better outcomes for consumers.\n\nI look forward to marking up this important legislation in the House  Financial Services Committee this week.\n\nThe OCC's merger rule under the Biden administration would have taken  us in the exact opposite direction. It would have upended decades of  precedent by shifting the burden onto banks to prove their merger  should…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…energy produced for the entire Nation.\n\nAfter a decade of delays, protests, and litigation, Keystone XL was  finally approved in 2017 by President Trump, but on day one of the  Biden administration, that permit was canceled. It wasn't canceled  because the project wasn't needed or because it wasn't safe, but to  appease radical activists.\n\nWith that single…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank the chairwoman for yielding.\n\nSo here we are. Democrats couldn't seem to find a single thing to say  about Epstein when President Biden was in office, but now they want to  make this the centerpiece of their entire conversation.\n\nThe fact of the matter is right now they know it is true, and right  now what…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…data that we could all  get together and say, all right. That is math. It is what we are. It is  indisputable. It is math. It is Census Bureau. It is from census data  from the Biden administration, so as a Republican using it, it isn't  partisan, it is just math.\n\nHow do we keep our promises as a society, as a country, as a  population that used to, at…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…bipartisan. Three Democrats have joined us. If five  more join the Republicans, we have done this 11 times in voting for  this clean CR, which Democrats have done repeatedly under Joe Biden's  watch. If five Democrats join us, we will open the government back up.  But just wanted to set that straight at home. Yes, Republicans have  majority control of the Senate,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696364/government-funding"}]