[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the other bomb. This is the plot in the Trump administration  for the sake of their big fossil fuel donors to try to hamper and  hinder and injure clean energy. They have the big lie, which is to say  clean energy is more expensive; it is clean energy that is driving  costs on the grid.\n\nOh my gosh, expensive clean energy--wrong. That just isn't true.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…not immigration policy. It  is dehumanizing people.\n\nTrump said this was about keeping people safe. He said it was about  going after criminals, but we all know it was one big lie. Hundreds of  the people being held in this internment camp have no criminal charges.\n\nI won't stay silent while our government turns the Everglades land-- protecting it used…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…I want to expose what has been  called to our attention in many different ways over the last many  hours.\n\nMr. Speaker, we are at this moment in our country engaging in a big  lie coverup. It is a part of a chat-gate, a big lie coverup.\n\nChat-gate, Mr. Speaker, is a security breach not defined as such  because the person who would define it as such,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that after they  leave. Let's listen to Trump's former top ally, Marjorie Taylor Greene.  Here is what she said: ``I think people are realizing it was all a lie.  It was a big lie for the people. What MAGA is really serving in this  administration, who they are serving, is their big donors.''\n\nLook at who Republicans have helped. They have been in charge…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…rights in order to combat a problem that nonpartisan  election experts tell us is already addressed by current law.\n\nThe real reasons for this policy are to support Trump's Big Lie that  the 2020 election was stolen, even though he lost by roughly 7 million  votes, to sow mistrust in our government, to deter people from voting.  This is all in service…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…inauguration broke records that no one had ever  seen before. Then there was the lie about the weather map and the  Sharpie, and then so many other lies building up to that one big lie  that you all have heard about the 2020 election. It was an obvious lie,  and yet he lost over and over and over in court and continued to lie.  There was no evidence, but…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691062/it-all-started-with-a-series-of-lies"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Donald Trump their voter rolls, is not just a solution in  search of a problem; it is also a very bad solution at that.\n\nThis bill is built on a myth that is rooted in the Big Lie of  election denial that has poisoned our democracy for years, which is  that supposed noncitizen voter fraud occurs with any meaningful  frequency. It is the same Big Lie…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…to vote. The legislation before us makes a  mockery of that legacy.\n\nSince his defeat in the 2020 election, President Donald Trump and his  Republican allies have pushed the big lie of a stolen election. The  majority has tried to convince the American people of the lie that  noncitizens are a threat to our elections and are using that lie as an  excuse…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…United States.\n\nThis is the standard response from this administration's nominees  seeking positions on the Federal bench. It is an embarrassing  genuflection before the Big Lie. The question of who won the 2020  election is not a matter of political opinion; it is a matter of  historical fact. The overwhelming majority of my Republican colleagues…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…trillion of our American  treasure that could have built our schools, could have built our  healthcare system, could have built our infrastructure was wasted  because of a big lie told to the American people.\n\nAnd now we have the Trump administration with this big lie that this  was about drugs, when it turns out that it is about regime change and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…congressional pushback.  This could go on and on.\n\nThe point is that this, again, was never about efficiency. It was  never about finding waste, fraud, and abuse. That was always the big  lie. What Elon Musk was trying to do was reshape government illegally  against the express will of Congress.\n\nUnfortunately, my colleagues on the other side of the aisle failed…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…available to private industry and slow down our economy.\n\nThis magic math goes by the name of ``current policy baseline.'' It  sounds very academic, but it is essentially the big lie.\n\nConsider this: You sign a contract to rent a home for a year, and  renting that home costs $2,000 per month so you know you are going to  have to pay $24,000 over the year.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}]