[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is their big donors.''\n\nLook at who Republicans have helped. They have been in charge for a  year. They have helped Big Oil. They have helped Big Banks. They have  helped Big Tech.\n\nLook who was in the front row at Trump's inauguration: billionaires.  That is all he cares about. Look at their promises to go after ``the  worst of the worst'' when it…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…big health insurers who are rolling up the entire industry, from  providers to hospital beds and to the prescription drugs that people  rely on for their lives. I hear about big tech companies that are using  your valuable data for their own gain. The list goes on.\n\nAs we look across our consolidated economy, we see that corporate  power has reached its…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are pretending like Trump's economy is great, even though they  know it sucks. They have showered tax breaks on the ultrarich. They  have bent the knee to Big Oil, Big Pharma, and Big Tech. They have  handed the Pentagon billions it didn't even ask for, and now they have  the nerve to tell working families: Sorry, no money for your  healthcare; can't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, 267 percent, that is how much energy prices  increase in communities located near Big Tech data centers.\n\nDTE Energy, in my State, already charges us some of the highest rates  in the Nation with some of the most unreliable services.\n\nDo you like clean water coming…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697553/protecting-michigan-communities-from-data-centers"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the  ticketing and lodging markets; it unveiled rules to make it as easy to  stop a subscription as it was to start it; and it has worked to rein in  the monopoly power of Big Tech companies to ensure small businesses and  innovators can thrive online.\n\nThe President's attempt to remove independent Commissioners violates  Congress's long-held power to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Eight, it guts green energy subsidies, including investments in  renewable energy projects that are already underway.\n\nNine, it blocks State AI regulations in a giveaway to Big Tech,  completely trampling over State legislatures.\n\nTen, it scraps nearly a century-long tax on gun silencers. Who does  that? Who does that? It is truly horrendous. We have…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…defunding the police by stripping funding from the  Consumer Financial Protection Bureau, and the CFPB is the only Federal  cop on the block to hold Wall Street banks and Big Tech payment apps  accountable when they cheat Americans.\n\nIt is shameful that while families suffer from high prices, Musk is  firing thousands of Federal workers and stealing…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688020/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…opposition to S.J. Res. 28, a  partisan Congressional Review Act resolution that will block the  Consumer Financial Protection Bureau from supervising payment apps  offered by Big Tech firms like Apple and Google.\n\nBefore I explain why this resolution is bad, let us not ignore that  President Trump and co-president Musk are tearing down key government  agencies…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…right. Household electric  costs and energy prices have risen 10 percent this year. In some  places, they have more than doubled, driven by Trump's tariffs; new  demand from Big Tech AI data centers; and expensive, old, polluting  plants.\n\nBack home in Florida, Florida's largest utility has proposed the  largest utility rate hike in U.S. history, amounting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…working people. Just like everything else that Donald Trump  does, his tariffs are all about helping himself and his rich friends at  the expense of everyday people.\n\nThe Big Tech companies and the Big Oil companies have been donating  millions of dollars to Trump's ballroom and lavishing him with gifts  like a golden iPhone.\n\nWouldn't you know it,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699968/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…establish an effective  regulatory framework for crypto. Instead, these H.R. 3633, S. 1582, and  H.R. 1919 fall short of creating an effective regulatory framework,  allow Big Tech and the Trump family to enrich themselves, and stifles  innovation at the Federal Reserve.\n\nNow, Mr. Speaker, let me tell you a bit about what these three bills  would do.…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…help us all keep track here on the 100th day of the Trump  Presidency, here are the 100 damages from Trump's 100 days:\n\nIn his first 100 days, Donald Trump, No. 1, propped up Big Tech  billionaires at his inauguration, right here in this building.\n\nNo. 2, withdrew the United States from the World Health Organization.\n\nNo. 3, pulled the United States out…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…stablecoins do not  destabilize our financial system and require taxpayers to bail out  crypto companies when they crash; have refused to adopt changes that  would prevent Big Tech billionaires from using this bill to issue their  own private currencies; have refused to adopt changes that would stop  Donald Trump and his family from corruptly profiting…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…companies  accountable and demand they put safeguards in place to protect our  children. One of my amendments would have repealed the liability shield  that Congress granted Big Tech nearly 30 years ago, known as section  230.\n\nAt that markup, Chairman Grassley agreed to work with me to finally-- finally--allow these companies to be sued by their victims'…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Republican Congress will do.\n\nOne of Chairman Hill's changes to the GENIUS Act addresses a key  concern I have had from the beginning, which is that Facebook and any  other Big Tech company should not be allowed to issue their own  stablecoin.  That would violate a longstanding separation of banking and commerce in  financial regulation, and our chairman's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, I rise today to urge my colleagues to  support H.R. 7045, the PROTECT Act, because it is time to repeal  section 230 and hold Big Tech accountable for the harm being done to  our children.\n\nAs a father of two young boys, I refuse to stand by and allow harm to  happen to our children when there are no consequences,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699340/repeal-section-230"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, for years, I have come to this floor  and I have talked about what Big Tech is doing to our children in this  country. There is an entire generation of children that have become the  product when they are online on some of these social media platforms.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…regulation. It is a shortcut to  control, applied without the justification that both consumers and  innovators deserve.\n\nSome may try to frame this argument as a gift to Big Tech. That is a  distraction. This is not about defending large companies. This is about  defending good governance, our legislative authority, and the public's  right to be part…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…defamatory content from its models. Google has not responded  to my letter. What they did do was take Gemma down over the weekend.\n\nDespite the AI model's serious flaws, the big tech giant said in a  statement that it is going to continue to work to make Gemma available  to their developers.\n\nAnd the message on this is clear: You need to shut it down.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, Section 230 of the Communications Decency  Act insulates ``Big Tech'' from most liability for the digital fentanyl  promoted on their sites. Time and time again, drugs are sold, sexually  suggestive and/or explicit content is posted without…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…exactly what is  happening to our children, and this is why we must act.\n\nMr. Speaker, the bill called the TAKE IT DOWN Act finally sends a  very loud and clear message to Big Tech. If you, Big Tech, do not  remove these fake images within 48 hours, you are as guilty and as  responsible as the predators who created them.\n\nI am talking to Snapchat, to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…say that this bill is based on another important  principle, a simple one, which is that no amount of corporate profit  justifies the exploitation of our children. All the Big Tech companies  are rich beyond belief. They are the wealthiest companies, the richest,  biggest companies, not just in America, not just in the world, but in  the history of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…eliminate this black market  from Facebook. He has until May 6 to respond to the questions.\n\nI will continue to press this issue of accountability and public  safety with the big tech giants.\n\nWhile President Trump has worked to secure our border and our  communities, he has also focused on making our economy stronger than  ever before. In the last 100…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]