[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…what we have seen from this Congress is that our colleagues on  the other side of the aisle have consistently made life harder for  everyday Americans. That is what the one big, ugly bill was all about.  It was to hurt everyday Americans in order, Mr. Speaker, to reward  billionaire donors with massive tax breaks.\n\nWhy was this done? The one big, ugly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…bring nearly 10,000 jobs  to the region.\n\nThey have created chaos at critical agencies that keep the lights on  like Bonneville Power Administration. Moreover, with their big, ugly  bill they have gutted clean energy investments meant to lower utility  bills and strengthen our energy infrastructure in the Pacific Northwest  and keep the lights on.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…day. Until we pass this enhanced tax credit bill, more and more  Americans will have no health insurance and the negative consequences  from that.\n\nLet's also talk about the big, ugly bill--Republicans call it the  big, beautiful bill--that is projected to increase electricity prices  for American families by 61 percent. Nearly 1 in 20 American households…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…heard  from people was, we are tired of a government that doesn't deliver to  the people. Make my life better, not worse.\n\nYet, somehow, we are waiting for a Senate bill, this big, ugly bill,  as if it couldn't get any uglier, that would actually slash more  resources from the very same people that sent us here instead of making  their life better.\n\nMr.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…spending  continues, there will only be money for interest payments and nothing  else: no Social Security, no medical, no defense, nothing.''\n\nThis week he said about the big, ugly bill: ``I am sorry, but I just  can't stand  it anymore. This massive, outrageous, pork-filled congressional  spending bill is a disgusting abomination.''\n\nWhich Elon Musk…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692137/which-elon-musk-to-believe"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…canceling tax credits to help union workers find jobs and to help  working people keep the lights on.\n\nThe President's so-called big, beautiful bill isn't beautiful. It is  a big, ugly joke. The only thing this bill does is hand out tax breaks  to billionaires while making it harder for working people to get by.\n\nAs we know, the bill canceled tax credits…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695602/devastating-harm-caused-by-trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…country right now.\n\nThe only thing Republicans care about is making their fossil fuel  friends even richer.\n\nAll of this comes a few months after Republicans passed their big,  ugly bill. That law will cause Americans' utility bills to go up by  about nearly $300 per year. That is on top of the nearly $29 billion in  electricity bill rate hikes that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…let's be really,  really honest about what is going on here. This isn't just a debate  about cuts, because in this rule, Republican leadership snuck in a  rewrite of their big, ugly bill.\n\nYes, that is right. A vote on this rule is effectively a revote on  their reconciliation package, a do-over. It is a  desperate attempt by Republican leadership to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…huge, greedy  corporations. And they accuse Democrats of being in the pocket of the  insurance industry?\n\nGive me a break. Nobody believes this BS.\n\nMr. Speaker, look at your big, ugly bill. Look at all the tax breaks  that go to millionaires and billionaires and big corporations. Every  millionaire, as I stated before, because of Republicans, are getting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today to condemn Republicans' big, ugly  law, which decimates food assistance for 42 million Americans,  including millions of children, seniors, veterans, and people with  disabilities.\n\nErica from Wilson, North…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693584/condemning-republicans-big-ugly-law"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…It is no  surprise that the first victim in the dismantling of the Department has  been the Office of Civil Rights. The Office of Civil Rights enforces  civil rights.\n\nThe big, ugly bill that they passed earlier this year cuts back on  student loans and Pell grants so fewer students can attend. Other  actions have been limiting equal opportunity in education.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698125/dismantling-the-department-of-education"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…will make it possible for families to thrive.\n\nIn fact, in just a couple of weeks, on October 1, our State  legislature will convene in the wake of Republicans' disastrous big,  ugly bill, which will gut healthcare and food assistance programs, to  actually shore up the programs that will save and support thousands of  lives in our State. They will invest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…will have as future leaders of our Armed Forces.                         Medicaid Paperwork Red Tape\n\nMr. SUBRAMANYAM. Mr. Speaker, we keep hearing the same thing about  the big, ugly bill the President signed last week. We hear we are  keeping Medicaid for the people who need it and only kicking off able- bodied people. This is simply not true.\n\nThese…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…majority has made it worse.\n\nThe bill that we voted on throws more people off of healthcare. Boy,  that is something to be proud of. There is no denying the fact that  their big, ugly bill cuts SNAP by $300 billion. They cut SNAP by $300  billion.\n\nThis is a benefit that, on average, is about $2 per person per meal,  and they cut $300 billion. They want…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…informed. Think of the harm done to  life-saving foreign aid that keeps children fed and vaccinated from  dreadful diseases that can and will cross our borders in check. And the  Big Ugly Bill does substantial harm to critical programs and to the  people who rely on them, so millionaires can get a tax break and the  rest of the country gets huge and endless…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…parroted their party line, claiming that this bill will end  up being unpopular.\n\nThey have done everything from describing this as not the Big  Beautiful Bill but as the ``Big Ugly Bill'' and claiming that somehow  it benefits only a fraction of the American people at the top 1 percent  and accusing us of fiscal irresponsibility, while they claim that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}]