[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…healthcare, and more. Hundreds of thousands of jobs have been cut due  to the DOGE policies. Our economy is sputtering, and the tariffs are  jacking up prices.\n\nThe so-called big, beautiful bill will decimate Medicaid, taking  healthcare from seniors, children, and working families, while driving  up premiums.\n\nThe President has told the majority not to negotiate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695634/delivering-for-the-american-people"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…been  sacred on behalf of the oil industry in our Nation. It is not the  first. There is an ongoing systematic plot that Donald Trump came up to  the Hill to say: Get my ``big, beautiful bill'' passed.\n\nWell, he might see it as a ``big, beautiful bill,'' but this thing is  one big economic disaster for our Nation.\n\nAnd I will say it again. It is all to…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, today is June 24, and it is almost exactly  a month ago that in this House, the misnamed One Big Beautiful Bill Act  was passed in the dead of night after hours and hours of debate while  the American people were asleep at home. With the rush of events that  take place every…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692841/stop-this-insane-attack-on-healthcare-that-affects-every-single-american"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…people will lose their  insurance. Everyone else on an ACA plan will pay more for worse  coverage, while billionaires sit comfortably and enjoy their tax breaks  from the One Big Beautiful Bill Act.\n\nRemember in the summer and fall, when Republicans told us that this  wasn't the right time to negotiate these subsidies over the shutdown,  they said: Don't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698373/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Palestinians would be moved to some  other place. That is a form of nouveau ethnic cleansing.\n\nI do not support it, and I want the world to know that if in this  bill, this big, beautiful bill that the President would have us sign  off on that I am already antithetical to, if there is money in that  bill to support the continued ethnic cleansing, the continued…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…bring down the cost of healthcare  because of the healthcare crisis that Republicans in this Chamber  precipitated back in July.\n\nJust to review the bidding, in July, the Big Beautiful Bill, which  all of you voted for--most of you voted for--slashed Medicaid and  slashed coverage for people on healthcare.gov. Now, all our hospitals,  all our healthcare…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696657/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Musk has decided to call it quits after President Trump and  congressional Republicans moved to eliminate a tax credit that would  have benefited Musk under the so-called big, beautiful bill.\n\nTo be completely honest, I agree with both sides on this. I agree  that Trump should start to question Elon's Federal contracts, and I  agree with Musk that the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692030/elon-calls-it-quits"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…schools, eldercare, and emergency  response. To protect against this, numerous States have passed laws to  decouple their tax code from the tax provisions in the so-called One  Big Beautiful Bill Act. This includes States like Maine, Virginia,  Pennsylvania, Michigan, Colorado, and Alabama. This also includes the  District of Columbia.\n\nTo avoid a more than…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, now, on reconciliation, a few hours ago,  while most Americans were fast asleep, House Republicans rammed through  their so-called Big Beautiful Bill through the House of  Representatives, in the dead of night, in the hopes that nobody would  notice.\n\nHouse Republicans took a bill that was already rotten to the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…mechanism. So, therefore, they largely don't need to dump the  filibuster because they can do their policy by simple majority already.\n\nYou saw that this year with the so-called Big Beautiful Bill that we  called the ``Big Ugly Betrayal,'' done solely on a party line, and if I  recall right, all of us in the 53-to-47 Senate--I think we ended up  with a 50-50…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…this bill  wouldn't take away benefits or close rural hospitals. Well, they were  wrong. We don't need more broken promises. What we need is a different  approach, a one big, beautiful repeal instead.\n\nLet's pass the Protecting Healthcare and Lowering Costs Act, which  will restore people's benefits and access to care, ensuring that people  in small towns…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695373/one-big-beautiful-repeal"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…knew this problem was coming all the way  back on January 20 when Mr. Trump first took office. To much fanfare,  they began moving forward with his legislative agenda, the big,  beautiful bill and other pieces of legislation. I don't even know how  many executive orders they put together and put out undermining the  government from the standpoint of government…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Connor's medical needs might not make it to his high school graduation.  Connor and so many others need this service to live.\n\nMr. Speaker, if the Republicans like their big, beautiful bill so  much, I beg this question: Why are they displaying it at 1 o'clock in  the morning?", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691496/gop-tax-scam-hurts-women-and-families"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "Mrs. TRAHAN. Mr. Speaker, proponents of Donald Trump's so-called big,  beautiful bill are lying to the American people. They claim it won't  cut Medicaid, but it slashes $715 billion, gutting care for seniors and  children with disabilities.\n\nThey…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691438/gop-tax-scam-hurts-women-and-families"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…themselves because this bill  is wholly toxic.\n\nHere is what Republicans should do. They should not let Donald Trump  bully them. They should hold firm and tell Donald Trump his Big  Beautiful Bill is a disaster, a betrayal of the American people.  Republicans should keep their own promises not to cut Medicaid. They  should listen to the critiques of some of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, I thank Chairman Smith for yielding.\n\nMr. Speaker, I rise in strong support of the One Big Beautiful Bill  Act.\n\nPresident Trump inherited a disastrous open-border policy from the  Biden-Harris administration. There were nearly 9 million encounters at  the southern border…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693161/one-big-beautiful-bill-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…pressing problem facing America as we try to  address the crime rate, the drug problem, and the education problem. It  is a problem that was, sadly, not addressed in the One Big Beautiful  Bill Act.\n\nAs a matter of fact, the One Big Beautiful Bill Act went, to a  certain extent, in the opposite direction. I want to educate the  American public on this problem,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…continues to work on  bringing down tensions in the Middle East.\n\nGod bless President Trump, God bless our troops, and God bless our  great country.                  One Big, Beautiful Bill's Economic Relief\n\nMr. MANN. Mr. Speaker, I am proud of the work our Republican  majorities are putting in to deliver American families the largest tax  cut in American…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Madam Speaker, after meeting with farmers, ranchers, small  businesses, teachers, students, and community leaders across Utah's  Fourth District, I am here to report the One Big Beautiful Bill Act is  a win for Utahns.\n\nIn Manti, I met with small business owners at a Sanpete County  Chamber of Commerce to talk about what this bill means to Main Street.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…caused by these drugs in our  communities. President Trump has done his part to secure our border,  and Republicans will supply him with more resources to do so in the One  Big Beautiful Bill Act. Through the SUPPORT for Patients and  Communities Reauthorization Act, we will combat the existing opioid  crisis in our communities.\n\nI am proud to stand in…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I thank the gentleman for yielding time.\n\nMr. Speaker, today I rise in support of the One Big Beautiful Bill  Act, which includes the work of the House Committee on Energy and  Commerce, to unleash American energy, promote innovation, and protect  healthcare for the most…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Promises Made, Promises Kept\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, my colleagues in the U.S.  Senate will vote this week on President Trump's One Big Beautiful Bill  Act, moving President Trump's agenda one step closer to being signed  into law.\n\nThis is critical legislation that will prevent the largest tax hike  in history by…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, I thank my friend from Texas for his  leadership.\n\nMr. Speaker, in order for us to deliver one big, beautiful  reconciliation bill, one that extends the provisions of the Tax Cuts  and Jobs Act, reins in regulations of wasteful spending, unleashes  American energy, secures the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689890/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "Mr. McGUIRE. Mr. Speaker, I thank the gentleman from Texas for  yielding me the time.\n\nMr. Speaker, this one big, beautiful bill delivers the American  people the promises of President Trump's America First agenda and  prevents the largest single tax hike on the middle class in history.\n\nA ``no''…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693198/one-big-beautiful-bill-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…The Energy and Commerce  Committee just finished up, and the House Ways and Means Committee  earlier. We have got 11 or so committees that have contributed to the  one big, beautiful bill, the reconciliation package. We want to see  this thing get advanced as we continue to make it into law as the  process plays out. We are going to move this conservative…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, on July the Fourth, President Trump  signed into law the One Big Beautiful Bill Act. The centerpiece of this  legislation is a permanent extension of the 2017 tax law, thereby  averting the largest tax hike in American history without a vote of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…bit better this year, a little bit smoother, and  much more affordable.\n\nMr. Speaker, that is not luck. That is because Congress is working to  pass President Trump's One Big Beautiful Bill Act, and it is already  making a difference in our summer travel plans.\n\nMr. Speaker, hardworking American families deserve the freedom to  fuel up without pinching…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…of the previous administration,  and a nation primed and ready to enter the golden age.\n\nOne of the many strong reinforced byproducts of our Republican vision  is the One Big Beautiful Bill Act. It is one of the most consequential  pieces of legislation that any party has ever passed and for good  reason.\n\nThe provisions interwoven in this legislation…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…ARRINGTON. Mr. Speaker, I think I can say a few things in 2  minutes, believe it or not, about some of the comments my colleague,  Representative Baumgartner, said about the One Big Beautiful Bill Act  and its positive impact on rural America, the heartbeat of this  country.\n\nThe food, fuel, and fiber capital of the world, west Texas, I can  tell you, appreciates…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, the big, beautiful bill is now the law,  so it is no longer a theoretical discussion about what the bill might  do. We are about to find out what it will do.\n\nThe Democrats have succeeded…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}]