[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…electricity to groceries to health  insurance are up, not down.\n\nIn fact, we are facing the biggest increase in health insurance costs  in 15 years, even as the cuts in this big, bad bill threaten to bring  more hospital closures.\n\nTrump's attacks on the Federal Reserve could cause another financial  crisis. Masked agents are roaming our streets, and reports…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…in immigration facilities. ICE plans to  increase its capacity to detain an average of 107,000 people by the end  of the year using $45 billion that was in the Republicans' big, bad  betrayal bill.\n\nHow did Republicans finance that unprecedented spending?\n\nThey did it by stealing healthcare from 16 million Americans.\n\nThis is cruel and unnecessary. First,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, I rise in strong opposition and  can never vote for this big, bad, inhumane, and ugly bill because it  will wreck healthcare delivery. It takes food from hungry children. It  sentences seniors to early deaths. It eliminates jobs and destabilizes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to oppose the big, bad  billionaire bill, especially the cuts to Medicaid.\n\nAccording to the Congressional Budget Office, this bill will result  in more than 13 million people across the country…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…anxious and afraid. This celebration of our heritage, culture, and  stories is dampened by the Republican scheme to strip away benefits  from those that need them most.\n\nThis big, bad billionaire bill would impact nearly 200,000 Asian- American constituents, many of them senior citizens in my district  alone, not to mention the nearly 1 in 10 Asian Americans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691503/gop-tax-scam-hurts-women-and-families"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…the fact that the United States was already experiencing record  oil production and was on its way to being a net energy exporter.\n\nAnd now they have done it again in their ``Big Bad Bill.'' But this  time they want more and more. To what end? We know this hasn't worked  before. We know previous efforts to offer leases here have actually  been a failure.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Speaker, I rise to share the impacts of Republicans'  big, bad bill.\n\nI don't want us to forget that healthcare is a matter of life and  death, and the proposed Medicaid cuts are a death sentence for people  like Jessica, who lives in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691495/gop-tax-scam-hurts-women-and-families"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…Homeland Security to hold this  administration accountable.\n\nICE must be defunded and dismantled. I am working to take the $75  billion that Republicans gave to ICE in the big, bad bill and invest  the money where it belongs, which is in expanded healthcare and  affordable housing. Every taxpayer dollar is better spent doing  virtually anything other…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699910/holding-ice-accountable"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, the news today is about a bill. It is a  big bill. The Republicans' big, bad bill is cruel, coldhearted, and  completely unnecessary. It is not even fiscally responsible. It is  actually going to add to the deficit.\n\nThis massive bill, which is more…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…we have seen the same script yield the same  results. This approach simply does not work. Since 2001, $31.6 trillion  has been added to our total debt, and thanks to the ``Big Bad Bill,''  that total is about to get supercharged.\n\nIt won't stop there.\n\nLater this month, this body will once again be faced with an  impending fiscal challenge funding the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the uninsured get sick. They don't seek care until  they have to go to the emergency room.\n\nHundreds of thousands of Virginians now stand to lose their  healthcare if this big, bad bill cuts Medicaid as it does now. Some  Members of the Republican caucus want to go even further.\n\nGloria has struggled for a long time with her health. She was born  with…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691506/gop-tax-scam-hurts-women-and-families"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…picture that our  country faces today: higher joblessness; Trumpflation; a host of  reckless policies, including trade wars, that have cost the American  people.\n\nThe Republican big, bad betrayal bill is unpopular everywhere in the  country no matter how you spin it because Americans know that kicking  17 million Americans off of healthcare just so you can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…when  I was in college helped me complete my education, and without that  critical nutrition assistance it's likely that I would not be a Member  of Congress today.\n\nThis Big, Bad Bill reverses the progress we've made addressing  climate change, resulting in thousands of lost jobs in renewable  energy, dirtier air and water, more extreme heat events,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…centers, and so many more.\n\nJust a few weeks ago, the administration froze a ton of funding that  Congress passed for summer school and afterschool programs. And again  with the ``Big Bad Bill'' that our Republican colleagues just passed,  President Trump signed into law a bill that gutted funding for critical  resources like Medicaid and SNAP, ripping healthcare…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Paul, Weiss, Skadden, and Latham, bent the knee and laid  down because they were too afraid of this administration destroying  their businesses.\n\nI mean, here are a number of big, bad, powerful, wealthy law firms  that can't even use the law to protect themselves, afraid to use the  law to protect themselves. What makes their clients think that those  law…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…my good  friend from California. I know what she is going to say here in just a  few minutes. She is going to say: Look at the Republicans. They are  supporting mergers of big, bad banks, and that hurts Americans.\n\nTo the contrary, Mr. Speaker. Allowing healthy mergers to prevent  bank failures allows for healthy financial institutions to compete with…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}]