[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the majority gave up yet another  guardrail, where they chose to go nuclear, to violate the filibuster,  to overturn the Parliamentarian in order to gratify the wishes of Big  Oil over the need of our constituents for cleaner air.\n\nThe GOP wasn't always this way. Republican administrations didn't  always demonstrate such hostility to the environment.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…all, crypto has  all the power in Congress because it is the number one source of super- PAC independent expenditures. Last year, crypto did more super-PAC  expenditures than Big Oil and Big Pharma times five.\n\nThis bill is designed to enrich President Donald Trump. Even Richard  Nixon never thought of printing up baskets of Monopoly money and  selling…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…here.\n\nWe cannot kick this can down the road and wait to take action. As our  kids are forced to grapple with this reality, I am sick and tired of  Republican efforts to let Big Oil and corporate polluters off the hook.\n\nThe methane polluter fee that would be rolled back by this resolution  corrects a serious market failure that makes it cheaper for polluters…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688175/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Republicans are pushing will drive American energy bills and prices at  the pump sky high.\n\nHowever, I guess those high prices are worth the costs to Republicans  if it means Big Oil and Gas are pleased.\n\nThe Methane Emissions Reduction Program was created to make sure that  these big corporations pay for their own pollution, but I guess my  colleagues…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688185/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Rubio did this. It is obvious. This is not a war for the  Venezuelan people. It is not a war for democracy. This is an illegal  war for oil. It is a coup for crude on behalf of big oil companies in  our country. It is just like ``The Godfather Part I.'' Trump made  Venezuela an offer it couldn't refuse. Capturing Maduro is the head in  the bed. We are holding…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…among  the American public on putting a pollution limit, a carbon pollution  limit on big companies--72 to 12. That is where the American people  are, not in the pockets of Big Oil.\n\nHere is another one: Impose a fee on big polluters. It shouldn't be  pollute for free. If you are polluting something, whether it is your  neighbor's yard with your waste,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…really serving in this  administration, who they are serving, is their big donors.''\n\nLook at who Republicans have helped. They have been in charge for a  year. They have helped Big Oil. They have helped Big Banks. They have  helped Big Tech.\n\nLook who was in the front row at Trump's inauguration: billionaires.  That is all he cares about. Look at their promises…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…difference between Iraq and this is that Bush didn't       keep the oil. We're going to keep the oil.\n\nThat was the President. Is this ``America First''? Of course not. It  is ``Big Oil Barons First.'' It is ``Billionaires First.'' It is  ``Trump First.'' First to rake in profits, mind you, not first to put  themselves in harm's way.\n\nAnd you can bet when…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…wind projects in  our country as they open our public lands for coal mining.\n\nNo. 92, gutted permitting processes in order to fast-track dirty  energy projects to reward his Big Oil and Gas and Coal cronies.\n\nNo. 93, canceled $90 million in disaster prevention funding to  Massachusetts alone.\n\nNo. 94, put all staff on the U.S. Interagency Council on Homelessness…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…serious about getting  after waste, fraud, and abuse. The Pentagon, by the way, has never,  ever passed an audit. They have never passed an audit.\n\nLet's look at tax breaks for Big Oil. We can't do that because they  write big checks.\n\nLet's go after the loopholes for billionaires. Let's end the  corporate giveaways.\n\nNo. No. No. Republicans don't want to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bills.\n\nThat is exactly what is happening right now. It is happening all  because this leadership here in this House refused to lift a finger.  They were too busy helping Big Banks, Big Oil, Big Tech, and whatever  billionaire needed a handout.\n\nThis Congress musters up the will to spend trillions of dollars on  tax breaks for billionaires and to send the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and sea level rise long after the  members who voted for this bill are gone. It abandons and condemns  those most at risk to real, unmitigated danger to give tax breaks to  Big Oil.\n\nThis Republican bill gives billions more to Immigration and Customs  Enforcement (ICE) when their unidentified, masked agents are abusing  their power with dangerous sweeps…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…bipartisan energy  efficiency progress. Having the information to make an informed  decision about your appliance that your family wants to buy is about  choice--your choice. Not Big Oil's choice, not Big Gas's choice--your  choice.\n\nHere is the information. Make up your mind. Do you want one that is  more efficient? There it is right in the middle of Best…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Federal waivers to get the job done.\n\nBut I know that even after all this progress, the detractors will  fall back on the same tired playbook of excuses. We know that the big  oil industry sees California's clean cars and clean truck sales as  existential threats. California has made tremendous advancements not  just in technology but in markets, but…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…incentives to modernize operations and remain competitive in an  international market that increasingly values low-emission energy.\n\nNow, I am supposed to get up here and bash Big Oil, but actually, Big  Oil is for the methane fee. The largest companies--ExxonMobil,  TotalEnergies, and Cheniere Energy--support strong methane rules. They  oppose this repeal…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…assessments under existing rules.\n\nThis is redundant, but it is not just redundant. It is punitive. It  was a rule put in place to attack what our colleagues like to refer to  as the Big Oil bogeyman. Apparently, because they have been successful  and they can actually turn a profit because there is a demand for their  product, they should be attacked by the Federal…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…just  trying to talk about these issues from their viewpoint. I get it.  However, I heard some speakers on the other side of the aisle say today  that we are just catering to Big Oil and others.\n\nThen I hear there were discussions with larger folks, and those are  the people who are okay with it. I hear from Representatives from  places like Alaska, North…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…claim this tax will cut emissions, but the U.S. already leads the world  in methane reduction, cutting emissions intensity by 42 percent since  2015. They say this is about Big Oil, but 90 percent of U.S. natural  gas comes from small and midsize producers. They claim only gas  producers are affected, but the Biden administration designed this rule…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]