[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…when the White House tells the Pentagon what it wants  to do, to Congress. It is in the law. Within 30 days, you have to do  that. It is not really complicated. It is not a big deal. They just  don't do it, and we have been asking over and over again. The lack of  respect for the law out of this Pentagon is a huge problem.\n\nMr. Speaker, let's start with,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…need to be hurt in order to  fix our country. I love it when Trump puts up all of these billionaires  to tell working families: You have to just deal with the pain. It is no  big deal. You should sacrifice. These are billionaires lecturing  hardworking, middle-class Americans.\n\nIf Republicans at least admitted what the impact of these tariffs  really were…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…majority leader, I would say maybe we should take an hour and  try to resolve that or adopt what my colleague has said, to iron out  the details over the weekend--because it is a big deal. It is a big  deal to go nuclear. It is a big deal to adopt a new idea that hadn't  been widely circulated until the last few days.\n\nSo I cast my heart and my vote with the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to  have this published, but once it was, there was a decision made by the  person who had the power to do so to say: Well, it is simply not  classified information, so no big deal.\n\nHere is the big deal. Mr. Goldberg indicates that at 11:44 a.m.  eastern time--he gives the name of the person, it is the Secretary of  Defense, posted in the chat in all…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…maybe up to $40 million for a parade of military tanks on his birthday.\n\nReally?\n\nWe are cutting money to save lives in this rescission package, but  $40 million-plus is no big deal, as long as Donald Trump is happy.\n\nWe should start with the Pentagon if we are serious about getting  after waste, fraud, and abuse. The Pentagon, by the way, has never,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Act, which recently passed  the House of Representatives. It attempts to codify the President's  dubious Executive order.\n\nNow, I can see people saying: Well, what is the big deal about making  someone show ID? Well, like many catchy sales pitches, this policy is  really a bunch of ``gotchas'' that will stand between millions of  voters and the ballot…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…reconciliation package and about  all issues of great importance to this caucus, to our constituents, to  the Congress, and to all Americans tonight.\n\nThis reconciliation bill is a big deal. It is important and it should  be talked about and discussed. The best disinfectant is sunlight, and  we have to stop allowing people to be so shady about  what is happening…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…copay for the first time up to $35. In the Energy and  Commerce Committee, my colleagues on the other side of the aisle said:  Well, they need skin in the game, so what is the big deal? I pay a  copay.\n\nMy colleagues on the other side of the aisle make a little bit more  than $1,255 of which they need to pay a little over a thousand in rent.  Now, they have…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…would be transformative for Somerset. It would create  about 250 to 300 good manufacturing jobs and would deliver more than  $10 million in annual tax revenues. That is a big deal for a small  town.\n\nSo for the last few years, local officials and our Massachusetts  Federal delegation has been working hard with the Federal Government to  help turn that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…using their position to introduce a nonsense bill to  rename the Gulf of Mexico.\n\nThe Gulf has been known as the Gulf of Mexico since the 16th century.  Why are they making a big deal out of this now? It is because they want  to stroke the ego of Donald Trump.\n\nBack home in California, my constituents are concerned about putting  food on the table. They…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690938/gulf-of-america-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…way, with whom we have a trade  surplus.\n\nWe are 9 months into this trade war with tariffs at the forefront. It  is a war with Canada. It sort of started with them. That is a big deal  for Vermont. We are a border State. But it is a big deal for all of our  States because Vermont is 1 of 34 States whose major trading partner is  Canada.\n\nFor Vermont, Canada…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…interest of the American people, but my colleagues on  the Democratic side do. My colleagues think when Republicans are taking  away people's healthcare in this country, it is a big deal.\n\nThis bill, this tax scam bill, would literally take food out of the  mouths of kids, and take nutritious food from senior citizens and  veterans. For what? To give massive…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…should have been denied, but instead, they went  through and cost this servicemember over $60 in unwanted fees.\n\nNow, I know to a lot of Members of this body, 60 bucks is no big  deal. Anybody familiar with the young enlisted men in our U.S. military  today who live, literally, paycheck to paycheck knows that $60 may be  the difference between having the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…colleague in New York has a different experience. I don't  know. I don't know if he hosts townhalls. I would encourage him to do  it. Maybe undersea fiber optic cables are a big deal in his district. I  can tell you that they are not in mine.\n\nMy constituents aren't really concerned with slashing permitting fees  so that the largest technology companies…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…What we do have, and Senator Lankford is right, is now a critical  mass of people who are willing to entertain changes to the way that we  process nominees. That is a pretty big deal. That is a pretty big deal.\n\nThis would be the first major bipartisan rules reform, I think, in a  political generation, maybe several political generations. And it is  not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Quarterback Club, which is the fundraising  arm for the football team. Our kid was on the football team. Like so  many others, our kid graduated--sorry, Mr. Speaker. He was just a big  deal.\n\nSo many others that are a part of this Quarterback Club where their  kids had already graduated years ago are part of a group that could not  say no to Billy O. We keep…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…measured in cubic feet, or whatever the  measurement is these days. As a result, they can say this is a cost  spread out over a large piece of the pie so it is not that big of a  deal to us.\n\nAs I said in my opening, there are 9,000 small and midsize  independent petroleum drillers in the United States. These, mostly  small, operations are responsible…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…activists.\n\nI urge the passage of this rule.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, a resolution of inquiry--Congress wants to know. Give us  some answers.\n\nIt is not that big of a deal, except that, right now, I think they  just don't want to have to vote. They don't want to have to vote on  Signalgate. They don't want to have to actually take up an issue…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…voting for and what they are voting against.\n\nNot passing this bill means a $1,700 increase in taxes for the  average American family of four. Mr. Speaker, that might not be a big  deal to the elites in Manhattan or San Francisco, but it does mean a  lot to the people of my district in North Carolina.\n\nNot passing this bill means our Border Patrol officers…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economic economist, the CMS data and HHS data, and The Wall  Street Journal, everyone else looks into this--it is coming in at 120  percent of fee for service.\n\nWhy this is a big deal is when Medicare Advantage was designed--it  really came into effect in 2005--Senator Frist, who is a doctor--they  put together a plan with this idea that we are going to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…already passed.  It passed the House in July, so if we pass it right now, it is going to  go to the President of the United States' desk for a signing. And this  is a really big deal for my constituents.\n\nHere is what it is: I talked about what I called the special  patriotism of Alaska Natives. They serve at higher rates in the  military than any other…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Nation.\n\nSo in September of 1990, around 46,000--we don't know the exact  number--students in 4 different States just quietly gathered to pray.  Now, that may not seem like a big deal, but in 1990, there was a great  debate that was still spinning on this issue. In fact, that year, that  September day, at at least one of those gatherings, the sheriff's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that they can get squatters out of their home when these squatters  illegally go into their homes, overstay their time in those homes, or  whatever it might be.\n\nIt is a big deal to help our servicemembers in any way, shape, or  form that we can to get people illegally out of their homes. It just  takes an undue stress off our servicemembers so that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695472/servicemember-residence-protection-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…wouldn't it then be a little bit late to vote on initiating a war?\n\nSee, this is an enormous debate. This is an important debate, and  this should not be sluffed over as, Oh, no big deal. The war is already  over.\n\nWell, we actually don't even know if the war is already over. We are  under a blockade. The current administration has said they will send  troops…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…legislation, not just including what is riding along  with it today from other committees, but in and of itself it authorizes  over half of all discretionary spending. This is a big deal.\n\nIt also has been done for 64 consecutive years. No matter which party  has control of the White House, and no matter which party has control  of this Chamber, we find a…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…there was a spot of dirt that was dug up there and a group of  Oklahomans, along with the Architect of the Capitol, buried a seedling  tree.\n\nNow, that may not seem like a big deal on the Capitol grounds, but  there aren't many trees that are planted on the Capitol grounds. Many  of the trees that are on the grounds are 100 years old or some, 200.  This…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…now.\n\nMr. Speaker, I take a lot of questions from folks back home. Utah is  a State that hits above their weight in academic outcomes. We have  large families. This is a big, big deal for us.\n\nThe confusion of why would you dismantle the Department of Education,  I will make sure I do my part, and I have spoken about this to a lot of  constituents back…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…calculator?\n\nMr. Speaker, what was it, 10 days ago, 2 weeks ago, Moody's  downgraded the United States and part of the point--because I know we  all read it because it was such a big deal. You subscribe to Moody's,  you downloaded the report. Thank you, Mr. Speaker, for letting me have  a Bloomberg Terminal. I chair the Joint Economic Committee so we bathe…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Settlements to create  this system.\n\nIt is a true threat to Western Civilization and maybe something that  to some of my colleagues who couldn't be here tonight also is as big of  a deal to them. I appreciate those people who have cosponsored and  voted for   Tom Emmer's bill. I hope we can vote on it soon in the  House, and the Senate takes it up.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Development Finance Corporation so that  America, not China, can set the pace for global investment. It expands  our loan program from $60 billion to $205 billion. That is a really big  deal to get America out there on the world stage.\n\nAlso, with this NDAA, as many know, we are repealing sanctions on  Syria that were placed there because of Bashar al-Assad and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697811/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}]