[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Is it simply because the goal is, as always, to  reward billionaires, as was done with the one big, ugly bill, providing  them with massive and unnecessary tax breaks?", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Madam Speaker, I rise today in opposition to this rule  which allows for consideration of the Republicans' extreme budget that  slashes funding for vital programs like Medicaid, SNAP, and Federal  housing assistance to bankroll $4.5 trillion in tax breaks for  billionaires and big corporations.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "What  is at issue is the tax cuts for multimillionaires, billionaires, and  big corporations.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "I am glad to call out the egregious giveaway to billionaires and  big corporations being orchestrated in this Republican tax bill.", "title": "Providing for Consideration of H.R. One Big Beautiful Bill Act", "date": "2025-05-29"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "They delivered all right--for billionaires and big donors.", "title": "Providing for Consideration of H.R. Supporting Pregnant and Parenting Women and Families Act; Providing for Consideration of H.R. Pregnant Students' Rights Act; and Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Look at all the tax breaks  that go to millionaires and billionaires and big corporations.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Oh, by the way, I am going to give  billionaires a big tax cut.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Fight for the middle class, the  working class, the vulnerable, not to protect the interests of  billionaires and big corporations.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Make no mistake about it, this budget will lead to millions of  Americans losing their healthcare coverage, all so Republicans can give  giant tax breaks to billionaires and big corporations.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Republicans are stripping healthcare away  from 16 million Americans so they can give giant tax breaks to  billionaires and big corporations, two groups that don't need any help  right now.", "title": "Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-11"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Republican billionaires  and Big Oil companies are the real winners when resolutions like this  are passed and savings are ripped away from American consumers.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''", "date": "2025-03-27"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Further adding to the chaos, this month, House Republicans are  expected to finish drafting the text of the reconciliation bill through  which they are planning to cut healthcare benefits to seniors,  children, and people with disabilities and cut nutrition assistance to  the poor in order to pay for a huge tax giveaway to billionaires and  big business.", "title": "Providing for Consideration of H.R. Gulf of America Act; and Providing for Consideration of H.R. Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-06"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Of course, we shouldn't be surprised that the House Republicans  continue to prioritize billionaires and big corporations over everyday  Americans.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Now  they are on the cusp of stripping millions of people of their  healthcare, all so they can shower these giant tax breaks on  billionaires and big corporations.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''", "date": "2025-03-05"}]