[{"senator": "Al Green", "party": "Democrat", "sentence": "Due process is accorded you not because you are a person who is  living the high life, wining and dining with the billionaire class,  living in the suites of life, having your galas, engaging in the  various cocktail events, known to all the people as an honorable  person.", "title": "A Message to the Cabinet", "date": "2025-05-01"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "President Trump's first 100 days in office have eroded constitutional  rights, illegally and lawlessly dismantled Federal agencies, and  consolidated power into the hands of the billionaire class.", "title": "Dte Rate Increase", "date": "2025-04-30"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Some of us  must ask during Passover and Easter week who is being forsaken in this  wild rush to endow the billionaire class with more, more vast infusions  of money taken out of the hides and hearts of the American people?", "title": "Trump Tariffs", "date": "2025-04-10"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "The billionaire class wants subsidies for every  investment they make, even when they are building the Chinese economy  or the Russian economy or the Iranian economy.", "title": "Problems Caused By Doge Cuts", "date": "2025-02-27"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "They want us to be  focused on their priorities, on making their lives better; not on the  priorities of the Elon Musk-wing of the Republican Party, the  billionaire class.", "title": "Providing for Consideration of H.R. Prohibiting Voting By Noncitizens in District of Columbia Elections; Providing for Consideration of H.R. District of Columbia Federal Immigration Compliance Act of Providing for Consideration of H.R. Protecting Our Nation's Capital Emergency Act; and Providing for Consideration of S. Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-10"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "The Republican agenda in the House today accomplishes one thing and  one thing only--selling out the American people and our planet so they  can continue to enrich the oil baron oligarchs and billionaire class.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-06"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "We will not go down the path  that our Republican friends intend to go, and that is to extend the  2017 tax cut law that actually provided more than 85 percent of the  trillions of dollars of benefits of lower taxes that go to the  superwealthy and the billionaire class.", "title": "Democratic Proposals", "date": "2025-02-26"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "It is the Members on  this side of the aisle that are fighting to save healthcare for the  American people, and it is our friends on the other side of the aisle  who are fighting for the billionaire class.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "If it wasn't  bad enough, this all is being done to give trillions of dollars--not  billions or millions, but trillions of dollars in tax breaks to the  billionaire class and the largest corporations--corporations that do  not need these tax breaks.", "title": "Budget Cuts Will Harm Families", "date": "2025-05-21"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Maybe they have forgotten that the people  elected them, not Trump or the billionaire class.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Later today, Republicans will be back on their tax plan, the one  where they take deserving taxpayer dollars and give them to the  billionaire class in the form of tax cuts for them.", "title": "Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''", "date": "2025-04-09"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "There  is one group making out as a result of this bill: the billionaire  class.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "When the billionaire class needed another tax cut, when they wanted  to funnel money to the people who write their campaign checks, boy, did  Republicans deliver.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Democrats will  stand where we always do, on the side of the middle class, against yet  another reckless Republican budget that steals even more wealth for the  billionaire class.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Republicans' supposed signature bill  betrays everyone outside of the billionaire class and the special  interests.", "title": "Budget", "date": "2025-07-21"}]