[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "This might not mean a lot to some of the President's friends and  family members, billionaires on his Cabinet."}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Also, billionaires  can weasel out of paying their fair share."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "The Republican leadership will not bring it up  because they care more about tax breaks for billionaires than tax  credits for working families."}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "As a part of a larger plan to pay  for tax cuts for the wealthiest amongst us who have done the best over  the last 20 years, for billionaires that seem so close to the President  that they sat right on the dais at his inauguration and sit in his  Cabinet meetings at the White House."}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "As Elon Musk is busy firing thousands of New Mexicans, the Republican  majority is preparing today a budget that offers American taxpayer  dollars to give massive tax breaks for millionaires and billionaires."}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Meanwhile, if you look at what the Trump administration and our GOP  colleagues are doing, they are actually adding deficits of trillions of  dollars to give tax breaks to billionaires."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Chair, that last month, House Republicans  passed the biggest cut to Medicaid in history as part of their scheme  to fund giant tax breaks for billionaires."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "President Trump said he will fight  for the working class, but instead put Elon Musk and billionaires in  charge of our government."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "To pay for tax breaks for billionaires and large  corporations; tax breaks they don't need."}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "The truth is that Republicans are happy to make  permanent massive tax cuts for billionaires in their ``Big Ugly Bill''  but refused--refused--to make permanent tax credits hard-working  families rely on to get their healthcare."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "In fact, what the Republicans have been focusing on is a massive tax  giveaway to billionaires like Elon Musk while they rip away healthcare  from millions of Americans."}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "This is about cutting important critical  services for the American people to give tax credits to billionaires."}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Instead of staying focused on lowering costs, House Republicans have  spent too much time protecting tax breaks for millionaires and  billionaires, blocking reforms that would help families, and  threatening government shutdowns that only add to more chaos."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "But it has no problem remodeling the  White House bathrooms with marble and gold, throwing a ``Great Gatsby''  Halloween party for the richest friends, and passing tax cuts for  millionaires and billionaires or inviting Senate Republicans down for  breakfast as Americans, many of them, struggle to pay for their own  breakfast."}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "1949 is a substantial giveaway to major oil and  gas corporations, billionaires, and executives at the expense of  working people once again."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "That is a tax cut for billionaires and rich people."}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Democrats are counting on this fact while stoking class resentments  over tax breaks for millionaires and billionaires, but millionaires and  billionaires don't work for tips."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I am going to show the slides that show what the Democrats say: We  will just tax billionaires and rich people."}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "We have listened to a lot of rhetoric about millionaires and  billionaires."}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "The word ``billionaires'' was  mentioned by my colleague from California."}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "Let's talk about some of their claims, that this is a handout to  billionaires."}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "These aren't the millionaires and billionaires."}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Speaker, about billionaires,  tax cuts for billionaires."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I keep hearing: You are giving away to billionaires."}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "That doesn't sound like benefits to millionaires and  billionaires."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "It  is not for the millionaires and the billionaires."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "They oftentimes talk about,  oh, this is just some tax giveaway to the billionaires."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "So Republicans can hand out tax cuts to  billionaires."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "The extent to which there is an extraordinary network funded not just  by George Soros but a large number of radical billionaires that are  funding organizations dedicated to putting into office DAs and judges  who put criminals on the street, who allow dangerous criminals to walk  among us in our communities, on trains in Charlotte, North Carolina,  where a young woman from Ukraine was butchered by someone who had been  in and out of jail, arrested 14 times."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Democrats will say over and over again that this is just a tax break  for the billionaires."}]