[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "McMahon because funding cuts for  schools, students, parents, and teachers all for the sake of  billionaire tax breaks--whose kids probably don't go to public  schools--is an awful idea."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "This harmful Republican resolution puts  the profits of billionaire corporate polluters over the health and  welfare of the American people, and it makes a mockery of Republican  promises to make America healthy again."}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Overturning the overdraft rule is yet another giveaway to these big  banks and the billionaires who control and run and own them."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "If you want more evidence of that, look at the bills on the floor  today: more garbage, more culture war crap, more bills written by this  Republican majority of, by, and for the billionaire class."}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "We have got a billionaire who is the Secretary of  the Treasury."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "It is one of the ways they can close that budget hole when they take  huge tax breaks for billionaires."}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "My colleagues and I are standing here because my Republican  colleagues have bowed down to the whims of an unelected billionaire and  a wannabe dictator."}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "The SNAP cuts in the big, billionaire bonus bill are literally going  to take food off of the table for 42 million Americans, a third of them  children."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Madam Speaker, it has been only 7 months since  billionaire Elon Musk fled town and barely 1 month since his heartless  DOGE machine collapsed, yet the damage keeps spreading."}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "For the past month, our Federal workers and agencies have been  assaulted by a dilettante billionaire empowered by President Trump to  muck about in Americans' lives and Federal agencies."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "What is worse, it comes at a time when Republicans are ripping  healthcare away from at least 13.7 million Americans in their  billionaire boondoggle bill."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "I am glad to call out the egregious giveaway to billionaires and  big corporations being orchestrated in this Republican tax bill."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "This Republican majority has done nothing for working people, nothing  to lower costs, nothing to make life more affordable, but, boy, have  they delivered for billionaires, corporations, and special interests."}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Everyone else on an ACA plan will pay more for worse  coverage, while billionaires sit comfortably and enjoy their tax breaks  from the One Big Beautiful Bill Act."}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Lutnick is a billionaire who can easily provide for her, while most  seniors rely on their monthly payments."}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Whatever a person makes today, the greatest thing about America, the  greatest country in the history of the world, is that whatever someone  is today, however much they make today, wherever they came from today,  they can be anything they want to be if they work hard, play by the  rules, and follow their dreams, whatever that dream is, even if that  person wants to be a billionaire\n\nMr."}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Speaker, about billionaires,  tax cuts for billionaires."}, {"senator": "Brian Mast", "party": "Republican", "sentence": "How many times did she say the word ``billionaire''?"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "In  fact, everything he has done in office has helped his billionaire  cronies, who, by the way, gave hundreds of millions of dollars to his  campaign at the expense of families like the ones that I represent in  my district across the Hudson Valley."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Ray Dalio, the billionaire, has been giving speeches around the  country."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I am going to show the slides that show what the Democrats say: We  will just tax billionaires and rich people."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "One hundred days of corruption, as billionaires like Musk and DOGE  take Americans' personal Social Security data and fired the employees  we need to process those Social Security checks."}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "Anybody who has  been a victim of sexual assault, or maybe they have been victimized by  a family member, maybe it is not a billionaire, but they are all  waiting and watching to see what we do today."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "As the Ray Dalios and these people who are the billionaire experts  are saying: China is in the market."}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "That is not some rich billionaire getting a break."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Now, we actually have our friends on the left basically saying: You  are going to give away to the millionaires and billionaires."}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "In their  big, beautiful bill, Republicans took a sledgehammer to our fragile  healthcare system to give permanent tax breaks to their political  donors, the billionaires, and the biggest corporations."}]