[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…Madera County Sheriff. In 2020, the Madera County Board of Supervisors  appointed Mr. Varney as County Administrative Officer, overseeing 25  county departments and a half-billion-dollar budget.\n\nCOVID hit almost as soon as he was hired, and Mr. Varney found  himself navigating Madera County through one of the most challenging  times in recent history.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…data-driven       pretrial policy reforms in D.C. and replace it with a wealth       based system that fuels mass incarceration, racial       disparities, and benefits the 2 billion dollar bail industry.\n\nD.C.'s pre-trial system is grounded in individual       assessment, not based on wealth. The federal Pretrial       Services Agency for the District of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…million people just to hand the richest 1 percent of Americans  a tax break they don't need. No one should be surprised that the  Republicans' next order of business is a billion-dollar handout to the  President himself.\n\nIn just 6 months, President Trump has enriched himself and his family  to the tune of $1.2 billion, and that is just the beginning.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…parks that they       seriously neglected basic upkeep of the magnificent parks we       had. So, we temporarily put off acquiring new parkland and       started a new billion-dollar, 5-year program to repair and       modernize facilities at our national parks and wildlife       refuges. If you've been to just about any national park       lately,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I rise in opposition to this resolution. We are here  today on the floor to support the complete disclosure of information  related to Jeffrey Epstein and his billion-dollar, international child  sex-trafficking ring. Our side of the aisle, at least, supports the  release of information relating to anybody who had anything to do with  it, whether…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…for taxes and maintenance of their land, and agritourism has helped  families across Virginia do just that.\n\nThis isn't just happening in Virginia. Agritourism is now a billion- dollar industry across the country, and it keeps growing. It is  revitalizing local, rural, and small-town workforces. The tourist  dollars are also expanding hotels, restaurants,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…unbelievable that 16 years have gone by and that we haven't found it  within ourselves the values we hold dear in America to give those who  have the least a raise.\n\nWe gave billion dollar giveaways to those in the top tax bracket, and  we can't raise the minimum wage from $7.25 an hour. We should hang our  heads in shame that we don't think about those who…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Speaker, the seasons may change, but we know this cycle is going  to go on. Families in New Mexico and across the Nation are going to  continue to pay the price for your billion-dollar tax breaks.\n\nAmericans literally cannot afford this economy. They can't afford  this administration or the GOP's leadership here in this House.\n\nThat is why we are here…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…reports  that natural disaster damages have risen more than tenfold since the  1980s and now cost the global economy over $200 billion per year.  NOAA's 5-year average of billion-dollar disasters in the period from  1980 to 2024 averaged nine of them per year; 1980 to 2024 averaged 9  billion-dollar disasters per year. From 2020 to 2024, that segment,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…from enrolling top international students altogether.\n\nThe United States has welcomed international students for decades.  Some of them include world leaders, founders of billion-dollar  companies here, and over 40 percent of the founders of the American  leading AI companies, just as a few examples.\n\nWe are shooting ourselves in the foot. Instead, why…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693005/student-visa-process"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…5.27  percent in Federal taxes. That is a rate higher than most of the United  States' wealthiest billionaires or megacorporations. Yet, while  Republicans give another billion-dollar company another tax break, they  are telling us that it is immigrants who are taking from the community  and from the people. Well, that is a lie.\n\nIt is a lie because…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…educated at Saint Mary's in Berkeley.\n\nHe first came to national attention by putting a human face on the  murder of Oscar Grant. He is the youngest director to helm a billion- dollar film. Now, with ``Sinners,'' he has given the world the work of  prophetic cinema.\n\n``Sinners'' deploys the imagery of Southern Gothic horror to excavate  the truths this…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700026/9999"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…detention centers once and for all, and we can finally reject the lie  that Trumpian cruelty is security because in America, our safety should  never come second to a billion dollar corporation's profit.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697457/fighting-dhs-immigration-raids"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…our country.\n\nEven as the vast majority of small businesses are seeing massive  tariff-induced cost hikes, this administration is offering exemptions-- exemptions--for billion-dollar corporations.\n\nIf you can get a dinner invitation to Mar-a-Lago, like the heads of  Apple and Google, you can secure an exemption for your industry.\n\nNow, in almost every…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, I oppose the rule because it contains H.R.  2189, the Law-Enforcement Innovate to De-Escalate Act. This is a  terrible bill and a billion-dollar giveaway to gun manufacturers  wrapped in a deceiving title.\n\nThe corporate lobbyists pushing this bill claim it is an effort to  prevent police violence, but, in reality,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699906/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…State-sponsored, forced  harvesting of human organs.\n\nInnocent people, often prisoners of conscience, are being killed so  that their vital organs can be removed and sold. This is a billion- dollar black market built on murder. It is a direct assault on every  principle of human dignity and decency.\n\nH.R. 1503, the Stop Forced Organ Harvesting Act of 2025, is a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…incentivized electric vehicles using billions of taxpayer dollars, with  only 60 charging stations to show for it. Folks, that is just one of  the many energy-related billion-dollar boondoggles by the former  administration.\n\nAs chair and founder of the Senate DOGE Caucus, I committed to  preventing unchecked bureaucrats from issuing regulations that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…mandates in place. If the Biden administration's so-called  energy efficiency regulatory agenda was cost effective for the American  people, why did they also have to have a billion dollar slush fund to  pay for it?\n\nInstead of a one-size-fits-all mandate from Washington, House  Republicans are focused on limiting the authority of the Federal  Government,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Iowa's businesses, America's businesses, deserve an equal opportunity  to access the capital they need to grow right on Main Street. These  businesses are not backed by billion-dollar valuations or teams of  high-powered lawyers. What they do have is grit, innovation, and the  drive to succeed. They are not asking for special treatment, Mr.  Speaker,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it or  against it. That depends on a lot of variables--the Inflation Reduction  Act to actually repeal the ridiculous subsidizing, enriching the  Chinese and enriching billion-dollar corporations, and undermining our  energy security.\n\nDo we have the resources necessary to secure the border and the fees  to pay for it? Are we putting in the provisions…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…businesses come  back to life as Spirit Halloween stores. It is almost spooky how fast  these Halloween stores pop up, transforming the remains of abandoned  buildings into a billion-dollar business. Spirit Halloween's successful  body-snatching business model scares up a great idea for reviving the  government's graveyard of lifeless real estate.\n\nLet's sell…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…program that a Member  of Congress brings to the floor should have a tax increase attached to  it. He is correct. He was correct.\n\nWhy? He was correct because if you bring a billion-dollar program to  the floor, we vote for it because the headline will say: Chip Roy  opposes puppies or Chip Roy opposes cancer research or Chip Roy opposes  something for veterans…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…senseless violence became  a regular news story.\n\nWhile Americans were working multiple jobs to afford rent and  groceries, the Biden-Harris administration was funding a billion-dollar  pipeline for unaccompanied aliens, and empowering NGOs that had no  incentive to solve the crisis, only to profit from it.\n\nThey called it compassion, however, in reality,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}]