[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…abandoned, and they will have to reckon with the  fact that the same government that swore to help them turned its back  on them, all so Republicans can find more money to give billionaires  new tax breaks.\n\nVital programs like the Division of Blood Disorders should not be  subject to political games, and those suffering from blood disorders  should not have…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690579/blood-transfusion-oversight"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, today Representative Beyer, Senator  Whitehouse, Senator Wyden, and I introduced a billionaires tax bill.\n\nBillionaires don't pay their fair share of taxes, and with the Trump  tax program starting in 2017, they have increased their wealth  tremendously.\n\nNot paying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695620/billionaires-dont-pay-their-fair-share-of-taxes"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Two  people who don't have the slightest clue how much Social Security means  to families are now threatening Americans' benefits in order to pay for  giant tax cuts for billionaires, and since those two cannot begin to  imagine what it means for working people, let's tell them what Social  Security does.\n\nA few weeks ago, I posted a video explaining…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Meanwhile, the American people need more affordable health insurance,  but these Senators, with their House allies, are lining their own  pockets. I say: No more tax breaks to billionaires and no payoffs to  U.S. Senators. This is what happens when power serves itself instead of  the people.\n\nThis isn't leadership. It is corruption disguised as legislation.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696730/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…improve our  healthcare system or lower costs for families and patients. Nope.  Republicans are looking to dismantle the basic Medicaid Program to help  the tax cuts for billionaires.\n\nDon't take my word for it. It is not just another political speech.  Last week, the nonpartisan Congressional Budget Office issued a  bombshell report. I am sure the Republicans…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…can't afford it?\n\nI will say why Republicans are still showing up. As Mr. McGovern  said, this rule also includes the next step in a budget plan that would  cut taxes for billionaires at the same time that it cuts healthcare for  working people. The math doesn't lie. This budget plan requires $880  billion of cuts under the Committee on Energy and Commerce.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…preparing to do.  The results will be devastating--the largest cut to the most successful  anti-hunger program in American history. All to pay for massive  giveaways to billionaires.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691427/supporting-the-democratic-womens-caucus-on-defending-snap-and-medicaid-cuts"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Republicans teeing up these  massive cuts to Medicaid in their budget?\n\nIt is because they are singularly focused on giving massive tax  breaks to their wealthy donors, to billionaires like Elon Musk, and to  huge corporations. They are willing to do that by selling out  healthcare coverage for 80 million Americans.\n\nThat is it. It is really that simple.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…in voicing our  unwavering commitment to protecting the vital programs that Americans  rely on, prioritizing the working families that I represent over  millionaires and billionaires.\n\nLast night, I stood with every single Democrat in this House to vote  against a devastating budget advanced by House Republicans to enrich  the ultrawealthy at the expense…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688236/democratic-proposals"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of the  Epstein files, and yet very rich and powerful interests are still  working to bury them.\n\nWho are they protecting? Are they protecting the Washington elite,  the billionaires, the politicians, the establishment class that think  they are above the law? Maybe they are even protecting the President  himself?\n\nWe won't know for sure unless and until…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694813/american-people-deserve-the-truth"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…are our  neighbors. They care about our community, and they give back. We should  make it easier for them, not harder.\n\nTo lower costs, let's go after the price-gouging billionaires and  corporate monopolies, not small business owners keeping our communities  alive.\n\nMr. Speaker, I urge this body to listen to the voices of our  constituents like Julie.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…conditions, including millions of veterans who become sick or  disabled as a result of their service.\n\nWhat is this all about? It is about funding giant tax breaks for  billionaires. Yes, over 2 trillion of that money goes to people who are  wealthy, people making over $400,000 a year.\n\nI am all for keeping in these tax cuts for people making under…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…program for comprehensive health and long- term care coverage to one in three people with disabilities.\n\nMy colleagues across the aisle are so focused on giving tax cuts to  billionaires, I think they have lost sight of the everyday people who  will be harmed by their reckless decisions.\n\nOne of my constituents, Rachael, is a caretaker for her adult son…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…kilter when we have a President who is absolutely passionately  excited about building a giant, golden ballroom worthy of Louis XIV to  feast, to dine, and to dance with billionaires and power brokers of the  world, while letting--in fact, forcing--America's children and  vulnerable families to go hungry.\n\nI thank Senator Schumer and the other 44 additional…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…make sure that Americans can avoid being exploited by  big and powerful institutions.\n\nOverturning the overdraft rule is yet another giveaway to these big  banks and the billionaires who control and run and own them.\n\nI have said before but it bears repeating: President Trump will  always help his billionaire friends at the cost of helping you.\n\nToday,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Chair, I yield myself such time as I may  consume.\n\nMadam Chair, once again, here is the budget document. Here are  spreadsheets. I keep hearing: You are giving away to billionaires.\n\nWhere is that?\n\nWhere is it?\n\nMadam Chair, it doesn't exist because this is a box that allows us-- and understand, Madam Chair, I am passionately concerned about debt…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…relief from this provision. We don't feel what doesn't  happen.\n\nDemocrats are counting on this fact while stoking class resentments  over tax breaks for millionaires and billionaires, but millionaires and  billionaires don't work for tips. They don't get paid overtime. They  don't rely on Social Security. Working families do, and for the first  time,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…who have just said: Look, is this moral? Is this really what America is  all about? Yes.\n\nI am going to show the slides that show what the Democrats say: We  will just tax billionaires and rich people. It doesn't get you anything  close. It doesn't close the gap, and you know it.\n\nFor our side, we are going to cut spending. Really? It doesn't get  you…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Committee. We will continue to pass  this legislation and deliver real relief for working families in this  country. We have listened to a lot of rhetoric about millionaires and  billionaires. It sounds like Bernie Sanders is in the Chamber, but  really this is about the working people of this country.\n\nIf we do nothing and the tax cuts expire in this country,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…executive order.  It is going to attack his agenda, the America First agenda, that he was  overwhelmingly elected to enact.\n\nThese unions are not neutral actors. The word ``billionaires'' was  mentioned by my colleague from California. I am glad he mentioned the  term ``billion,'' because that is what the partisan machine government  union spent in the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…begin a process that sets a fiscal framework to  meet the agenda the American people demanded in November.\n\nLet's talk about some of their claims, that this is a handout to  billionaires. It is their party that abandoned the middle class by  spending like crazy. Not extending the 2017 Trump tax cuts would be the  ultimate betrayal of the middle class. The…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…border communities shouldering a burden Washington created are who the  one big, beautiful bill is going to help.\n\nWho are these people? These aren't the millionaires and billionaires.  These are everyday Americans. Despite what we hear from the Democrats  and the media over and over again, this bill isn't tax cuts for the  rich. It is not about eliminating…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…people back  home, Mr. Speaker, that are angry, saying why did you vote--those  waiters and waitresses, who make $32,000 a year, when they keep hearing  them talk about billionaires. They are not voting against billionaires.  They are voting against waiters and waitresses earning $32,000 a year  and cops working the beat who don't want to have to pay…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent of all taxpayers will be subject to higher  taxes.\n\nNow, we actually have our friends on the left basically saying: You  are going to give away to the millionaires and billionaires. It is not  the distributional effect of 2017.\n\nAs a matter of fact, one of the great trivia points--and I actually  had some fun with this one because it comes from my…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…best fits their needs, and expanded  health savings accounts so American families can control their own  healthcare. That doesn't sound like benefits to millionaires and  billionaires. It sounds like benefits to hardworking American families.\n\nAlso, I note that the subsidies that the gentleman from Massachusetts  so wants to support, the American people…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…is for those working families, those small business owners,  and those farmers who are doing everything they can just to get by. It  is not for the millionaires and the billionaires.\n\nHow many waitresses who are tipped are billionaires? How many  billionaires work hourly jobs and overtime? None do so.\n\nMr. SMITH of Missouri. Wow, Mr. Speaker, we have…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Speaker, on the individual side, this is something that my  Democrat colleagues oftentimes overlook. They oftentimes talk about,  oh, this is just some tax giveaway to the billionaires. I have never  seen anybody actually pinpoint and show me where this is targeted  toward giving the billionaires some type of tax relief.\n\nProbably the largest portion of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…hours just to see a doctor and  will have to drive hours more when their Medicaid cuts destroy our  world healthcare system. Why? So Republicans can hand out tax cuts to  billionaires.\n\nDo the millionaires and billionaires you are protecting really need  more? They already have so much. They will drown and bury the veteran,  the pregnant mother, the disabled…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…President recognized just yesterday, I  believe rightfully.\n\nThe extent to which there is an extraordinary network funded not just  by George Soros but a large number of radical billionaires that are  funding organizations dedicated to putting into office DAs and judges  who put criminals on the street, who allow dangerous criminals to walk  among us in our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…administration. We are 4 months into our  119th Congress, and this is going to be a key piece.\n\nDemocrats will say over and over again that this is just a tax break  for the billionaires. Mr. Speaker, when you cap SALT like the  Republicans did, that only hurts wealthier folks. I hate to bring them  that news. I believe it was Bernie Sanders who was criticized…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}]