[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…frustrated and frightened by  the imminent skyrocketing of healthcare costs caused by the loss of the  ACA tax credits and cuts to Medicaid, Medicare, and lifesaving  biomedical research.\n\nMy constituent, Ms. Angela Hoomes, is unable to walk without  debilitating pain. She is worried that, without the tax credits, she  won't be able to afford health…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…entirely  by this new Trump administration.\n\nTen years ago, I met with Dr. Francis Collins, then the Director of  the National Institutes of Health, the world's premium biomedical  research agency. I admired his work so much that I asked him what I  could do to help.\n\nHe said:\n\nIf you can provide a 5-percent increase to NIH's medical       research budget,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, I rise today in support of our Nation's  investments in biomedical research through the National Institutes of  Health and the National Cancer Institute.\n\nThe research that is conducted through NIH and NCI improves health  outcomes, creates…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…safe, and disruptions to their work can be harmful to the  health of American people.\n\nLet me go to the National Institutes of Health. It is the largest  public funder of biomedical research in the  world. It is facing devastating cuts. The NIH is one of the greatest  successes in publicly funded scientific research in all of human  history. The United States…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…will be locked in. We  will reject $163 billion in cuts to public services proposed by  President Trump. We will increase funding for the National Institutes  of Health biomedical research by $450 million. We will provide over $66  billion for rental assistance programs.\n\nWe turn back in the Labor-HHS bill 47 programs that the  administration had slotted…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and mission.       It had been the happiest and proudest time in my long career.\n\nEverything changed in 2025.\n\nThe Trump administration cut billions of dollars in       biomedical research funding, resulting in dire consequences       for the scientific research community, including universities       and medical centers. This action has crippled lifesaving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…nutrition and diet to advanced drugs, to, really, so much  more.\n\nI share my grandfather's story because it demonstrates why the NIH is  so essential. As the world's premier biomedical research institution,  the NIH invests in our health, our national security, our economy, and  our future. These investments influence our Nation's competitive edge,  patients'…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…in Houston, where researchers are leading the fight against  Alzheimer's and heart disease; and at the University of Texas at Austin  and Texas A&M, where cutting-edge biomedical research is shaping the  future of medicine. If Trump's cuts go through, these institutions will  lose the funding they need to continue their vital work.\n\nThis attack on the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…funding for the Eastman  School of Music expansion, Wegmans Hall, the Goergen Institute for Data  Science and Artificial Intelligence, and the Kornberg and Del Monte  Biomedical Research Buildings.\n\nBeyond his professional contributions, Peter served for 30 years in  the New York Army National Guard, retiring with the rank of colonel.  His deep commitment…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690121/recognizing-peter-robinsons-retirement"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…to invest nearly half a billion dollars more. It rejects  Trump's plan to gut NIH funding. It, once again, rejects his illegal  plan to set a cap that would devastate biomedical research institutes  across the country, and it rejects Russ Vought's scheme to have NIH  reward all its multiyear grants in one lump sum, something that would  mean thousands…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…our districts.\n\nThe Labor-Health and Human Services bill on the floor today balances  the need for responsible fiscal stewardship while maintaining key  investments in biomedical research, schools, and public health.\n\nThanks to the negotiations on a bicameral, bipartisan level, funding  decisions have moved through a deliberative, Member-driven process…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…to be the most  lethal in the world, while also ensuring that our allies have the tools  they need to help us defend democracy.\n\nThe package also makes investments in biomedical research and small  business development. Together, these measures and more support a more  prosperous America.\n\nMadam Speaker, as chairman of the Transportation, Housing, and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…2026 while enacting funding for core  priorities, including: strengthening America's defense and providing a  well-earned pay raise to our troops; advancing lifesaving biomedical  research and critical education programs; enhancing the safety and  reliability of our skies and infrastructure; supporting small  businesses and strengthening cybersecurity;…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}]