[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…sponsor was our current Secretary of  Homeland Security Kristi Noem. It had support from our current National  Security Adviser, former Congressman Waltz, and it was bipartisan  legislation.\n\nIt is not some DEI program--some program that is designed to provide  women an advantage in the Department of Defense. What it is is a  program that gives us a security…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong support of H.R. 2458, the Secure Space  Act, bipartisan legislation that I introduced last month with Energy  and Commerce Chair Guthrie.\n\nThere is no question that we are once again in the midst of a new  space age. It is opening a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690258/secure-space-act-of-2025"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…nothing. We want to protect American consumers. That  is our job. This legislation does that.\n\nMr. Speaker, I urge my colleagues to support this critical  commonsense, bipartisan legislation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…their families in North Carolina's First  Congressional District, it was an honor to join and work with the  gentleman from Arizona (Mr. Ciscomani) in introducing this bipartisan  legislation.\n\nFor too many veterans, the transition from military service to  civilian life comes with uncertainty about how to build a new career  and support their families.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…of donors. It  requires organizations that spend money on political activities to  disclose the true owner.\n\nThe Freedom to Vote Act also includes my Honest Ads Act, bipartisan  legislation that I first introduced with Senator John McCain, whom we  miss very much and his leadership when it comes to campaign finance.  This bill would require online platforms…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in support of this legislation, the Mikaela Naylon Give  Kids a Chance Act, sponsored by Representatives Dingell and McCaul.\n\nThis bill includes several strong, bipartisan pieces of legislation  to help expand access to care for patients with rare diseases and  complex medical needs. It increases research and development into rare  pediatric diseases,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…is  lower costs, more jobs, and a better quality of life for Oregonians and  that I will work with anyone to get that done. I am pursuing all of  that by co-leading bipartisan legislation to help rural small  businesses, by advocating for funding for my district, and by actually  listening to my constituents. It is time for others to do the same.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688086/it-is-time-to-lower-costs"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the gentleman for yielding.\n\nThe Trafficking Survivors Relief Act is very critical, bipartisan  legislation that would provide long-overdue relief to victims and  survivors of human trafficking to help them overcome the lasting  effects of being trafficked and allow them…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…them on everything  from closing out murder investigations all the way to mental health.\n\nIn fact, the legislation that is being brought forward--it is right,  it is bipartisan legislation. I am the cosponsor of some of the bills  we have right now on the floor. We should be united in this body, all  100 of us, to stand up for public safety and to fund…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…needed to quickly identify and respond to unauthorized  biological operations. That is why I have introduced legislation based  upon committee recommendations.\n\nThis is bipartisan legislation aimed at strengthening Federal  coordination, improving oversight, and helping close regulatory blind  spots that have allowed unauthorized facilities to operate undetected.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…and helps the United States hold these  unmanned vessel operators accountable.\n\nMr. Speaker, I am proud to support my colleagues who have worked on  this important bipartisan legislation, and I look forward to seeing it  passed into law.\n\nMr. CARBAJAL. Mr. Speaker, I support H.R. 2351, I encourage my  colleagues to do the same, and I yield back the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692170/controlled-substance-onboard-vessels"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong support of this bipartisan legislation,  which will help ensure that Americans have access to bankruptcy relief  when financial disaster strikes and they need it.\n\nThe legislation would increase compensation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698846/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…in limbo.\n\nRespite care offers family caregivers a necessary break to focus on  their own mental health and well-being. That is why I was proud to  reintroduce our bipartisan legislation so that our family caregivers  can access the support and the relief they need. This bill would  support family caregivers by reauthorizing the Lifespan Respite Care…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…George's County,  Maryland elected Mr. Barron to the House of Delegates. In the state  legislature, he prioritized public safety and criminal Justice reform,  co-authoring bipartisan legislation that instituted sweeping  improvements to Maryland's sentencing and corrections systems.\n\nHis thoughtfulness and effectiveness as a legislator helped Mr.  Barron win…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 2449, the FUTURE Networks Act.  This bipartisan legislation is an important step to protect Americans  and our communication networks from threats posed by rapidly evolving  next-generation technologies. It also ensures that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…and transnational crime. The Coast Guard  saves American lives and ensures that commerce flows smoothly at our  ports.\n\nThe Coast Guard Authorization Act of 2025 is bipartisan legislation  that Senator Cantwell and I negotiated and agreed to with House  Transportation and Infrastructure Chairman Sam Graves and Ranking  Member Rick Larsen.\n\nIt authorizes…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…veterans seem to  always be paying the price. Veterans are sent to emergency rooms while  skilled doctors are waiting to serve patients.\n\nThat is why I introduced this bipartisan legislation with my  colleague, Congresswoman Nikki Budzinski, because we saw a program that  required action. Bureaucratic red tape is the enemy.\n\nThe reports by the inspector…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…extending and improving the TCJA, working-class families in my  district will pay $10,900 less in taxes and see increased wages of  $7,200 on average. It contains my bipartisan legislation to make  research and development expensing permanent, a jobs provision ensuring  America continues to lead the world entirely on innovation. It  eliminates fraud and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693193/one-big-beautiful-bill-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…and the Dietary Guidelines  for Americans has reported that nearly 90 percent of Americans do not  meet their daily dairy intake recommendations.\n\nThis overwhelmingly bipartisan legislation brings common sense back  to how we help the next generation stay healthy, putting vitamin D and  calcium-rich whole milk in front of millions of children nationwide.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698185/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…bill that is now under  consideration.\n\nMr. Speaker, I rise in support of H.R. 390, the ACERO Act, sponsored  by Representatives Fong and McClellan. This important, bipartisan  legislation will enhance our ability to respond to wildfires and  mitigate the destruction that they cause.\n\nEach year, wildfires burn millions of acres, threatening lives,  destroying…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise today in support of S. 1071, the National Defense  Authorization Act of 2026.\n\nThis bipartisan legislation includes the Coast Guard Authorization  Act of 2025. This bill supports the efforts of the Coast Guard to  protect American waters, interdict drugs, stop human trafficking,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697803/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the table to coordinate on a wide range of topics.\n\nMr. BABIN. Mr. Speaker, this bill passed the House with unanimous  support last Congress. That is because smart, bipartisan legislation  rarely faces opposition.\n\nI thank former Science, Space, and Technology Committee chairman, Mr.  Lucas, and Ranking Member Lofgren for once again leading this effort.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…American lives.\n\nLast Congress, this bill went through regular order and enjoyed  unanimous support on the House floor.\n\nMr. Speaker, I urge my colleagues to support this bipartisan  legislation.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693438/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…stability of the Crime Victims Fund.\n\nMr. Speaker, I am beyond proud to rise in support of my bill H.R.  909, the Crime Victims Fund Stabilization Act.\n\nThis bipartisan legislation will provide critical support to over 7  million crime victims throughout every State in this country, without  spending a single taxpayer dollar.\n\nMr. Speaker, across…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…avoids picking winners and  losers, and keeps the Federal Government focused on providing  information, not mandates.\n\nI urge my colleagues to support this commonsense, bipartisan  legislation and to vote ``yes'' on H.R. 5784.\n\nMr. WILLIAMS of Texas. Madam Speaker, I yield such time as he may  consume to the gentleman from Montana (Mr. Downing).\n\nMr. WILLIAMS…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…higher in this era of rapid global innovation and increasingly  complex geopolitical dynamics.\n\nI thank Chairman Babin for working with me to bring this important  bipartisan legislation to the floor quickly. I also thank my colleague  from Michigan, Congresswoman Stevens, for co-leading this bill with me.\n\nI am proud that my very first bill to pass…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…rural America, creating  jobs, and ensuring resources reach all businesses across America. I  thank Representatives Goodlander, Wied, and Golden for introducing this  bipartisan legislation.\n\nMr. Speaker, I urge my colleagues to support H.R. 4549, and I reserve  the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Nation.\n\nAs a result, my colleague Representative Sharice Davids and I  introduced the Successful Entrepreneurship for Reservists and Veterans,  or the SERV Act.\n\nThis bipartisan legislation, which passed through the Small Business  Committee unanimously last Congress, will help veteran small business  owners and entrepreneurs succeed by studying the barriers…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687888/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Missouri. Mr. Speaker, I rise today in support of S.  1071, the National Defense Authorization Act of 2026, which includes  the Coast Guard Authorization Act of 2025, bipartisan legislation to  authorize appropriations for the Coast Guard for fiscal years 2026 and  2027.\n\nThis bill will allow the Coast Guard to continue its vital missions  of defending…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…scientific innovation  and technological advancements.\n\nI thank my colleagues, Representatives Morrison and Thanedar, for  joining me in introducing this important bipartisan legislation.\n\nThis legislation passed the House with unanimous support last  Congress. Unfortunately, we couldn't get it over the finish line in the  Senate in time, so I thank Chairman…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}]