[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…compliment Chairman Rogers and the majority staff for having worked  with us throughout that process and worked with the Senate. I thought  we had a very good bicameral, bipartisan agreement this year.\n\nThe chairman is right. The highlight of this bill is acquisition  reform, something that our committee has worked on for quite some time.  For the last 2…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…remain fully funded to assist small business owners as our  community rebuilds after this crisis.\n\nWhile these bills were not ideal, I urge my colleagues to support  this bipartisan agreement.", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is the good news though. We can make a difference here in the  Senate. We can stop Americans like Jess from falling off this looming  healthcare cliff. As part of the bipartisan agreement to end the  longest government shutdown in American history, Leader Thune, who was  on the floor this morning, gave me his word, and I accepted it, that he  will hold…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to President Trump that ``[w]e supported the budget  deal and did so in good faith. Preventing agencies from obligating such  large sums seems an abdication of this bipartisan agreement, and  Congress thus expressed strong opposition to this precise exercise last  year. Furthermore, the U.S. Government Accountability Office's December  2018 legal opinion…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…have an opportunity to move beyond what has been  incredibly partisan rhetoric about the immigration issue. The reason we  have the opportunity is because there is now bipartisan agreement about  a secure border. There is now bipartisan agreement about deporting  criminals.\n\nIsn't it time for us to have the discussion about legal ways to have  an immigration…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…this vital source of  capital for our Nation's most promising innovators alive. I look  forward to continuing discussions in the coming weeks and months to  reach a bipartisan agreement.\n\nAllowing this program to lapse is simply not an option. I encourage  all of my colleagues to support this commonsense measure.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…that fails to meaningfully lower our taxes for Long Island when we are  already facing a cost of living crisis. Mr. Speaker, that is totally  unacceptable.\n\nThere is bipartisan agreement among my New York colleagues that the  majority's offer is a slap in the face to  New Yorkers. We need to hold the line and push for a full repeal that  will bring tax…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691111/bring-back-full-salt-deductibility"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…mistake in the  Senate today by voting to overturn a science-based record of decision  that was done by the book and with the public input. We should be  hammering out a bipartisan agreement instead on other major issues like  healthcare affordability or finding other ways to reduce the cost of  living.\n\nBut this administration has opened up all drilling…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…as EGCs, so those EGCs only need  to provide 2 years of audited financial statements across the board.\n\nLike other bills that Democrats and Republicans have come to  bipartisan agreement on, this bill balances the concern of those trying  to raise capital while also maintaining disclosures and financial  transparency that benefit and protect investors…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…what we are  doing.\n\nAnd she did so on the basis of advice from the Government  Accountability Office, which was given that role by the Senate, given  that role in a bipartisan agreement years ago.\n\nSo we are de facto legislating here, amending the operation of the  Clean Air Act to remove a statutory waiver for the State of California,  amending the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Beyond Caucus  bill, H.R. 1765, the Promoting United States Wireless Leadership Act.\n\nAs a co-chair of the 5G and Beyond Caucus, it is good to see that we  actually have bipartisan agreement in this body that the United States  must be a leader in the development and deployment of cutting-edge  technologies.\n\nMr. Speaker, I thank Representative Tom Kean,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Security at its current  level while allowing for several days, 10 to be exact, for us to  continue to zero in on that segment of the legislation and hopefully  reach a bipartisan agreement.\n\nWe have already reached bipartisan agreements on five other sections,  and one of those in this bill includes $113 billion in discretionary  spending for transportation…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…will now promote a safe, sound, and competitive banking system, one  that doesn't threaten our housing markets or our economy.\n\nThis package represents a historical, bipartisan agreement. I am  proud that Mr. Hill and I, along with Mr. Flood and Mr. Cleaver, have  been able to work together to prioritize the housing needs of millions  of Americans and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…responsible sourcing and innovation and reduce  environmental, labor, and human rights abuses, ultimately making our  supply chains more secure.\n\nThese are areas where bipartisan agreement is indeed possible, but  H.R. 4090 is not that answer. This bill would make it easier to sell  off public lands to polluting mining companies and weaken key  protections…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…the holidays. We  wouldn't be standing here today if they and so many others on both  sides of the aisle hadn't put in this work.\n\nI am pleased we were able to reach a bipartisan agreement to produce  a bill that protects Tribal lands and the environment, invests in our  Tribal communities, supports the arts, and rejects billions in extreme  cuts proposed…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…matter. I am against gerrymandering wherever  it occurs no matter which party stands to benefit, but this present  uncertainty has created a window of opportunity for a bipartisan  agreement to bring this madness to an end.\n\nMr. Speaker, I have introduced H.R. 4889 to ban mid-decade  redistricting in every State in the country. I am calling on House  leadership…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…2683 was  reported favorably out of the House Foreign Affairs Committee by a vote  of 51-0. Mr. Speaker, we can't do better than unanimous, but that is  showing broad bipartisan agreement on this particular issue.\n\nToday, Congress needs to uphold our responsibility to the American  people to close this loophole and stop the CCP and its affiliates from…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…dependence must be  replaced with the culture of self-sufficiency and personal  responsibility. The culture of permanence must no longer be a way of  life.\n\nThis used to be a bipartisan agreement we could all rally around.\n\nI sincerely ask my Democrat colleagues: What has changed?\n\nWe live in the greatest country in the world, where anyone from  anywhere can…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…turn Venezuela into a hub for drug  trafficking, corruption, and foreign influence that directly threatened  the United States and our allies. For a year, there was bipartisan  agreement on this fact. The difference is President Trump acted.\n\nAs Secretary of State Marco Rubio made clear, this was a limited law  enforcement action carried out with precision…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…is unwise and unsound.\n\nWe need to get back to regular order. We need to get back to a  reliable and predictable appropriations process. In order to do that,  we need bipartisan agreement that rejects severe cuts; that restores  funding for programs like the NIH and the CDC, which is done in the  bipartisan Labor-H bill; and that rejects cuts to WIC and…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…week. I don't know anybody. I have yet to meet one  person who supports it.\n\nMr. Speaker, rather than my colleagues on the other side of the aisle  coming together in a bipartisan agreement that we are going to, as the  House, hip-check the Senate for having put a provision in there that we  disagree with, my colleagues on the other side of the aisle want…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696928/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…alongside eight of my Republican colleagues, introduced  the Rotorcraft Operations Transparency and Oversight Reform--or ROTOR-- Act. After several weeks negotiating a bipartisan agreement with the  ranking member of the Senate Commerce Committee, Maria Cantwell, the  committee passed the ROTOR Act unanimously.\n\nHere is what the ROTOR Act does:\n\nNo. 1,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Appropriations work is demanding, and I appreciate all they have done  to make it possible for us to pass 11 of the 12 fiscal year 2026 bills.\n\nNow, on that 12th bill, we had a bipartisan agreement on the Homeland  Security appropriations bill that included funding for deescalation  training for Immigration and Customs Enforcement as well as body cams  for ICE…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…States merchant mariners.\n\nI very much appreciate Ranking Member Larsen, Subcommittee Chair  Ezell, and Subcommittee Ranking Member Carbajal for working to reach a  bipartisan agreement on this bill.\n\nMadam Speaker, I urge support for this legislation, and I reserve the  balance of my time.                                       Committee on Armed Services,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…but I would say I represent--every single Republican is in  agreement to this. Every single Republican was ready today to be able  to move on what was an agreed-upon bipartisan agreement--not by all;  understanding that. But, again, we have a supermajority of Members of  this body that are being blocked by a small group of the minority party  saying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Venezuela. We need to strengthen sanctions on Russia,  which continues to prosecute this awful war against Ukraine. We need to  do more.\n\nWe need to work together to reach a bipartisan agreement on  permitting reform. We seem to make good forward progress and then take  a few steps back. But we need that to build out the infrastructure that  this country needs.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}]