[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…particular, get into lives of  really risky and potentially violent behavior.\n\nSo we came together in 2022, and we passed the Bipartisan Safer  Communities Act. It was a big bipartisan vote. It wasn't close. The  final tally was 65 to 33, with nearly two-thirds of the Senate voting  in favor of this commonsense gun safety measure. It wasn't anything  close…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…parents.\n\nLast Congress, we marked up this bill in the Ways and Means Committee  and sent it to the floor with our unanimous consent. While it passed  the House on a strong bipartisan vote, I was disappointed that the bill  did not become law. I am glad to support it again. I believe it is a  strong complement to the  bipartisan legislation we enacted last…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…been confirmed as the acting. We recommended  him to the Trump administration. The Trump administration nominated  him, and the Judiciary Committee--in an overwhelmingly bipartisan  vote--reported him to the floor of the Senate.\n\nBut before the Senate could act on that bipartisan vote by the  Judiciary Committee, Erik Siebert was forced out of office,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…having a  single point of contact or a person to deal with.\n\nMr. Speaker, I urge my colleagues to support this legislation. It did  pass out of committee with a strong bipartisan vote. I hope that there  is bipartisan interest in protecting our data which, like I said, has  been DOGE'd and stored somewhere in the cloud. I hope that this urgency  around…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…It was written with input from the Senate Finance Committee,  and it was bipartisan. USMCA was a trade deal negotiated by Donald  Trump himself, and it got a significant bipartisan vote.\n\nCongress approved the deal, put it into black-letter law, and we made  sure--with Senator Brown, in particular, leading the fight--to have a  bill with tough enforcement--enforcement…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…insurrection or incited mob violence on  that day because I will tell you, this Chamber voted to impeach that  President who incited mob violence against us in a sweeping bipartisan  vote, Democrats and Republicans, together. Then the Senate voted 57-43.\n\nThe President, in his inimitable way, was able to beat the  constitutional odds, but nonetheless, commanding…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…President's desk,  and then fight for their authorization through the appropriations  process, as well. I am committed to doing that, and I look forward to  hopefully a bipartisan vote on this bill.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. GUTHRIE. Madam Chair, I rise in opposition to the amendment.\n\nMr. GUTHRIE. Madam Chair, I yield myself…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and feels comfortable with, and that is exactly  his right as the Commander in Chief.\n\nSo we should move on. General Caine is going to get a very, I think,  significant bipartisan vote. He should. And if the minority leader  wants to object, we will just grind it out all night and get it done.\n\nMr. SULLIVAN. Mr. President, I yield to my good friend from…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…refund checks  stolen as well.\n\nThis legislation received unanimous approval in the Ways and Means  Committee, and I encourage my colleagues to give it an equally strong  bipartisan vote here in the House.\n\nMr. SMITH of Missouri.  Malliotakis), the sponsor  of this legislation.\n\nThis legislation will not only help taxpayers who have been victims  of fraud,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, just now, the Senate passed three more of  the fiscal year 2026 appropriations bills by a strong bipartisan vote.  These bills support State and local law enforcement, invest in vital  scientific research, promote economic development, help protect our  national security, and assist…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…High-Speed Rail Update\n\nMr. KILEY of California. Mr. Speaker, I rise today to provide a brief  update on the California high-speed rail,  which, thankfully, in an overwhelmingly bipartisan vote, this House  just voted to cut funding off for. The President just signed that  legislation into law.\n\nWe are also now raising questions about what has happened to the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…mandate. And I am confident that  most Americans don't want these things either. That is why the House of  Representatives passed this resolution of disapproval with a strong  bipartisan vote that included every Republican and 35 Democrats, some  from the State of California.\n\nToday, despite the best efforts of the Biden administration and  congressional Democrats…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…winning the election.\n\nIt is not OK, friends.\n\nIt is not OK, Mr. President.\n\nLast night, in this Chamber, we did something rather remarkable  together with a very large bipartisan vote. We passed not one, not two,  but three appropriations bills--as Chairman Collins reminded us, the  first time we have done it before the August recess since 2018.\n\nWe…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…simply what we are doing here.\n\nOnce again, I think it is a great bill. I hope that Members support  it. It sounds like it is going to be what I would expect to be a solid,  bipartisan vote today.\n\nMr. Speaker, I will reserve the balance of my time.\n\nMr. FITZGERALD. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMr. FITZGERALD. Mr. Speaker,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…the process, making it  easier and faster for victims to get relief.\n\nThis piece of legislation was passed favorably out of the Ways and  Means Committee with a strong bipartisan vote. Mr. Speaker, now it is  time to act in a bipartisan manner to support Americans whose Social  Security numbers fall into the wrong hands.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…KILEY of California. Mr. Speaker, a year ago, I introduced  legislation to cut off all funding for California's high-speed rail  project and today, in an overwhelming, bipartisan vote, the House  passed this measure as part of an appropriations bill that will soon be  signed into law.\n\nThis is fantastic news for American taxpayers and for California…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699380/no-more-tax-dollars-for-californias-high-speed-rail"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the care and benefits they have  earned through their service to our country.\n\nLast week, the Senate Appropriations Committee reported this measure  in an overwhelmingly bipartisan vote of 26 to 3.\n\nI ask my colleagues to support the motion to allow the Senate to  begin to work its will on this important funding bill and to fulfill  our constitutional…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693982/hr-3944"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the Committee on Foreign Affairs, in  crafting economic deterrence to bad actors--certainly, the military  junta in Myanmar is a bad actor--calling loudly for a strong bipartisan  vote in this House on the BRAVE Burma Act, which I hope then will be  promptly considered by the Senate.\n\nThis is when the legislative branch and the executive branch work…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…FIGHT China. Two years ago, I  sponsored an amendment to the NDAA requiring transparency for these  outbound investments. It passed the Senate overwhelmingly with a final  bipartisan vote of 91 to 6. We don't see many votes here in the Senate  these days where there is such strong bipartisan support, so I am  grateful for that.\n\nRegrettably, even in the…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…recent compliance review. This  project has no viable path forward.\n\nThankfully, in the House of Representatives, following a bill I  introduced to this effect, there was a bipartisan vote to cut off all  further Federal funding for high-speed rail. There is no  viable path forward for the project. I do believe when we have a new  Governor in the State,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…cloud and finally  close this loophole.\n\nThe Remote Access Security Act received unanimous support in the  House Committee on Foreign Affairs during markup, passing with a  bipartisan vote of 51-0.\n\nMr. Speaker, I thank Chairman Mast, as well as my bipartisan co- leads, Speaker Johnson, and Leader Scalise for helping to move this  bill to the floor today.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}]