[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Neguse,  who introduced this bill, and Chairman Thompson and Ranking Member  Craig. We would not be standing here today without their leadership and  outpouring of strong, bipartisan support that we have seen for this  bill both here in Congress and on the ground in our communities.\n\nFor decades, SRS has been more than an abstract Federal program. It  has…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…a regulatory gap to  oversee third-party vendors used by credit unions and the GSEs. I know  Republicans have some concerns with the former, but the latter bill has  bipartisan support in the Senate and is timely. Given how our community  financial institutions increasingly rely on these vendors, helping them  access technology to compete, the least…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…prefers to study and then update our deposit insurance  framework to allow more business payment accounts to be insured based  on that research.\n\nThis effort has strong bipartisan support, including that of the Vice  President and Treasury Secretary, so I hope we can advance those  reforms soon for community financial institutions, midsized banks, and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…those constituents in times of need all across this country.\n\nMr. Speaker, I want to say briefly in closing that, as you have  heard, this legislation has tremendous bipartisan support and will  remove burdensome processes at the IRS to make government work better  for our constituents after a disaster.\n\nI appreciate Mr. Murphy talking about his district…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…people out of the  decisionmaking process, all while driving up energy prices for the  American people.\n\nMr. Speaker, I urge my colleagues to join me in the longstanding,  bipartisan support for protecting the Arctic Refuge by opposing H.J.  Res.\n\nIn closing, I strongly oppose this resolution. It would open up  ecologically sensitive, culturally important,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…rise in support of H.R. 5810, the Federal Supervisor  Education Act of 2025. The bill was reported favorably by the Oversight  Committee unanimously on December 2 with bipartisan support.\n\nThe bill would require Federal agencies to create and implement  training and development programs for agency supervisors. These  programs will help improve their management…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698217/federal-supervisor-education-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…farmer, and it  was launched by President Eisenhower. They called it Food for Peace,  and it sent American-grown grain to hungry people around the world. It  has enjoyed bipartisan support from Democrat and Republican Presidents  for 70 years.\n\nThis Republican Congress passed a funding bill to continue to fund  the program, but the Trump administration…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693626/restore-funding-for-lifesaving-food-aid"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…with a strong, nonpartisan history of protection,  dating back to 1909 through treaties with Canada and to 1964 with the  Wilderness Act, which passed with overwhelming bipartisan support back  when we had great conservation champions in both parties.\n\nAmericans from across the country who have experienced the serenity  of this wilderness know exactly…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…the Nation.\n\nThis legislation includes 25 housing provisions that were introduced  by Democrats and 12 banking provisions that passed our committee with  broad bipartisan support.\n\nTo support local lenders and access to financing, this bill includes  bipartisan reforms to strengthen our community banks, credit unions,  CDFIs, and MDIs.\n\nAs ranking member…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the people who were opposed to  impeachment were making it clear that certain things would have to  happen before there could be impeachment.\n\nYou would have to have bipartisan support for impeachment. You would  have to have--well, let's just say certain things. If I say more, I  will probably say enough that you will know who I am talking about, and…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…ask for passage today. There will be a unanimous consent  request made at the end of my statement. If that unanimous consent  request passes, and I hope it does with bipartisan support, it will go  to the House of Representatives for their consideration. It will be  miraculous. We just might pass a bill. We just might create a law. Stay  tuned.\n\nLet…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…functions. One of the most egregious examples of this power grab is the  ongoing effort to illegally withhold funding that Congress has  authorized and appropriated, with bipartisan support, for critical  services. He is withholding it. President Trump froze funding that  helped Michigan communities build new radio towers, prepare for natural  disasters,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Schools  Reauthorization Act of 2025, that for years I have championed with my  friend and colleague from Idaho Senator Crapo.\n\nAcross the West, this legislation has had bipartisan support because  it would reauthorize a crucial lifeline--particularly for schools and  law enforcement and roads throughout the West.\n\nI was in Grant County recently, a small…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691667/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…has provided duty-free access to  the U.S. market for a broad range of goods from eligible AGOA sub- Saharan African countries. AGOA has enjoyed broad bicameral and  bipartisan support from both Democrats and Republicans from both the  House and the Senate.\n\nBy lowering barriers for African exports, AGOA expands demand for  U.S. services and inputs--from…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…in detail below.           h.r. 3633, the digital asset market clarity act of 2025\n\nThis measure succeeds the ``Fit 21 Act'' of the last       Congress, approved with bipartisan support, a result we       believe reflects profligate political spending by the crypto       sector in 2024. Now that the crypto political spenders       brazenly threaten to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…It is only common sense to make this  fraud prevention measure permanent.\n\nThis policy has already passed both the Senate and the Ways and Means  Committee with broad, bipartisan support. I hope the House does the  same and sends this to President Trump's desk as soon as possible.\n\nMadam Speaker, I yield back the balance of my time.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…should be something that unites this body. In fact, in  the Biden administration, that happened. Over 80 percent of the  judicial nominees in that administration received bipartisan support on  the floor.\n\nBy contrast, this Congress, only 20 percent of the Trump nominees  have had bipartisan support.\n\nI encourage my colleagues to ignore the pressure from…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this sort of lapse to happen again where for 1\\1/2\\ years these schools  and counties were going without these vitally needed payments.\n\nThis is a measure that has broad bipartisan support. It is a very  popular program. It is an important program. There is no reason that  Congress should fail to pass its reauthorization in a timely manner.\n\nMr. Speaker,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697664/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, today, we rise to discuss the important  issue of home affordability.\n\nAs you just saw on this floor, we passed, with bipartisan support,  led by our chairman of the Committee on Financial Services, French  Hill, from the great State of Arkansas, a bill, with a 390-9 vote, to  promote the idea of home…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Jersey's program. Then Florida's  program was approved by the Trump administration and then defended by  the Biden administration. This is something we should agree on,  bipartisan support to help protect the environment.\n\nMr. Chair, it is Florida, Michigan, and New Jersey, but here are the  States that are in line, that say we  want to protect our own…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Enforcement Innovate to De-Escalate Act, and       H.R. 4242, the Innovate Less Lethal to De-Escalate Tax       Modernization Act. H.R. 2189 has received significant       bipartisan support and was marked up and approved by the       House Judiciary Committee with favorable guidance on November       18, 2025.\n\nH.R. 2189 addresses a serious and growing challenge:…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…organizations like the AARP, the Bipartisan Policy Center, and the  Association of Mature American Citizens have come out in support of  this bill, which received overwhelming bipartisan support in the Ways  and Means Committee.\n\nMr. SMITH of Missouri.\n\nMr. Speaker, no American entering retirement should lose out on their  hard-earned Social Security benefits…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…dangers lurking online and  sometimes even more than there are in the real world, which is why 86  percent of Americans support KOSA.\n\nThe legislation enjoys overwhelming bipartisan support. How often do  we see legislation that can pass through the Senate with a 91-to-3 vote  like KOSA did last year in this Chamber? It has also received  endorsements from…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…information and support to deploy Open RAN  technologies if providers would like to implement this technology in  their networks.\n\nThis legislation has a strong history of bipartisan support in the  Committee on Energy and Commerce and passed the full committee in April  by voice vote.\n\nMr. Speaker, I urge my colleagues to support H.R. 2037, and I reserve…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…investments. It passed the Senate overwhelmingly with a final  bipartisan vote of 91 to 6. We don't see many votes here in the Senate  these days where there is such strong bipartisan support, so I am  grateful for that.\n\nRegrettably, even in the face of such overwhelming consensus, this  amendment did not make its way into the final version of the bill for…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the House acts and the President signs it into law.\n\nI am also very pleased that we were able to fully fund three  appropriations bills that passed with overwhelming bipartisan support  on August 1.\n\nI thank my colleagues. I know of no other requests for time.\n\nI yield back the remaining time.                        Vote on H.R. 5371, As Amended\n\nMs.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…technology. This task force will ensure that the United States has a  unified position to cement our leadership in 6G, which is so critical.\n\nThis legislation has strong bipartisan support.\n\nMr. BILIRAKIS.  Mr. Speaker, I have no additional speakers, and I  reserve the balance of my time.\n\nI commend Representative Allen, the vice chair of the Communications…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…should be no debate or question about that. The SAVE  Act adds additional layers of protection to elections right here in our  own country. It is an opportunity worthy of bipartisan support.\n\nH.R. 1526, the No Rogue Rulings Act of 2025, would limit the  authority of district judges to provide sweeping injunctive relief on a  nationwide or exceedingly broad…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Speaker, I am so grateful to my colleague, Representative Lee,  for leading this effort to protect children from this harmful practice.  I am pleased with the widespread and bipartisan support for it, and I  urge my colleagues to support the Combating Online Predators Act.\n\nMr. Speaker, I thank my colleagues for their thoughtful debate and  for their support…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the best way to send a  message to the President that you support these programs is to vote  ``no'' on the bill. I just don't understand that logic. I hope we can  get bipartisan support. We will put the bill on the President's desk,  and I believe the President will sign the bill.\n\nMr. Chair, I yield 2 minutes the gentleman from Ohio (Mr. Latta), the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}]