[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…lucky ones. Far too many mothers and babies don't have that same  outcome.\n\nMr. Speaker, today I join Representatives Jennifer Kiggans and Robin  Kelly to introduce a bipartisan resolution to designate November 2025  as Prematurity Awareness Month, and I join my colleagues to do more to  prevent preterm births.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696798/raising-awareness-of-preterm-birth-rates"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I rise today in strong support of our  bipartisan resolution, which Senator Kaine and I lead, along with our  colleagues Rand Paul, Mark Warner, and Leader Schumer.\n\nOur resolution terminates the President's so-called emergency…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Mr. NEGUSE.  Res. 476, my  bipartisan resolution to condemn the terror attack in Boulder and to  denounce anti-Semitism, be called for consideration by the full House.\n\nMr. NEGUSE. Mr. Speaker, I have a parliamentary…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692378/request-to-consider-h-res-condemning-the-violent-antisemitic-attack-in-boulder-colorado-and-expressing-support-for-the-survivors-and-their-families"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Madam Speaker, I rise today to highlight a bipartisan  resolution introduced alongside my northwest Ohio colleague,  Bob  Latta. It proclaims May 9 to May 18, 2025, as National American Birding  Week.\n\nEach spring, 3.5 billion birds…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…carry out his current plans in the Caribbean, without  authorization from Congress. If Trump acts without congressional  authorization, the Senate stands ready with a bipartisan resolution-- led by Senator Kaine, myself, Senators Paul and Schiff--preventing the  unauthorized use of force.                          Tribute to German Vazquez\n\nMr. President,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…opposition to H. Res.  516, the Condemning the violent June 2025 riots in Los Angeles,  California. It is deeply unfortunate that instead of working with  Democrats on a bipartisan resolution to condemn violence, Republicans  have instead written a partisan resolution designed to attack elected  officials in California. Furthermore, the resolution fails…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…hard, Mr. Speaker, for the 15 victims of this heinous attack,  my constituents. Several of these victims are people I know personally.  They are friends. I support this bipartisan resolution denouncing anti- Semitism. I continue to stand with those victims, with my constituents,  with their families, with our Jewish brothers and sisters as we  recommit…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…United  States.\n\nChu).\n\nMr. RASKIN. Mr. Speaker, I thank the gentlewoman for her excellent  point. The California delegation has advanced, with Ms. Lofgren, a  truly bipartisan resolution that deplores all violence because the  political violence is getting out of control in America.\n\nWe just had colleagues in Minnesota who were the subject of  assassination…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…well aware, there was a  terrible, heinous terrorist attack in my district 10 days ago in  Boulder, Colorado. We have introduced a resolution, H. Res. 476. It is  a bipartisan resolution. Several of my Republican colleagues have  joined me on this resolution.\n\nIt denounces anti-Semitism, condemns the horrific attack in my  community, and lifts up the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692346/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Ms. ROSEN. Madam President, I want to begin by thanking my colleague  from Florida for his bipartisanship and his partnership, including to  pass this bipartisan resolution to recognize Jewish American Heritage  Month by unanimous consent.\n\nI also want to take a moment to speak about the horrific murders that  took place last night. Like…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Colorado, in the Congress. I live in Boulder County. My wife  and I are incredibly blessed and lucky to be raising our family in this  community.\n\nLast week, I introduced a bipartisan resolution denouncing this  heinous anti-Semitic terror attack in my community. H. Res. 476, a  resolution that makes clear that we stand with the Jewish people, the  Jewish community,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…does not receive one penny of taxpayer dollars. It is funded  primarily from satellite and cable providers.\n\nSenator Klobuchar of Minnesota and I have introduced a bipartisan  resolution to recognize C-SPAN2 and the public service it provides the  American people through its live, nonpartisan coverage. Our resolution  calls for television providers,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…overturned the entire D.C. law,  with 14 House Democrats and 6 Senate Democrats joining Republicans in  support of the resolution.\n\nHowever, then-President Biden vetoed the bipartisan resolution of  disapproval, allowing the harmful policies of the D.C. Council to  remain in effect today.\n\nIn another attempt to protect the D.C. police, Representative  Garbarino…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…support of H. Res. 153, which expresses  condolences to the families, friends, and loved ones of the victims of  the crash of American Flight 5342 and PAT 25.\n\nThis is a bipartisan resolution to honor the 67 lives that were lost  during the tragic collision that occurred over the Potomac River on  January 29, 2025.\n\nJanuary 29 is typically a day of celebration…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today in support of my bipartisan  resolution honoring the brave men and women who serve in local law  enforcement.\n\nThese officers work tirelessly to protect and serve, putting their  lives on the line every day…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…other restrictions applicable to the Capitol Grounds, in       connection with the events.\n\nMr. PERRY.  Con. Res. 9.\n\nMr. Speaker, I am proud to have introduced this bipartisan resolution  along with the Economic Development, Public Buildings, and Emergency  Management Subcommittee Ranking Member   Greg Stanton of Arizona.\n\nThis resolution authorizes…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…This resolution today will officially name the House Press  Gallery after him. I thank the gentleman from Florida, Representative  Donalds, for his leadership on this bipartisan resolution.\n\nMr. Speaker, I urge support of the legislation and reserve balance of  my time.\n\nMr. GRAVES.  I  will take a moment to recognize someone who has made a particular…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]