[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…up, and so they  decided to invite us at the same date and time we were going to show up  anyway.\n\nWe took them up on that. We went in the facility. I am here to talk a  little bit about my experiences there.\n\nThe State of Florida and DHS got wind of our visit. They got scared.  They invited us. Of course, what we got was a sanitized version of the  way…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…reach. That is the best of government. The  worst of government is when a few benefit from the oppression of the  many.\n\nWe just commemorated the D-day anniversary, a little bit later than  the Depression, or as we were coming out of the Depression. There are  only 12 people left who survived that. There are very few people alive  today who remember…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…circumstances that we are living in.\n\nMrs. WATSON COLEMAN. Mr. Speaker, I thank Mrs. Ramirez for convening  this very important discussion.\n\nI will talk about something that is a little bit of an extension of  this, but I do want to remind people that I visited Delaney Hall  Detention Facility in the State of New Jersey with LaMonica McIver and  Rob Menendez. It…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…citizens but for people who are here whether it is a  legal status or because they have been invited to this country to apply  for asylum.\n\nI want to go ahead and speak a little bit more about Andry Romero,  this young gentleman right here. He is a gay hairstylist and makeup  artist who came to the United States with an asylum appointment. The  United States…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690508/trump-immigration-policies"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…you something about drugs, how much drugs are coming  in from Canada, because that is what this is about. As a former special  narcotics prosecutor--that is me--I know a little bit about that.  Saying that you are going to focus and stop certain things from coming  across the border of Canada, as if it is coming across in a cluster  like it is an emergency,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…President readily admits that these tariffs will disrupt  the economy, but he claims two things: that there will only be a minor  disruption and says that they will cause a little bit of pain.\n\nMaybe it will only be minor to those who are billionaires, but to  everyday Americans, to the people who go to work every day to provide  for their families--the families…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…he  had just voted for.\n\nMr. Speaker, I am sure you are familiar with Mark Twain's old adage  that history doesn't repeat itself, but it often rhymes. It does feel a  little bit like deja vu because in the case of these CRAs, I have no  doubt that several of my colleagues, including several of my colleagues  who are championing these resolutions, will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…administration's efforts to minimize the importance of focusing on  areas that have been left out of the process, I will mention a couple  things here tonight that is going to run a little bit contrary to what  my staff has researched for me.\n\nThe knowledge and skills of our young people and the things that they  learn in school should not be limited to people who…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…ask you a question about one thing in particular, and it is  about the U.S. military and the leadership of the U.S. military.\n\nBut I want to kind of set the stage here a little bit. The United  States has the most lethal military in the history of the world. The  President presiding right now has experienced that as a U.S. Navy SEAL,  I myself as a pilot…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "Mr. BENNET. Mr. President, I wanted to come down here and talk a  little bit about energy with my colleagues in the Senate today, and  part of the reason why is that as you know, Mr. President, and others  know, the President of the United States has…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…send their kids for an education, and  retire with dignity. We have to have living wages for every worker, and  we have to tax the billionaires so that they just pay a little bit more  of their fair share like everyone else is doing.\n\nWe can and have to break up the largest corporations so they can't  keep screwing regular people. We have got to stand…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…collusion with OPEC to gouge American  consumers, they are just such a victim in the telling of my friends  across this aisle.\n\nI hate to intrude on that narrative with a little bit of truth, but  the fact is, the offshore wind industry already does this stuff. They  have to comply with the National Historic Preservation Act.\n\nThe reason that the fossil…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…scratching their  heads saying: How does this help me? How does this solve my problem? It  creates more.\n\nI spent the August recess mostly in my district, but I spread out a  little bit beyond my district because I am one of only two Virginians  on the Energy and Commerce Committee. Healthcare, in particular, has  been very important to me. I spent time talking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…trillion, it is now $7 trillion, most of which one penny doesn't even  pay for it, except, again, for cuts to Medicaid, as well as cuts to  other programs.\n\nNow, there is a little bit of confusion here on a couple aspects, and  I will quickly address them.\n\nFirst, on tax cuts, there is no question that there will not be a tax  increase on working Americans.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…and I know many of our colleagues have been through it, where these  super-PACs come in and change the dynamics of an election with millions  and millions of dollars.\n\nThe one bit of good news is that many of us, like me, are here still.  We fought that uphill battle and won it, but now we have to look at  what is going to happen in the future, at what…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…very American Dream that people seek to achieve when they come to  our land.\n\nMr. ROY. Mr. Speaker, I would like to see if my friend from Louisiana  can stick around a little bit longer.\n\nMr. ROY. Mr. Speaker, I appreciate my friend from Louisiana because  of his long history of distinguished service, and he knows what he is  talking about.\n\nI know that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…businesses to all of us,  the people we represent. Yet, that often doesn't get reflected in the  decisions and the actions that come out of this town.\n\nMy colleagues have talked a bit about reconciliation, and I say these  are connected because we are going to make large policy decisions here  in the House, in the Senate, and with the President over the course…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Speaker, I had a couple of odds and ends and then some basic  optimism on one or two things. First off, let's do some cleanup.\n\nLast week, I actually walked through a little bit of an economic  report. We got a preview of it. I think it will be published fairly  soon. It is ``Measuring What Matters,'' and the title is: ``Why Italy  May Be in Better…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…shutdown in  time to be paid.\n\nI am not trying to put down anybody. I am not trying to condemn folks  who have been taking their salary. I am not saying they don't earn  every bit of it. But I am saying what is good for the goose is good for  the gander.\n\nI want to offer up these two bills for the Members' consideration,  starting with my first bill,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, when Congress is in session, there are  always interesting articles in the paper that I think demand a little  bit more attention.\n\nOver the weekend, or late last week, there was an article that said  that the United Kingdom, in a few years, is going to begin having 16- year-olds vote. Since…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…and I am feeling a little whiplash over here because  Democrats liked Elon Musk. Then, the minority hated Elon Musk. Now, my  Democratic colleagues like him again?\n\nI am just a bit confused and ask that maybe someone can clear that up  for me because it goes back and forth, and I feel like there is lots of  whiplash going on.\n\nMrs. FISCHBACH. I yield 1…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…white supremacy is a major problem, as Joe Biden said.\n\nWhile I was back home, I had an opportunity to speak to a mosque of  Ahmadiyya Muslims. Ahmadiyya Muslims have a little bit different  theology than Muslims in general. They are persecuted by those members  of Islam who live in Pakistan, and many of them have had to flee  Pakistan even with regards…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…what is in this budget  resolution. I expect every single one of them to come down here and do  that. I predicted it, Mr. Speaker. Here it is, coming true.\n\nLet me talk a little bit about the tariffs. The tariffs announced by  President Trump on April 2, 2025, are a response to our economy that  will strengthen the international economic position of the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…distract the American people  with things that we are not here to talk about.\n\nThe American people do not want to see their hard-earned tax dollars  being squandered, not one bit. At its core, H.R. 4 is about shutting  off the spigot of wasteful money, clawing back the tax dollars of  Americans, and ensuring that wasteful and unnecessary spending is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…let's go to the ObamaCare exchanges because the shutdown we just  had for over 40 days was related to the fact that subsidies are ending  on the ObamaCare exchanges.\n\nA little bit of history: During the COVID pandemic, health insurance  premiums were going up so much that Democrats passed extended,  temporary, enhanced premium tax credits--if you will,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to try to walk through is where the actual  math lays in the box that has been given to us by the Budget Committee,  and then the part I am going to do, the Schweikert little bit of hope,  is: Is this the moment? Is this the moment of policy that actually  forces us, both the left and the right, that if there are cuts,  modernization, changes, updates…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…majority. They rendered the consequences to elect the President that  has revived this country from a disaster, 4 years under the Biden  administration.\n\nLet's go back into a little bit of history here about the hearing.  The messages show that Plaskett texted Epstein before the hearing that  started that day, at 7:55. She texted him, the sex offender, the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…although we have to do that. It  is about helping folks change their behavior and their lives.\n\nThere is a lot that needs to be done. This is one piece of it. I am a  little bit disappointed that this has been something of a partisan  debate. It never has been for me. It never was in my previous public  roles. It should not be now.\n\nMr. Chair, I thank…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…and it is  their healthcare system. They created it. When they created the  Affordable Care Act, there were no Republican votes. When they extended  it or changed it a little bit and eventually renewed it again in the  Inflation Reduction Act, there were no Republican votes for that.\n\nToday, they want to blame Republicans for their policy failures. The…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…we need to move this forward. The minority leader of the  U.S.   But he didn't want to do it. He just walked off the floor. So that is  what we just witnessed. It is a little bit unusual, particularly when  it comes to a confirmation that is so important. There are very few  confirmations that the U.S. Senate does that are more important than  confirming…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]