[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the  American people are dragged into a very endless war by those whose  radical acts of retribution will not cease.\n\nThis is a time to pay attention, to study history a little bit, and  to abide by the Constitution of the United States.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692692/congress-must-reassert-our-constitutional-authority"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…except that he was one of the kindest, most  gentle, and genuine people I have ever met.\n\nI don't know about you, Mr. Speaker, but the House floor feels a  little less warm and a bit empty without Doug, but maybe I just miss my  friend.\n\nTo his wife, Jill, and the LaMalfa ``family''; ``family,'' our  prayers, our aloha, and our love are with you.\n\nMay you…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698745/9999"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…up, and so they  decided to invite us at the same date and time we were going to show up  anyway.\n\nWe took them up on that. We went in the facility. I am here to talk a  little bit about my experiences there.\n\nThe State of Florida and DHS got wind of our visit. They got scared.  They invited us. Of course, what we got was a sanitized version of the  way…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…the ballast that everybody needs across America.\n\nWe were trending well. We were trending well. I know how negotiations  go. They go up and down. They go sideways. They stall a bit. People get  a little irritated. But we really were trending well. And I am  legitimately shocked that we are like 94 percent of the way there, and  somebody just woke up and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank the gentlewoman from  Connecticut for yielding. It is so good to be here with her.\n\nI want to focus a little bit on the importance of bringing this to  the floor and perhaps even entering into a sort of dialogue with Mrs.  Hayes about it.\n\nI am thinking that the Individuals with Disabilities…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…real travesty of lawmaking, but that is where we are at  now.\n\nSo what is this really all about--this Republican decision to invent  new meanings to existing words when every bit of common sense and every  bit of legal knowledge knows that that is a lie. Why did my colleagues  engage in this massive deception? It is an end-run around the  policymaking…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…lab-grown meat for any purpose.\n\nThe Rules Committee should not have made this amendment in order  because it is just not germane to this bill.\n\nMr. Chair, let me tell you a little bit more about why it is  important that this amendment be defeated. By preventing funding for  the Bioindustrial Manufacturing and Design Ecosystem partnership, or  BioMADE, this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…benefit, but  it would be enormously impactful and beneficial for each of those  retirees who would be affected. The average is about $1,200 a month-- some more, maybe some a little bit less. At $1,200 a month--you can do  the math--it is not a fortune, but it would make a difference in the  lives of these combat-injured veterans.\n\nIt simply ensures that the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…opportunities to grow wealth and better oneself with an  education.\n\nWhat the forces against progress don't seem to realize, is the spirit  of progress is alive and well today--every bit as much as it was for my  parents' generation, and the generations before them.\n\nI mentioned Hattie Canty--I stand on her shoulders to this day.\n\nI spent a decade leading the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise because I am deeply concerned  about hurricane season and the state of FEMA and our national disaster  preparedness.\n\nA little bit of context: One of the reasons I got involved in  politics was as a student at Tulane University in New Orleans,  Hurricane Katrina hit the city at the time.\n\nI couldn't believe…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692184/concerns-about-hurricane-season"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…watching in the gallery. Of course, he can always  watch on C-SPAN; but I thought it would be nice to have him watch in  the gallery.\n\nI thought it would be nice to share a little bit about his life and  his journey. I mentioned his father who worked for the Fords. That is  how they call it back home. The Fords is a family business. My father  was born January…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…assault on America, on our institutions, on our workers, on the rule of  law, and on democracy itself. This is not leadership. This is a broken  promise.\n\nI will talk a little bit as we go forward about the promises that now  President Trump made during the campaign, especially with respect to  the economy. He said he was going to put money back in people's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…now. In 2012,  he said:\n\nHealthcare is a right, and it is not a privilege, not just       for some people but for all people.\n\nJohn Lewis was a visionary.\n\nSo let me tell you a bit more about Medicaid. If you are watching,  let me break it down and show just how critical it is for millions of  Americans.\n\nMedicaid, right now, is in the crosshairs of many,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…KAPTUR. Mr. Speaker, I now turn to a very important issue that  arose today because of something that happened with Speaker Johnson.\n\nAmerica's farmers are hurting. They need every bit of help Congress  can deliver. So do truckers and working families paying more for  groceries and at the pump just to haul goods, get to work, and move  around their communities.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…about the Clean Air Act would have followed regular Senate  order. But no.\n\nOr the fossil fuel industry could have gone to California and said:  Hey, things have changed a little bit. We would like to figure out a  way to work with you. You change your rule. They are the real principal  party here; Rhode Island follows the California standard. They could…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…businesses to all of us,  the people we represent. Yet, that often doesn't get reflected in the  decisions and the actions that come out of this town.\n\nMy colleagues have talked a bit about reconciliation, and I say these  are connected because we are going to make large policy decisions here  in the House, in the Senate, and with the President over the course…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…difficult court proceedings. For children who are recounting  heartbreaking terrible events, these dogs provide comfort and support  to make those difficult moments just a little bit better.\n\nWhile these dogs can often cost courthouses around $50,000 each, PAWS  for Justice provides them free of charge.\n\nAs a proud owner of my great pup, Taft, I have an…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…relative to what  happens.\n\nNow, these are nice homes, but they are not castles. These are  middle-income families. The neighbor is driving a pickup truck. It  looks a little bit--the Presiding Officer is a car dealer. That doesn't  look like it is a 2025. It is a good truck. It is a good family. These  are not wealthy families. They are good, middle-income…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…and, at the time,  get free cash from a program called Aid to Families With Dependent  Children. Now we have cash from a program called TANF.\n\nIn any event, Gilder was a little bit surprised, but wrote books on  the matter saying: Hey, wait a minute here. It shouldn't be a cause for  celebration when someone gets pregnant out of wedlock. It should be a…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…true in healthcare.\n\nWe have done presentation after presentation here showing how you  could crash the price of healthcare legalizing technology. Even today,  I had a little bit of a verbal kerfuffle--love that word--with a Member  who is a doctor, and he is my friend. He despised the concept, but I  was showing him part of the paper that says if you…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…I filed a bill, as I do  multiple different weeks. I don't come every week  to be able to talk about the bills that I file, but I want to be able  to talk about this a little bit and some context that comes into it.\n\nI also don't come to this floor very often and read an entire bill to  this body, but I want to do that today. It is not long. It is literally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…should  look like, here is what we can do. We could use a carrot and a stick.\n\nEvery year, we send between $2 and $3 billion to cities across  America. Every city gets a little bit of it. Some get a lot of it. But  every year, just like clockwork, we appropriate--it is really more like  $3 to $4 billion. We send that money through the Department of Housing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…that our parole  authority is properly done, ending catch and release, and re- implementing the remain in Mexico policy. I think this gets missed from  the conversation quite a bit. It is actually some of the most humane  things we can do.\n\nI still remember the 30-plus immigrants who were basically killed in  the back of that truck in the San Antonio area.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to try to walk through is where the actual  math lays in the box that has been given to us by the Budget Committee,  and then the part I am going to do, the Schweikert little bit of hope,  is: Is this the moment? Is this the moment of policy that actually  forces us, both the left and the right, that if there are cuts,  modernization, changes, updates…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…future.\n\nLaw enforcement officers are faced with danger every single day, not  only on the job, but when they return to their homes. This commonsense  bill honors them a little bit and shows them that we want them to have  these weapons in their homes to protect them, their property, and their  families, as well.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the gentleman from Arizona (Mr.  Schweikert). We have engaged in a colloquy on his time. I am going to  start my 30 minutes. He, of course, is welcome to stick around a little  bit if he wants.\n\nI am going to just jump off from where he started, or I am going to  start from where he left off, and that is to talk about what we are  debating on the floor…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…think, kept too well hidden. For  example, over 50 percent of veterans have experienced at least one  traumatic event in their lifetime.\n\nMr. Speaker, let's just go back a little bit in history because  ``PTSD'' was not always a term of reference and a term of the norm when  it came to dealing with stress. In World War I, I believe the term was  ``shell…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the gridlock, the nonsense, and all the rhetoric. Mark Roman  accomplished some things for the American people that he will never get  credit for.\n\nI am going to speak a little bit about it today, but I also wanted to  add how much I appreciated getting a chance to work under Mark. I wish  his amazing kids and family all the best. We hope that he really,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have  borrowed and have given to agencies, but they haven't been authorized  or haven't spent it.\n\nMr. Speaker, off the top of your head, will you raise your eyebrows a  little bit if we call this SF 133, so it is money that has been  appropriated, sitting in their accounts, so it is cash. We are paying  interest on it because that money was borrowed.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…have been made to stop the  efforts of President Trump and his Cabinet and the rest of the  administration in downsizing our bloated bureaucracy and trying to  bring a little bit of control to the amazing growth of our Federal  Government without causing the damage that is always alleged that is  being done.\n\nFrom groundbreaking biomedical advancements…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]