[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Episcopal Zion Churches in New York, Connecticut,  North Carolina, and Alabama. In 1992 he became the senior pastor at the  Wesley Temple Church in Akron, which is Akron's oldest Black  congregation.\n\nReverend Dr. Walker has been a faithful servant of God, the African  Methodist Episcopal Zion Church, and the Beth-El AME Zion Church where  he currently serves…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688261/recognizing-reverend-dr-curtis-theodore-walker-sr"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I rise to oppose the SAVE Act. The bottom  line is that the SAVE Act suppresses the votes of women; Black, Brown,  and indigenous people; veterans; and working-class Americans.\n\nIn advancing it, Republicans invoke those historical policies that  were intended to disenfranchise…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…Washington, as a  longshore worker at the port in 1978, and worked his way up, including  to secretary-treasurer of the executive board. In 2018, he broke  barriers as the first Black international president of the ILWU.\n\nHe fought for increased wages and benefits for his longshore brothers  and sisters and navigated the safety and supply challenges of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695163/congratulating-willie-adams-on-his-retirement"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…his billionaire buddies, of course, but it is  the people that many of us represent that are the most at risk.\n\nThis is a White House that constantly diminishes and dismisses Black  achievement; a White House that blames anything and everything on  diversity, equity, and inclusion; a White House that is trying to  defund our public safety programs and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…ceremony held in her  name, a tribute to a trailblazing jurist whose legacy has profoundly  shaped Tarrant County and the State of Texas. This historic occasion,  led by the Black Women Lawyers Association, reflects Judge Hicks's  extraordinary impact on the legal profession and her commitment to  justice and public service.\n\nJudge Hicks's distinguished…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…diverse group of people to invest responsibly, regardless of their  net worth.\n\nThis legislation creates a new path for capital to reach more hands.  In my State, the Delaware Black Chamber of Commerce has told me that  the legislation would help close the capital gap for diverse  businessowners. Small business leaders say that it is not lack of ideas…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of people charged with an offense who received cash       bail jumped from 37 percent to 61 percent. Cash bail has,       historically, disproportionately impacted low-income Black       communities while disparities in the Black-white wealth gap       persists amidst racially discriminatory policies that have       not been       fully addressed. Overall…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Care Act.\n\nThis big, pretty some may say, most would say ugly law will hurt  Americans of every party, of every background, of every ZIP Code. For  43 days, the Congressional Black Caucus stood firm to protect America's  healthcare and lower healthcare costs for people like Mike and so many  others that will remain nameless and faceless because they don't…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…airfield, erupting into flames as hundreds of thousands of  pounds of jet fuel ignited. The resulting fire engulfed an area the  size of nine football fields, and the thick, black plume of smoke could  be seen from anywhere in the city. I have lived in Louisville my whole  life and could never have imagined seeing something like this. For a  moment,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…fifteen years, he  has served our city through multiple appointments to boards,  commissions, and committees, including his prior role as Immediate Past  Chair of the Dallas Black Chamber of Commerce, and his membership on  the Dallas Citizens Council and North Texas Commission.\n\nSince joining DART, Mr. Bryant has been elected to serve on the Board…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to recognize Sergeant Major  Troy Black as he retires from a distinguished 37-year career in defense  of our Nation.\n\nSergeant Major Black was born and raised in Louisville, Kentucky,  before joining the Marine Corps…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694976/recognizing-sergeant-major-troy-black"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…going through committee and being considered  and having people weigh in on whether it is a good idea or not. But to  simply reinvent and pretend, if you will, that the color black is the  color white or an orange is an apple--because everyone understands a  waiver is not a rule.\n\nSo it is unfortunate that the colleagues in charge of the legislative…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…aggressor, and the perpetuator of  war crimes. Louisiana's own Republican Senators agree. Senator Kennedy  went further, calling Russia's dictator, Vladimir Putin, a gangster  with a black heart, a figure responsible for unprovoked war and  atrocities on a sovereign nation.\n\nIt was Russia's invasion that shattered Ukraine's peace, beginning  with the invasion…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688193/rapid-response-subgroup"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, it is Black History Month, and I came to give  you hell all month.\n\nThis weekend, ICE agents tear-gassed kids. Let me repeat that. ICE  agents tear-gassed kids. Protestors from union families…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699493/protests-in-portland"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…stewards from around the globe. Nationwide, 95 million birders generate  over $90 billion annually for our economy.\n\nThe biggest week in American birding is sponsored by the Black Swamp  Bird Observatory in Oak Harbor, Ohio. This event leverages public- private partnerships to promote conservation of migratory bird  populations and promote millions of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Eventually, Angela Davis, another person prominent in the revolutions  that were taking place in the 1960s, was very antifamily. Even since I  have been in Congress, we had the Black Lives Matter movement, who came  out against what was referred to as the ``traditional family.''\n\nThis is not only a problem for children, it is a problem for the men.  I think…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…home. We remember the  58,000 patriots who never returned home safely to the warm embrace of  their families. Today, their names are hauntingly etched into the two  faces of black granite in our Nation's Capital known simply as The  Wall.\n\nA replica of this very wall, almost 300 feet long, will be on display  in my district from April 17 to April 21,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Pacific, including Hawaii, Okinawa, and the  Philippines.\n\nIn more recent history, the Delano Municipal Airport gained  distinction as the home of a squadron of Northrop P-61 Black Widow  aircraft--twin-engine fighters that played a key role in defending the  Pacific Coast during the war.\n\nToday, Delano is best known for its thriving agricultural industry.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…the Joint Strike Fighter and amphibious ship readiness  concerns.\n\nThis bill reestablishes safety as a culture and seeks to partially  correct the mistakes that led up to the Black Hawk collision with a  commercial airliner here at DCA earlier this year.\n\nThis bill seeks to foundationally reform the military construction  process.\n\nFinally, this bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…square and put forward your ideas and put forward what you believe is  truth and then hash it out. He did so eloquently, thoughtfully, and  engagingly with people of all stripes: Black, White, straight, gay,  male, female, whatever it was. He would engage with people on campuses  and around this country to pursue truth.\n\nMr. Speaker, one of my favorite quotes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…discourage people who are  married from having children?\n\nIn fact, Karl Marx, of course, was very opposed to the traditional  family. We have known since I have been here.\n\nBlack Lives Matter made it clear that they were opposed to what they  referred to as ``the Western-prescribed nuclear family.'' Of course,  even after Black Lives Matter came out…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…other side are saying today.\n\nThey are saying that American minorities are not capable of showing  an ID to vote. It is an insult. It is abusive. In reality, 76 percent  of Black Americans support voter ID in poll after poll, and 82 percent  of Latino Americans support voter ID in poll after poll.\n\nWhat the left is saying is that they don't trust the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Mr. President, in January of this year, tragedy struck just  a few miles from here when an Army Black Hawk helicopter collided with  American Airlines Flight 5342 at Ronald Reagan Washington National  Airport. Sixty-seven souls were tragically lost in an instant.\n\nAfter the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…District.\n\nHydropower is critical to our Nation's energy mix, supplying power to  approximately 30 million homes and businesses and accounting for 40  percent of the Nation's black start capacity.\n\nHowever, the average age of a hydropower facility in the United  States is 60 years. Therefore, hundreds of projects will be up for  relicensing between now…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, today we remember and honor a trailblazer, a  leader, and a dear friend, Mia Love.\n\nMia made history as Utah's first Black mayor and the first Black  Republican woman elected to Congress, but her impact went far further  than those titles. She was a fierce advocate, a tireless servant, and a  bright…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I rise today to recognize Papillion,  Nebraska's, Mayor David Black, as a paragon of public service and  remarkable stewardship.\n\nThrough more than two decades of service to the people of Papillion,  Mayor Black helped to guide the city into…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…we are speaking out on your  behalf today; and we have not forgotten. And this kind of hatred and  anti-Semitism cannot continue in America.       Historic Greenwood District-Black Wall Street National Monument                             Establishment Act\n\nMr. President, today, I am also disappointed. There is a bill that is  a very simple bill that…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…aisle can  somehow make book and tell you that you must support violent murderers,  rapists, robbers, gang members, drug traffickers, and human  traffickers? It couldn't be more black and white, and it is so  disappointing.\n\nMr. PERRY. I just have to ask you in this colloquy, Representative  Roy from Texas: You say, ``the radical left,'' but I listened to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…nationally renowned wildfire  mitigation program.\n\nMarshal Lacey was onsite and led the efforts to combat the Waldo  Canyon fire and saved my own home and thousands of others in the Black  Forest fire that devastated our community, in addition to helping  recover victims of Hurricane Katrina.\n\nMr. Speaker, I ask that my colleagues join me in congratulating and…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689254/recognizing-the-retirement-of-colorado-springs-fire-marshal-brett-lacey"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…meaningful honors  that meant a great deal to him, including the Man of the Year Award  from the Dauphin County Teenage Republicans in 1971, a Resolution of  Recognition from the Black Republican Council of Pennsylvania in 1982,  and a Presidential Award from the IMC of Greater Harrisburg in 2012.\n\nMr. Speaker, I am honored and privileged to recognize Mr.…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}]