[{"senator": "Mike Quigley", "party": "Democrat", "sentence": "…becoming a pilot. Like many men at the time, Donald felt it was his  duty to serve his country, but despite scoring well on the aptitude  test, he, like many other qualified Black men, was forced to wait while  White pilots were fast-tracked for training.\n\nBy the time he was accepted for pilot training at the Tuskegee  Institute in Alabama in 1945, the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Lieutenant Colonel George Hardy, a veteran of Vietnam, Korea, and  World War II, passed away.\n\nThis is not a name most of us know in isolation, but we all know the  story of the Black men who were trained as pilots on airfields in the  backwoods of Macon County, Alabama, who would go on to become what the  world knows today as the Tuskegee Airmen.\n\nLieutenant…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696982/tuskegee-airmen-moment-of-silence"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…healthcare worldwide.\n\nIn the Congressional Black Caucus, we are daily organizing and  legislating towards a different vision: one of true healthcare justice,  a vision where Black men can grow old, where birth is safe and sacred,  where every baby has clean air to breathe and safe water to drink,  where health equity is a given and not an afterthought,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…historically underserved  populations.\n\nIt is no secret that systemic racism negatively impacts health  outcomes for Black Americans. That is not speculation. It is well- documented. Black men face higher risks of chronic conditions, receive  fewer preventive services, and experience worse outcomes overall. This  must stop.\n\nIt is simply unacceptable. We cannot…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Black, pregnant women had their first heart  attack either while they were pregnant or shortly thereafter. Oh, by  the way, the disparities in cardiovascular care for Black women and  men: The death rate is higher than for White men and women.\n\nI began to look at how do we put policies in place that address the  maternal mortality crisis as a whole, but…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Members in this Congress, the largest in our history. As we say  in the Baptist church, we have come a mighty long way. From 1971, when  13 Members sat on this House floor, 12 Black men from across this  Nation and one brave, courageous, bad sister, Shirley Chisholm. My,  have we come a long way.\n\nWe come tonight, and we speak truth to power in this most…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Overall Black and Brown defendants are 10-25       percent more likely than white defendants to be held       pretrial, and that number skyrockets to 50 percent for young       Black men compared with white defendants. Not only would       Black men be placed in pretrial detention at a       disproportionate rate, but in 2022, The U.S. Commission on…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…fluff; they are crucial.\n\nI also must refuse the default Republican Social Security ``reform''  of raising the retirement age to 70 given that it would  disproportionately harm Black men and communities of color who have  lower life expectances. Systematic inequalities in socioeconomic  status, education, food security, and access to healthcare play an  intricate…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…of the bipartisan Men's  Health Caucus, this issue is close to my heart.\n\nEvery year, the Black community is disproportionately affected by  prostate cancer. Specifically, Black men are twice as likely to die  from prostate cancer as their White counterparts. This alarming trend  highlights an urgent need for action.\n\nTo address the disparities in prostate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…South Carolina, to the racist mass shooting at  the Tops grocery store in Buffalo, New York, that claimed the lives of  10 people, to countless police shootings of unarmed Black men, women,  and children, our Nation has, unfortunately, bore witness to far too  many horrific acts of gun violence against Black communities.\n\nThis crisis of gun violence…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Speaker, I rise tonight to join with my colleagues  in the Congressional Black Caucus to pay homage to the Black men and  women of our Armed Forces whose service and sacrifices have far too  often gone unrecognized and underappreciated. To make matters worse,  they have often been denied…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Religious  Award; Outstanding Georgia Citizen Award presented by then-Secretary of  State Cathy Cox; Excellence in Community Award from the NAACP; the  Trailblazer Award from 100 Black Men of Albany; Citizen of the Year  from Omega Psi Phi--Eta Omicron Chapter; the Liberty Bell Award from  the Dougherty County Bar Association; a Certificate of Special  Congressional…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…rights movement. We  are in the third backlash now.\n\nWhat the backlash involves is propaganda that breaks up coalitions,  whether it was a coalition of previously enslaved Black men and poor  nonlandowning Whites who came together during Reconstruction to rebuild  this Nation, the backlash to that involved racial terror lynching, or  the lie of white…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…However, for most of our country's history in the  beginning, only White, landowning men could vote.\n\nThat was changed in 1870 when the 15th Amendment opened the door for  Black men to vote by prohibiting the Federal Government and States from  denying or abridging a citizen's right to vote on the account of race,  color, or previous condition of servitude.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…civic service roles include: Chief Voting Inspector for Lee  County at the Covington Recreation Center, Chairman and member of the  City of Opelika Zoning Board, Member of 100 Black Men of America. Inc.,  Greater Auburn-Opelika Chapter, where he served as All Pro Dad's  Chairperson for Carver Primary School and West Forest Intermediate  School, Longtime…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Martin Luther  King, Jr., Memorial.\n\nHis continued civic work through service on the Papio-Missouri River  Natural Resources District Board, and as a founding member of 100 Black  Men of Omaha leave a great mark in our city.\n\nMr. Conley and his wife, Teresa, have three children and have resided  in the same North Omaha district they have dedicated themselves…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}]