[{"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…continue to serve today. The strength of our  military and our democracy depends on truth, inclusion, and the respect  of those who have carried the burden of service.\n\nBlack Americans have served in the United States military since the  Revolutionary War, with over 350,000 currently serving on Active Duty  or in the Reserves, making up approximately…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…news  from every corner of our Federal Government. They are bone weary by the  fear of the impact these reckless actions continue to have on our  working families.\n\nFor Black Americans, in particular, the Trump administration has made  direct attacks on our communities and emboldened extreme hatred and  bigotry. The symbolism of using the Presidency…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…work of President  Obama, President Biden, and Democrats in Congress, the Black uninsured  rate fell to historic lows last year. That is right. We went from 20  percent of Black Americans being uninsured to just 10 percent.\n\nIt is not just Black Americans or people living in cities who have  benefited. In fact, some of the Whitest and most rural parts of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696766/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…been running a  fever, a moral sickness, one that begins at the very top, a twisted  agenda that pardons the powerful, protects the predators, and punishes  the people. Black Americans are paying the price.\n\nMr. Speaker, buried in the last jobs report was this number: The  Black unemployment rate is now 7\\1/2\\ percent. That is a recession- level rate,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…should do with this extraordinary power, the power  of the vote, when for the first time in American history, a government  by, of, and for the people finally included Black Americans.\n\nHe focused on addressing poverty. He focused on addressing  discrimination. He focused on addressing war. I thought about another  speech that he gave shortly before…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…rise today with my colleagues of the Congressional Black Caucus to  commemorate Black History Month and to reflect on the innumerable  contributions to our country that Black Americans have made throughout  our Nation's history.\n\nDuring Black History Month, we celebrate the generations of Black  Americans whose courage, advocacy, sacrifice, and patriotism…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…and  to celebrate Black History Month.\n\nBlack History Month is not just a celebration, but a reminder of the  struggles, achievements, resilience, and contributions of Black  Americans throughout our Nation's history.\n\nIn New Mexico, it is the opportunity to honor and celebrate that  Black history is not only American history, it is New Mexico history,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687897/black-history-month"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…struggled and died in a dual battle: fighting abroad in defense of  country and fighting at home for opportunity, change, and their rights  as American citizens.\n\nMillions of Black Americans have answered the call to serve and  protect the American people from all threats, both foreign and  domestic. Today, 350,000 Black men and women serve in the United States…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…is only the first week of June.\n\nEvery shooting leaves behind a shattered family, a traumatized  community, and a ripple effect that lasts generations.\n\nLet's be clear. Black Americans are not just victims of community  violence. We are also disproportionately impacted by rogue police  violence, police shootings, and shootings of unarmed men and women,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…minutes after  receiving his high school diploma.\n\nThese are 2 of the 46,728 people who died from gun-related injuries  in 2023 alone. They were among the average 13,300 Black Americans who  die of gun violence every single year.\n\nSierra Jenkins, Jahiem Dickerson, Devon Harris, Samiyah Yellardy,  Tyshawn White, Jaiden Carter, Kenneth Cooper, Markiya Dickson,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…segregation, Jim Crow, and the legacy of bigotry today.\n\nWe should be clear about who Charlie Kirk was. He was a man who  believed that the Civil Rights Act that granted Black Americans the  right to vote was a mistake, who after the violent attack on Paul  Pelosi claimed that ``some amazing patriot'' should bail out his brutal  assailant, and accused…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…constitutional principles,  economic realities, or morality.\n\nOur Constitution has been amended specifically to advance inclusion,  equity, and diversity, granting freedom to Black Americans from slavery  and ensuring their right to vote, and establishing the right of women  and those over 18 to vote, as well--free speech, assembly, and  religious practices…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…the Third Congressional District that I serve in the  great State of Ohio.\n\nI rise on behalf of the families across this Nation. I rise on behalf  of the 18-plus million Black Americans that the members of the  Congressional Black Caucus serve.\n\nMr. Speaker, I also rise on behalf of the 82 million Americans that  the Congressional Black Caucus serves.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Representatives Bynum and Figures  for organizing this Special Order hour.\n\nMr. Speaker, I rise to celebrate Black History Month and the profound  and vibrant legacy of the many Black Americans who have made our  country.\n\nBlack history is a living, breathing narrative that enriches our  Nation and influences our daily lives. It is a powerful testament to  resilience,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…to advocate for Asian  immigrants who wanted to earn the right to become U.S. citizens.\n\nDuring the civil rights movement, Asian American activists protested  alongside Black Americans in the fight for equality.\n\nThe allyship between our two communities remains critically important  in the face of a vicious campaign to erase our stories, voices, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688013/standing-with-cbc-in-shared-fight-for-equality-and-justice"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Let them look at 51 Republicans sitting on the Senate floor who want to  move a bill that 85 percent of White Americans, 82 percent of Hispanic  Americans, 76 percent of Black Americans, 71 percent of Democrats, and  95 percent of Republicans believe we should pass so that we can have  security in our elections.\n\nWe can pass the SAVE America Act. We will…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Republicans. That is all across the spectrum. Over 70 percent of  Democrats support picture ID, 82 percent of Hispanic Americans support  picture ID to vote, and 76 percent of Black Americans support a picture  ID to vote.\n\nIf they still want to lie to people on the other side, Mr. Speaker,  if they still want to try to scare people and talk about Jim Crow,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…other side are saying today.\n\nThey are saying that American minorities are not capable of showing  an ID to vote. It is an insult. It is abusive. In reality, 76 percent  of Black Americans support voter ID in poll after poll, and 82 percent  of Latino Americans support voter ID in poll after poll.\n\nWhat the left is saying is that they don't trust the American…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…percent of Democrats across this  country, over 90 percent of Republicans, and well over 70 percent of  virtually every ethnicity and ethnic group in the country--Black  Americans, Hispanic Americans, White Americans, men, women, rural,  urban--overwhelmingly support voter identification and ensuring that  only citizens vote.\n\nFact five: We passed the SAVE…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]