[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, I rise today to celebrate Black History  Month.\n\nBlack History Month means a lot to me, and it means a lot to my  constituents in northeast Ohio.\n\nJust in the last few days, we have been reminded of how the past and  present…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Congressional Black Caucus  Special Order hour.\n\nMr. Speaker, I rise tonight with my colleagues of the Congressional  Black Caucus to again commemorate the centennial of Black History Month  and to reflect on the innumerable contributions to our country that  Black Americans have made throughout our Nation's history.\n\nBlack History Month offers our community…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, in celebration of Black History Month, I rise  today to recognize extraordinary Black luminaries from central Florida  for their work and impact on the community that I proudly represent.\n\nThrough tireless…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700051/black-history-month"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I thank Representatives Bynum and Figures  for organizing this Special Order hour.\n\nMr. Speaker, I rise to celebrate Black History Month and the profound  and vibrant legacy of the many Black Americans who have made our  country.\n\nBlack history is a living, breathing narrative that enriches our  Nation…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, February is Black History Month, when we  take special note of the historic achievements of African Americans who  have helped shape today's America. Black history is American history  and for decades…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700078/black-history-month"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "Ms. MENG. Mr. Speaker, my Congressional Asian Pacific American Caucus  and I are proud to honor Black History Month and stand with our  Congressional Black Caucus colleagues in the shared fight for equality  and justice.\n\nThere is a long and storied history of solidarity between the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688013/standing-with-cbc-in-shared-fight-for-equality-and-justice"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today with my colleagues in the  Congressional Black Caucus to honor my history--our history--American  history . . .\n\nI'm here to honor Black history during Black History Month.\n\nThis is a time to honor our elders, and the struggles they endured  bringing us to this moment.\n\nMy home of Las Vegas is rich with contributions, milestones…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I stand before you tonight to honor and  to celebrate Black History Month.\n\nBlack History Month is not just a celebration, but a reminder of the  struggles, achievements, resilience, and contributions of Black  Americans throughout our Nation's history.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687897/black-history-month"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today as the first, but not the last,  Black Member of Congress in Oregon's history to celebrate Black History  Month in these hallowed Halls of Congress. Listening to Brother  Figures' speech has me a bit choked up. We are the next generation.\n\nIt is not lost on me that I am just one…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687899/black-history-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…impact of President Trump's engagement in the peace process between  Israel and the Palestinians.\n\nFirst, let's look at the two resolutions. The first resolution is our  Black History Month resolution.\n\nI am proud to say that this resolution will be filed tomorrow, and  this is the original Black History Month resolution for 2025. We have  many persons…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of the Black  Heritage Trail of New Hampshire, in celebration of Black History Month.\n\nOriginally founded in 1994, the Portsmouth Black Heritage Trail,  which has since grown into the Black Heritage Trail of New Hampshire,  has fought to uncover and…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Congressman   James Clyburn of South  Carolina.\n\nYou see, Mr. Speaker--and to all those who are listening and watching  tonight--it is not only our 100th anniversary of Black History Month,  but it is just that, it is our history, as Mr. Clyburn has so aptly  outlined.\n\nFor the remainder of our first hour, you will hear from us. We will  speak directly…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "Mr. GARCIA of Illinois. Mr. Speaker, as we celebrate Black History  Month, I rise to recognize Joann Williams, a dedicated leader in  Illinois' Fourth Congressional District and a pillar of the LeClaire- Hearst community on Chicago's southwest…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I include in the Record the following  essay from Virginia's Fourth District Black History Month Essay  Contest--1st Place middle school contest winner, Augustus Rezba-Patel.\n\nWomen are 17 percent of active-duty U.S. military members       today. They serve in combat…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, it is Black History Month, and I came to give  you hell all month.\n\nThis weekend, ICE agents tear-gassed kids. Let me repeat that. ICE  agents tear-gassed kids. Protestors from union families…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699493/protests-in-portland"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Ragland a very  happy 90th birthday and thank her for being such a powerful example of  perseverance and purpose and for being my friend.                       Celebrating Black History Month\n\nMr. BACON. Mr. Speaker, in recognition of Black History Month, I rise  today to honor two community leaders and two outstanding youth for  their contributions to the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}]