[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…OMB, and the architects of Project  2025 are trying to use this rescission bill to undermine the power of  Congress.\n\nThat is why we will vote ``no,'' a ``hell no'' to the blatant power  grab that it represents in the face of the chaotic and corrupt  administration and Congress that is stealing from our people.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693707/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…seems to be choosing military leadership he  believes will say yes. He is purging dedicated, capable leaders with no  explanation other than removing roadblocks.\n\nThis is a blatant attempt to politicize our military, replacing  loyalty to our Constitution with political loyalty to Trump.\n\nOur Founding Fathers designed our military to be explicitly  apolitical.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688243/removing-roadblocks"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…authoritarianism, using the tools of government to  enrich himself, reward his friends, and punish his enemies.\n\nSo I am asking my colleague: What kind of threat does this blatant  corruption pose to our democracy, our institutions, and on the American  people?\n\nMs. HIRONO. Certainly.\n\nSo the rampant corruption of this regime, what kind of threat does…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696353/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…This is a devastating  moment for transgender youth, their parents, and their healthcare  providers across the country.\n\nThe so-called Protect Children's Innocence Act is a blatant attack on  the rights of parents. It allows the government to interfere with very  personal healthcare decisions.\n\nMy Republican colleagues have spent years touting parental…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698355/protect-childrens-innocence-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…foreign  companies buying influence, and okay with criminals buying Trump coins  to seek pardons and beneficial treatment.\n\nEach of my colleagues surely can see how this is a blatant conflict  of interest. Democrats and the rest of America do, as well. It is why I  introduced the Stop TRUMP in Crypto Act, to ban the President, Vice  President, and Members…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…than 1.3 million Americans have sought lifesaving help by making  the call to 988. Yet this administration has eliminated funding for  those specialized services. These are blatant attempts to harm the  LGBTQ community that has already overcome so much and made incredible  strides towards equality.\n\nIt is here in this Chamber that we should be standing…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693017/fighting-for-lgbtq-rights"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…from a foreign government and flying around in a  Qatari jumbo jet, taking it  with him as a door prize when he leaves office in January 2029--if he  leaves office. This is blatant, in-your-face corruption to see how far  he can go in his attempt to replace democracy with dictatorship.\n\nCongress has the authority to introduce Articles of Impeachment…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Street, plain and  simple. It would make it easier for big banks to get even bigger,  hurting small businesses and communities in the process.\n\nS.J. Res. 31 is even worse, a blatant handout to big polluters,  putting corporate profits ahead of our constituents' health and safety.\n\nThis isn't new, Mr. Speaker. That has been the Republican playbook  all…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…another horrific  incident of anti-Semitism, which we all know is much too rampant in our  society.\n\nYaron Lischinsky, Sarah Milgrim--may their memories be a blessing.\n\nSuch a blatant and targeted act of anti-Semitism, right here in the  Nation's Capital, should outrage everybody--a beautiful young couple  about to be married just starting their lives,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691653/capital-jewish-museum-shooting"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…ventures that Trump and his family are pursuing now with no  oversight by Wall Street's cop on the beat--that is the SEC.\n\nSurely, each of my colleagues can see how this is a blatant conflict  of interest. Democrats do. It is why I introduced the Stop Trump and  Crypto Act to ban the President, Vice President, and all the Members of  Congress from crypto…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…to massacre law enforcement.\n\nI want to be very clear on this. Those statements are lies. They are  lies used to justify the unjustifiable actions of some DHS officers.\n\nThe blatant lies of DHS leadership and misconduct by the officers  involved in the killings of Alex Pretti and Renee Good are  indefensible, and they cannot stand. They violate the public…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Conference. He is an honorable and earnest leader, a man who has even  offered to step down from the Presidency if it would guarantee the  freedom of his people.\n\nPresident Trump's blatant lie and absurd insult is a lie directly out  of Soviet-style propagandist playbooks. It is Putin who wants to take  Ukraine's resource-rich land. It is Putin who wants to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…lifetime.\n\nMr. Divine also referred to himself as a ``zealot'' for the anti- choice movement. Now, whether you are pro-choice or pro-life, you would  think that someone who is that blatant and open in declaring himself a  zealot on the issue would trouble you. This has been on full display in  his role as Missouri solicitor general.\n\nMr. Divine has challenged…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…refusing to  ``jeopardize Americans' sensitive data, or dismantle critical public  services.''\n\nThree, one of Musk's companies secured a lucrative FAA contract,  laying bare his blatant conflicts of interest. Somehow, I doubt that  one will be canceled.\n\nNumber four, he fired 6,000 veterans serving the American people.\n\nWhy? Apparently, it is because a disabled…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Medicaid, just to give you one  example. That is why I have joined Senator Wyden and Senator Schumer in  introducing a bill that will repeal the health provisions in the ``Big  Blatant Betrayal.'' It is not a Big Beautiful Bill; it is a ``Big  Blatant Betrayal.'' This measure would extend the ACA premium tax  credits.\n\nAgain, Medicaid cuts are reprehensible…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…biological males to compete in women's sports.\n\nToday, that warning proved well-founded as the Department of  Education concluded its investigation, finding that California is in  blatant violation of Title IX. As a result, our State could lose its  Federal education funding.\n\nThe good news is that we don't have to. The State can prevent any  loss of funding…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692907/warning-californias-political-leadership"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…our sacred responsibility.\n\nWe just found out about a case in my own district where an individual  was collecting her dead mother's Social Security checks for 3 years.  Her blatant fraud was finally discovered, and she was sentenced and  ordered to repay $25,000 in restitution. This case is not isolated. The  Government Accountability Office estimates…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699247/epidemic-of-waste-fraud-and-abuse"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…instead labeled it Palestine. Following a  congressional hearing last year, New York Public Schools acknowledged  receiving large donations from Italy and South Korea. These blatant  attempts to inject foreign ideologies into our schools undermines the  fundamental purpose of American education. It goes without saying that  we should be teaching American…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…of checks and balances by exercising its Article I powers  entrusted to us.\n\nThe executive's military exercise to capture the leader of Venezuela  represents one of the most blatant usurpations of congressional  authority we have seen in modern times. If we ignore it, then we are  not merely acquiescing to executive overreach, we are rendering  impotent…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…contained so many limitations, restrictive  stipulations, and Required Operating Procedures that it made leasing  and development economically infeasible. As a result of this blatant  attempt to undermine and disregard Congress' direction for a  competitive oil and gas leasing program within the Coastal Plain, the  DOI received zero bids and never truly…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…into law to ban the  sort of parody video that was seen by many people during the election.\n\nNow, of course, I made it very clear at the time that this was a  violation, a blatant violation, of the First Amendment. It didn't stop  Newsom from signing the bill. He has had many bills before that  violated the First Amendment and they were thrown out by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…half of  2023 alone, China supported the transfer of nearly $300 million worth  of semiconductors to Russia, including for use in missiles and drones.\n\nThe CCP's actions are blatant violations of U.S. export controls and  detrimental to our ongoing peace efforts. China's economic and  industrial support for Russia is a critical lifeline for the Russian…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…on oil and natural gas facilities called the waste  emissions charge, also like we have been discussing, the natural gas  tax or the methane tax. This natural gas tax was a blatant abuse of  power and the first time that the Federal Government has ever directly  levied a tax on emissions, creating a duplicative layer of red tape  that would devastate…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…other side,  many Democrats want to make race and sex the most important factors in  choosing ERISA retirement plan service providers. In so doing, they are  advocating for blatant race and sex discrimination, which we should all  strongly oppose.\n\nDiscrimination is never justified, and the use of quotas is  inherently discriminatory. ERISA plan service…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Virginia. That is part of the reason why we  conspired together on this bill, when we were talking about how  ridiculous it was that, on both sides of the aisle, there were blatant  abuses of this trust that the American people put in the people who  represent them not to violate that trust by trading securities for- profit on the very issues they are…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Veterans Crisis Line and ensure that veterans have  everything they need and a safety net firmly in place.\n\nWith all the issues raised during this debate, Mr. Chair, from the  blatant push toward privatization of VA medical care to the  underfunding of infrastructure and climate resiliency projects and the  harmful poison pill riders, I just cannot in good…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…a  restaurant or pick up food.\n\nWhen it comes to the most sacred act in our Republic, voting, they  fight tooth and nail against requiring proof of citizenship. Why? It is  blatant hypocrisy, and the American people see right through it.\n\nThe SAVE Act ensures that only American citizens can register to vote  and vote in Federal elections. It protects…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…to offshore  wind development?\n\nThis was politically driven. I am not arguing we need these  additional necessary requirements for offshore wind. I am just pointing  out the blatant hypocrisy of the past administration. It is clear where  their intentions were. Overturning this rule is good for our energy  security and for our energy independence.\n\nMr.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I thank the Chairwoman for yielding.\n\nMr. Speaker, after blatant obstruction and prolonged delay on the  part of congressional Democrats for over 40 days, the House has  returned to regular order. It is good to be back, and it is about…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696902/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…weapons,'' it added.\n\nThe Israeli military said ``the storage of weapons and the       activities of the Hezbollah terrorist organization at these       sites constitute a blatant violation of the understandings       between Israel and Lebanon.''\n\nLebanese security sources said that Israeli warplanes flew       more than 10 attacks in several eastern…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}]