[{"senator": "Al Green", "party": "Democrat", "sentence": "…for the grace of God,  dear brother, you could be on Medicaid. You just have been blessed.  Don't assume that it was your intellect that has caused you all of  these great blessings that you have received. You have just been  blessed beyond measure. Speak to the President and tell him that  Medicaid ought not be cut.\n\nBut I continue. I interrupted.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…actors to do this and  commit any Federal crime with impunity. As a matter of fact, we could  say it is with immunity.\n\nThese actors, these participants, they all have the blessings of the  President of the United States of America. The President of the United  States of America is now under the impression that he has absolute  immunity, knowing that…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Monumental Faith Ministries alongside  his loving wife, First Lady and Co-Overseer, LaVerne Shinault Carter.  For 35 remarkable years, he shepherded his congregation through  blessings, baptisms, weddings, and offered comfort to grieving  families. Under their dynamic leadership, First Monumental became a  beacon of hope and salvation.\n\nAs the great Agriculture…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…seeing daily assaults on our democracy, it is  our duty to never give up hope and to continue to fight for what  Congressman Lewis aptly called ``one of the most important blessings of  our democracy,'' and that is our Nation's right to vote.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…through those times  I was struggling financially, and so I am so thankful it was there when  I needed it most. I am no longer on the program, but it was one of the  biggest blessings in my life during those hard years after my loss.  Thank you to the government for helping me. We all need help at times  in life, and I think this program should remain…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to form a more       perfect Union, establish Justice, insure domestic       Tranquility, provide for the common defense, promote the       general Welfare, and secure the Blessings of Liberty to       ourselves and our Posterity, do ordain and establish this       Constitution for the United States of America.\n\nWhich each one of us, each one of us in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "Mrs. MOODY. Mr. President, last week, across America we were shocked,  astonished, gutted. The night before our Nation paused to give thanks  for the blessings in our lives--the night before Thanksgiving--two of  our country's finest were shot down mere blocks away from the White  House. Two young National Guardsmen, who had served…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Helen loves sipping a good, hot cup of tea  while reminiscing on her past. Helen's ideal way to spend her birthday  exemplifies her ability to find joy in life's simplest blessings-- attending a quiet luncheon savoring her favorite treat: ice cream.\n\nMr. Speaker, I ask my esteemed colleagues in the United States House  of Representatives to please join…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…point I want to make--and I am going to come back to this a couple  of times here--a couple hours ago, we had the Joint Economic Committee  over in the Senate. It is one of my blessings. I get to chair it. We  did something, and both sides were pretty good. Some Democrats took  some pokes at us, but the theme of this Joint Economic Committee  hearing was…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…government has given over the years to this brutal dictatorship, we owe  many times over to the Iranians who are desperately trying to overthrow  their oppressors and restore the blessings of liberty to themselves and  their posterity.\n\nThey need the direct satellite access to the internet that the regime  has denied them on the ground. They need us to restore…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…unwavering commitment to  victory.\n\nI am proud that their hard work has paid off. As these talented  students prepare for their next endeavors, I wish them the best of luck  and blessings for an even brighter and more victorious future.\n\nGo Bearcats.\n\nIn God We Trust.                  RECOGNIZING GORDON LONGHORNS BASEBALL TEAM\n\nMr. WILLIAMS of Texas. Mr. Speaker,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Stephen Reich,  Sergeant First Class Michael Russell, Chief Warrant Officer Chris  Scherkenbach, Petty Officer James Suh, and Petty Officer Jeffrey  Taylor.\n\nMr. Speaker, may blessings go out to the Gold Star families and  friends on this day.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…few minutes talking about what that all means. Let's  talk first about pro-family. My husband, Mike, and I have three  children. Raising a family is one of life's greatest blessings and  biggest responsibilities. Government should not make it even harder.\n\nThat is why the tax relief is a top priority for Republicans in  Washington and is the centerpiece…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…unalienable rights and to secure these       rights, governments are instituted among men, [receiving]       their just powers from the consent of the governed.''\n\nTo secure the blessings of liberty, the Founding Fathers of       the United States of America created a written constitution       under the inspiration of Almighty God. The preservation of…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Constitution.\n\nMaybe, just maybe, by joining together to mark this milestone, we can  awaken a fresh reverence and respect for our founding documents, our  collective national blessings, and the ideas that changed the world  two-and-a-half centuries ago.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…ahead of our 250th birthday. I would  encourage us to accept that challenge. It is hard to hate someone when  you pray with them and for them regularly.\n\nOne of the greatest blessings of this job is that I get to know and  spend time with Kansans all across the Big First District, and because  of that, I know that we are better than this. America is still…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…great-grandchildren honor and love her  deeply as she remains faithful to God.\n\nI congratulate Sylvia on reaching this remarkable milestone. May God  continue to pour out His abundant blessings upon her and her family. It  is my honor to serve her in the United States House of Representatives.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…reconciliation process, I am  encouraging my colleagues to hold fast to the principles established in  the House's budget resolution. If we do that, we will preserve the  blessings of liberty and prosperity for our children and grandchildren  for generations to come. If we don't, if we shrink back in this  monumental moment and this historic opportunity,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…friends and colleagues, really, across the  aisle, what we celebrate tomorrow is the Nation's birthday. Let's put  the politics aside for a minute and let's reflect on our blessings. No  kidding, really. Tomorrow is the 249th birthday of our Nation. That is  right.\n\nI mean this sincerely: I thank my colleagues for standing, we all  should be united in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…was needed. He even advocated  directly with the Army Corps of Engineers to advocate improvements to  local flood control and levee systems.\n\nSteve counts among his greatest blessings, his wonderful parents,  devoted family, his incredible community, and the opportunity to make a  positive difference in so many lives.\n\nSteve Ledwell's lifelong commitment…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…honored through  the nationwide Honor Flight Network of volunteers, since 2005.\n\nMr. Speaker, President George W. Bush once said, ``We have been the  recipients of the greatest blessings of liberty ever known to man. We  live in freedom because others have made the ultimate sacrifice. As a  Nation, we must never take for granted, the liberties we enjoy today,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}]