[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…best-kept secrets in Washington. But it's not, by       far, the only secret. And I'll have more on that in the       months ahead.\n\nUntil next week, thanks for listening, and God bless you.\n\nThat was Ronald Reagan. The Republican Party wasn't always like it is  today. There was a time when the environment and clean water and clean  air were a priority of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…independent in perpetuity, the United  States of America must continue its steady progress in building  competitive modern energy systems forward here in our homeland. May God  bless America.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…than I paid a week before.\n\nI have heard from mothers worried their daughters and granddaughters  will lose their Medicaid coverage for mental health care and treatment.  God bless every American family that has a child with mental illness or  a relative with mental illness. You are saints caring for them.\n\nA wife called worried her husband going through…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…amazed at is  that the media will allow him to take the last thing he says as what he  really meant. You would never do that for Barack Obama. You would never  do that for, God bless him, the last President of the United States,  the Honorable Joe Biden. You would never do that.\n\nHowever, you take the last thing this President says, regardless as  to what…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…We thank Reverend Carr for her tireless work, leadership, commitment  to help others, and for showing us all what it means to walk in purpose  and faith. May God continue to bless her and her work.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…another form of       protectionism and I may need your help to stop it. Remember,       America's jobs and growth are at stake.\n\nUntil next week, thanks for listening, and God bless you.\n\nMr. SCHUMER. Yesterday, the Senate came together in a bipartisan way  to pass legislation to end Donald Trump's bogus emergency declaration  in Brazil, under the leadership…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…profound respect and admiration that I recognize Rabbi  Alan Katz this Jewish American Heritage Month. His legacy of  leadership, advocacy, and deep spiritual care continues to bless our  community and beyond.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691618/recognizing-rabbi-alan-katz"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…U.S. government has stated that it is not safe for Americans       to travel there. For this reason, I have chosen to remain in       the United States to protect my life.\n\nGod bless America.                                __________\n\nMy name is Rebecca Zama, and I serve as Legal Services       Coordinator and Immigration Policy Analyst with SOIA. As a…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…point.\n\nOr that tax cut can be designed so it goes to folks who have really  been riding the wave of the financialization of the economy, folks who  have become billionaires--God bless them--multinational corporations  that have extremely strong balance sheets and really strong profits,  companies that already saw a tax cut in the last tax bill that has…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…strengthening Social Security, not cutting and gutting it.\n\nMr. Speaker, I end with Social Security is a sacred trust from one  generation to the next, and we intend to keep it.\n\nGod bless every senior in this country and those who will access that  important age of 65-66 very soon.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…sacrifice will never be in vain.\n\nOn behalf of all of Long Island, we will never forget those who laid  down their lives in service to others. As we mark Police Week, may God  bless the officers who gave up their lives to keep Americans safe and  may He give their loved ones comfort.\n\nMr. Speaker, I thank, honor, and stand with all of our officers,  past,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…condone now. I condemned what  happened then. My mind has not changed. The people who will suffer will  still suffer.\n\nMr. Speaker, why would I now decide that I am going to bless, if you  will, condone, a CR that continues what happened, when my Republican  colleagues did what they thought was right, I assumed, and passed the  legislation without the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…wanted to make sure there was enough pomp and circumstance.  Then we were informed about a nonexistent Pelosi precedent.\n\nAt one point, the Speaker went on television and said, ``Bless her  heart. She's a Representative-elect. She doesn't know how things work  around here.''\n\nBless his heart, because here is how it should work. Let's call it  the Adelita…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696709/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…treated him. Chevy Chase falling over Gerald  Ford would probably put him in bad positions, too. Comedy is comedy.  Free speech is free speech, and we shouldn't step on it.\n\nGod bless the First Amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…faces--those nice pictures of such nice people--out of my mind.\n\nOn the other hand, I am glad to hear Senator Hoffman and his wife are  making progress toward recovery. May God bless them all and their loved  ones.", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692586/minnesota-lawmakers-shootings"}, {"senator": "James Risch", "party": "Republican", "sentence": "…being killed, that has drastically--drastically-- lowered the number of boats that are coming to the United States loaded  with drugs.\n\nThis is the most effective way to do it. Bless you, Mr. President,  for doing it. Keep it up. Continue to put these drugs on the bottom of  the ocean.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…deeply missed in this Congress and  beyond. My team and I continue to pray for Doug, his family, and for  all who loved him during this particularly difficult time.\n\nMay God bless Doug LaMalfa's memory and may he rest in peace.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698733/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Funeral services will take place on Saturday in Malvern,  Pennsylvania. Our thoughts are with his wife of 33 years, Nancy, his  four children, and all of his family.\n\nMay God bless Congressman Dick Schulze.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…dies.\n\nI am for these agencies actually serving the taxpayers, not being  engaged in things like that. We respect the police and want it done  right. At the local level, God bless them. I have not been for  defunding them. We are for honoring local police, like this good  sheriff, this Member of Congress, and what they do day in and day out.  That is…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going on and start to legalize them, but there are  too many damn lobbyists walking up and down our hallways here trying to  stop us.\n\nLook, here is an article from 2 days ago. Bless the State of Utah. If  you are like me--I have hypertension. Can you imagine that? I have had  it since I was a teenager. I take a calcium inhibitor. It lowers my  blood pressure.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the bottom line is that you cannot put a price on the  value of life. As a matter of fact, no one should determine a person's  quality of life, as far as I am concerned.\n\nGod bless Charlotte for advocating on behalf of this bill and, of  course, my good friends Mrs. Cammack and Mrs. Dingell. We have to get  this done. Time is of the essence.\n\nMr. Speaker,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker, in the coming days, I will be introducing legislation to  ensure our guardsmen are better protected and supported, both during  deployments like this and beyond.\n\nGod bless our military. South Carolina stands with you, and so do I.                  Suicide is at Crisis Levels in the Country\n\nMrs. BIGGS of South Carolina. Mr. Speaker, suicide is…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…time for choosing whether he wants peace or chaos, prosperity or  poverty, isolation from the rest of the Arab world or integration to  make the Middle East great again.\n\nGod bless the 509th and 131st Bomb Wings. God bless our airmen and  women at Whiteman Air Force Base, and God bless Donald J. Trump, our  President.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…president of Belarus, Sviatlana  Tsikhanouskaya, has been warmly welcomed at the Munich Security  Conference, supporting freedom for the people of Belarus.\n\nIn conclusion, God bless our troops as the global war on terrorism  continues. Open borders for dictators put all Americans at risk of more  9/11 attacks imminent as warned by the FBI. Trump is reinstituting…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I would note just an observation: One of our  colleagues on the other side of the aisle who is a cancer survivor--and  God bless him for it--was raising issues about government funding and  about what funding should or shouldn't exist and what this  administration may or may not be doing to make sure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…his passing.\n\nI will very much miss my friend and my colleague. My thoughts and  prayers are with his wife, Jill; the entire LaMalfa family; his  friends; and his staff.\n\nGod bless you, Doug.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…workhorse; not a show horse. I am ready to get  to work with my colleagues and this country together to get this  country out of the ditch and return it to greatness.\n\nMay God bless America.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689466/restoring-trust-in-our-nations-government"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…entire LaMalfa family during this time of  unimaginable grief.\n\nMr. Speaker, from Mr. Potato Head to that rice farmer from  California, here is my final: Way to go, Idaho. God bless.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698717/9999"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…most of all, their  commitment to excellence and service to the people of west Texas. I  congratulate them on 50 years of incomparable service, and here is to  50 more.\n\nGod bless America, and go west Texas.               Congratulating Coahoma High School Bulldogettes\n\nMr. ARRINGTON. Mr. Speaker, I rise today to recognize an  extraordinary group of…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…as they work to rebuild their nation.\n\nI join the Greater Lehigh Valley Syrian community in praying for the  victims of this attack and for peace to return to Syria. May God bless  all of those who stand up in the face of terror and violence.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693108/facing-down-perpetrators-of-destruction"}]