[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the way, what these Republican Senators are saying was such an  egregious abuse is something that every American is subject to, every  single one of the 340 million Americans blessed to call this country  our home have to go through, except these Senators because they think  it is outrageous.\n\nBy the way, if you took this to its logical conclusion, a Senator…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…shepherd separates the sheep from the goats. He will put the sheep  on his right and the goats on his left.\n\nThen the king will say to those on his right: Come you, who are  blessed by my Father; take your inheritance, the kingdom prepared for  you since the creation of the world.\n\nFor I was hungry and you gave me something to eat. I was thirsty and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Jesus said that when He came into His glory  in Heaven and all the nations of the Earth would come and be divided  and He would turn to the righteous and say: Come, you who are blessed  by my Father; take your inheritance, the kingdom prepared for you since  the creation of the world. For I was hungry and you gave me something  to eat, I was thirsty and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…proven the doctors wrong. She  continues to lead.\n\nCristina just celebrated her 94th birthday in the United States, and  her story is a story of the American Dream. We are blessed to have her  as part of our community.\n\nMr. Speaker, I thank Cristina for the way in which she inspires us.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…live in the United States of  America, a nation that is rich; it is abundant. A nation that is rich  in agricultural tradition can be abundant in harvest.\n\nNow, in a nation blessed with such abundance, allowing our fellow  Americans to go hungry is, sadly, right now, a policy decision--I would  argue a political decision, not a financial necessity.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…prevent violence on the basis of  religion, to ensure the humane treatment of all, and to join hands  across the world in seeking peace and justice.\n\nIn Oakland County, we are blessed with a thriving Orthodox Christian  community. As their Representative in Congress, I am thrilled His All- Holiness joined us in Washington, D.C., last week. His visit reminds…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…right. I stand before you here  today as the proud grandson of men who set the stage.\n\nMost Black people in this country don't come from privilege. I  consider myself to be blessed. I think here in Congress, a lot of the  time, we see a lot of people born on third base thinking they hit a  triple. That is the unfortunate reality of where we find ourselves--…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…strength.\n\nI will end with this: With the passing of the Holy Father and holding  on to a promise of my faith, he reminded us over and over again of the  Gospel of Matthew: Blessed are the peacemakers, for they shall be  called the children of God.\n\nI plead for this administration to help bring us peace, no  appeasement, peace through the sovereignty…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Chief  since the very first days of this Republic.\n\nBut even in that instance, it was foreseen that Congress would come  in and have a debate and agree or not with whether they blessed the  mission or not. Letting a single individual take us to war based on a  secret list that he won't even reveal to the public and to Congress  sets such a dangerous precedent.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…conditions, and those rebuilding their lives after       incarceration desperately need to recover and thrive.\n\nLet me tell you something about that that really strikes me. I was  blessed to go to colleges, and there, people would use drugs. Now I  live in a community where the consequences for drug use often mean jail  time. In fact, if you look at low-income…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…traditions. As the  global climate crisis deepens, he has reminded us that creation itself  is a sacred trust, urging us to honor and protect the natural world  with which God has blessed us. For this leadership, he is being awarded  the prestigious Templeton Prize during his visit.\n\nPatriarch Bartholomew's spiritual guidance has inspired Orthodox  Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695736/recognizing-the-visit-of-ecumenical-patriarch-bartholomew"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…souls who were  lost fleeing repression on boats. We have no choice but to honor those  precious souls who were lost by giving the most we can to this life  that we have been blessed with.\n\nI share my own story with hundreds of thousands of Vietnamese  Americans born to parents who fled our homeland with nothing. Boat  people did not let the hardship of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…getting cut. . . I'm looking forward to       all of it. Sometimes it feels surreal just thinking about it.       This is such a once-in-a-lifetime opportunity. I feel so       blessed that I get to go and do this.'' Abby's been part of       Zoom meetings with the team to talk through ideas for the       trip and has put together a scrapbook of her journey…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Patriarch.'' The Templeton Prize recognizes his  decades of work urging the world to see care for creation not just as  policy, but as a sacred duty.\n\nIn Riverside, we are blessed with a vibrant Orthodox Christian  community. Parishes such as Saint Andrew Orthodox Church remind us of  the enduring presence of Eastern Orthodox faith in Southern California.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695408/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Congresswoman that will be joining in  the discussion, that it just reflects the tremendous amount of talent  and passion to make a difference in this freshman class. We are so  blessed to have them in the Caucus. It is so important to witness the  efforts that the two congresswomen hosting us have made in regard to  accessibility and affordability. It is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698667/protecting-healthcare-for-millions-of-americans"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "Mr. MURPHY. Mr. Speaker, I rise today in support of my legislation,  H.R. 1491, the Disaster Related Extension of Deadlines Act.\n\nI am blessed to live in eastern North Carolina, which is all too  familiar with the devastation caused by natural disasters. For coastal  Carolina, it is not a question of if but rather…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…today to recognize a  tremendous honor for the heart of Texas' 26th Congressional District,  Flower Mound, Texas, named the best place to live in America. My family  and I are blessed to call it home.\n\nThe distinction didn't come from luck. It came from leadership,  vision, and a community where hometown charm meets national excellence.\n\nIn Flower Mound,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…donated over $10,000 to the media center to refresh its library with  new books. These are just a few of the examples of the programs and  initiatives that Emily leads. We are so blessed that if we voice a  need, Emily responds quickly to fill it. In addition to being so  hardworking, Emily is just a pleasure to work with. She always has a  smile on her face…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…commitment to remain ``One nation under  God, indivisible, with liberty and justice for all.''\n\nI extend my warmest welcome to His All-Holiness and pray that his  visit will be blessed with success, fellowship, and hope for the future  of our common humanity.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…every day  in the district that I represent, as I know many of my colleagues do.\n\nMy grandfather was the chief of police of a small west Texas town  called Sweetwater. I was blessed to work in the United States  Attorney's office and the Office of the Attorney General of the State  of Texas, working every day with law enforcement. What they do matters…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…and Islam. Moreover, he leads a congregation of 300  million church members worldwide and is the longest-serving Patriarch  in the two-millennia history of the Church. We are blessed to have him  here in Washington, D.C. this week.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695624/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…only as a moment of remembrance but also a  tribute to the strength, resilience, and sacrifice of these courageous  individuals.\n\nAs an Army dad, I consider myself profoundly blessed that my son  returned home. I recognize that not all families share that same  blessing. That truth weighs heavily on my heart and should remind us  all of the price that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689652/recognizing-gold-star-spouses-day"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…these estimates of  electricity demand are five times higher than earlier forecasts.\n\nThe United States should be the world leader in energy and mineral  production. We are blessed with abundant resources. We have the  brightest minds, and we maintain the most rigorous and clean production  standards in the world. Yet, the anti-American energy policies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Jordana and Tino,  continue to grieve this unimaginable loss, we keep them in our thoughts  and prayers. Gia's memory will forever shine brightly in the hearts of  all who were blessed to know her.\n\nMay Gia rest in peace and may we all strive to live each day in the  spirit of kindness that she exemplified.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689204/gia-deborah-gentile-leaves-behind-a-legacy-of-kindness"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…before I rest.      Life is short so like Darin always give your best.      Rise . . . rise up to heaven Darin with tears in yours eyes,             for our world you have blessed.       In loving memory of Darin Coward.      by Albert ``Bert'' Carey Caswell", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…which enacted the Biden  administration's dangerous mining ban in northern Minnesota.\n\nThe district I am proud to represent, Minnesota's Eighth  Congressional District, is blessed with an abundance of mineral wealth.  On the Iron Range in northern Minnesota, we have been responsibly  mining for 145 years. We mined the iron ore that won us two world…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…week, where we were  trying to explain some of the things we see going on in the math. I  want to walk through a concept.\n\nWe actually, right now, as a country, are remarkably blessed. The GDP  growth, the economic growth, is actually well beyond almost any of what  even my economists were predicting over the last year.\n\nWe are seeing some data right now--if…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…president of the Florida Baptist Convention Pastors' Conference and  president of the Florida Baptist State Convention.\n\nJohn is married to Dawn, and together they have been blessed with 5  children, 3 sons-in-law, a daughter-in-law, and 10 grandkids.\n\nI deeply value his faith leadership in my life, my family's life, and  our community. I am grateful…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691358/welcoming-dr-john-cross"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Personnel  Administrators and the Public Sector Human Resources Association. She  also served in leadership roles for the IPMA-HR Southern Region  organization.\n\nBersheba is blessed with two daughters, Ashley Burton and Alayna  Pernell, and two grandchildren. On December 10, 2025, an event will be  held to celebrate her retirement at the Anniston City…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697364/recognizing-the-retirement-of-bersheba-austin"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…aren't mathematically true. We hear  something, and we repeat it. The customs duties, tariffs, are helpful.  It is not as much money as so many people think.\n\nMr. Speaker, I am blessed to chair the Joint Economic Committee. I am  number four on Ways and Means. I chair the Oversight Committee. I am  the guy running a bunch of committees and am responsible…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}]