[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…single New Mexican. That is how you should be transforming education,  that is how you deliver for communities, and that is how you care for  the children that we have been blessed to take care of in our role and  prepare the next generation of leaders.\n\nI will say this to Mr. Trump: While he and his colleagues may not  believe in the power of public…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698935/protecting-education-for-children-with-disabilities"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…right. I stand before you here  today as the proud grandson of men who set the stage.\n\nMost Black people in this country don't come from privilege. I  consider myself to be blessed. I think here in Congress, a lot of the  time, we see a lot of people born on third base thinking they hit a  triple. That is the unfortunate reality of where we find ourselves--…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…live in the United States of  America, a nation that is rich; it is abundant. A nation that is rich  in agricultural tradition can be abundant in harvest.\n\nNow, in a nation blessed with such abundance, allowing our fellow  Americans to go hungry is, sadly, right now, a policy decision--I would  argue a political decision, not a financial necessity.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…getting cut. . . I'm looking forward to       all of it. Sometimes it feels surreal just thinking about it.       This is such a once-in-a-lifetime opportunity. I feel so       blessed that I get to go and do this.'' Abby's been part of       Zoom meetings with the team to talk through ideas for the       trip and has put together a scrapbook of her journey…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…pronouncements laced with exaggeration and puffery, but it is entirely  right and proper to say that the expiration of the New START treaty  will make the world and every inhabitant blessed to live on it less  safe.\n\nFormally, the New Strategic Arms Reduction Treaty, otherwise known as  New START, caps U.S. and Russian strategic nuclear arsenals and  underpins…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…proven the doctors wrong. She  continues to lead.\n\nCristina just celebrated her 94th birthday in the United States, and  her story is a story of the American Dream. We are blessed to have her  as part of our community.\n\nMr. Speaker, I thank Cristina for the way in which she inspires us.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Even though this class' end is near,      We are grateful for our fall term here      Throughout votes, runs and UC requests,      Chaplain Doctor Black makes sure we're blessed\n\nMr. BOOKER. Mr. President, you will enter all the page poems because  they are so good. So for the rest of time, it will be noted in the  Congressional Record, in the Record…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…strength.\n\nI will end with this: With the passing of the Holy Father and holding  on to a promise of my faith, he reminded us over and over again of the  Gospel of Matthew: Blessed are the peacemakers, for they shall be  called the children of God.\n\nI plead for this administration to help bring us peace, no  appeasement, peace through the sovereignty…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…leadership, as well as the chairman's  leadership, and as well as the ranking member who has been very  supportive.\n\nMillions of seniors across the country, including my own mother-- blessed memory--have been the victims of financial scams, and far too  many have been cheated out of their retirement savings. It is  appalling. It is offensive, and it is unacceptable.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…pay the cost.\n\nMr. Speaker, as we enter the holiday season, as a preacher's kid, I  have been thinking a lot about Matthew 25:31-40, where Jesus said:  ``Come, you who are blessed by my Father.'' He said when He enters into  his kingdom, all the nations will come, and He will say: `` `Come, you  who are blessed by my Father; take your inheritance, the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, on this consequential day, when this body is  likely to make law and debate critical things, it has already been a  good and blessed day because our day was opened with a prayer by  Reverend Dr. Lindsay Curtis.\n\nDr. Curtis is well into his second decade leading as senior pastor at  Grace Baptist Church,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693739/welcoming-reverend-dr-lindsay-curtis"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…until I was by that plane, and I went: Oh, that is  what a riveter is.\n\nThey were also welders, and they proved to themselves and the world  that Americans can do it.\n\nI am blessed to have many Rosies in my life. I have gone to many  birthday parties for 100-, 102-, and 103-year-olds because we are  blessed to have a number of the original Rosies living…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Jesus said that when He came into His glory  in Heaven and all the nations of the Earth would come and be divided  and He would turn to the righteous and say: Come, you who are blessed  by my Father; take your inheritance, the kingdom prepared for you since  the creation of the world. For I was hungry and you gave me something  to eat, I was thirsty and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…prevent violence on the basis of  religion, to ensure the humane treatment of all, and to join hands  across the world in seeking peace and justice.\n\nIn Oakland County, we are blessed with a thriving Orthodox Christian  community. As their Representative in Congress, I am thrilled His All- Holiness joined us in Washington, D.C., last week. His visit reminds…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…New York.\n\nToday, the group performs throughout our city, providing  opportunities for local professionals to share their talents on the  stage and behind the scenes. We are blessed to have a vibrant and ever- growing artistic community in Rochester. The Rochester Community  Players have been at the helm for an entire century, a remarkable  accomplishment.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689016/congratulating-rochester-community-players"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…in our backyard, it is much better in our  backyard because we have better labor standards, better environmental  standards, and better health and safety standards.\n\nGod has blessed our country with these deposits of minerals really  from sea to shining sea. We just need to be getting them out of the  ground here, creating American jobs while doing that,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…before I rest.      Life is short so like Darin always give your best.      Rise . . . rise up to heaven Darin with tears in yours eyes,             for our world you have blessed.       In loving memory of Darin Coward.      by Albert ``Bert'' Carey Caswell", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…every day  in the district that I represent, as I know many of my colleagues do.\n\nMy grandfather was the chief of police of a small west Texas town  called Sweetwater. I was blessed to work in the United States  Attorney's office and the Office of the Attorney General of the State  of Texas, working every day with law enforcement. What they do matters…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…today to recognize a  tremendous honor for the heart of Texas' 26th Congressional District,  Flower Mound, Texas, named the best place to live in America. My family  and I are blessed to call it home.\n\nThe distinction didn't come from luck. It came from leadership,  vision, and a community where hometown charm meets national excellence.\n\nIn Flower Mound,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…open range  and never tired of participating in the cowgirl life from baking bread  to moving cattle. Juli was particularly fond of the natural beauty and  wildlife we are blessed with in Wyoming.\n\nHer fondness for the West led Juli to work towards preserving the  history and legacy of Wyoming, and Juli and her husband, Hort, were  long-time supporters…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687885/recognizing-the-legacy-of-juli-spitzer"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…and Santa  Fe is still standing. May we never forget the lives we lost, and may we  always honor them by standing for life, for truth, and for the  communities that we are blessed to represent.\n\nGod bless Santa Fe. God bless Texas, and may God continue to bless  these United States of America.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691383/anniversary-of-santa-fe-shooting"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the vision? Where is the innovation? Where is the optimism?\n\nLook, I am 63. My wife is 63. I have a 3-year-old and a 9-year-old.  The 9-year-old is remarkably loud.\n\nWe are blessed. We were able to adopt. It is the most greatest joy in  life.\n\nMathematically, my children will be part of the first generation that  is going to be poorer than their parents.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…commitment to remain ``One nation under  God, indivisible, with liberty and justice for all.''\n\nI extend my warmest welcome to His All-Holiness and pray that his  visit will be blessed with success, fellowship, and hope for the future  of our common humanity.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…president of the Florida Baptist Convention Pastors' Conference and  president of the Florida Baptist State Convention.\n\nJohn is married to Dawn, and together they have been blessed with 5  children, 3 sons-in-law, a daughter-in-law, and 10 grandkids.\n\nI deeply value his faith leadership in my life, my family's life, and  our community. I am grateful…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691358/welcoming-dr-john-cross"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…reminder to remember and memorialize law  enforcement officers who have fallen in the line of duty.\n\nDuring this week, I am reminded of a quote from Matthew chapter 5,  verse 9: ``Blessed are the peacekeepers, for they shall be called the  children of God.''\n\nOur law enforcement officers put themselves in harm's way every day  in the pursuit of justice and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691307/thanking-police-officers-for-all-they-do"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…donated over $10,000 to the media center to refresh its library with  new books. These are just a few of the examples of the programs and  initiatives that Emily leads. We are so blessed that if we voice a  need, Emily responds quickly to fill it. In addition to being so  hardworking, Emily is just a pleasure to work with. She always has a  smile on her face…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Florida's 3rd Congressional District, I  extend my deepest gratitude and warmest congratulations to Captain  Floyd Blair on his 105th birthday. May his life continue to be blessed  with health, joy, and the enduring appreciation of a grateful Nation.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697045/recognizing-captain-floyd-blair"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Lineville High School  in 1977 and married Andy Dale Graben on April 8, 1979. Beverly obtained  a cosmetology degree from Ayers State Technical College. She and Andy  have been blessed with two sons: Adam (married to Jayme) and Kevin  (married to Kimberly). They have five grandchildren who are the light  of Beverly's life: Seth, Ella Jaymes, William, Charlotte…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688459/recognizing-the-retirement-of-beverly-denise-buckhannan-graben"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…decides to keep on the balance sheets, we  are going to hit a trillion dollars. This was supposed to be a year  where we would start seeing the debt starting to go down.\n\nI blessed. I chair the Joint Economic Committee, I am number four on  Ways and Means, and I chair the Oversight there. My job is to get the  math right.\n\nWe always said we thought this…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Every day of this last year, the President and House Republicans have  worked to ensure that you keep more of your own money and remove the  red tape so you can thrive. We are blessed to live in the greatest  country in the history of mankind every single day. America's brightest  days are ahead of us, and I am grateful to have a Commander in Chief  who…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}]