[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…this under control. Yet we see time and time again this  body vote, under Republican leadership, for another ocean of red ink,  another massive deficit, adding to an already bloated debt that so  profoundly compromises the ability of our Nation to address issues in  the next generation.\n\nWe are borrowing from the next generation, making it less likely…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…be won and must never  be fought. That principle has been the bedrock of global security for  nearly 40 years. It led us and Russia to eliminate nuclear testing, to  shrink bloated stockpiles, and to prioritize communication over  conflict.\n\nYet today we are close to forgetting that profound blessing. Instead  of prioritizing deescalation, we see a resurgence…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…We need to start with the Pentagon and  modernizing the Pentagon. This is what Elon Musk actually signed up to  do with SpaceX and initially with DOGE. He wanted to cut the bloated  defense contractors and the waste out of the Pentagon. We need not  cost-plus accounting. We need new competition.\n\nSecondly, we need to go after negotiating with Big Pharma.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692232/addressing-our-exploding-deficit"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…healthcare, a bill that cuts school lunches and food  assistance to children who go to bed hungry every night, a bill that  includes billions of dollars for ICE, an already bloated agency that  has been upending due process and racially profiling people in my  district for weeks.\n\nMr. Speaker, I say to my colleagues across the aisle, have you no  decency?…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693180/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…trillion.\n\nThe bill recklessly adds $3.4 trillion to the U.S. debt, and interest  rates will climb.\n\nCongress can create a much brighter future for America by defeating  this big, bloated bonanza bill for billionaires.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693166/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…that everyday Americans may unknowingly violate multiple  Federal crimes without ever being made aware of it. Yet, we cannot  meaningfully address the consequences of this bloated system until we  fully understand the scope of the problem.\n\nOver the last few decades, the number of Federal criminal offenses  has dramatically increased to more than 5,000,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Speaker, I rise in strong opposition to H.R.  3486. Let's be clear. This bill is not about border security. It is  about pouring gasoline on a prison system that is already bloated,  broken, and unjust.\n\nWhile American families are begging us to release the Epstein files,  to lower grocery prices, to keep doctors' offices open, to confront  mass shootings,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695363/stop-illegal-entry-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…objection.\n\nThis is another of many attempts that have been made to stop the  efforts of President Trump and his Cabinet and the rest of the  administration in downsizing our bloated bureaucracy and trying to  bring a little bit of control to the amazing growth of our Federal  Government without causing the damage that is always alleged that is  being…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Defense Authorization Act for Fiscal Year 2026 continues to press  needed reform to make our military more lethal and ready.\n\nAccelerating the acquisition cycle, slaying a bloated military  construction process, delivering environmental stewardship to  communities impacted by PFAS, and providing quality housing for our  servicemembers, this bill is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697789/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…BIGGS of Arizona. Mr. Speaker, I thank the gentleman from Texas  for yielding.\n\nMr. Speaker, the Federal Government has turned the criminal code into  a labyrinth, a maze so bloated and disorganized that not even the DOJ  can tell you how many Federal crimes exist.\n\nThat is why I rise in strong support of H.R. 2159, the Count the  Crimes to Cut Act, led…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…will be a new,  affordable insurance option that is paired with these accounts that  emphasize transparency, competition, and catastrophic protection,  rather than all the bloated mandates.\n\nThese plans eliminate unnecessary requirements that have been proven  to fail and drive up costs in ObamaCare. It will cap excessive provider  pricing, expand access…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…State as to a discrete issue--it might be important or  interesting to literally no one else in any other State or in other  parts of the same State--we are told that these bloated bills that  sometimes get combined, which are multiple pieces of legislation,  sometimes amounting to thousands of pages at a time, can become a  necessary evil to accommodate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Representatives.'' They are watching to see  if their Representatives have the courage to actually fight for them or  will their Representatives defend waste, fraud, and abuse of the  bloated Federal Government.\n\nI can say with certainty that House Republicans will always put the  American people first, and I hope the other side of the aisle might  have the courage…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…the  Federal Government, and that is not an appropriate use of taxpayer  dollars of American citizens.\n\nTaxpayer dollars should not be used to fund woke projects overseas or  bloated government programs at home. They should be funding efforts  that protect our border, defend our Nation, and serve the American  people.\n\nHouse Republicans promised to root…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the government running,  protects America, and respects the taxpayer. This package contains two  bills with real cuts, real security, and real governing, Mr. Chairman,  not bloated omnibuses, not last-minute shutdown threats or games, but  Members on both sides of the aisle who are actually doing the work line  by line and in the open.\n\nThis package…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699059/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…nibbling around the edges begging for crumbs. Please,  oh, please, please give me $150 billion a year in savings on a $7  trillion annual budget, up almost twice in a decade, bloated and  expanded under COVID, bloated and expanded under both Democrat and  Republican regimes.\n\nWe have had an extraordinary first 100 days. The President has turned  this ship…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…healthcare system. It created numerous problems over the last decade.  Since its inception, these premium costs have skyrocketed. Networks  have shrunk, and the system has become bloated and inefficient.\n\nIt is important to remember that the enhanced premium tax credit  expiration at the end of the year, again, was set by Democrats. When  they are complaining…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…of President Donald J.  Trump.\n\nLet's be clear about what is at stake. In November 2024, the American  people gave President Trump a mandate to secure our borders, shrink a  bloated Federal bureaucracy, and put America first. He has acted  swiftly, with over 100 executive orders in just 3 months, to deliver on  those promises that he made to the American…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689710/no-rogue-rulings-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…up had  consequences, Mr. Speaker.\n\nIt had consequences not only in terms of our national debt, but it  affected the pocketbooks of families all across America because that  bloated spending in Washington, which is money we don't have, by the  way; and it increased inflation to the point where people couldn't even  go to the grocery store to fill up their…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…It protects their  telework perk. It also shields them from accountability and gives them  effective veto power over a duly elected President with a mandate to  clean up a bloated Federal bureaucracy.\n\nSpecifically, this legislation would nullify President Trump's  executive order titled ``Exclusions From Federal Labor-Management  Relations Programs.''…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…because  we have messed up their livelihoods so much, Congress has, with a  failed system. Crop insurance is important. All the things we do are  important, but we include a bloated food stamp program, which is  exploding off the charts in the farm bill every 5 years, and they  expect me to vote to continue a food stamp program, which is often  going…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…decisive rejection, Trump  derangement syndrome remains completely untreated.\n\nInstead of course correcting, Democrats continue to defend wasteful  programs, failed policies, bloated bureaucracy, while reflexively  opposing every effort that President Trump and House Republicans are  making to clean up the mess that they created.\n\nHere we are again today…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}]