[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…justification  this administration has provided to Congress and the American people is  a joke.\n\nIf this were about drugs, why seize an oil tanker and threaten an  illegal Navy blockade? If this were about drugs, why would the  President pardon a drug-trafficking former President of Honduras?\n\nThis is not about drugs. This is about regime change and control…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Ms. JAYAPAL. Mr. Speaker, I rise in strong support of this measure to  rein in President Trump's unlawful boat strikes.\n\nThese strikes and Trump's naval blockade represent appalling  violations of international law and Congress' constitutional authority  to authorize the use of military force.\n\nDrug trafficking is a serious offense.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…servicemembers and their families deserve  nothing less.\n\nRight now, we have a massive military force in the region. We have  killed almost 100 people. We are beginning a blockade of a country with  which we are not at war and with which the American people do not want  us to go to war--not over regime change, as despicable as the Maduro  regime is.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…what we are asking for  is in their constituents' interests, even when what we are asking for  is something that their constituents want. Even then, we are up against  this blockade.\n\nSo I hope Republicans come to their senses. I hope the President  realizes what he is doing and that we can put an end to this shutdown  as quickly as possible. But let…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…operation.\n\nThe administration's actions, whether the largest military deployment  to the region since the Cuban Missile Crisis, the seizure of a  Venezuelan oil tanker, ordering a blockade of Venezuela, or the many  public statements issued by U.S. officials, including President Trump--\n\nMr. MEEKS. Let me just say, I see him putting up a picture.\n\nMr. MEEKS.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Constitution gives Congress the power  to declare war, making the President's acts flat out illegal. Trump's  warmongering with Venezuela, including the recent declaration of a  blockade on oil tankers from Venezuela is not about stopping drug  traffickers. The real goal is regime change and to grab Venezuelan oil  and gas reserves for the President's billionaire…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…More broadly, they were burned  during Trump's first term. When the Saudis and the Emiratis ganged up  on the Qataris and effectively implemented an economic and political  blockade on Qatar, the Trump administration, in the first term,  effectively took the side of the Emiratis and the Saudis. That was  devastating for the Qataris.\n\nSo first and foremost,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…notification--or asked for  authorization before Americans were sent to fight and to bleed in  Venezuela.\n\nSeven Americans were wounded in that military operation. There is a  functional blockade of Venezuelan oil. As others have pointed out here,  Mr. Speaker, an aircraft carrier strike group sits nearby, poised to  again send Americans into Venezuela should the President…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699367/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Operation Southern Spear, the boat strikes of  Venezuelan boats in international waters, is still being carried out by  the U.S. military. The U.S. military is engaged in a naval blockade of  Venezuela, transit out and transit in. Would we think that was an act  of war if Russia was blockading the United States and not allowing  commerce to come into or out…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republican House--chose for it to happen.                                  Venezuela\n\nMr. President, on Venezuela, yesterday, President Trump announced ``a  total and complete'' blockade of all sanctioned oil tankers entering  and leaving Venezuela--another dangerous escalation with no clear plan  whatsoever. Donald Trump has offered precisely zero explanations--…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…including most Republican amendments, and  over 60 percent of bipartisan amendments.\n\nIf you are a Democrat, forget it. I am not sure they even read what  we submit.\n\nThis blockade on amendments is leading to some shameful records. For  example, this Republican majority set a record for the fewest House  votes cast in the first session of a 2-year Congress…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…more have died under bombs and bullets at aid sites themselves.\n\nAt the time, I held up this picture of Jinan Iskafi. She died in her  parents' arms, the victim of a military blockade on infant formula.\n\nHere joining Jinan are children suffering from famine conditions that  exist right now, this month--Amer, Maryam, and Shamm.\n\nThere is an ongoing famine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…thousands of troops inside Venezuela,  but let's make it clear. This is just a different kind of military  force because the only way that we get the oil is through a military  blockade--that is absolutely an act of war--and the threat of another  invasion if the leader--whomever it turns out to be; today it is Delcy  Rodriguez, who knows who it will be tomorrow--doesn't…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…presented by the White House is to simply force the remnants of the  Maduro regime to grant the United States exclusive access to Venezuelan  oil or face the consequences of a blockade. That is it. That is the  plan.\n\nNot in the plan: positive change for the people of Venezuela. There  is no framework for elections or democratic transition, no serious  assessment…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…he  is willing to use force to make that happen.\n\nThe warning signs are in plain view. China is ramping up aerial  incursions, conducting illegal exercises that simulate a blockade  around Taiwan, threatening sanctions against Taiwanese industries, and  relentlessly targeting Taipei with economic and political intimidation.\n\nIf we are serious about countering…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…his fatigues. His  aggressive efforts might extend beyond that.\n\nWhat am I talking about?\n\nThe Chinese military just completed another massive military exercise  to not only blockade Taiwan but to stop any reinforcements from coming  into Taiwan. Then they conducted offensive military exercises off the  shores of our allies the Philippines and Australia.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…sent in--dozens and dozens--and pilots and planes were sent in. You  bombed a nation's capital. You had extraordinary rendition of the  nation's President, and now, we have a blockade involving hundreds of  ships and thousands of sailors, but that is not a war.\n\nIt is somewhat boggling to the mind that almost every Republican  Senator believed there was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…system of aid  distribution that prevents diversions by terrorists.\n\nMore aid was delivered into Gaza last month than in almost any other  month of the past year. There is no blockade. Food is getting in. Hamas  is stealing it, and what they steal, they either eat or they sell.\n\nThis resolution is incomplete, it is misleading, and unfortunately it  is partisan.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "John Thune", "party": "Republican", "sentence": "…would restore Senate precedent, and it would  restore sanity to a confirmation process that Democrats and Republicans  alike have complained is broken.\n\nDespite their historic blockade, I think a lot of my Democrat  colleagues are well aware that we can't continue as we are. So I say to  those colleagues, many of whom I know do care about this institution:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Medicaid, and against everything that  helps working families.\n\nHere in the Senate, for months, they delayed hundreds of routine and  bipartisan nominees. It was an unprecedented blockade.\n\nNow Democrats have set a new, shameful record. Today, they broke the  record for the longest government shutdown in American history. Let me  repeat that. Today, the Democrats…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}]