[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…leadership here kicking and screaming.\n\nI appreciate their sudden and stunning change of heart on this issue,  but I state for the record that the Republican leadership has tried to  block this day for months and months and months.\n\nI also want to state for the record that Donald Trump could release  these files on his own, today, right now, right this very second.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…is nothing more than a yellowing piece of  paper that he can rip up at will.\n\nThose are just some of the many, many reasons why, today, I am voting  yes on the resolution to block the administration from continuing to  illegally use military force within or against Venezuela.\n\nThis should not be a partisan issue. No matter if you are a factory  worker…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…public lands open and safe. Republicans are trying to sell off  our public lands for a quick buck.\n\nRepublicans are working to undo protections for national monuments,  trying to block updates to outdated resource management plans, and  pushing reckless development for extractive industries no matter the  public health or environmental consequences.\n\nRepublicans…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…the MaryLee Allen Promoting Safe and Stable Families  program that we know helps prevent child maltreatment and strengthen  families. It would eradicate the Social Services Block Grant that  provides substantial investment in childcare, child welfare, and adult  protective services. These egregious cuts alone will cost Illinois over  $72 million dollars…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…affordability  concerns. I had to say to one member of the administration just last  week: Do not continue to be a flunky of the President. Don't be a  flunky of the President. Don't block for the President if he is not  doing the right thing. Work for the American people. Don't be flunkies  for the President when you know he is wrong. Work for the American…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, last night, the Speaker's Rules Committee  voted to block my amendment that called for the full release of the  Epstein files while protecting the victims' identity.\n\nLet's just be clear. They voted to protect rich and powerful men…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693552/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…that we need to, to keep our country healthy.\n\nFor another woman, her son had congenital blindness, and NIH was  searching for a cure for that. That funding is on the chopping block,  as well, and also the people who are doing that research.\n\nAnother biomedical researcher in the district said it perfectly when  he said that the NIH, FDA, CDC, and NSF are…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…imagine being so ideologically  committed to destroying an imperfect healthcare bill that has helped  millions of Americans access care over the last 15 years that you would  block a vote--just a vote--to extend the lifesaving credits that help  keep millions of Americans on their healthcare.\n\nMadam Speaker, imagine that you would block members of your…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698337/call-a-vote-on-healthcare-now"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…and their cases  to be investigated. These are not statistics; these are real families  that we serve.\n\nDid Congress ever intend this?\n\nDid the administration ever intend to block away rights and  responsibilities of folks who are supposed to oversee the rightful  education of disabled children?\n\nThe American people will not accept this.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698945/protecting-education-for-children-with-disabilities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…on healthcare for Americans in  order, again, to give tax cuts to the wealthy.\n\nIf the enhanced Federal match for Medicaid is eliminated, one of the  things on the chopping block: States would be forced to absorb the  difference, an estimated $80 billion every year. That is a 29-percent  increase in State-funded Medicare spending per resident.\n\nTo fill…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…cannot permanently end Iran's nuclear programs without a  negotiated agreement, without inspectors on the ground, without Iran  agreeing to reverse course. We must permanently block every path to a  nuclear weapon that Iran might have.\n\nThe 12-day war over the skies of Iran and Israel has certainly  weakened Iran's program, but we don't know without a…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…simple change,  really. It says that the International Emergency Economic Powers Act,  or IEEPA, can no longer be used to place taxes on imports.\n\nIf the President needs to block some dangerous product, he still can.  But if there is a real threat, we would want to stop it, not just add a  tariff tax. That is what my bill does. It would stop these tariffs…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…over 25 don't have a bachelor's  degree. Many of those individuals have skills, training, and knowledge  to support our agencies and serve the American people. We shouldn't  block them from those opportunities.\n\nMr. Speaker, I encourage my colleagues to support H.R. 5235, I  reserve the balance of my time.\n\nMr. Speaker, I thank my colleagues and the…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700120/skills-based-federal-contracting-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…rich while  everyday Americans suffer through an affordability crisis that  Republicans don't appear interested in confronting.\n\nThey are sick and tired of watching Republicans block a tax credit  that will lower health insurance costs for millions of Americans after  passing a partisan budget that will throw millions more off of  Medicaid, only to turn…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…up.\n\nMr. Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.R. 2753, the Hands Off Medicaid and  SNAP Act of 2025, which would block the Republicans from cutting  Medicaid or SNAP benefits and kicking people off these lifesaving  programs as part of their reconciliation bill.\n\nLast month, House Republicans…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Washington, D.C. Metropolitan Police  Department officers were called to resolve a private matter at  Representative Cory Mills' residence, where officers were called to the  1300 block of Maryland Avenue, SW, around 1:15 p.m. for the report of  an assault;\n\nWhereas police reports obtained by NBC4 Washington confirmed that the  Washington, D.C. Metropolitan…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "Mrs. CAPITO. Mr. President, as chairman of the Environment and Public  Works Committee, I rise in support of my resolution to block the Biden  EPA's rule approving California's Clean Air Act waiver for its Advanced  Clean Cars II regulation.\n\nI want to explain to my colleagues why they should join me in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Activist groups exploit the ESA through relentless litigation and red  tape, imposing critical habitat designations that do precious little to  recover species but everything to block land use and weaken our  defenses. They are a direct assault on our national security.\n\nAfter more than 50 years since its enactment in 1973, the ESA's track  record is abysmal.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…streets.\n\nNow, even though these efforts have been very successful and are  widely supported by the American people, we have seen some powerful  institutions in our country try to block the will of the people and  what they wanted to see done. This includes some of our Nation's social  media companies. According to reports, Facebook is allowing a black  market…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…section 401 of the Clean  Water Act, designed to protect our water quality, has too often become  a roadblock for critical projects.\n\nToo many States are using this authority to block interstate natural  gas pipelines, transmission lines, and other federally approved  projects for reasons that have nothing whatsoever to do with water  quality. These projects…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…history. It will strengthen our border and support  law enforcement.\n\nI was disheartened and disappointed but not surprised, frankly, that  our Democratic colleagues voted to block the bill, preferring instead-- I assume, since they offered no viable alternative--to foist that large  tax increase on the American people, which would have amounted to a…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…very few  confirmations that the U.S. Senate does that are more important than  confirming the Chairman of the Joint Chiefs of Staff. And I guess the  Democrats are going to block it for now, and we will go all night to  make sure President Trump has his principal senior military adviser,  which he needs during these dangerous times.\n\nMr. SULLIVAN. Mr.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…all know, roads are  networks. For instance, there is a half-mile section in this ruling  under the Biden administration that blocks off access to over a million  acres. You block off a half-mile of road, and you restrict the use to a  million acres. I don't think that is what most people would call public  access or would agree that it is the way that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Kimberly married Robert  Brooks, she quickly recruited him to become a Camp Volunteer. Kimberly  and Robert use ``Lifelines'', an exercise using strings and dark  glasses, that block vision, to help children build self-confidence and  ``find their way''. When Kimberly's mom, Lynn Godding, moved to our  area, Kimberly quickly recruited her as a volunteer…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Mr. SCALISE. Mr. Speaker, I thank the Chair for yielding and for  helping get this process to the floor, despite so many attempts by the  Democrats to block this effort to cut waste, fraud, and abuse in  government spending. We have seen it over and over and over again.\n\nEvery time we have tried to get our economy back on track…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…generations, along with billions of dollars of  revenue for our schools, State and Federal governments, and, most  importantly, our Nation's mineral security.\n\nIt didn't only block our access to precious critical minerals, Mr.  Speaker, it also cut us off from one of the largest and most  concentrated deposits of helium, a gas that is necessary in everything…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Economic       Powers Act (50 U.S.C. 1701 et seq.) (except that the       requirements of section 202 of such Act (50 U.S.C. 1701)       shall not apply) to the extent necessary to block and       prohibit all transactions in all property and interests in       property of the person if such property and interests in       property are in the United States,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…that targeted offshore energy development and the other stopping  the implementation of the Biden tax on natural gas.\n\nLast week, the Senate passed another CRA resolution to block a Biden- era regulation on walk-in freezers and coolers. This rule, part of the  Biden administration's climate agenda, would have heaped additional  costs on small businesses…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…have lost their lives violently through narcotics,  through fentanyl, through drunk drivers, through murder, through rape,  and through intimidation.\n\nThey represent a large block of Americans suffering at the hands of  people who have been released on our streets purposely for crass  political purposes by my colleagues on the other side of the aisle.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…When asked about a short stopgap measure  that we are talking about now to keep government open so we can proceed  with additional appropriations bills, he said:\n\nI am going to block it.\n\nThat is what he said--block the normal process to regular order.\n\nAnd it is not just the Democrat-elected officials calling for a  shutdown. Liberal columnist Ezra Klein…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}]