[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Mr. President, for months, the Trump administration  claimed that its campaign of blowing up boats in the Caribbean was  about stopping drugs like deadly fentanyl coming to the United States-- never mind that fentanyl doesn't really come from Venezuela; it comes…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…GAO did was unprecedented in making this  decision that it is actually a waiver and not a rule. Yes, it is  unprecedented. It is unprecedented in the same way that a referee  blowing a whistle on an unprecedented foul is doing something  unprecedented. But it is not the fault of the referee that their  whistleblowing is unprecedented, it is the fault of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…markets and new  allies that are more reliable than the United States. America would get  better results on trade by buying spells from an Etsy witch.\n\nTrump's stated reason for blowing up commerce is fentanyl  trafficking. Now, I don't take a backseat to anybody when it comes to  cracking down on the scourge of fentanyl. Oregon is no stranger to the  devastating…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…could invariably lead to  mistakes, could also lead, inadvertently, to war with another country.\n\nThis resolution says: If you want to use force against  narcoterrorists by blowing up ships, come to Congress for an  authorization because at this point you don't have it. If there is an  imminent threat of attack, you have all of the authority you need…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the Federal Government to develop land  management plans that both allow for energy development and protect  subsistence hunting and fishing resources.\n\nThat is what they are blowing up with these CRAs, not to mention that  if these CRAs are signed into law, the validity of every single permit,  lease, and Federal approval that has been issued based on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…shameless campaign of  extortion against any major law firm that has taken a position against  Trump or Trump's interests. What he is doing is extraordinary, and it  is mind-blowing to me that it is just being ignored by my Republican  colleagues. He is going firm by firm--and not to every firm, just to  the firms that have represented Democrats or brought…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…majority said that Republicans  wouldn't vote for it if it would raise the debt and the debt ceiling,  and here they are.\n\nBravo to my friends. My Republican colleagues are blowing a hole  through the debt ceiling, and we will vote ``no.''", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689886/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…try to justify it.\n\nNow, just this week, we heard the White House Chief of Staff--the  White House Chief of Staff--admit on the record that Donald Trump  ``wants to keep on blowing boats up until Maduro cries uncle.''\n\nFolks, the fact of the matter is, Congress has not declared war, nor  has Congress authorized the use of military force in Latin America.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…history.\n\n``They got drunk, painted themselves like Indians and       pushed tea bags into the Boston Harbor, which we in Rhode       Island think is pretty weak tea compared to blowing up the       goddamn boat and shooting its captain,'' Whitehouse told The       Post. ``But you know, all those Massachusetts people went on       to become president and…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Speaker: Congress approved this funding just  2 months ago, and Donald Trump signed it into law. Now, Republicans  want to rip it back to cover up the massive hole they are blowing in  the deficit with tax giveaways for billionaires. Their so-called fiscal  responsibility comes at the expense of starving children, crumbling  democracies, and public-private…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…to me, to this institution, to  the working families of New York's 20th District, and to every American  who is still struggling just to get by.\n\nNevertheless, here we are, blowing a $3 trillion hole in our national  debt to serve billionaire oligarchs instead, billionaire oligarchs and  donors who will never have to wonder whether they can afford to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688070/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…have been mailed  out in many jurisdictions, and the first round of early voting begins  today in some jurisdictions.\n\nIt is pretty clear which way the political winds are blowing. The  American people are rightly frustrated by Donald Trump's failed  economic policies that are raising costs for working families, and the  American people are increasingly…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…healthy.\n\nPresident Trump and congressional Republicans are presenting us with  a false choice. We don't have to choose between keeping the status quo  on the one hand and blowing up our healthcare system on the other. We  don't have to buy the falsehood that, somehow, we have to close rural  hospitals and throw seniors out of our nursing homes to improve…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…the leg  and the numbness in the hand. That is your engine light telling you:  Pull over, get it checked. Pull over, get it checked. You are in  threat. You are in danger of blowing a gasket, except this gasket is  not a tube in your car. It is not a radiator. It is a vessel in your  head that causes a stroke. It is a vessel in your heart that causes…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…That is  something that I hope every single Senator is thinking about right now.\n\nThis is not a time to put your finger up in the air and figure out  which way the wind is blowing, to try to think through what type of  reaction might come from the White House if we speak out against this.\n\nThis is a time for us to stand up together and stand up for…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…communities together.\n\nDistrict lines cannot be influenced by partisan considerations or  drawn to favor or disfavor any incumbent or candidate.\n\nIn one fell swoop, Gavin Newsom is blowing up all of these  constitutional principles. His unprecedented mid-decade gerrymander  tears up the map created by our citizens commission, replacing it with  one drawn behind…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…watching  and following him. He is my committee chair and has an extremely strong  leadership in the conference.\n\nI express my appreciation and downplay the fact that he is just  blowing smoke there sometimes when he says it about me.\n\nI would like to get to some real substantive remarks now  with my colleague.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…level of spending that  is $2 trillion short of what comes in.\n\nAccording to the Congressional Budget Office, enacting a yearlong  CR--continuing resolution--will result in blowing through next year's  spending target by nearly $1 trillion.\n\nSo the target that was passed last spring was 6.3, but the spending  is actually going to be 7.2. How can you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…percent of U.S. electricity generation by 2050.\n\nPeople say that is great. Isn't that good? It is good if you don't  care if you can't turn the lights on because the wind is not blowing  and the sun is not shining. We are going to have rolling brownouts and  blackouts because that is what is going to happen, like in California.  Americans in the 21st century…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…where I am standing to where you are sitting. And I  said: What went wrong over 24 hours? And they told me the wind shifted  and was coming in from China. China's dirty air was blowing in because  China is producing dirty energy.\n\nAnd yet we would rather defer to them when we know we can produce it  cleaner. In my State of Wyoming, the Dry Fork energy plant…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of 51.9 million, almost 16  percent, a record high. This is the important part. We have social  welfare and social safety nets that are being used by noncitizens that  are blowing out the rolls and driving up the cost of all of these  goods.\n\nMy point here is that we have had massive amounts of immigration over  our history. All of us love the actual…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…two grids. One grid props up wind and solar with massive  transmission costs. The other is the backup power we all rely on when  the Sun is not shining and the wind is not blowing.\n\nThis measure puts reliability first. It follows the lead of major  grid operators who know the danger of relying too heavily on  intermittent sources, and it makes sure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…connect remote wind and solar  projects to population centers.\n\nThey also ignore the cost of backup generation needed to keep the  lights on at night or when the wind isn't blowing. The low-cost claims  don't account for these expenses, but, rest assured, utility customers  still pay for them.\n\nAnd last, but not least, eliminating these subsidies is…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…that  justifies this administration's actions. We have simply not been given  enough information about the Trump administration's assessments,  justification, and strategy for blowing up numerous boats off the coast  of Venezuela. Members of Congress must have this information, and that  is why I support this bill.\n\nTo be clear, we should have had this…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…enforcement, and for the first time, it makes it a Federal crime to  ``inhibit, stymie, hamper, or interfere with'' Federal law enforcement  operations. That means the people blowing whistles and erecting  roadblocks on streets in Minneapolis, not just the ones who physically  attack ICE and Border Patrol.\n\nSecond, it dismantles the corrupt NGOs that are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…about me and enrichment. The Democratic majority  leader, Senator Schumer, signed off on this. I want the world to know-- and the world is paying no attention because it is blowing up right  now--that this provision was coordinated between Senators Thune and  Schumer because a lot of people worried that if they can do it to  Republicans, maybe they can…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]