[{"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the importance of a strong public education  system for every student in our country. An educated citizenry helps  grow the middle class and drive economic success in red and blue States  alike.\n\nSupport for public schools should not be a partisan issue. There are  millions of kids who are attending public schools in every single State  in our country,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…officers like Michael Fanone, who wasn't  even on duty that day, but he heard about the riots at the Capitol, and  he came down to join the fight with his brothers and sisters in blue  and was nearly killed? He begged for his life to the mob, saying he had  four daughters of his own. He had a heart attack. Will we not honor  Michael Fanone?\n\nWill we honor…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…lethal force.\n\nIt is obvious what Trump is doing. He is targeting and punishing the  cities who dare to push back against his abuse of power. And while he  is currently targeting blue cities with his lies, if these deployments  are not stopped, there will be nothing to stop him--or any future  President--from doing this to anyone, anywhere, for any made-up…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in paying the  premiums, what families would be doing with these increased costs.\n\nDo you want to know one of reasons that the health insurance is so  expensive? I have asked Blue Cross Blue Shield in Chicago, and they  tell me it is pretty simple.\n\nDid you ever see an ad for a pharmaceutical product on television? I  will bet you did, and I bet you saw…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…there aren't, and I imagine you have  looked a lot in this room and what is in the room. One of the things  you have noticed is that in the panels--all around the room, the blue  panels--at the top of the panel is the seal of the United States. That  seal of the United States was designed and embraced by the United  States in 1782. The seal of the United…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…And its arrogant captain was heard to boast\n\nThat he'd soon have Rhode Island under his sway,\n\nWell, a course was set for a fateful day.\n\nNarragansett Bay sparkled bright and blue June 9 of 1772,\n\nThe trading ship Hannah was making her way\n\nWith cargo for Providence that fine day.\n\nKing George's Gaspee pursued in chase,\n\nBut the Hannah decided to give…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…energy and will  increase household energy costs by up to $415 a year.\n\nOn top of that, ending the tax credits will lead to thousands of job  losses nationwide, in red States and blue States. This comes as demand  for electricity is surging, driving up costs even more.\n\nEveryone in this body talks a good game about lowering costs; but  when the time came…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…flee the markets. That is Trumpflation.\n\nMeanwhile, fossil fuel companies make even bigger profits. Families  lose; billionaires win.\n\nYou know, this is not a red State or a blue State issue. Since August  2022, investments from the Inflation Reduction Act have created more  than 400,000 clean energy jobs with more than half of those jobs in red  States.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…of this.\n\nMr. Chair, 83 percent of people who are treated in the rural parts of  Colorado and across the Nation are on Medicaid. This will significantly  impact red States, blue States, and especially the rural places across  the United States.\n\nLike many people, my family has been impacted by the opioid epidemic.  When I was just 6 years old, my mom…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…a very short period of time, they want to pull the plug.\n\nNow, why would they do that? Why would they do that when, in fact,  most of those projects are in red States, not blue ones, not States  like California but States like Indiana and Kentucky.\n\nWhy would they do that? Because the obligation here is not to their  State or constituency. The obligation…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…former union member and the daughter of union members,  and I will always fight to protect union rights. What is true about  Kitsap, where I grew up, is that we are not red or blue, but we are a  union town. That is why I was proud to cosponsor this bill and a proud  signer of the discharge petition.\n\nMr. Speaker, today, I will be a proud ``yes'' vote…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697989/protect-americas-workforce-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…wealthy. That is his agenda.\n\nMy state knows how Donald Trump's tariff chaos is already hurting  real people, and we know how it is drying up markets for ``red, white,  and blue'' products. About one in five jobs in Oregon depends on trade,  and the trade jobs often pay better.\n\nSpeaking with small businesses and workers all over Oregon--I did it  just…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the economy so the corporate  PACs that are funding your campaigns make huge profits, jacking up  costs on folks who can't afford it, and now this.\n\nThis bill will kill good, blue-collar manufacturing jobs that we need  to rebuild the economy in this country, close rural hospitals, and  defund healthcare, all to give trillions of dollars in tax cuts to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…to the new ballroom, but I am not going to back down. I am going to  continue to stand up for small businesses across the country, across  Massachusetts, from red States to blue States, who are bearing the  burden of these tariffs, and I hope that our Republican colleagues will  join us today by voting to pass this resolution.\n\nAnd, again, I thank you,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…power; and his consolidating information on voting, I am very, very  worried about that.\n\nI want to encourage the secretaries of state in every State, whether  you are in a blue State or a red State, to hold onto your data, protect  it, back it up, double secure it, and tell the Feds to keep their hands  off.\n\nMr. MERKLEY. Yes, I will yield for a question.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…beyond that, agriculture is  science, technology, and innovation. Its cutting-edge advancements will  drive the future of food production and environmental stewardship.\n\nThe blue FFA jacket is more than just a uniform. It symbolizes hard  work, commitment, and leadership. The young men and women who wear it  today are tomorrow's farmers, veterinarians,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…fentanyl, meth, cocaine, and heroin have been  seized and, thankfully, are off our streets due to the hard work of law  enforcement's very courageous work. I am proud to back the blue. I am  also grateful for their work to maintain the peace.\n\nAs chairman of the Senate Judiciary Committee this year, I have  continued my work to support law enforcement in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…unwavering support.\n\nMr. Speaker, I encourage my colleagues to do the same and to honor  the life of Deputy Sheriff Brad Reckling. May we always appreciate the  men and women in blue.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691379/recognizing-the-life-and-service-of-deputy-sheriff-bradley-j-reckling"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…in recognizing the Moody girls' flag  football team, Coach Moore and the coaching staff, the faculty and fans  on this exciting win for the school. I congratulate them and Go Blue  Devils.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698051/recognizing-moody-high-school-for-winning-the-ahsaa-class-1-5a-state-championship-in-girls-flag-football"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…and I look forward to sending this  commonsense legislation to President Trump's desk to restore law and  order in our Nation's Capital and support our brave men and women in  blue. Public safety should not be a partisan issue. It is just plain  common sense.\n\nMr. Speaker, I urge all my colleagues to support H.R. 5107 so we can  codify the progress we…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…year, there was pretty much flat population growth.\n\nThen there is this. I'm trying to help folks understand the reality  of what your Federal Government is.\n\nDo you see the blue area? This is defense and nondefense. In a couple  of days, we are actually going to get an update, and my team actually  thinks that this number will go from 26 percent of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to  congratulate Ellie Sheehan, drum major of the Penn State Blue Band this  season.\n\nThis is a historic milestone because Ellie is the first woman to hold  the position in the Blue Band's 126-year history.\n\nEllie hails from Hollidaysburg,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696938/congratulating-ellie-sheehan"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…surged 124 percent higher than under President Trump. In 2021 alone, $7  billion was spent on emergency care for illegal immigrants. Meanwhile,  Democrats in Washington and blue States are demanding we actually pay  even more.\n\nTo put this into perspective, as the Congressman from North Carolina  (Mr. Knott) mentioned, I am from the State of Florida.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…President says, hotter  than ever.\n\nThroughout 2025, Republicans worked to undo the damage of the Biden- Harris administration, resulting in less red tape, bigger paychecks, a  blue-collar boom, and a stronger, more resilient workplace.\n\nThe United States will always be the land of opportunity, but the  previous administration shuttered small businesses,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the Trump agenda with respect  to renewing the Trump tax cuts, with respect to creating and passing  legislation to prohibit tax on tips and tax on overtime, and all the  new blue-collar, working-class tax cuts that President Trump campaigned  on and received a mandate to do.\n\nAfter the mandate, draining the swamp, and passing the America First  agenda,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…talk about energy costs. For a  second, by the way, I think it is really rich coming from them because  I think eight of the top ten States with the highest energy costs are  blue States that are run by Democrat State legislators and Democrat  governors. They want to talk about the rising cost of energy. It  disproportionately affects blue States. Why?…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…politician in a generation to even care enough to try.\n\nThe 77 million ``deplorables'' who cast their lot with Donald Trump  last November were the forgotten Americans--the blue-collar patriots,  the conservatives of the heart, miners, mechanics, tradesmen, and  farmers; men and women who worked with their hands, grew our food,  built our homes, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…with hostility and  policies from Washington that make their job harder and put their  safety at risk.\n\nLet me be clear. I unapologetically stand with the men and women in  blue. I will always oppose any effort to defund, demoralize, or  dismantle the law enforcement agencies that keep our streets safe.  These men and women put their lives on the line…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…means good jobs for welders,  machinists, and engineers. It means new orders coming into counties  like Anderson, Greenwood, Newberry, and Oconee, and many other  hardworking blue-color communities all across the Nation.\n\nImportantly, it means America's best equipment reaching our allies  faster than ever before.\n\nMr. Speaker, I urge my colleagues to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the Nation with a  total of 51 National Academy Foundation distinguished career academies  and 3 model career academies, and numerous schools have been designated  as National Blue Ribbon Schools of Excellence.\n\nFor the 41st consecutive year, the district was awarded the  certificate of excellence in financial reporting by the Association of  School Business…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}]