[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…a place where they can rely on  having a meal twice a day.\n\nYes, even six decades after Michael Harrington published the great  book, ``The Other America,'' which became a blueprint to fight poverty  and hunger in America and was published by Michael Harrington during  the Kennedy administration, hunger still exists in America.\n\nSchool is also a place…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694834/fy-2026-education-cuts"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…constituents. I came here to provide  direct relief to struggling Americans and lift people up. This  Republican budget does none of those things. It is nothing more than a  blueprint for cruelty. This GOP budget will destroy Medicaid and take  healthcare away from millions of Americans.\n\nIn my district alone, this could strip healthcare from the 215,000…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688033/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…runs  out of money in 2 weeks.\n\nRepublicans, who lead both Chambers and the White House, have yet to  produce an actual funding plan. Instead, House Republicans passed a  blueprint to slash up to $2.5 trillion from Medicaid.\n\nIn my State of Pennsylvania alone, that jeopardizes care for nearly 3  million people, including 100,000 people struggling with…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688326/funding-medicaid-is-not-negotiable"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…earlier this month, the Trump administration released its new  National Security Strategy.\n\nAnd some folks may wonder: What is the National Security Strategy  document?\n\nIt is a blueprint that provides strategic guidance for the  administration. It sets priorities and articulates a vision for  achieving them--or at least it should.\n\nTrump's strategy rejects…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…the Department of Defense to again resume nuclear testing in  a disastrous policy reversal. It is really not surprising because it is  in Project 2025, which is the policy blueprint of this disastrous  administration.\n\nJust look on page 399, and you will see that Project 2025 calls for  the rejection of the Comprehensive Nuclear-Test-Ban Treaty once…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Chicago.\n\nAnd while he failed in his attempt to use Chicago as ``training  grounds'' for military forces, the scale and tactics of Operation  Midway Blitz have given him a blueprint for similar operations  across the country, including in Minneapolis this week.\n\nSo I ask my Republican colleagues, Will you denounce this President's  use of troops in our…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the only anchor,  yet ever imagined by man, by which a government can be held to the  principles of its constitution.'' Indeed, the way a courtroom pursues  truth provides a blueprint for encouraging trustworthiness in our  public servants.\n\nAt the beginning of jury selection, potential jurors take a solemn  oath to truthfully answer questions posed by…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…fundamental, including the rights to reproductive  freedom, marriage equality, and even private consensual relationships.  That is not constitutional interpretation; it is a radical blueprint  for rolling back decades of progress on individual freedom and  equality.\n\nWhen I gave Mr. Tung an opportunity to explain his history of sexist  and anti-labor comments…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…have seen qualified airline pilots grounded for months, in some cases  even years, due to delays with FAA medical clearance reviews.\n\nWith the 2024 FAA reauthorization as a blueprint, the Mental Health  in Aviation Act will do several things.\n\nIt will direct the FAA to annually review and update its mental  health-related policies for pilots and air traffic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…7,500 title I schools in Texas, and so many more.  Every single State has title I schools. There are 49,000 title I  schools throughout our country.\n\nProject 2025, Trump's blueprint, will have the Secretary of Education  dismantle civil rights protections for students and weaponize the  Office of Civil Rights to advance Trump's hateful, far-right political…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…tangible, and it is urgent.\n\nLet me be clear: The last 100 days have not been an accident or a  fluke. He has done exactly what he said he was going to do. He gave us  the blueprint in Project 2025. Some tried to warn us of the dangers  and, well, here we are.\n\nLet's talk about education. Within weeks of taking office, the  Department of Education quietly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…they were forced to, but because  they chose to in order to protect their constituents, their residents,  and protect our planet.\n\nAnd the truth is, they do have a tremendous blueprint to follow.  California is now the fourth largest economy in the world and the  largest contributor to the Federal Treasury. California didn't get  there by sticking our head…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…for those who we  represent, but I am here to speak out against the flexibility for  workers not to be paid education act. Yes, I said that.\n\nThis disastrous bill would be a blueprint to commit wage theft on a  silver platter.\n\nI know what it is like to be cheated out of wages. That happened to  me, unfortunately, when I was a younger man. The rules that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…familiar with Project 2025's  proposals on higher education, it is abundantly clear that this  administration is following Project 2025 to a tee.\n\nProject 2025 lays out a blueprint for ending the Federal Government's  role in public education, starting with dismantling the Department of  Education, so that they can find the money they need to provide…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…agenda without making significant cuts to Medicare or       Medicaid, the official budget scorekeeper confirmed       Wednesday.\n\nHouse Republicans adopted a budget blueprint last week that       opens the door to pass Trump's policy priorities on       immigration, energy and taxes. It instructs the House Energy       and Commerce Committee to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…this city. Crime is down, homicides are down,  carjackings are down, and most importantly, people feel safer in their  Nation's Capital.\n\nPresident Trump has handed us the blueprint to restore safety in  America's cities. Families are safely going out to restaurants,  businesses are seeing life return to their neighborhoods, and tourists  feel secure,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695560/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…Act.\n\nThis year marks the 20th anniversary of State Wildlife Action Plans,  a major milestone for fish and wildlife conservation. Statewide action  plans serve as a vital blueprint for identifying the unique  conservation needs of each State and territory and are required for  States to take part in the State and Tribal Wildlife Grant program.\n\nThese…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…sure America's capital markets drive down costs,  lift up families, and keep us the number one place to do business in  the world. This is not theory. This is the American blueprint for  prosperity in action. Let's pass this good bill and greenlight the  future.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697833/increasing-investor-opportunities-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Chair, I want to thank Mr. Arrington for  yielding.\n\nMr. Chair, 4 years ago, President Trump left Joe Biden a blueprint  for success, and then Democrats proceeded to open our borders,  undermine American energy, and spend trillions of dollars on handouts  to the wealthy.\n\nThey created the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the path to  recovery. I am confident that innovative housing solutions like this  one will not only uplift the Grizzly Flats community but will also  serve as a powerful blueprint for resilience and recovery across  California and the Nation.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to join the people of El…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Mr. Speaker, I extend congratulations to Ms. Conner-Miller on her  selection for the Dr. Laura Hummell Technology Innovator of the Year  Award. She is providing students the blueprint for a successful future.                          Recognizing Michael Clark\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to recognize  Michael Clark for being selected…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…restoring our  economy, delivering relief to working families, securing the border,  and unleashing American energy like never before.\n\nThis is more than a budget. It is a blueprint to take our country  back, Mr. Speaker. We are done playing defense. It is time to lead,  fight, and win, all for the American people.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]