[{"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…vessels, inspecting cargo, and arresting suspects  where evidence existed. This Administration has shamefully abandoned  that lawful and effective approach in favor of bombing boats and  committing extrajudicial killings at sea. There is no operational  reason for abandoning interdiction, which worked, respected the rule of  law, and avoided the use of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Currently, the administration is waging a secret war against a secret  list of unnamed groups that they will not tell us about. There have  been four lethal strikes against boats in the Caribbean. The  administration wrote us a letter--wrote this body a letter--about what  they were doing in September. They said they considered themselves to  be in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…faces.\n\nOne area where we need to be particularly strong is in those islands  in the Pacific between the United States and China. My father fought in  the Pacific. He landed the boats on island shores. We need to maintain  our influence in places like the Solomon Islands  and the Cook Islands. Solomon Islands are a place where thousands and  thousands of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…and the  buoys there are missing or misplaced, making it difficult for boaters  and fishermen to safely navigate the channel. Incorrectly placed buoys  and markers could cause boats to run aground in the sand, threaten  commercial towing through the channel, and undermine safe navigation  for all.\n\nMy amendment, which is included in section 283 of this…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…systems on Nicolas Maduro's doorstep--115 Tomahawks alone, with an  additional 70 coming with the Ford.\n\nAre we supposed to believe that this is only about striking speed  boats? If so, why would there be 10,000 American servicemembers in the  vicinity? Why fly three B-52s from the United States to the region? Why  have B-1 supersonic bombers flown…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…``imminent  hostilities'' within the meaning of the War Powers Resolution is a  violation of every reasonable meaning of that term.\n\nLet's begin with the boat campaign against boats with Venezuelans on  it, starting in mid-September, that has now killed more than a hundred  designated combatants; the amassing of U.S. military assets, what the  President…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…about the suffering of the  Venezuelan people. It is not even about narcotrafficking, despite the  administration's killing more than 100 people in its strikes on alleged  drug boats. In the President's own words, this campaign is simply about  seizing Venezuela's oil and profiting from it.\n\nThe people of Venezuela have suffered extraordinary hardship under…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…calling it up for a vote on the  floor.\n\nBut this is obviously bigger than the initiation of an arrest  warrant.\n\nFrom the beginning, on September 2, the striking of Venezuelan boats  in open waters, the amassing of naval assets around Venezuela, the  President's authorization of covert activities, the seizure of ships,  the coordinated attack of 150 aircraft…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Guard and $20 billion to help us recapitalize  our Coast Guard fleet. Replacing the aging and inadequate equipment,  from icebreakers to offshore patrol cutters to heavy weather boats to  MH-60 helicopters and C-130 aircrafts are all important.\n\nBut beyond the modernization, there are other things. It includes in  Base Seattle, the homeport to our Nation's…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…give that voice in this moment because this is  a crisis that can spiral into a conflict and from a conflict into an  all-out war.\n\nWhile Trump tries to claim their targets are boats from Venezuela, in  reality, reports show strikes have hit boats from Colombia and  apparently those carrying citizens from other neighboring countries.\n\nThe administration…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…matter is that the arguments on the other side of  the aisle are to distract. The vast majority of fentanyl that comes  into the United States comes from China and comes in via boats in our  ports of entry.\n\nThey want to distract to take away from the real issue, which is that  the Constitution is very clear that the power to levy tariffs and  regulate…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President. This  body must not do so regarding matters of war.\n\nI think about the idea of a war breaking out between the United  States and Venezuela. Certainly picking off unarmed boats in the ocean  is an easy task for our great military. But let's keep in mind that we  live in a world where there is asymmetric power. What am I talking  about? Take a look…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…wants to say these strikes are about stopping  drugs from entering the country. Putting aside the fact that drug  smuggling is not a crime punishable by death, or that these boats could  have, per the law, been intercepted by the Coast Guard and suspected  traffickers questioned and prosecuted in a U.S. court, this is not a  counternarcotics operation.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that.\n\nNow, the administration spent a lot of time talking about drugs.  Their initial forays with respect to military intervention in and  around Venezuela were targeting these boats that they  claimed were carrying drugs. And, you know, that makes a little bit  more sense to the American people because there are thousands of  Americans that are dying every…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…full-time. At age 69, she traveled to the Mosquito  Coast of Honduras on a human rights observation mission. She took her  mission on headfirst and investigated bullet holes in boats, houses  that had burned down, and wounded villagers with her international  activist group, the Cross Border Network. Alice never stopped looking  for a way to improve the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that they can to defeat  fentanyl, while my Democratic colleagues are willing to do everything  that they can to have those deaths continue. They don't support  striking drug boats. We know that much. They don't support removing  cartel leaders. We know that. Apparently, they don't support tariffing  a country that acknowledges that they have a drug trafficking…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…trial. These narcoterrorists are responsible for the deaths of  thousands of Americans every single year because of drugs. Every time  the U.S. eliminates one of these drug boats, it actually saves American  lives.\n\nLet's talk about what is actually going on. While there are no U.S.  troops, the men and women of the Armed Forces, what they are doing…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699368/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Rubio and President Trump's administration, rightly,  determined that further action was necessary. And, of course, that  began, most notably, with a series of strikes on drug boats in the  Caribbean designed to deter the cartels and disrupt their evil trade.\n\nNow, by capturing Maduro, by enforcing an indictment made by a U.S.  grand jury in a Federal…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…nobody fights  harder against drugs. He made a big speech. Nobody fights harder  against drugs than the President of the United States of America. He is  the one sinking the boats.\n\nDemocrats are the ones saying any terrorist organization, no matter  how many people they kill, behead, abduct, no matter how much drugs  they traffic, the President shall…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…sledgehammer to our fragile  healthcare system to give permanent tax breaks to their political  donors, the billionaires, and the biggest corporations.\n\nOur President bombed boats and then the capital of a foreign country  for oil, and now he says he is acting President of that country.\n\nHe wants our military to invade a NATO ally. Remember, Mr. Speaker,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…now that the  southern border--the land border--is being shut down, the cartels are  not only drilling tunnels now, but they are also putting folks on jet  skis and in Panga boats, taking them out into the Pacific and trying to  be able to come around the maritime barrier and be able to drop off  somewhere around the California coast.\n\nJust this week,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…18, Clyde, of course, said yes.\n\nAs a staff sergeant, Clyde guarded the beaches in Virginia and  Maryland. That was a dangerous duty, as those beaches were vulnerable  to U-boats. This assignment was made sufferable, he said, by the dances  that were held at the camp, but those evenings and any other comforts  were soon just faded memories by the time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Lakes shipping and its importance to our region's  heritage.\n\nTheir recent investments--including $1 million in new docks and a  seawall--as well as $3.5 million in new pilot boats, demonstrate a  strong commitment to strengthening infrastructure, enhancing  operational capacity, and ensuring long-term service to the region.\n\nThe Lakes Pilots Association…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…prime location right there, as I said, on the Chena  River. That was a problem Lloyd Pike solved by building a public launch  to clear up some of the demand in terms of getting boats on the river.\n\nThe original boat launch was washed away when the Chena River  flooded--huge flood by the way--in 1968. But decades later, Jay found  himself building another…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…As a matter of fact, I know a friend who went to Cuba. It was an  interesting observation. In Cuba, which is an island country, he  noticed that there were no, or almost no, boats on the docks as he went  around the Gulf of Mexico.\n\nThis is a sign of what happens in a socialist state. People are so  unhappy there that they won't allow them to  get on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…we sign up for this job,  as has been said, we agree to come to this Chamber, 435 of us.\n\nMr. NORMAN. If you want to get into Members of your own party who  voted coming off boats and just basically took a vacation, it ends  today.\n\nThat is why I fully support this.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…traffickers in our own hemisphere, where we are most directly impacted.\n\nI just heard from the distinguished gentlewoman that these are  fishermen, that these are fishermen in these boats. Really? I guess we  are supposed to not believe our own eyes when we see these boats loaded  with narcotics coming to the United States and going to other  countries.\n\nThese…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698239/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have passed. The Senate will have once again excused itself  from the responsibility of governing, and the United States will once  again be at war.\n\nThose who argue that small boats in the Caribbean are so dangerous  that they warrant being blown out of the water must explain why, when  some of the individuals happen to survive, they are not detained.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…in the Western Hemisphere.\n\nPresident Trump is acting decisively, lawfully, and within his  authority as Commander in Chief. Our military is targeting known drug  smuggling boats loaded with drugs and moving along well-established  trafficking routes. Every strike is based on rigorous intelligence  linking these boats with well-known narcoterrorists.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…off-highway vehicles while still allowing for  conventional vehicles as akin to designating parts of Lake Powell  exclusively for yachts while restricting more accessible fishing boats  and kayaks to less desirable sections of the lake.\n\nIn totality, this rule ensures that only the most able-bodied and  wealthy will be able to have access to areas of Glen…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}]