[{"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise today to recognize Robert ``Bob'' P.  Hubbard for receiving the 2024 Citizen of the Year Award in the City of  Batavia. The Citizen of the Year Award celebrates individuals who have  made a profound impact…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…of Washington, in Olympia, we had a bill  signing, and it is no secret in the State of Washington that a guy  named Tim Eyman is probably the antithesis of what our Governor Bob  Ferguson believes.\n\nHe fights him on all sorts of initiatives to the people about  policies that Mr. Eyman wants to express. So he is a noted individual  in our State.\n\nSo…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692451/alex-padilla"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…space.\n\nDuring my visit, I tasted a delicious bowl of zero waste ramen with  glazed chicken and bok choy, perfect for a cold winter day.\n\nMr. Speaker, I thank Jill, Matt, and Bob, and everyone at Refettorio  for taking a few minutes during meal prep to show me around.\n\nRefettorio Harlem is a spectacular example of what is possible when  dedicated, like-minded…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700160/recognizing-refettorio-harlem-in-new-york-city"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize South Metro  Fire Department Chief Bob Baker for his leadership and service over the  past 40 years.\n\nBob Baker has served with South Metro Fire Rescue as the Chief for  the last ten years. Last summer, when the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…KHANNA. Mr. Speaker, I never want to hear the Republicans lecture  about fiscal responsibility again. The last President to actually  balance this budget was Bill Clinton. Today, Bob Rubin and Larry  Summers wrote an op-ed in The New York Times that every American should  read.\n\nTheir budget will take the deficit up to 8 percent of GDP. It is  historically…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693228/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…advocacy as Past President, mentoring new superintendents through  ACSA's professional development academies. In 2019, she was named  Senate District 10 Woman of the Year by Senator Bob Wieckowski and also  contributed her expertise as a member of Assemblymember Anthony  Rendon's State Blue Ribbon Commission on Early Childhood.\n\nIt is my honor to recognize…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…important to our communities and to the small business  community.\n\nThis bill also increases funding for election security grants by $30  million. I created that program, along with Bob Ney from Ohio, when we  passed the Help America Vote Act. We all want to make sure our  elections are run well. At that point in time, we distributed to the  States over $3…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Madam Speaker, I rise today to highlight a bipartisan  resolution introduced alongside my northwest Ohio colleague,  Bob  Latta. It proclaims May 9 to May 18, 2025, as National American Birding  Week.\n\nEach spring, 3.5 billion birds from over 350 species migrate through  the United States to their…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…of the proceeds from the sale of the plate benefitting the  organizations to support scholarships.\n\nCareer highlights, honors, and awards include: Having roads  designated for Bob Billingslea, July Perry, Edna Hargrett, and Bessie  Coleman; Resolution for George Starke and exoneration of the Groveland  Four; Recipient of the 2022-2023 Humanitarian Award…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mrs. DINGELL. Mr. Speaker, I thank my dear friend, the chair of the  subcommittee, Bob Latta, and our ranking member, Frank Pallone, for  helping to move this and for recognizing me today.\n\nMr. Speaker, I rise today in support of the 5G and Beyond Caucus  bill,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Marcy Kaptur, and Chellie  Pingree on the Appropriations Committee, who led these negotiations and  secured crucial funding for key programs. Subcommittee staff,  especially Bob Bonner, Rita Culp, Scott McKee, Adam Wilson, Nora Faye,  Jamie Wise, Faye Cobb, Jocelyn Hunn, Michael Schmeltz, and Ippo  Dellatolas worked through the holidays to craft this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to introduce bipartisan legislation,  alongside my northwest Ohio colleague, Representative  Bob Latta.\n\nOur purpose is to honor a legendary Ohioan and pioneer of American  military history, Rear Admiral Alene B. Duerk.\n\nAdmiral Duerk was the first woman in the United States…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697052/request-to-name-us-vessel-after-rear-admiral-duerk"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Board.\n\nSo that was the second message: Look out. This is about to get deadly  serious, and people at the top of the finance profession are warning  about it.\n\nI will close with Bob Litterman. He was the chief risk management  officer for Goldman Sachs, right? Goldman Sachs ain't green--except  green with money. And he was their chief risk management officer.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…trade jobs often pay better.\n\nSpeaking with small businesses and workers all over Oregon--I did it  just last week--every single one warned of damage from tariffs, and  soon.\n\nBob's Red Mill, for example, sells delicious flour and grains, mostly  made from wheat and other crops in Oregon. But some of their  ingredients--like coconut or tapioca, which…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…his professional basketball on the West Side  with the Chicago Bulls, which I represent. He played on the same floor  and joined the ranks of Michael Jordan, Scottie Pippen, Bob Love,  Mickey Johnson, and Norm Van Lier. Mickey Johnson lives in the same  neighborhood as I do. Scottie Pippen and Bob Love both grew up in rural  America near where I grew…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699336/congratulating-derrick-rose"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Robert ``Bob'' O'Brien has made through his  volunteerism at Cypress Elementary School. Bob's talents and craft as a  Master Gardener are enjoyed by students and appreciated by staff.  Affectionately…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Their stories of heroism and sacrifice  will be passed along from generation to generation.\n\nOne of the men who sought to memorialize their heroic actions was  Staff Sergeant Bob Slaughter. A native of Roanoke, Virginia, Mr.  Slaughter served in Company D, 116th Infantry Regiment. Soldiers from  central, southside, and southwest Virginia served in the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…features more than 100 awards from the  United Press International and Associated Press, and his enduring  dedication has meant so much to his community.\n\nDescribed by Mayor Bob Morgan as a positive and stabilizing influence  for the city, Doug has also served several years on the City of  Beatrice Community Redevelopment Authority.\n\nDoug's steadfast…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Miller, Melissa Jane Nicandri, Staff Sergeant Ryan Austin       O'Hara, Vikesh Patel, Jesse Jameson Pitcher, Robert ``Rob''       Alan Prewitt, Lori Ann Girard Schrock, Robert ``Bob'' Ryan       Schrock, Wendy Jo Shaffer, Evgenia Shishkova, Vadim Naumov,       Michael ``Mikey'' Bret Stovall, Olesya Taylor, Olivia Ter,       Inna Volyanskaya, Angela Yang,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Speaker, I rise today to celebrate the  Lieb family of Barr Ridge Farms as the Farm Family of the Year in  Cambria County, Pennsylvania.\n\nBarr Ridge Farms is operated by Aaron and Bob Lieb, the triple-great- grandsons of Adam Lieb, who founded the dairy farm in 1861.\n\nThe Farm Family of the Year is awarded by the Cambria County Farm  Bureau to a multigenerational…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. President, the call to feed the world has been  answered by many Kansans, from farmers and ranchers to Senator Bob Dole  and President Dwight D. Eisenhower. American farmers are linked to  global markets and, by extension, to the well-being of people  everywhere.\n\nTwo of our Nation's most…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Simmons finished in 9th place, with a time of 20:05.5. Sophomore Kylie  Lederhos finished in 10th place, with a time of 20:08.9.\n\nCongratulations to coaches Michael Smith and Bob Jones, the whole  team, and everyone who made this win possible. They have made their  school and our community very, very proud.\n\nNighthawks, enjoy this victory. You have earned…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697431/congratulating-salpointe-catholic-high-schools-girls-flag-football-team"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…However impressive Mr. Kimmitt's family might be, his personal career  speaks volumes to the type of man he is. He served as counselor to  then-United States Trade Representative Bob Lighthizer and helped  implement the historic USMCA. William defended our steel and aluminum  industries and worked tirelessly to ensure that America's trade policy  put our…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, I rise today to mourn the passing of Bob  Phelan of Modesto, a valued and beloved member of my congressional  staff for these past 3 years. His was a remarkable life and one that  should inspire every American to realize…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…planes, we must quickly recapitalize these planes to  ensure the U.S. does not lose the critical capabilities provided by the  LC-130 fleet.\n\nBefore I conclude, I want to thank Bob Epp and Dennis Feeney from the  New York National Guard's legislative team, General Steven Slosek from  the 109th Airlift Wing, General Michael Bank, the New York Air National…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…career on Capitol Hill  as a Research Assistant for Rep. Louie Gohmert (TX-01) in October 2016  before becoming a Legislative Correspondent and Legislative Assistant  for Rep. Bob Goodlatte (VA-06) and a Professional Staff Member for the  Republican Study Committee. In February 2023, Gavin joined the House  Committee on Energy and Commerce as a Professional…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692115/recognizing-gavin-proffitt"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the farm.\n\nFamily ownership was passed down through the years to Samuel Black,  who transitioned the operation from a poultry farm to a dairy farm, and  then to Samuel's son Bob Black, who chose to focus on crop farming.\n\nToday, Black's Willow Run Farm is owned by Bob Black's son, Clinton,  and his wife, Jessica. Crops grown on the farm include corn,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…attends Barfield Baptist Church.\n\nBeverly has worked at Burger Quick, RL Harris Dam, Graben Wood  Products, Midway Ford, Wright and Sprayberry Insurance and former  Congressman Bob Riley. Beverly has worked for me since I took office in  2003. She is an outstanding employee and has a heart for the people of  Alabama's Third Congressional District. She…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688459/recognizing-the-retirement-of-beverly-denise-buckhannan-graben"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Remembrance Society.      Dr. Ellen Kennedy,\n\nExecutive Director, World Without Genocide.      Dr. Eric Patterson,\n\nPresident, Victims of Communism Memorial Foundation.      Bob Fu,\n\nFounding President, China Aid.      Levi Browde,\n\nExecutive Director, Falun Dafa Information Centre.      Turghunjan Alawudun,\n\nPresident, World Uyghur Congress.      Louisa…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the global headquarters for the Character Counts  organization is located in my home State. The Robert D. and Billie Ray  Center is located at Drake University.\n\nBy the way, Bob Ray was Iowa's Governor for 14 years. So the location  in Des Moines makes perfect sense to me because Iowa's values align  with the six pillars of character promoted by the…", "date": "2025-10-20", "source_url": "https://justfacts.votesmart.org/public-statement/1696289/national-character-counts-week"}]