[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…actually have a President, who, when  asked if it is his responsibility to uphold the Constitution, wouldn't  say I don't know, and instead of passing laws  about renaming bodies of water, we would actually be doing things to  help the American people.\n\nMr. Speaker, I rise today to honor and celebrate the winners of this  year's Congressional Art Competition.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690755/congratulations-to-marely-gutierrez"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…opposite of  what we need to have happen. This bill guts Federal, State, Tribal, and  local authority and resources to attain clean water and protect locally  important water bodies.\n\nFirst, this bill significantly restricts Federal oversight and  regulatory authorities under the Clean Water Act. The current  administration has already acted to slash Federal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Mr. Chair, I rise today in opposition to this amendment, which would  ban transgender women from participating in women's sports but also  lead to challenges on all women's bodies, making the military and  academies less safe for any women to enlist, no matter who they are.\n\nMilitary personnel already undergo in-depth medical exams, and this  amendment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695232/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…taking concrete,  proactive steps to lower the barriers of entry for U.S. companies and  other stakeholders to promote American ingenuity at international  standards-setting bodies as they develop the next generation of  wireless technologies.\n\nMr. Speaker, let's be clear. Our global competitor is China. As 5G  has become the backbone of our digital infrastructure,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…food aid for malnourished children, despite their promise to do so.\n\nI speak today about the biology of hunger. A 2-year-old child may  weigh the same as a newborn. Their bodies stop growing. Their immune  systems shut down. They lose the ability to walk and sometimes even the  ability to cry. That is what severe malnutrition looks like, and it is…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…identify risks to financial stability, promote market  discipline, and respond to emerging threats to our economy.\n\nFSOC brings together the heads of 15 financial regulatory bodies,  giving it a unique, systemwide view of the American financial system.  Among its authorities is the ability to designate certain nonbank  financial companies as systemically…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…import goods. Those increased costs are  paid for by Americans, not foreign countries.\n\nMr. Speaker, instead of mind-bending tariffs, giveaways to  billionaires, and renaming bodies of water, we should be voting on  bills that lower costs for the average family. I know many of my  colleagues agree. Let's get to real work on behalf of our constituents.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690668/no-action-on-lowering-costs"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…are  showing the world how to respond to violence and how to stand up to  bullies with strength and with dignity and with peace. You are putting  your own safety and your own bodies on the line to protect your  neighborhoods and your democracy. You are risking your own safety to  document the emergency and the inhumanity unfolding on our streets. And…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…all  because everyone deserves access to fundamental healthcare, and that is  exactly what abortion care is.\n\nNo man, no king, and no coward should come between us and our bodies.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693925/access-to-abortion-care"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…make sure  that they are empowered with every tool, every resource, and every bit  of information they deserve to make the choices they need to make about  their lives, their bodies, and their pregnancies.\n\nThis body should not determine what decisions they make for  themselves. We talk about God. God gives us choice. God gives us choice  to make the decisions…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…happen anymore. We come to the floor and make a speech. We  may, once a month, have something to vote on the floor.\n\nThis Senate is described as one of the great legislative bodies-- deliberative legislative bodies--in the world. You couldn't prove it by  the history of our schedule over the last several months.\n\nThis week, the Senate Democrats are going…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…printing amendments,      Debates and objections and unanimous consensus.       We leave this world made of marble and to Webster Hall we             return;      Where our bodies may rest, but our minds will still churn.      We all have no clue what tomorrow will bring;      Best and brightest, to this place we will cling.       We will cling to the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…pleased  to report that Senators Markey, Merkley, Sanders, Welch, and Van Hollen  have all introduced a version of our resolution. I urge the foreign  policy committees of both bodies to consider these resolutions  promptly.\n\nUnfortunately, Mr. Speaker, activity in House committees is taking us  in the wrong direction. Last week, the Appropriations Committee…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…water. The Clean Water Act, in many cases, has been the sole  reason why decades of pollution threatening the health of our  communities has been reversed and why countless bodies of water  throughout the country are now being preserved for future generations.  The PERMIT Act will reverse progress and give polluters the ability to,  once again, contaminate…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…day before the  anniversary of Roe v. Wade, which Trump gutted, Republicans are making  it even harder for women to get honest information to make decisions  about their own bodies.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699215/funding-crisis-pregnancy-centers"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…directing the National Telecommunications and Information  Administration, or NTIA, to encourage participation by trusted  stakeholders in the international standards-setting bodies, like 3GP  and IEEE, that develop technical standards for 5G and next-generation  wireless.\n\nThrough this bill, NTIA will partner with these trusted stakeholders,  representing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693510/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…police officers and firefighters that have literally never been back to  that location because it is too painful to be able to return to a spot  where they carried out the bodies of their friends and neighbors.\n\nThere are individuals that their family was truly forever changed.  And now, 30 years later, they still get together and talk and visit,  catch…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…at a moment when  international competition is sharper than ever.\n\nThis legislation gives our Nation the ability to fully engage with  influential regional and international bodies such as the Association  of Southeast Asian Nations, the European Organization for Nuclear  Research, the Pacific Islands Forum, the Caribbean Community, and the  African Union…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…the San Bernardino County Transportation  Authority, the San Bernardino Council of Governments, and the Victor  Valley Wastewater Reclamation Authority. Her service on these bodies  has been marked by professionalism, collaboration, and a deep  commitment to transparency and good governance.\n\nDebra's accomplishments would not have been possible without…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…couple of weeks ago, I went to  New Hampshire to a lab where they were growing undifferentiated islet  cells. Apparently, islet cells don't need antirejection drugs to get  bodies to be able to start making their own insulin again. There are  crazy ideas.\n\nMr. Speaker, can we do a thought experiment? I am probably going to  get beat up for this. This…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…that these nationwide  injunctions bear a remarkable similarity to a step in the legislative,  not judicial, process.\n\nIn our branch of government, we had Democrats in both bodies of the  legislative branch who proposed legislation just a Congress ago saying  this is a problem we ought to deal with. Their legislation looked a lot  like part of this bill,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…civilians in Israel more than 2 years ago.\n\nEarlier this year, the barbaric inhumanity of Hamas was revealed  again in the macabre and infuriating spectacle of returning the bodies  to the Bibas family. We last saw Shiri Bibas alive on October 7, 2023,  as she was seized, terrified and sobbing, begging for the lives of her  two little boys as they were…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…PRC Government has committed genocide and crimes against       humanity against Uyghurs and other ethnic and religious       minorities in the XUAR.\n\n(18) Government bodies of multiple nations have also       declared that PRC Government's atrocities against such       populations in the XUAR constitute genocide, including the       parliaments…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…millions starved to death and thrown into  the gulags by Mao's China and Stalin's Soviet Union.\n\nThese aren't abstract failures, Mr. Speaker. They are graveyards  built on broken bodies. What starts as hope ends in tyranny and death  every time.                          Coptic Christians in Egypt\n\nMr. HILL of Arkansas. Mr. Speaker, I rise to shed light on…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…the UN system is not a political issue, but       a pragmatic one.''. He continued, ``Taiwan's exclusion       undermines the important work of the UN and its related       bodies, all of which stand to benefit greatly from its       contributions.''.\n\n(15) In October 2024, Taiwan announced it would seek IMF       membership, with the Taipei Economic…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Pharmacists, after six to eight years of rigorous training, including  a Doctor of Pharmacy degree, serve as trusted experts in how  medications work, interact, and affect aging bodies.\n\nThrough services like medication therapy management, they review  entire regimens, including prescriptions, over-the-counter products,  vitamins, and supplements to identify…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nTwo hundred one (201) MK 83 MOD 4/MOD 5 General Purpose       1,000-pound bomb bodies.\n\nFour thousand seven hundred ninety-nine (4,799) BLU-110A/B       General Purpose 1,000-pound bomb bodies.\n\nOne thousand five hundred (1,500) KMU-559C/B Joint Direct…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…what is happening in France.\n\nIn the United Kingdom, Muslims are increasingly turning to Britain's  sharia courts, which are not part of the U.K. law and operate as  informal bodies. The number of sharia courts in Britain has grown to 85  since they first began operating in the country in 1982.\n\nPolls have found that 41 percent of the British public believe…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Commerce, Science, and       Transportation of the Senate, a report on sixth-generation       wireless technology, including--\n\n(A) the status of industry-led standards-setting bodies in       setting standards for such technology;\n\n(B) possible uses of such technology identified by       industry-led standards-setting bodies that are setting       standards…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…not be tolerated.\n\nThe United States' response to an invasion of Taiwan should be robust  and include numerous sanctions and economic penalties. Exclusion from  international bodies must be a part of that response.\n\nIf China seeks to disrupt the global order, then China cannot  continue to be party to international organizations that seek to  preserve…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}]