[{"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize an extraordinary  milestone in the Quad Cities--the 30th anniversary of the Channel Cat  passenger ferryboat service. What began as a bold idea in 1994, led by  Kathy Wine, Executive Director of River Action, has since become a  vital part of our region's transportation network and a celebrated  symbol of innovation…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691090/recognizing-the-30th-anniversary-of-the-channel-cat-passenger-ferryboat-service-in-the-quad-cities"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Trinity Railway Express and as of  this weekend the new Silver Line), GoLink on-demand services, and  paratransit. Recently, DART has adopted an updated Strategic Plan  setting bold new vision and mission statements, guiding the agency into  the decade ahead as a ``first-in-mind mobility partner'' and a premier  regional economic and mobility asset. With…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…innovation.  They want to discover and create a stronger economy.\n\nIt is also inspired in upstate New York because I represent the  easternmost portion of the Erie Canal. This is a bold vision that  connected a great ocean, the Atlantic, with the Great Lakes. It allowed  for not only the strengthening of the port of a small place called New  York--New York…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…that this is happening right  before the midterm elections.\n\nIn January, the FBI raided the Fulton County election office, my home  county, where I am a voter. That raid was a bold attempt to intimidate  voters in the Fighting Fifth.\n\nThe SAVE America Act is just another part of a scheme by House  Republicans and the Trump administration to take over our…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700000/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…approval ratings are in free fall. The American people  are rejecting much of what we see, but too many of our side of the  aisle aren't giving a strong enough alternative, a bold enough  alternative.\n\nWhile the President's numbers may be in free fall, we also see  favorability of the Democratic Party at record lows, the lowest CNN has  seen since 1992.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…undergraduate researchers at UC  Riverside. They are doing remarkable work on everything from climate  change to biomedical engineering. Their students are bright; their  ideas are bold; and their funding is suddenly at risk, not because the  science failed but because politics did.\n\nWhile we fire researchers, other countries are sending job offers.  France,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…importance of representation, equity, and cultural  pride in community leadership. When she saw that Latina voices were  underrepresented in positions of influence, she took bold action,  bringing together a group of Latina activists to chart a new path  forward by creating Latinas Unidas. Today, the organization stands as a  powerful testament to her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695836/recognizing-daisy-rivera-algarin"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…unfortunately, still familiar today.\n\nYet in the face of this hateful, dehumanizing rhetoric, Mother  Cabrini responded not with fear or hatred--what our President wants-- but with bold, unwavering love and compassion.\n\nAs the founder of the Missionary Sisters of the Sacred Heart of  Jesus, she built a movement grounded in hope, service, faith, and  fierce…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…But his call for hangings came to naught:\n\nHis nooses hung empty; no charge was brought;\n\nBecause never a traitorous tale was told.\n\nRhode Island stood steady, silent, and bold.\n\nThe spark that was struck in the Gaspee Raid\n\nLit a flame that still burns in our hearts today.\n\nAnd the lesson from then is a lesson now,\n\nThat every American still will…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in America but the whole world. This is a  great message for all Americans. Whether you live in Albany, New York  State, or any other part of this great country, there is a bold, vital  message that comes from Albany: The future of chips and the most  advanced semiconductor chips is here in America--not overseas, not  China.\n\nThese chips are vital to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…American decency, and the  American Dream.\n\nMr. Speaker, if there is a single revelation to emerge from this  abyss of wickedness, let it be that our immigration apparatus needs  bold and systemic change, and may that change be a system centered in  compassion, not cruelty; entrusted to competent officers, not  kidnapping traffickers and killer thugs, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…his moral standards are the standards that everyone  concurs with.\n\nHe has as much as said that the only thing that can get in his way  would be his own moral standards. How bold. How can a person have the  gall to say such a thing? Do you not want to hesitate and have the good  sense to say to yourself that maybe this is not an appropriate thing to…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…years of profound service. The Patriarch has also been  honored by the United Nations, the European Union, and dozens of  governments, universities, and institutions for his bold efforts to  promote peace and understanding, especially between the East and West.  In 1997, he was honored in Washington, DC, with the Congressional Gold  Medal, the highest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695682/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…annual  events and programs for employees, including the Haunted Cafe for the  children of employees, a Thanksgiving feast, and a Christmas  extravaganza.\n\nJoyce created Big, Bold and Beautiful Productions to expand her  service work to the Waterbury community. As an entrepreneur, she opened  New York Handbags Plus Dresses in downtown Waterbury. Through…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…runs on banks.\n\nAgain, I would want people to understand that institutional knowledge  is a supreme exemplar of what can occur when we have these  circumstances that require bold action, but you can't have bold action,  Mr. Speaker, without bold people. I thank the ranking member for her  bold action.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697285/systemic-risk-authority-transparency-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…who fund rare disease innovation. Lowering  the bar will set a dangerous precedent for copycat products with few  modifications, encouraging incremental changes rather than bold  scientific advancements. Lowering the bar will hurt patients most of  all, delaying or discouraging the development of a first-ever therapy  for the nearly 10,000 rare diseases…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…continues to keep pace  with the dynamic threat environment.\n\nFor defense of the homeland, this bill supports development of the  Golden Dome system to achieve President Trump's bold vision.\n\nIn space, we established the Tactical Surveillance, Reconnaissance,  and Tracking program as a formal program of record to provide badly  needed space products from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Midnight Hammer: After day 60, all the negotiations went  nowhere because the Iranians didn't want them to go anywhere. President  Trump acted, and it was brilliant, it was bold, and it will live in  history. To all those who took part in this, God bless you. We have the  finest military on Earth. We proved that yet again. But you can have  the best…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…and to fight every day for Christian values that have  made this country great.\n\nThe president of the College Republicans of America described Ella as  being ``known for her bold, brave, and kind heart as she served her  chapter and her fellow classmates.''\n\nYou know, the true measure of a life is not found in its length but  its impact. And in the stories…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…is completely  novel, from what I understand, in the history of legislative government  in this country. He inserted a poison pill saying that, if California  voters were so bold as to go out and vote for Prop 36, our initiative,  then all of these other bills would automatically be reversed as a  punishment, if you will.\n\nI will say that again. The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Nation's strategic and economic  security at great risk.\n\nThe Trump administration has long recognized the threat China poses  to our critical mineral supply chains and has taken bold actions that I  applaud. Additionally, I have introduced several pieces of legislation  that will help counter China's threat.\n\nIn January, I introduced the SECURE Minerals…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Chair, I rise today in support of the PERMIT Act introduced by my  good friend and chairman of the Water Resources and Environment  Subcommittee, Congressman  Mike Collins.\n\nThis bold legislation delivers a long-overdue blow to the radical  environmental agenda that has weaponized the Clean Water Act, paving  the way for critical infrastructure projects to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Executive order making clear his commitment to American energy  independence. The President is moving very quickly in terms of boosting  the coal industry. It is part of his bold plan that the administration  has to restore American energy dominance.\n\nWe have more coal in this country than any other country in the  world. It is one of our most affordable,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…his nearly four decades  of service, the House saw a lot of change. Noah's ability to constantly  adapt and consistently excel--all while maintaining his sense of  humor--is a bold testament to his dedication to the House of  Representatives and the people it serves. I wish Noah the best for his  well-earned retirement.\n\nOn behalf of my colleagues and…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Ms. BOEBERT. Mr. Speaker, I rise in support of the No Rogue Rulings  Act, a bold and necessary step to rein in activist judges who have made  it their sole mission to obstruct the agenda of President Donald J.  Trump.\n\nLet's be clear about what is at stake.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689710/no-rogue-rulings-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…in that group. These men reflected profiles in  courage, pledging their lives, their fortunes, and their sacred honor  on a piece of parchment paper. As benefactors of their bold commitment  to freedom, we must never take for granted the remarkable risk and  providential promise that they embraced.\n\nSince July 4, 1776, Americans can trace a shared heritage--a…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…hometown, and to the  future.\n\nWhen Mike assumed leadership of PennFab following his father's  passing in 2018, he did far more than carry on a legacy--he redefined  it. With bold vision and relentless determination, he transformed a  respected local operation into a nationally recognized infrastructure  partner. He expanded operations, acquired PennFab's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Uribe assumed office in 2002 during one of the most  challenging periods in Colombia's modern history, a time marked by  violence, narco-terrorism, and instability. Through his bold and  visionary ``Democratic Security'' policy, President Uribe restored law  and order, dismantled the strongholds of terrorist organizations like  the FARC, and reestablished…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…instrumental in his visionary leadership and  success.\n\nMr. Speaker, I could speak volumes about Doug McMillon's legacy.  Suffice it to say, his quiet and patient demeanor, his bold and  innovative leadership, and his commitment to the shareholders and  associates of Walmart make him one of America's true success stories,  and not only that, but his spirit…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…to turn Iran's terrorist assets into liabilities.  Despite the pearl-clutching here in Washington, our allies  simultaneously decapitated Hezbollah and crippled Hamas. Their bold  operations created a new opportunity for Lebanon to claw back its  sovereignty from a terrorist state within a state.\n\nMeanwhile, the collapse of the brutal Assad regime in…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}]