[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…with  disdain.\n\nWith our Nation's economy in such a precarious state and 2 weeks of  session left before a 2-week recess, is the Republican majority taking  urgent action to bolster Americans' finances, boost growth, and restore  confidence? Regrettably, they are not.\n\nInstead, among other ill-advised items, they are tackling the so- called problem of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…seven years, said he would do what he could to assist St.  Augustine, but added it would be helpful to him to have Sister Madalena  of Xavier Prep also apply for admission to bolster his request.\n\nFather Grant faced resistance from other Catholic schools, whose  coaches set the athletic schedules. The Catholic League coaches ignored  the two LIALO schools…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…provisions that strengthen our defense relations with  Taiwan, expanding DOD's annual readiness assessments, even Republican- led amendments to invite Taiwan into RIMPAC and bolster its energy  security. These are the kinds of amendments that are aligned with the  United States' interests. These are the kinds of amendments that foster  deterrence, not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to turn over that data are now being sued by the Department of  Justice.\n\nTrump is attempting to compile the largest list of voter roll data  ever in our history in order to bolster unsubstantiated and false  claims of illegal voting by noncitizens, despite the fact that  noncitizen voting is essentially nonexistent.\n\nThis type of national voter roll…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…requirements for occasions  when employers must require the use of respirators that prevent  exposure to toxic chemicals that can cause cancer and other diseases.\n\nRegulations to bolster labor protections for farmworkers on guest  worker visas; they are rolling those protections back.\n\nThe implementation of Federal law requiring affirmative action for  employees…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Taliban.\n\nThere remain considerable areas of bipartisan consensus in Congress  when it comes to our Afghanistan policy. This legislation will lean on  that consensus to help bolster our committee's oversight power and take  a step toward delivering to our Afghan allies the support that they  deserve.\n\nMr. Speaker, I hope my colleagues will join me and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…with trespassing cases. We owe it to servicemembers to provide them  with the information and resources to navigate that process.\n\nThis legislation, unfortunately, does not bolster access to legal  assistance, but I hope the sponsors of this legislation will join us on  those efforts in the future.\n\nI will be supporting this legislation today, as it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695470/servicemember-residence-protection-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…FCC to ensure that our communications networks  remain reliable when we need them the most.\n\nCountless tragic and heartbreaking incidents have highlighted the  urgent need to bolster these networks, from the recent flooding in  Texas, to Hurricane Helene last year, to Superstorm Sandy that  devastated my home State of New Jersey in 2012.\n\nIn these moments,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…country's natural resources and  forests for future generations. My colleagues and I are honored to  reintroduce this legislation to preserve America's working forests and  bolster our rural economies. Mr. Speaker, I encourage all members to  join us in cosponsoring this bill.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…in Congress. They have  canceled billions of dollars in investments for our State, including  the hydrogen hub that would expand research and development of hydrogen  fuel, bolster American energy dominance, and bring nearly 10,000 jobs  to the region.\n\nThey have created chaos at critical agencies that keep the lights on  like Bonneville Power Administration.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…protection of the most sensitive technologies  that underpin our security.\n\nI am grateful to have worked with Representative Kim on this  bipartisan effort to support our allies and bolster our shared defense.\n\nMr. Speaker, I encourage my colleagues to support this bill, as well.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694781/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…values, particularly in the context of  growing geopolitical competition and threats by our shared adversaries  to endanger the pursuit of a free and open Indo-Pacific.\n\nTo bolster U.S. engagement with this region, we have reintroduced our  Pacific Partnership Act, which passed the House unanimously in the  118th Congress. Our bill supports the tenets…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Commerce to study the  costs, benefits, and feasibility of manufacturing products within  critical infrastructure sectors so we can take well-informed and  strategic next steps to bolster our Nation's supply chains.\n\nI thank our Democratic sponsor, Representative Schrier, for her work  on this bill. I urge my colleagues to support the bill.\n\nMr. PALLONE. Mr.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690288/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…headwinds make SBA  services more important than ever.\n\nThe bills before us today reflect the monthslong, bipartisan effort  to strengthen the services offered by the SBA and bolster the support  for small businesses across the country. These five bills were  negotiated in good faith and in the spirit of collaboration.\n\nTogether, they help expand access…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Corps of Engineers to contribute their expertise to the development of  new and existing infrastructure projects that not only improve water  and sewer infrastructure but also bolster our economic competitiveness.\n\nI am proud to have advocated for these resources to ensure that they  were included in last year's WRDA. These programs allow communities in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…implementation of this misguided policy. I encourage my colleagues  to support the CRA that is central to our mission of American energy  dominance and reject this tax that will bolster our adversaries,  increase energy costs on American families, and put our energy future  at risk.\n\nI would like to yield, but before I do that, I would like to thank my  colleague…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…let alone on our college campuses.\n\nBy establishing footholds in American schools, bad actors gain access  to valuable research and intellectual property that can be used to  bolster their own military and undermine our Nation's best interests.\n\nUnder the Higher Education Act, schools are required to report  foreign gifts and funding. Unfortunately, loose…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…innovation to protect lives, including those of our first responders.  These brave men and women who risk their safety to combat wildfires  deserve every available tool to bolster response capabilities and  enhance operational safety.\n\nI thank Representatives Fong and McClellan for their work to address  this pressing need.\n\nMr. Speaker, I urge all…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Speaker, today I rise in strong support of  my bipartisan bill, the Global Investment in American Jobs Act.\n\nMr. Speaker, this is a critical piece of legislation that will help  bolster American competitiveness in the face of increasing economic  aggression from the Chinese Communist Party, all while helping to  create jobs in my home State of Colorado and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…fuel-reduction strategies.\n\nWe know that forest management is the single most crucial factor in  determining wildfire severity. This bill builds on a proven model and  will bolster Utah's ability to confront wildfire risks head-on.\n\nMr. Speaker, I commend Representative Kennedy and the chairman of the  Senate Energy and Natural Resources Committee, Senator…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…ensures that the United States carriers will play a more  significant role in the transportation of goods funded by the Federal  Government, which will fuel economic growth and bolster United States  maritime jobs.\n\nH.R. 2035 also helps ensure that our Nation has a ready fleet of  vessels and mariners that we can mobilize in national times of  emergency.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the foreign influence law, the       President should take steps to improve the bilateral       relationship between the United States and Georgia, including       actions to bolster Georgia's ability to deter threats from       Russia and other malign actors.\n\n(c) Certification Described.--The certification described       in this subsection is a certification…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…critical technology  developed in the U.S. from falling into the hands of our adversaries.  Export controls are a major tool of the administration to protect  sensitive tech and bolster our own national security, and these rules  have never been more timely or important as China seeks to enhance  their chip and AI development.\n\nUnfortunately, there is a major…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…vital resources to strengthen our fight  against transnational criminal organizations and the deadly flow of  illicit fentanyl.\n\nMy first amendment redirects $2 million to bolster the National Guard  Counterdrug Program. This funding will enhance training and equipment  for our servicemembers, empowering them to disrupt the cartels and  criminal networks…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…chain that will support upwards of 6,000  jobs. T1 delivers domestic energy and energy dominance.\n\nThis investment in American energy will strengthen our national  security, bolster our economic competitiveness, and power the future,  including the technologies of tomorrow like artificial intelligence and  data centers. I congratulate T1 Energy on this…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…package that we will debate and discuss and vote on this week  makes targeted investments in the Federal Agencies and Departments that  conduct critical scientific research, bolster economic growth, promote  U.S. energy independence, and strengthen our Nation's national  security. These priorities are achieved while also making thoughtful  reductions…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Wendell White.\n\nSpecifically, this NDAA helps small businesses by fast-tracking  promising technologies, establishing a pilot program to test and  procure technologies that bolster operational capabilities,  incentivizing the consideration of commercial, off-the-shelf products  prior to entering expensive contracts, and authorizing the Defense  Innovation…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697795/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…adults consider themselves to be in recovery from a  substance use disorder or mental health condition.\n\nIn order to ensure that more patients can reach recovery, we must  bolster treatment integration and wraparound services for patients  suffering from substance use disorder and addiction.\n\nThis amendment directs the National Coordinator for Health…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691885/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…National Guardsman who has been deployed to a combat zone,  that is of critical importance to me, as well.\n\nMadam Speaker, in closing, this commonsense bill is simple. It helps  bolster American innovation, keeps the lights on rain or shine, and  helps reduce utility bills for the middle class. As a Representative of  a district that is at the forefront of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…made that a provision of  this legislation.\n\nThis legislation will also fulfill President Trump's pledge to make  our cities and streets safe again through provisions that bolster our  Nation's border security and law enforcement efforts.\n\nOver at Immigration and Customs Enforcement, or ICE, the Big  Beautiful Bill will provide additional funding to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}]