[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…would give up their  chemical weapons program. Diplomacy achieved a result, just as  diplomacy achieved a more effective control of the Iranian nuclear  program--even than the bombs that we dropped last Saturday--until it  was torn up.\n\nI pray the cease-fire continues, but I fear we are going to be back  here on this floor. And I hope when we are on this…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Congress horrified by the ongoing massacre in Gaza.\n\nThis is not a humanitarian crisis in abstract. It is the result of  choices, choices leading to preventable famine.\n\nWhile bombs are leveling entire cities, the only so-called aid group  allowed in, the Gaza Humanitarian Foundation, is annihilating the very  principles of neutrality and humanitarian…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694108/ongoing-massacre-in-gaza"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…strikes were illegal, unauthorized, and  unconstitutional. No debate, no vote, no evidence of an imminent  threat--that is not how this should work. If we are going to drop bombs  and put American lives in danger, Republicans in Congress should be  willing to come down here and have the courage to vote ``yes'' or  ``no'' so that people know where they…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Congress. The dehumanization and the  anti-Palestinian racism here is painful, especially when my colleagues  remain silent on the starvation of children and vote to send more bombs  to the Israeli Government while they commit war crimes with impunity.\n\nToday, we are witnessing a genocide in Gaza. Many human rights  organizations, advocacy groups, NGOs,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Trump's  team have been working on this, were in conversation with Iran before  Israel's attack to create such an arrangement. In fact, they continued  those conversations even as bombs were dropping.\n\nWe have to succeed to put in place a permanent, detailed, enforceable  plan for peace which Iran agrees to, that stops funding for militias  outside Iran and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…in Gaza to  alleviate the humanitarian catastrophe. It will resume when families on  both sides of the border can sleep peacefully without the constant fear  of rockets and bombs falling from the sky. It will resume when there is  a lasting, durable, and negotiated cease-fire.\n\nMr. Speaker, that day need not be far away. Israel achieved its goal  of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…hostages.\n\nSince then, more than 400 people have died of starvation, including  more than 100 children, and that is ongoing and accelerating. Thousands  more have died under bombs and bullets at aid sites themselves.\n\nAt the time, I held up this picture of Jinan Iskafi. She died in her  parents' arms, the victim of a military blockade on infant formula.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President of the United States will consult corporate America before he  consults Congress; and when the President of the United States goes  into another country, Venezuela, bombs this country, and consults with  corporate America but does not consult with the Congress of the United  States of America? Where do you stand?\n\nWell, here is where the Senate…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…It is strategy.\n\nDon't take my word for it. Military leaders from both parties have  warned us for years. If we fail to lead with soft power, we will end up  paying in blood, bombs, and more boots on the ground.\n\nCutting foreign assistance will: deepen desperation, fuel extremism,  and push fragile societies toward collapse. When that happens, we all…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Minuteman III ICBMs. This single program has already  ballooned to cost over $200 billion, an 81 percent cost overrun. We are  spending blindly. We are on remote control: more bombs, more, more, and  we will be safe.\n\nThat is nonsense, just nonsense. We will not be safer.\n\nInstead of doing the hard work of diplomacy, we are being asked to  plow billions…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…family, my distant family, were in Hiroshima on the day  the atom bomb fell. That memory is not just historical. It is personal  for me and my family.\n\nMr. Speaker, the atomic bombs of 1945 caused unimaginable horror.  Some died instantly, many over subsequent days and months. Others  suffered for the rest of their lives, afflicted with burns, radiation,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nuclear arsenal when we should be restoring funding to  healthcare, medical research, and food and nutrition programs here at  home.\n\nWhy is it that we always have money for bombs, but when it comes to  helping improve the quality of life for our people, we are told we  can't afford it? It doesn't have to be this way, and both Vladimir  Putin and Donald…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…violence are no longer functioning because the funding was cut off. We  don't know how many deminers we have trained and equipped to locate and  destroy unexploded mines and bombs in Vietnam, Laos, Lebanon, and  Ukraine are no longer working because the funding was stopped.\n\nBut before long, we will know, and our constituents will know. And  they will…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…because we have to rebuild  Palestine.\n\nI say ``we.'' I believe the United States has to make a contribution,  just as we contributed to the rebuilding of Japan after we dropped  bombs on Japan, just as we have contributed to the rebuilding of other  places when we have been involved in the destruction.\n\nWe helped to destroy Palestine. Yes, I know that what…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…program has been obliterated. That is a program that can be  reconstituted in a relatively short amount of time because, of course,  knowledge is not able to be destroyed by bombs.\n\nThe only way that you are going to make this country and this world  safe from Iran's nuclear weapons ambitions--and they have them--is  diplomacy. I hope that diplomacy…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "James Risch", "party": "Republican", "sentence": "…(INS)/Global Positioning System       (GPS) guidance capability with Selective Availability Anti-      Spoofing Module (SAASM) or M-Code that converts unguided       free-fall bombs into accurate, adverse weather ``smart''       munitions. The JDAM weapon can be delivered from modest       standoff ranges at high or low altitudes against a variety of…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I rise also today in full support of the  National Defense Authorization Act. This bill delivers exactly what  America has needed: bombs and bullets from America for America.\n\nIt also does something very important to me as chairman of the  Foreign Affairs Committee. It rebuilds American foreign policy.\n\nWhat…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697811/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Worst of all, throughout these so-called peace talks, Vladimir Putin  has repeatedly taken the lives of noncombatant civilians and pummeled  residential neighborhoods with bombs. Every statement Mr. Putin makes  should be viewed through that lens.\n\nPresident Trump is right. Too many people are dying, and that  includes the Russian people who are also…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Kansas, for his sentencing. What  was a normal day in Topeka suddenly turned into gunfire and tragedy as  the convict's car and his person were covered with explosives and pipe  bombs.\n\nAs building staff hid in fear, Craig and his fellow law enforcement  agents put their fear aside to get innocent civilians to safety. In  all, five Kansans were injured that…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "James Risch", "party": "Republican", "sentence": "…notification threshold at $18.8 million ($15.4 million in       major defense equipment (MDE)) and included three hundred       eighty-seven (387) GBU-39/B Small Diameter Bombs (SDB-I). The       Republic of Korea has requested the case be amended to       include an additional six hundred twenty-four (624) GBU-39/B       SDB-Is. This amendment will…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697584/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…million in       major defense equipment (MDE)). The Government of Japan has       requested that the case be amended to include twenty-eight       (28) GBU-53 Small Diameter Bombs-Increment II (SDB-II) all-      up-rounds (AURs). This amendment will cause the case to       exceed the notification threshold, and thus notification of       the entire program…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…have committed to reaching the 5 percent GDP of defense spending in the  upcoming years, and are vulnerable NATO allies.\n\nWe are debating this amendment at a time when Russia's bombs have  just fallen upon NATO ally Poland. It is important that we secure this  funding.\n\nThe Baltic states have contributed about $10 for every $1 of U.S.  funding that has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695258/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…36(b)(1) of the Arms Export       Control Act, of the Government of Belgium's request to buy       one hundred ninety-six (196) Guided Bomb Unit (GBU)-53/B       Small Diameter Bombs Increment II (SDB-II) All Up-Rounds       (AURs). Also included were SDB-II Weapons Load Crew Trainers       (WLCT); training aids and devices; spare and repair parts,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697685/arms-sales-notification"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…there goes Israel and,  eventually, us.\n\nSo their nuclear ambitions are not to build peaceful nuclear  powerplants and fuel them. Their enrichment program is designed to make  bombs. They intend to use these bombs because they are religious  fanatics.\n\nDoes anybody doubt that if Adolf Hitler had a bomb, he would have  used it? If you doubt that the Ayatollah…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…KMU-556 (GBU-31) for MK-84 warheads; 1,725 KMU-557 (GBU-31)       for BLU-109 warheads and 1,725 KMU-572 (GBU-38) for MK-82       warheads); 3,450 MK-84 2000 lb General Purpose Bombs; 1,725       MK-82 500 lb General Purpose Bombs; 1,725 BLU-109 Bombs;       3,450 GBU-39 Small Diameter Bombs; 11,500 FMU-139 Fuses;       11,500 FMU-143 Fuses; and 11,500…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…transmittal number 22-17 of       the possible sale, under Section 36(b)(1) of the Arms Export       Control Act, of two hundred thirty-nine (239) GBU-39/B small       diameter bombs, Increment I; two hundred four (204) FMU-152       fuzes; two hundred four (204) Mk 82 500 lb general purpose       bombs; and fifty (50) BLU-109 2000 lb hard-target-penetrator…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}]