[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Massie and I introduced a resolution to prevent more  wars of choice.\n\nWhat did we achieve? The intelligence tells us that we just pushed  Iran back 3 to 4 months in building a bomb. Vice President Vance says  they still have enough nuclear fuel to have 10 nuclear missiles.\n\nWe need tough diplomacy to deny Iran a bomb, not more wars at the  expense of the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692976/americans-of-all-parties-do-not-want-more-war"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…day or  two after the attack in Iran, put up a music video with lyrics that  were matched to a Beach Boys song, ``Barbara Ann,'' but the music video  contained these lyrics: ``Bomb bomb Iran; bomb bomb bomb bomb bomb Iran  . . . ; went to a mosque, gonna throw some rocks . . . ; time to turn  Iran into a parking lot.''\n\nWe shouldn't premise a decision…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…very detailed knowledge that we have had in the  past in our national labs to be able to go in there and do what is  called nuclear forensics and find out whether that was a bomb from X,  Y, or Z. That capacity has been under duress for a long time. It seems  like it is every single time the appropriations budgets come up, we end  up having to try to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…devastating American  communities flows overwhelmingly through different routes. So what  problem are we actually trying to solve?\n\nAnd I think it should be obvious you cannot bomb your way out of a  drug crisis. The demand that motivates drug trafficking is not found in  the Caribbean. It is located in communities across America where people  are suffering…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…needless suffering.\n\nWe must act. We must act so that an innocent son or daughter risking  starvation does not starve. We must act to save someone's mother or  father from a bomb dropped in Gaza into a place that is already  unlivable. And we have to act as a body to do everything we can to end  this war.\n\nNow, the objection that my colleague made is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and visiting Kikue, who was there  taking care of her mother, that I learned that she was a ``survivor'';  ``Hibakusha,'' that is the Japanese word for survivor, of the atom  bomb.\n\nShe lived in the outskirts of Hiroshima. If you have been there, it  is mountainous. It is a place, a delta, with five different rivers  converging, and she lived in the outskirts.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…against Iran that the President began  last weekend, there was no imminent threat against the United States.  There was no Army marching in this Nation. There was no nuclear bomb  that even existed that could be dropped on the United States or our  soldiers in the region.\n\nSo it was required--it is required under the Constitution--that the  President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Elon Musk--where are we at here on the timeframe here? This was  actually shortly before I came to the floor this afternoon.\n\nElon Musk tweets: ``Time to drop the really big bomb:  @realDonaldTrump is in the Epstein files. That is the real reason they  have not been made public.''\n\nThen he cheerfully says: ``Have a nice day, DJT!''\n\nWe all know what…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…DOGGETT. Mr. Speaker, Speaker Johnson calls our soaring national  debt the ``number one threat'' to our Nation. The Republican Senate  leader says that it is a ``ticking time bomb'' just before he lights  the fuse with this sorry resolution that hikes the debt by $6 trillion.\n\nThe independent Committee for a Responsible Federal Budget urges us  to reject…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689897/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…gun. They have properly decided that we should not put more machine  guns into the stream of commerce.\n\nWhat is still swept within it? Any explosive, incendiary, poison gas,  bomb, grenade, rocket, missile having explosive or incendiary charge of  more than \\1/4\\ ounce, mine, device, and so on.\n\nWhy would we open this up if that is not the intention of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…significant amount  of 60-  percent-enriched uranium--more than the 3 percent to 5 percent that is  utilized for civilian energy--it was still not enriched to the level to  build a bomb. It would have had to be enriched to 90 percent. It would  have had to be converted to metallic form. It would have had to be  arranged with an extensive system of explosives…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…movie ``A House of Dynamite'' as well as  ``Oppenheimer'' the previous year, which introduced a lot of people in  the moviegoing world to the development of our first atomic bomb at the  Manhattan Project.\n\nIt is very important that we go from popular culture to real history  and talk about this in terms of the destruction that will occur if we  do not…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…administration because we  must hold these groups accountable for their war crimes. We must  support them in ending the violence.\n\nRight now, both sides in the war continue to bomb, to raid, to siege  schools, markets, and hospitals. The Sudanese Armed Forces are  intentionally denying humanitarian aid. They are blocking medicine and  other relief items.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…pipe dream. Reagan and Gorbachev also did it. South Africa unilaterally  dismantled their arsenal. Other countries have stopped developing  nuclear weapons before they got the bomb.\n\nIt is possible to disarm, and it is possible to abolish nuclear  weapons. We only need the political will, and we need the urgency.\n\nFinally, Mr. Speaker, you will note that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…begin to  dissipate. If there is any hope in such a dark prognosis, it might be  that such a reality could, in turn, ignite a worldwide anti-nuclear  movement like the Ban the Bomb campaigns of the 1960s, 1970s, and  1980s.''\n\nWe have a path out of this. Trump can make good on his statement that  there is no need for new nuclear weapons. He can extend…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Americans like December 7, 1941, Pearl Harbor Day.\n\nOn October 7, 2 years ago, Israel experienced a surprise attack from  Hamas. As those under attack rushed to safe rooms and to bomb shelters,  the terrorist group infiltrating the country began firing on homes and  killing Israelis at random.\n\nThose who have seen the footage of the attacks--in many cases,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…us.\n\nIn 1979, they took American citizens hostage and paraded them out on  the news day after day after day until President Reagan secured their  release.\n\nIn 1983, a suicide bomb in Beirut, paid for by the Iranians, killed  63 people, including 17 Americans. In 1983, later that year, we all  know they blew up our barracks with our marines, killing 241…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…activities along the railway system until the  end of the war. He served in the North Apennines, Central Europe and Po  Valley campaigns.\n\nLt. Col. Wagamon served in the 6th Bomb Group, 313th Bombardment  Wing, 340th Bombardment Group, 486th Bombardment Squadron earning; the  Air Medal, European-Africa-Middle Eastern Campaign Medal with 4 Bronze  Battle…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, also last week, an Afghan evacuee was  arrested for threatening to bomb a building in Texas. The terrorists  entered our country as part of a program called Operation Allies  Welcome in the aftermath of the Biden administration's chaotic  withdrawal…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}, {"senator": "James Risch", "party": "Republican", "sentence": "…violations of Iran's  nuclear commitments. These actions confirmed what we have known all  along: The Iran nuclear program is not civilian, as they claim; it is  the pursuit of a bomb to destroy Israel and threaten U.S. national  security interests in the region.\n\nThe international community must not tolerate this activity any  longer. The decision to initiate…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…to           Section 36(b)(1) of the Arms Export Control Act                             Annex Item No. vii\n\n(vii) Sensitivity of Technology:\n\n1. The GBU-39/B Small Diameter Bomb Increment I (SDB-I) All       Up Round (AUR) is a 250-pound GPS-aided munition with precise       positioning services provided by Selective Availability Anti-      Spoofing…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697584/arms-sales-notification"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…If you don't think this is our concern, look what they have done.  They have attacked Americans. They have American blood on their hands.  They are trying to build a nuclear bomb, and one of their targets is  us. How do I know that? Because that is what they say.\n\nLast July, they were chanting, ``Death to America'' while they were  swearing in their…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…carefully calculated time, much  like what he did with General Soleimani in his first term that was so  successful.\n\nThe strike on Iran was a single, brief strike at three nuclear bomb  facilities that ended the conflict between Israel and Iran. It was on  behalf of a close ally, Israel, and on behalf of the world, which is  unanimously against Iran obtaining…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the Biden-Harris SBA sought to implement a new  certification portal. Unfortunately, this portal's lackluster planning,  creation, and rollout left the SBA with a ticking time bomb.\n\nThe Biden administration's failed Unified Certification Portal  rollout resulted in delays, errors, and cybersecurity risks, shutting  out small businesses from vital government…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…war. You have to realize this is an important part  of the debate because, if it is a drug bust, it is not a war. So they  told us this is really just a drug bust. We had to bomb the entire  capital. We had to remove all their air defenses. We have an armada of  20,000 ships and hundreds of airplanes flown from all over the world,  but it really was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Appropriations Committee will take to restore strong, responsible  governance under the golden age of the Trump administration.\n\nJust this past weekend, Missouri's own 509th Bomb Wing and the 131st  Guard Wing of Whiteman Air Force Base in my district demonstrated the  vital role that our B-2 long-range strike force plays in preserving  national and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…if you are in Oklahoma, you  already know the rest of this story, but I would like to be able to  tell this body the rest of that story.\n\nOn April 19, 1995, when that truck bomb explosion took place, it took  168 lives. It destroyed the Alfred P. Murrah Federal Building. Across  the street was  the Journal Record Building; it just demolished a big section…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Purchase:\n\nMajor Defense Equipment (MDE):\n\nThree thousand eight hundred forty-five (3,845) KMU-558B/B       Joint Direct Attack Munition (JDAM) guidance kits for the       BLU-109 bomb body.\n\nThree thousand two hundred eighty (3,280) KMU-572 F/B JDAM       guidance kits for the MK 82 bomb body.\n\nNon-Major Defense Equipment: The following non-MDE items…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…it because it leads to dislocation. No, it led to the  Embassy being in Jerusalem, and it led to the Abraham Accords.\n\nWe know that last week the President was advised not to bomb Iran,  that it would lead to World War III. No, it has led to a cease-fire and  the ability to have the Abraham Accords extended to other countries,  including Syria.\n\nI am…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…entire program is required. The above notification       requirements are combined as follows:\n\nMajor Defense Equipment (MDE):\n\nOne-hundred-twenty (120) GBU-39 Small Diameter Bomb-      Increment I (SDB-I) all-up-rounds (AURs).\n\nTwenty-eight (28) GBU-53 SDB-IIs (AURs).\n\nThirty (30) KMU-556 Joint Direct Attack Munition (JDAM)       tail kits for GBU-31.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}]