[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…would force every state to hand over their voter rolls to the  Department of Homeland Security, so that Kristi Noem can purge voters  at will. Just weeks ago, Attorney General Bondi attempted to blackmail  the state of Minnesota with a similar proposition--hand over the voter  rolls and the ICE surge would end. Now, Republicans in the House are  aiming…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…even need a vote. He continues to defy the subpoena  of the Committee on Oversight and Government Reform to release all the  files. What is Donald Trump hiding? What is Pam Bondi, the Attorney  General, hiding? Why won't they release the Epstein files right now?\n\nHe must explain to the public why he moved sex trafficker and monster  Ghislaine Maxwell…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696810/epstein-files-transparency-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…prosecutors; that they will, in  effect, rig the system in his favor, as Mr. Bove has done while  representing, supposedly, the Department of Justice because he was-- like Pam Bondi and others who have taken senior positions--a lawyer, in  fact, for President Trump, his personal lawyer, defending him against  claims in his personal capacity before he took…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…the bipartisan House Abraham  Accords Caucus was privileged to host Rabbi Yehoram Ulman and Ahmed al- Ahmed, of Sydney, Australia, and survivors of the terrorist attack at  Bondi Beach last month.\n\nWhen a father-and-son pair of ISIS-inspired gunmen began massacring  Jews during a Hanukkah celebration on the beach--murdering 15 people,  including Rabbi…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…speak, the U.S. Department of Justice has files detailing the  names of those connected to Mr. Jeffrey Epstein. It has been widely  reported that in May our Attorney General Pam Bondi informed President  Trump that his name appears in the Epstein files.\n\nBut, to be clear, just because a name is listed in the Epstein files  doesn't mean that that person was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…administration's flood of illegal actions. That is  why I rise today in opposition to this bill.\n\nMr. Speaker, I include in the Record an April 2, 2025, letter  addressed to Pam Bondi from 500 law firms and lawyers across the  Nation.                                                      April 2, 2025.      Hon. Pamela Bondi,      Attorney General of the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…at the time. Since that incident, the Bureau of Alcohol,       Tobacco, Firearms, and Explosives issued a regulation, upheld       by the United States Supreme Court in Bondi v. Vanderstock,       to require background checks and serial numbers on unfinished       frames and receivers and on some weapons parts kits. But only       firearms frames…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…example, I have sent letters to the law firms that acquiesced to  the Trump administration and the Florida bar for the apparently  unscrupulous ethical behavior of Attorney General Bondi.\n\nWe have seen them go after higher education. We need to stand up and  fight back right now. Donald Trump has weaponized the Federal  Government to go after Columbia, for…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…said: ``Make sure the American public knows the full  weight of what happened.''\n\nHe said that he would do that. That was his quote.\n\nNow, in February, Attorney General Pam Bondi told FOX News that  Epstein's client list is: ``Sitting on my desk right now to review.''\n\nNow, they claim there was never a list. This weekend, Donald Trump  claimed that…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…resolution tonight.\n\nNow, the President is paying attention--not just because his favorite  Congressman   Thomas Massie is involved--and he directs the Attorney  General Pam Bondi to ask the courts to release the grand jury  testimony.\n\nHere is the problem: The grand jury testimony is largely about  Epstein and Maxwell, not about all the rich and powerful…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693720/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…by Jeffrey Epstein, a  sex offender and financier with whom the President often socialized.\n\nFor years, the President and those in his orbit, including Attorney  General Pam Bondi and FBI Director Kash Patel, alleged that prior  administrations had covered up the identities of the rich and powerful  people to whom Epstein had trafficked the girls and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…country will take another look at  their gun safety laws and see where they can make improvements. If  Australia can find the courage to act after a tragedy like the one at  Bondi Beach, Congress should certainly find the will to act after a  tragedy like the one at Brown University.\n\nFor the sake of those who were killed this weekend and for the sake…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Georgia Secretary of State to find 11,780 ballots so that he can win,  even though he lost, and that is on tape.\n\nThey are losing faith in our elections because they saw Pam Bondi  trying to shake down Minnesota's State government, saying the  administration would only withdraw ICE if Minnesota handed over their  voter rolls to Trump's DOJ. They are…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "Mr. LIEU. Mr. Speaker, in February of this year, Attorney General Pam  Bondi went on national TV and told the American people that Jeffrey  Epstein's client list was ``sitting on my desk right now.''\n\nWhy won't she release that client list?\n\nWhy won't…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694127/release-the-epstein-files"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…been reflecting on this lesson in the  wake of the two awful acts of violence that took place this past  weekend.\n\nOn Sunday night, in Australia, hundreds of people gathered at Bondi  Beach to celebrate the first night of Hanukkah. Two men opened fire on  the crowd. The attendees at Bondi Beach were targeted for simply one  reason: They were Jewish, and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…noncitizens under  the age of 14 to combat the horrific practice called child recycling.\n\nJust this week, I also sent a letter to FBI Director Kash Patel and  Attorney General Pam Bondi requesting that they release the complete,  unredacted flight logs from Jeffery Epstein's private jet.\n\nIn addition, I also requested Ghislaine Maxwell's little black book…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…administration. This isn't a scandal the Times would  like to create. The Justice Department and the FBI have an obligation  to respond to congressional inquiries.\n\nTo Attorney General Bondi's and FBI Director Patel's credit, they  have done better in that regard than any of their predecessors of  Republican Presidents and Democrat Presidents. Now, am I fully…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I have asked Attorney General  Pam Bondi to open an investigation into the  FireAid concert that took place in the aftermath of the devastating Los  Angeles fires.\n\nWhat we have learned has happened is absolutely…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694134/investigation-into-the-fireaid-concert-in-los-angeles"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…registration of the tax paid on a firearm when there is  no tax.\n\nLast month, on Veterans Day, I led 30 of my House Republican  colleagues in sending a letter to Attorney General Pam Bondi to  reaffirm congressional intent behind the zeroing out of the NFA tax  provision in the One Big Beautiful Bill Act, as well as to urge that  the DOJ adopt this position in…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…assault, and  homicide. They also have located more than 120 missing children and  have recovered 970 illegal firearms and 560 stolen vehicles.\n\nWith President Trump and AG Bondi and Kash Patel, and the commitment  that they have made to Memphis, this is what you are seeing. Criminals  are being apprehended, and the citizens in Memphis feel safe to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Congress of the United States,                                        House of Representatives,                                  Washington, DC, December 10, 2025.      Hon. Pam Bondi,      Attorney General, Department of Justice,      Washington, DC.      Hon. Dan Driscoll,      Acting Director, Bureau of Alcohol, Tobacco, Firearms and           Explosives,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…announced, I made the statement that I will  take this allegation seriously. But I am concerned that it comes from  someone without consultation with Big DOJ. I don't think Pam Bondi or  any of the senior people in the DOJ knew anything about it. Without  consultation with the White House, they decided to pursue this  investigation.\n\nSo they put me in an…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "John Rose", "party": "Republican", "sentence": "…between the Senate payday or  reopening the government.\n\nLet me be very clear. I support real accountability. Last October, I  signed onto a letter urging Attorney General Pam Bondi to launch a  criminal investigation into the activities of Special Counsel Jack  Smith and to consider possible Fourth Amendment violations during  Operation Arctic Frost.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…of  foreign nationals voting in our elections threaten the bedrock of our  democratic Republic. All of us should be thankful to the Department of  Justice, Attorney General Bondi, FBI Director Patel, and DOGE that they  identified and eliminated this violation of the sanctity of our  elections process.\n\nThe Department of Labor and the Department of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. Mr. Speaker, I have sent a letter along with  several of my colleagues in the California delegation to Secretary of  Education Linda McMahon and Attorney General Pam Bondi asking them to  investigate a simple question: Why is it so stunningly easy to commit  fraud against the State of California?\n\nDuring the COVID era, we saw fraud unlike we…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]