[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and figurative--tested Terrell County. People could depend upon  him. When difficult choices had to be made, neighbors sought his  counsel because they knew his word was his bond. He earned the respect  of fellow law enforcement officers across counties, and he carried  himself with a dignity that reflected both his personal faith and his  commitment…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…the best on his retirement.\n\nHis decades of service in patrol, community policing, and the  detective bureau allowed him to build invaluable relationships and  strengthen the bond between the police department and the Cranford  community.\n\nThat was demonstrated in profound ways, particularly during his son  Nicholas' battle with leukemia. Cranford Police…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699515/congratulating-lieutenant-john-swandrak"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, the stock market is decimated, almost 20  percent down, entering bear territory. At the same time, bond yields  are skyrocketing, meaning ordinary Americans are going to have higher  interest rates on their credit cards and their mortgages. It means we  are going to have to pay…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…but he believed in the American  Dream. He raised my grandfather, Sam, on that farm.\n\nMy grandfather, Sam, was an economic patriot. He really believed that  your word is your bond. He believed that hustle was the name of the  game. He milked cows, bailed hay, and got his start as a businessman  selling airplane rides at the Nashua Airport. His slogan…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…modernize the hospital for bioterrorism and mass  casualty incidents; leading multiple public election campaigns for  property tax levy approval; securing approval of multiple bond issues  for capital improvements on two hospital campuses; supporting the  Hospital Hill property acquisition efforts and urban renewal  attainment; securing numerous Affordable…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…know not many  tourists bring bear spray and whips to the Capitol. The man who  attacked him was also a fugitive from justice at the time he came here.  He had been released on bond from Texas. He was a 32-year-old man, and  he was charged with online solicitation of a minor.\n\nFortunately, it was an undercover officer posing as a 15-year-old  girl, but…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…him with the blood for  the 17 transfusions that kept him alive.\n\nAANHPI history and Black history are inextricably tied together and,  in the case of Senator Inouye, a blood bond uniting our two communities  together.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688016/aanhpi-history-and-black-history-bonded-together"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…would lose access to food stamps, and just how many consumer watchdogs  they would fire at the Consumer Financial Protection Bureau. It doesn't  matter that the United States bond ratings were downgraded, that  foreign investors are dumping U.S. investments, or that small  businesses are struggling to keep their lights on.\n\nNo, Republicans are instead…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…spending committee, not in a partisan special  bill, one-sided, basically bailing on the deal struck last year-- because this strategy is a recipe for disaster, destroying the bond of  trust on a deal made with each side having its priorities in a bill and  then one side bailing on it--because of that, it has never happened  before, and it should never…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…suites, we should  not defund the police. We don't defund the men and women in blue, and  we don't defund the Securities and Exchange Commission that oversees  the stock and bond markets.\n\nThe SEC has a budget of $2 billion. It secured over $3.2 billion in  fines, in effect, to those on Wall Street that did the wrong thing. It  more than paid for itself…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…you carried 66 out of 67 counties, clearly             many favored you to be strong      While we pages sprint through halls, trying not to get in             trouble with no bond       Late nights are long, senators congregate like they're in             frats      While the Parliamentarian and Journal Clerk chat.      And before you I stand, in my shoes,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Fennessy, who, after 8 years as chief, will be  retiring.\n\nWhile at Orange County Fire Authority, Chief Fennessy led the  department through the COVID-19 pandemic and through the Bond,  Silverado, and Blue Ridge fires. He was named by the Orange County  Register as one of the most influential individuals in Orange County in  2020.\n\nAfter his retirement, Chief…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Service Officer, retired; Anne Bodine, Senior Foreign       Service Officer, retired; Avis Bohlen, US Ambassador,       retired, Former Assistant Secretary of State; Michele Bond,       US Ambassador, retired, Former Assistant Secretary of State;       Paul L. Boyd, Senior Foreign Service Officer, retired.\n\nAurelia Brazeal, US Ambassador, retired; Sue…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…stocks while in office, it  fuels distrust, undermines public confidence, and casts a shadow over  the work of this institution. Even the perception of impropriety  weakens the bond between the government and the governed.\n\nMembers of Congress have unparalleled access to market-moving  information and the ability to shape laws and regulations that can…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691223/stock-trading-ban-for-members-of-congress"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…O'Leary, South Lakes High       School\n\nFounders Lifetime Achievement Award: Dr. Dennis Humphrey,       PhD\n\nOmega Man of the Year: Sanford Crenshaw\n\nSuperior Service Award: Brian Bond\n\nService Pins: Gerald Hamilton, 55 Years; Howard Foard Jr.,       50 Years; Gerald Curry, 45 Years; Robert Drummer, 40 Years;       Julius Reynolds, 40 years; Earl Smith Jr.,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Board, and the  Planning and Zoning Committee. Additionally, he is a member of the  Board of Directors for the Williamson County Appraisal Board, where he  also chaired the Bond Oversight Committee. Driven by a passion for  service, Commander Lux was a founding member of American Legion Post  911 in Cedar Park, raising funds for the Gold Star Monument…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the week before that Members come behind  these mikes and talk to you about the real issues that will change this  Republic, or have we just decided we are going to let the bond market  basically run this country, and we are going to just keep pretending we  can keep spending like this?\n\nMuch of that spending is not Democrat policy, Republican policy.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$2.1  trillion will just be interest. The majority of future deficits are  actually interest.\n\nInterest and healthcare are the primary drivers of U.S. sovereign  debt. Will the bond market continue to finance this?\n\nWhat happens when one of your greatest solutions is: Can we actually  have honest conversations about healthcare costs? Are we willing to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…debt because they  are having to finance their own governments.\n\nYou start to look at our interest payments, and there is this concept  called a term premium. When we make the bond markets nervous, we pay  higher interest rates. So the clown show will go around and say: Well,  let's just not pay our debts. Hey, we are up against the debt ceiling.  Let's…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ratings than we do. It is just an  interesting thought experiment. How about if I told you that, I think  it is as of yesterday, either 12 or 13 countries can sell a 10-year  bond cheaper than the United States. Greece today can sell a 10-year  bond cheaper than the United States.\n\nIf any of you are paying attention, remember there is this concept of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to walk away until they get serious.\n\nThere are real things going on in the world. Here is an article from  the other day. I have a small stack of these. It is talking about bond  markets and debt markets and others starting to unload U.S. debt.\n\nMr. Speaker, today, if you are a geek and are watching the 10-year  bond--I was watching it over a period…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…News; Gibson, Brittany: Axios;       Gillison, Douglas: Thomson Reuters; Gillum, Jack: Wall Street       Journal/Dow Jones; Givhan, Robin: Washington Post; Glazier,       Kyle: Bond Buyer; Glebova, Diana: New York Post; Glenn,       Michael: Washington Times; Goba, Kadia: Washington Post;       Gold, Ashley: Axios; Gold, Michael: New York Times; Golden,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…horrors of the Bataan Death March, and, together, we fought to liberate  the islands from Japanese occupation.\n\nGeneral MacArthur's famous return symbolized the unbreakable bond  between our peoples. That history of fighting shoulder to shoulder  lives on today in our mutual defense treaty, in Exercise Balikatan, the  largest annual exercise that we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…mortgage, trying to  get a car loan, trying to see what your credit card interest rates are  going to be.\n\nThink of this, in the last 12 months, half of all the debt in the  U.S. bond markets, half of it has just been the United States Federal  Government. Your school district, the company that wants to expand, all  the bond market that is supposed to be…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…new mothers who are taking the journey of parenthood. These  centers are a pillar for nearly 2 million families every year, making  it easier to provide and foster a loving bond throughout communities  just like mine in North Carolina.\n\nNo longer will political discrimination keep compassion at the  doorway. No longer will bureaucrats in Washington…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699217/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…integrity and courage. His work alongside local law enforcement in  Evans County demonstrated steadfast support during critical  investigations and helped to strengthen the bond between State and  local public safety partners. His commitment to protecting families and  upholding the rule of law reflects a deep sense of duty to his  neighbors and fellow…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…money from was actually a pretty  good interest rate. That is internal borrowing.\n\nThen, there is the public borrowing. These are the options. This is  the note, T bill, or bond that is in a retirement account. Another  country may buy it to hold in their version of their Federal Reserve.\n\nRemember, China is not our number one buyer of our debt. As…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…vote for that bill when it  comes back. That needs to be said, and it needs to be clear.\n\nThe fact of the matter is our country is hanging on by a very thin  fiscal thread. The bond markets are recognizing this. There was a  headline in the Financial Times today that foreign markets are starting  to pull out of Federal treasuries. Interest rates are doing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$6 billion a day, what  happens in a world where you actually--the liquidity of the debt  markets.\n\nI grabbed an article that was in one of my--I think it was in one of  my bond publications because I have some weird reading habits. ``Japan  prepared to use its role as America's largest creditor as leverage in  Trump's trade talks.'' The point I want…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this ping-pong back and forth--they are in  charge, we are in charge, we are in charge, they are in charge--and we  will blame each other. Then we are going to have a failed bond auction,  and interest rates are going to explode.\n\nRemember, there are datasets--I presented them here on the floor-- that just a single point of interest going up over the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]