[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Opportunity Act,  has affirmed America's commitment to expanding economic opportunity,  creating jobs, strengthening strategic partnerships, and forging  mutually beneficial economic bonds between the United States and our  allies in sub-Saharan Africa.\n\nSince its enactment in 2000, AGOA has provided duty-free access to  the U.S. market for a broad range of goods…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…protects profits. The effort to roll back bail reform is a       handout to the for-profit bail industry, which thrives on the       desperation of working families. Bail bonds function like       predatory payday loans: families must pay a nonrefundable fee       to a bail bondsman, money they never get back--even if       charges are dropped. This…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…with Ambassador Rudd on some of the most pressing challenges of our  time.\n\nWith his departure, we are going to bid farewell to a statesman whose  tenure has strengthened the bonds between Australia and the United  States and upheld the values we share.\n\nFrom the day Ambassador Rudd arrived in Washington on March 2023, he  proved to be a driving force…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Ben  Franklin Room, and Vice President Al Gore welcomed him at a breakfast  at the Vice President's Residence.\n\nThese visits remind us of the enduring spiritual and cultural bonds  between the Ecumenical Patriarchate and the United States. As we  prepare to welcome His All-Holiness once again, we recognize not just  the leader of a faith, but a global…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…mark-up, especially in       light that the Committee will not hold public hearings on       these measures.            Sincerely,\n\nChairman Phil Mendelson; Councilmember Anita Bonds, At-      Large; Councilmember Robert White, Jr., At-Large;       Councilmember       Brook Pinto, Ward 2; Councilmember Janeese Lewis George, Ward       4; Councilmember Charles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…you       on our shared goals to advance the safety, security, and       prosperity of the District.            Sincerely,      Phil Mendelson,\n\nChairman, At-Large.      Anita Bonds,\n\nCouncilmember,\n\nAt-Large.      Robert C. White,\n\nCouncilmember,\n\nAt-Large.      Brooke Pinto,\n\nCouncilmember,\n\nWard 2.      Kenyan R. McDuffie,\n\nChair Pro-Tempore,\n\nAt-Large.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…pride and reverence. They view his presence  here as an opportunity to celebrate the rich spiritual and cultural  heritage of Orthodox Christianity and to reaffirm the strong bonds  between the United States and the Ecumenical Patriarchate.\n\nIt is my honor to welcome His All-Holiness to our Nation's capital  and to recognize his tireless efforts in promoting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695495/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…support of the United States for the sovereignty and territorial  integrity of Ukraine in the face of the illegal invasion of its  territory by the Russian Federation and the bonds of friendship and  shared values between the people of the United States and allied  fighting forces.\n\nNow, by any measure of military success, Ukraine has done the  impossible.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…mark-up, especially in       light that the Committee will not hold public hearings on       these measures.            Sincerely,\n\nChairman Phil Mendelson; Councilmember Anita Bonds, At-      Large; Councilmember Robert White, Jr., At-Large;       Councilmember Brooke Pinto, Ward 2; Councilmember Janeese       Lewis George, Ward 4; Councilmember Charles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is a process that has been in place and that will be honored. They  invest in this country also because they know that your money is safe  here. You invest in our bills, our bonds. It is safe.\n\nWe have stability except when you do as the President has just done,  and that is tariff some 90 countries and do it in such a way as to  cause people to start…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…are calculated annually. When the government runs a deficit in  any given year, it must borrow money to cover the shortfall. This is  done primarily through issuing government bonds. Additionally, we  borrow from intragovernmental sources such as the Social Security Trust  Fund, which must eventually be repaid in order to fund Social Security  benefits.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Committee       will not hold public hearings on these measures.            Sincerely,\n\nChairman Phil Mendelson; Councilmember Kenyan McDuffie, At-      Large; Councilmember Anita Bonds, At-Large; Councilmember       Christina Henderson, At-Large; Councilmember Robert White,       Jr., At-Large; Councilmember Brianne Nadeau, Ward 1;       Councilmember Brooke…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…enduring engagement  between the Hawaii National Guard and the Philippine armed forces has  advanced the strategic goals of a free and open Indo-Pacific and  strengthened the bonds between our two great nations.\n\nLet us honor this important milestone not just as a celebration of  the past but also as a reaffirmation of our shared future. I look  forward…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…mark-up, especially in       light that the Committee will not hold public hearings on       these measures.            Sincerely,\n\nChairman Phil Mendleson; Councilmember Anita Bonds, At-      Large; Councilmember Robert White, Jr., At-Large;       Councilmember Brooke Pinto, Ward 2; Councilmember Janeese       Lewis George, Ward 4; Councilmember Charles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…mark-up, especially in       light that the Committee will not hold public hearings on       these measures.            Sincerely,\n\nChairman Phil Mendelson; Councilmember Anita Bonds, At-      Large; Councilmember Robert White, Jr.; Councilmember Brooke       Pinto, Ward 2; Councilmember Janeese Lewis George, Ward 4;       Councilmember Charles Allen, Ward…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…to be organized within the State of  North Carolina.\n\nMr. Speaker, this club is more than just about gardening. It is about  fostering pride in the community, strengthening bonds of fellowship  between people, and upholding tradition.\n\nThis club is a shining example of the best that North Carolina has to  offer. Its 100-year history is a testament to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688345/recognizing-leakesville-garden-clubs-centennial"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…guidance and encouragement to young  entrepreneurs, fellow business owners, and civic leaders. His ability  to bring people together for a common cause has strengthened the bonds  within Brooksville, fostering collaboration and goodwill among diverse  groups of residents.\n\nAbove all, Casey Thieryung exemplifies what it means to be a Local  Hero--not…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…significant  contributions to projects that directly support veterans, law  enforcement officers, first responders, and their families, improving  lives and strengthening the bonds of community.\n\nChristopher Aaron McGowen embodies the highest ideals of service,  both in uniform and as a citizen leader. His legacy is one of valor,  compassion, and unwavering…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…faith to  transcend borders.\n\nAs a Catholic, I am deeply moved by the ties between our churches.  His All-Holiness has met with Popes across generations, working to  strengthen bonds of unity and to advance the cause of peace. Together,  they have spoken with one voice: to defend the weak, serve those in  need, and pursue reconciliation among nations. Patriarch…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are refinancing. We have $30 trillion out there we have to  bring to market over the next few years. I think this year refinance  was going to be about $11 trillion. That is bonds, notes, and paper  that come due, plus another $2 trillion probably in virgin. That is new  issuances. They are subject to the higher interest rates today than we  had 5 years…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…charts because they  are exhausting, but if you take a look at interest, remember that we  have to refinance $10 trillion or maybe $11 trillion this year. That  means that the bonds that were sold in the past have to come back to  market, refinance, and they are being refinanced, for many of them, at  much higher interest rates.\n\nThe other thing is healthcare,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…has  been a vital part of our religious and cultural life. Families in  Greenville and Spartanburg have shared their faith and traditions for  generations, strengthening the bonds of community and enriching the  fabric of our state.\n\nOn behalf of my constituents in South Carolina's 4th District,  including the faithful at St. Nicholas Greek Orthodox…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…using our money that I think the  majority of Americans would reject. If now is not the time, I don't  know when is. It will be too late when the investors stop buying our  bonds and everything comes to a dead halt in America. We can't let that  happen.\n\nMr. Chair, these earmarks are against every conservative value that  is known. The intent of these…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthier with much less morbid  obesity, there would be healthcare systems that would go bankrupt  because they wouldn't have enough multi-chronic sick people to pay  their bonds. Think about that.\n\nEverything is about the money here, not about the morality of having  a society that is growing and prospering. Prosperity, I would argue,  Mr. Speaker,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…first responders, and rescue animals, offering a sanctuary  where pain met purpose and isolation gave way to hope.\n\nThrough Lois' tireless dedication, lives were transformed and bonds  were forged between heroes and horses. As the farm prepares to close on  July 31, we reflect not with sorrow but with deep gratitude. The legacy  of New Freedom Farm will…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this.  Other countries don't do this.\n\nHere is $30 trillion that we have to go to public markets. People  from all over the world, primarily from the United States, buy our  bonds. It is in your pension. It is in the bank note you buy. There are  another several trillion that are actually borrowed internally. It is  not magic money. We still owe the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…judge's ability to release these violent criminals. It would require  judges to hold anyone charged with a violent crime before trial, and it  would impose cash bail or bail bonds on anyone charged with a range of  public safety or law-and-order offenses.\n\nThis is a smart and long overdue reform that rectifies the ill- conceived policies currently enacted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…almost $6.5 billion a  day is what we borrow.\n\nYou don't need to actually pay real detailed attention to this, but  what I am trying to show is the average maturities on our bonds and  that they have to be refinanced. Every quarter, this is what is coming  to market and the fact that we are moving away from much lower interest  rates to much higher interest…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this, but we don't have a choice. Is anyone else at  least at all freaked out a little bit looking at what is happening  around the world right now, what is happening to French bonds, British  bonds, Japanese yields on the long end of the curve? When you see the  long end of the curve going up and up, that lets you know the entire  world is getting really…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…could borrow forever. At what point are  there no more services, purchases, government helping our brothers and  sisters because it is all covering the interest costs on the bonds?\n\nSo let's say--I think you are a little insane--you believe we can  just borrow forever, you are a monetarist, but even the fragility in  the monetarists, you saw in the previous…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}]