[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…leading with a sensible proposal to lower  deficits.\n\nIf you care about debt in this country, if you care about our  grandkids  being burdened with debt, if you care about a bond market devastation,  then you need to recognize that this bill hurts America, and you need  to support the Democratic plan for deficit reduction.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693228/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…continue raising capital efficiently, allowing it to direct  resources that are needed the most.\n\nThis is needed because in April 2018, the IDA began issuing  securities on the bond market which are also distributed in the United  States. These securities are not exempted from the SEC's registration  and regulatory framework.\n\nCongress passed legislation in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…really want the debt markets to think we are acting like adults.\n\nIn many ways, when you look at these charts and you see our interest  coverage and how fragile we are, the bond market basically may be the  greatest influence on this government.\n\nHowever, how many people have you seen come behind these microphones  and talk about debt?\n\nYet, the one thing…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion will just be interest. The majority of future deficits are  actually interest.\n\nInterest and healthcare are the primary drivers of U.S. sovereign  debt. Will the bond market continue to finance this?\n\nWhat happens when one of your greatest solutions is: Can we actually  have honest conversations about healthcare costs? Are we willing to  legalize…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the week before that Members come behind  these mikes and talk to you about the real issues that will change this  Republic, or have we just decided we are going to let the bond market  basically run this country, and we are going to just keep pretending we  can keep spending like this?\n\nMuch of that spending is not Democrat policy, Republican policy.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion dollars in additional interest over  the next 10 years.\n\nLook, no one needs another speech from me doing interest rate  fragility, but the fact of the matter is the bond market is on the cusp  of running this country, except that is really hard to explain to our  voters. If you are a Democrat, you don't want to explain that because  you want to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Sometimes I am worried there is not even  14--if you ever have a curiosity, if you really care about saving the  Republic, I would argue what takes us down is potentially the bond  market. If we keep borrowing like this, the bond market is going to  start running this country.\n\nGo to the Joint Economic Committee Republicans' website. We put out  some amazing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bleed.\n\nUnderstand a basic principle, Mr. Speaker: At this rate of borrowing,  when you are clicking off $1 trillion in just 4 months, 5 months, then  you have decided the bond market, basically, is the most powerful  organization in ruling your country. It is not us as policymakers. It  is not the White House. It is the bond market because if you do…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of all the debt in the  U.S. bond markets, half of it has just been the United States Federal  Government. Your school district, the company that wants to expand, all  the bond market that is supposed to be helping finance the growth of  this society, this country, half of it now is just the Federal  Government, and it is going to get worse.\n\nI am giving…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…really unhappy because we are capable of doing more. And if we don't  start to telegraph to the bond markets we are going to do something  serious, at what moment does the bond market say: Screw these people.  They are just not serious. They are consuming the world's capital.  Let's charge them more.\n\nMr. Speaker, do you really think the United States…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…with their debt, but they can sell a bond for about 50  basis points cheaper than we can.\n\nGreece is actually about 70 basis points cheaper. When Greece takes a  10-year bond to market, it is a substantially lower interest rate than  the United States. If we look at the credit rating of what people are  willing to buy the debt for, all of these countries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…model.\n\nYesterday, on CNBC, Eric Cantor was, in many ways, almost mocking us.  He is a former majority leader here. Now, he is on Wall Street. He  said: Do we really think the bond market isn't going to notice if we  just do this pretend thing and say let's call this thing current  policy, so we will keep the current tax regime. Yes, it means financing  another…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…matter is, we are at what is called interest fragility  that--think about what happened over the last couple days in the  discussions coming from the White House, from us. The bond market  actually bounced up about 30 basis points. We were just playing on the  back of napkins, the math, and if that had held for an entire year,  just those 30 basis points…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}]