[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…our  clean energy capacity where possible.\n\nThe legislation will help power thousands of homes with affordable,  reliable energy, support the creation of good-paying jobs, and boost  local economy all while reinforcing our commitment to energy  independence.\n\nImportantly, this bill ensures that the Colorado River Indian Tribes  and the Tribal Historic…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693917/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…weaken energy and water conservation measures that help people  save money. We don't need to make life more expensive for hardworking  neighbors back home. We don't need to boost foreign manufacturers who  want to import inferior products to the U.S., but that is what they are  doing.\n\nNo, in 2026 we are going to need real solutions. I beseech my  colleagues…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Trump's request for hundreds of millions of dollars to support his  dangerous efforts to deploy our military against our citizens.\n\nThis bill also includes a much-needed pay boost for our  servicemembers and vets. It invests in critical infrastructure and  repairs at bases across our country, including at the Puget Sound Naval  Shipyard.\n\nLastly, the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the President of the United States isn't  having a showroom on the White House lawn for all electric vehicles,  not just for Elon Musk's Tesla. Why not provide that kind of boost and  elevation for electric vehicles generally? And the car manufacturers  would bet on cleaner cars if they were given the true cost and enabled  to enjoy the true benefits…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…should be  expended.\n\nIf the Trump administration can send $40 billion off to Argentina to  buy foreign beef that hurts Ohio cattlemen, they ought to restore this  support to boost U.S. factories, companies, and new jobs here at home.\n\nThis is simply unbelievable.\n\nBy the way, the U.S. Commerce Department Secretary is a Wall Street  magnate. He doesn't…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698082/funding-manufacturing-extension-partnership-offices"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…restrictions, the suspension of new offshore wind leasing and       a crackdown on permitting for onshore wind and solar projects       on federal land.\n\nPresident Trump has vowed to boost the oil-and-gas       industry, in part by cutting support for renewable-energy and       emissions-reduction initiatives. A key factor in the U.S.       downgrade was the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…been a leader in IFIs like the World Bank.  Our leadership in these institutions provides us with a strong voice to  improve global economic stability, decrease poverty, and boost  prosperity.\n\nThrough our membership, we advocate for high standards, push for  transparency, and drive economic reforms that benefit not only  developing nations but our own…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…electricity prices lower.  All of that is a recipe for skyrocketing electricity bills.\n\nWhat do Republicans in Congress do? They keep bringing these random  bills to the floor to boost the profits of polluters. This bill is a  good example of that.\n\nThis bill would elevate the Federal Energy Regulatory Commission  above any other Federal agency, give it unprecedented…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…into  America's semiconductor industry.\n\nIt will help identify the gaps, barriers, and opportunities to bring  these new investments and then inform Congress so that we can boost  investments from our allies and partners.\n\nThere is way too much uncertainty in our economy right now. This bill  is smart, bipartisan, and a good way to protect and grow…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690163/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the funding included in the Republican spending  bill.\n\nThe GEO Group that owns Adelanto boasted about a $31 million windfall  if they keep full capacity.\n\nRepublicans want to boost the funding of ICE to hire more masked  agents and pay out more contracts like that at Adelanto.\n\nAccording to my Republican colleagues, our budget is too tight to  provide…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Nation's economy in such a precarious state and 2 weeks of  session left before a 2-week recess, is the Republican majority taking  urgent action to bolster Americans' finances, boost growth, and restore  confidence? Regrettably, they are not.\n\nInstead, among other ill-advised items, they are tackling the so- called problem of noncitizens voting, which is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…it  is still cheaper than whatever anybody else is providing. It blocks new  people's ability to bring those forward.\n\nLast summer, he gutted programs that were designed to boost domestic  renewable energy. He slashed incentives to help households save money.  He arbitrarily blocked the development of affordable energy sources,  while forcing more expensive…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…veterans receive the benefits that they so  richly deserve and that our seniors have access to resources that they  set aside for the future.\n\nOur civil servants do so much to boost our quality of life, and do  you know what? This administration doesn't care. For the first 100  days, they have been subjected to spiteful, petty attacks. They have  been…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…electric bills. I  don't know about you, but I think Americans are already paying too much  for electricity.\n\nOnce again, Republicans are selling out their own constituents to  boost the profits of big, polluting corporations.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695768/national-coal-council-reestablishment-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…child has resources that they need to live and thrive in our  country, not just hope to survive.\n\nThis plan includes the End Child Poverty Act, the Baby Bonus Act, and  the BOOST Act. The End Child Poverty Act would provide a universal  child benefit of $458 per child per month. It would bring us closer to  a nation where all children have the opportunity…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…jobs and power new  American advancement in space.\n\nThe One Big Beautiful Bill Act also supports a strong national  defense by investing in America's UAS industrial base to boost U.S.  drone capabilities. In my district, companies like Vector, a veteran- owned drone manufacturer, are leading that charge, developing  technologies to strengthen the warfighter,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…a  competitive advantage. In turn, more workers will find that they get  steady, reliable paychecks. Coal miners will also get new  opportunities. All of America will get a boost.\n\nMore American energy also means that data centers, artificial  intelligence--which are major users of energy--will grow here in  America, not overseas. With it, we can power…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…campaign,  President Trump promised to unleash American energy and to end the era  of overregulation.\n\nIn just 7 months, President Trump has already taken those historic  steps to boost domestic energy production, resulting in gas prices  dropping by 50 cents over the past year.\n\nIn March, President Trump and EPA Administrator Lee Zeldin undertook  the largest…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…unconscionable.\n\nI know you agree. I know. Amen.\n\nLaw enforcement will have the help of a border wall now that is 100  percent complete. Our immigration enforcement officers will get a boost  from more manpower, resources, and detention space so that detained  illegal aliens are not released back onto the streets like they were  for the last 4 years.\n\nOur homeland…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…investments and modernizes the contracting process within the service.\n\nAs the Coast Guard looks to grow its forces, this legislation will  support the Coast Guard's efforts to boost recruiting and retention  while supporting President Trump's vision to strengthen the domestic  maritime base and boost the pool of qualified United States merchant  mariners…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694195/coast-guard-authorization-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…AI  for Main Street Act, introduced by Representatives Alford and Scholten.\n\nArtificial intelligence is increasingly being used to streamline  operations, reduce costs, and boost productivity for small businesses.  For many small businesses across the country, adopting these tools  remains out of reach because they lack the staff, the expertise, or…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…resources efficiently. It will not weaken genuine historic preservation  but will stop a pointless cash grab that inflates administrative  burdens. In fact, this resolution could boost Federal revenues by  speeding up leasing and production timelines that are critical to U.S.  energy security.\n\nOffshore oil and gas from the Outer Continental Shelf accounts…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…happening. The GDP numbers, which means the  baseline economic growth numbers, are remarkably healthy. There is huge  investment going on right now in technology that could actually boost  productivity. Therefore, it will boost wages.\n\nWhere is the unified theory here? We are going to do another  reconciliation where we are going to tell the markets that we…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…cameras should be present in the Federal  courts, including the Supreme Court, because what I said about State  courts is not yet a requirement in Federal courts. Cameras would boost  transparency and help Americans grow in confidence and understanding of  the Federal Judiciary if we had cameras in the Federal courtrooms.\n\nIt has been maybe a joke that…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696518/cameras-in-the-courtroom"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Current law is clear.  Requiring a statutory presumption in favor of exports are in the public  interest.\n\nPlus, the vast majority of studies show that not only do LNG exports  boost our energy security but they also help maintain low domestic  natural gas prices for Americans.\n\nThe Biden-Harris administration's action not only jeopardized our  European…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to generate more  than $260 million for the Federal Treasury.\n\nThis CRA helps the U.S. remain energy dominant and will lower prices  for families, strengthen our economy, and boost real wages for  hardworking men and women. I urge my colleagues to stand with Wyoming,  stand with American workers, and stand for energy security by  supporting this resolution.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…billion endowment that  Harvard controls. The American people voted for an agenda that roots  out waste, fraud, and abuse of our programs and gives the middle class  the economic boost that they need.\n\nToday, marks the beginning of delivering on President Trump's agenda.               Honoring our Courageous Law Enforcement Officers\n\nMr. JOYCE of Pennsylvania.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…million to expand its production plant and  distribution center in Covington, TN. Mount Juliet was included in a  $700 million nationwide investment by Schneider Electric to boost  domestic manufacturing and energy infrastructure. Electronics company  ABB is investing $80 million in Selmer, TN, to expand manufacturing and  to create new jobs.\n\nLater…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "James Risch", "party": "Republican", "sentence": "…important forces for stability in the Middle East. We  would talk about how these agreements will lay the foundation for  investment, innovation, and good-paying U.S. jobs that will boost our  economy.\n\nBut, no, these joint resolutions do not conduct oversight or provide  congressional disapproval. Instead, they make arms sales to some of our  closest allies…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692354/motion-to-discharge-sj-res-54"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…SelectUSA program of the Department of Commerce, in       coordination with other Federal agencies and State-level       economic development organizations, is positioned to boost       foreign direct investment in domestic manufacturing and to       help secure the semiconductor supply chain of the United       States.       SEC. 4. COORDINATION WITH…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690162/securing-semiconductor-supply-chains-act-of-2025"}]