[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…was taking place.\n\nThe bottom line is this: Americans do not want another war. They  don't want American servicemembers put into harm's way, either flying  missions or with boots on the ground, for a war not authorized by  Congress. Mothers and fathers of American sailors, marines, soldiers,  and pilots do not want to lie awake at night wondering if…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…supposed  to pull themselves up by those ridiculous bootstraps that people like  to talk about?\n\nThis administration and the House majority are actually not just  taking away their boots but taking away the leather, the rubber, the  soles, and the labor that would be used to even make these boots. We  are going to be spending the next hour talking about all…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…``Billionaires First.'' It is  ``Trump First.'' First to rake in profits, mind you, not first to put  themselves in harm's way.\n\nAnd you can bet when Trump says he is not worried about boots on the  ground, it is because he is not talking about his boots. He is not  talking about his kids. He is talking about yours.\n\nCongress cannot stand by and shrug our shoulders.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…after I was elected  to the U.S. House of Representatives, when he would leave a shovel by  the front door when I would go home on the weekends, and he would leave  my rubber boots there to make sure I put them on because we were going  to go clean the barn.\n\nWe raised cattle. We raised sheep. We raised all kinds of animals.  After those animals eat,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…cynical, and we are in a situation  where the President continues to assert that we can use hostilities at  any time. In fact, on January 9, he said, ``We are not afraid of boots  on the ground.''\n\nLet me, for a moment, point out another great hypocrisy that has  arisen in this situation. This all began as a way to prevent drugs from  reaching this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…District  rely on Medicaid or SNAP. These cuts would take food away from children  as young as 8 years old. I guess we will just have to give our 8-year- old kids little, tiny boots with little, tiny bootstraps so they can  pull themselves up.\n\nThese aren't just budget choices. They are moral ones. They are the  wrong ones. We should support families and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691489/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…administration already did not  get permission before escalating the first time.\n\nBy the chairman's logic, the only time we can ever have a vote is if  there are physically boots on the ground. That just is logically  insane. It doesn't comport with the way the War Powers Act is written.  By his logic, the President should be able to launch a preemptive…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…resolute heels of Senator Blackburn!      They've traveled here from Alabama's waterfalls      Tracking dust from Jersey streets onto the blue rugs      Long ago, Webster's boots echoed across these halls      Stepping over many tobacco spittoon jugs.      Do I belong here? Could I fill these sacred shoes?      Those grand wooden doors swung open for…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Ms. DUCKWORTH. Mr. President, one of the proudest moments of my life  was the first time I ever laced up my boots, put on my uniform, and  raised my right hand to swear my oath to the Constitution as a member  of the Illinois Army National Guard, and I cherished every day that I  got to…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Don't take my word for it. Military leaders from both parties have  warned us for years. If we fail to lead with soft power, we will end up  paying in blood, bombs, and more boots on the ground.\n\nCutting foreign assistance will: deepen desperation, fuel extremism,  and push fragile societies toward collapse. When that happens, we all  pay the price.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…aspirin and creams for people's hands.  They work with their hands. They need gloves to work with the soil.  They raise their own food. They live at a simple level.\n\nSweaters and boots for the men as they go through the forests, and  bicycles--there are so many things that are needed there that we just  throw away. We just throw away material and plastics…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, it is really devastating to listen to the other side  talking about how we somehow were not supposed to be told when boots  went on the ground before. Somehow, we were lucky enough, by God's  grace, that  nothing bad happened to the men and women in the service of our Nation.  Yet they actually…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…heading up the  Party Planning Committee. His energy was contagious, and his commitment  never wavered.\n\nIn 2022, Matt took a leave of absence from my official office to be  boots on the ground in New York City (NYC) assisting with my re- election campaign. He was a staple at many NYC subway stops, canvasing  and connecting with constituents. His hard…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Ms. DUCKWORTH. Mr. President, next week marks the anniversary of my  Alive Day. That is the anniversary of the last day I ever woke up,  laced up my boots, and climbed into my Black Hawk helicopter; the day  when an RPG shot my helicopter out of the Iraqi sky; the day that I  could have died; the day that I probably should have…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…strong and resilient. This  is not a regional fight. Ukraine's sovereignty is a U.S. national  security issue. We must hold the line in Ukraine now or we may have  American boots on the ground, fighting in Europe in a few years. That  is my fear.\n\nWe do want peace, and yet this administration has begun negotiations  from the weakest possible position.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, when danger strikes, it is not just  about boots on the ground. It is about paws in motion.\n\nToday, I rise in defense of those who cannot speak for themselves but  serve our Nation with unmatched loyalty, discipline, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Troop Box Ministry started receiving special requests from soldiers,  and soon, they were knitting wool helmet liners and collecting cans of  spray for the bottoms of combat boots to give servicemembers a better  grip on slippery terrain.\n\nOver the next 23 years, Diana and her volunteers sent an estimated  10,000 packages to American troops serving all…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Biden  administration projecting American weakness to the world. Under the  previous administration, America turned away from policies that had our  adversaries quaking in their boots and instead bent a knee to the axis  of evil. Make no mistake, China, Russia, and Iran are exerting  influence across the globe that is causing harm and posing major  threats…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…The U.S. is not at war with Venezuela. I know they all predicted  there was going to be some forever protracted war, but we were never at  war with Venezuela. There are no boots on the ground. Democrats are  asking us to vote on a resolution about a situation that literally does  not exist.\n\nWe do not have anybody there in Venezuela fighting. There…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Congress.\n\nNow, it is on the Senate to pass the One Big Beautiful Bill Act and  give the President the resources he needs to keep the border secure.  The bill will  fund more boots on the ground, more deportations, and the critical  border wall.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693036/big-beautiful-bill-impact-on-border-security"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…lumberjacks and woodsmen drawn by the abundant forests.  Despite difficult growing conditions, residents were successful in  farming, and in establishing factories to produce lumber, boots, shoes,  and barrel staves.\n\nAs the town grew, so did trade and tourism. The Cumberland and Oxford  Canal opened in 1832, tying together the Sebago Lake and Portland  economies.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…country that fit this category.\n\nNow, across the country and in this body, most Americans know I am  very plugged into law enforcement. I get calls every day from these  guys, boots on the ground across the country, including deep in Federal  law enforcement, and they support this law. Don't tell me that Federal  law enforcement doesn't want to do this…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…history books or the battlefields that define the  Army. It is the people. It is the young men and women from small towns  and big cities who raise their hands, lace up their boots, and swear an  oath to protect this Nation and its values.\n\nI have seen what that sacrifice looks like. I have worn the uniform.  I have served beside heroes, and I know what…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…force; and\n\n``(B) identifying and outlining a plan for outreach and       promotion of the programs and services for veterans,       including Veteran Business Outreach Centers, Boots to       Business, Boots to Business Reboot, Service-Disabled       Entrepreneurship Development Training Program, Veteran       Institute for Procurement, Women Veteran Entrepreneurship…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…States from an armed attack or imminent  threat. I believe invoking the War Powers Act at this moment is  necessary, given the President's comments about the possibility of  ``boots on the ground'' and a sustained engagement ``running''  Venezuela, with which I do not agree.\n\nWhat happens now matters greatly, both in terms of accountability for  Maduro…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…This Conference and the Trump administration are working for American  citizens, and it has been truly life-changing for many people.\n\nThis August, I had the chance to get boots on the ground and see  firsthand the impact of this bill on hardworking Georgians. Just the  other week, I was eating at a Georgia restaurant, and I asked my server  how no…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694797/promises-made-promises-kept"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…that so many of us  did. He enlisted in the Iowa Army National Guard. It was there that he  learned the mundane tasks of a young soldier, at that time--shining  black leather boots, making sure your uniform was ready for those  weekend drills in a blustery cold Iowa. But he also learned the more  impactful lessons in the National Guard, such as leadership…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Speaker, today, I rise to recognize Black April and 50  years since the Fall of Saigon.\n\nOver 8.7 million Americans served during the Vietnam war, including  2.7 million who put boots on the ground.\n\nWe will always remember the 58,281 U.S. servicemembers who gave  everything for freedom, and we rally with our Gold Star families and  the loved ones of the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690417/recognizing-black-april"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…of the Fort Worth Stockyards,  the shop stands as a lasting symbol of the area's Western heritage and  strong sense of community. While it's known for its unrivaled custom  boots and saddles, M.L. Leddy's also offers western clothing, hats,  buckles, and accessories. Each piece is crafted with meticulous  attention to detail, a time-honored technique…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700234/recognizing-ml-leddys-on-being-included-in-the-new-york-times-list-of-the-top-50-clothing-stores-in-the-united-states"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…a military operation, the Constitution says  that it is Congress that appropriates money, not the President. So, for  instance, in Venezuela, if you don't want any American boots on the  ground, I think you could come forward and pass through the  appropriations process a prohibition of funds to be used to have  American ground forces in Venezuela.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]