[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that.\n\n``President Trump will fire his first tariff salvo on Saturday  against those notorious American adversaries, Mexico and Canada. They  will get hit with a 25 percent border tax, while China, a real  adversary, will endure 10 percent. This reminds us of the old Bernard  Lewis joke that it is risky to be America's enemy, but it can be fatal  to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…families. It  will resume when there is enough food, water, and medicine in Gaza to  alleviate the humanitarian catastrophe. It will resume when families on  both sides of the border can sleep peacefully without the constant fear  of rockets and bombs falling from the sky. It will resume when there is  a lasting, durable, and negotiated cease-fire.\n\nMr.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…kidnapping and disappearing of immigrants and  U.S. citizens off our streets, House Republicans are, once again,  looking to turn the conversation back to immigration and the border.\n\nI will point out the absurdity of spending this valuable floor time  on a bill that has harsh and ineffective mandatory minimums for  immigrants while the majority effects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…hospitals, and churches must be protected.\n\nWe must rein in the sweeping surveillance system DHS is using to  crack down on Americans. CBP personnel must also go back to the border.  The Federal Government must cooperate with State and local  investigators in investigations, including on the murders of Renee Good  and Alex Pretti.\n\nMr. Speaker, I have…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699595/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…took her  mission on headfirst and investigated bullet holes in boats, houses  that had burned down, and wounded villagers with her international  activist group, the Cross Border Network. Alice never stopped looking  for a way to improve the lives of others or to push anyone to their  fullest potential. She lived her life to her fullest potential, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…legislation, like the HALT Fentanyl Act, is  something that is going to have much more of an impact. CBP statistics  show that all of the fentanyl seized along the northern border from the  beginning of 2022 until now is 71 pounds. Now, that is a lot of  fentanyl, and that could kill a lot of people, so I don't endorse that  by any means, but when you…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…that caused their customers to lose $8 billion would not have  happened.\n\nThis bill strengthens our national security by giving regulators the  tools they need to track cross-border transactions and stop digital  assets from being used to evade sanctions or fund our adversaries.\n\nThe bill is not perfect, and it does not resolve every issue. Like  many…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…extraordinary guts and grit. I  have met parents who have lost sons and daughters in Russian bombing. I  have met families whose children were kidnapped and taken across the  border in a really grotesque campaign of abduction and indoctrination-- war crimes that stain the people of Russia, not just their leader. And  the world has demanded accountability,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…raise very substantial concerns about the  operations that are being carried out not only in Minneapolis but in  other parts  of our country by the Immigration Customs and Border Patrol agents.\n\nThe Constitution calls upon us to establish justice and ensure  domestic tranquility. Many of my colleagues I know believe that voting  against this bill will…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…children, I am appalled but,  sadly, not surprised that this administration continues to terrorize  children, using the same playbook as when they separated families at  the border.\n\nLet me be clear: According to the United States Supreme Court, all  children, regardless of their immigration status, have the right to  attend public schools. The ICE tactics…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that.  They are trying to put their thumb on the scale, and that is where this  week's bills come into play.\n\nThe first bill we are discussing right now, H.R. 3062, the cross- border energy bill, was first proposed way back in 2013 to respond to  the energy politics of the 2010s. It is simply irrelevant in this day  and age. The Keystone Pipeline has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Security employees out  there who have served us so well through so much difficulty, to the  Federal Emergency Management Agency, Homeland Security Investigations,  Customs and Border Protection, Transportation Security Administration,  they do critical work for us, and we apologize to them that we must  create uncertainty to them for the foreseeable future,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…was fought. His  beer was taken off the shelves in Canada because of Donald Trump's  stupidity and name-calling of the Canadians.\n\nIn northern New York, we have had a great border--a peaceful,  wonderful, prosperous border--between Canada and New York. Trump just  about destroyed it in a minute with some jerky comment that he always  typically makes.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…resources to remove dangerous individuals, not those  contributing positively to our society and to our economy, not people  like Nelson and Gladys Gonzalez.\n\nI am all for a secure border, but what we are seeing today is not the  America that I know.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690924/recognizing-gladys-and-nelson-gonzalez"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…in this area? This is when we were doing the  appropriations bill: Prohibition on detaining or deporting U.S.  citizens, reducing funding for ICE, prohibition on the use of Border  Patrol and CBP officers, a requirement for DHS law enforcement to use  body-worn cameras, require reporting on the use of force, training  standards--they should be trained…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…will sign this bill because he  believes, as we all believe, that people are hurting. They are hurting  with substance use disorder. You have the supply coming across the  border that he is shutting down and trying to shut down, but we also  have to deal with the demand side. We need not just to slow down the  demand, which is important, but change…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…terrorists around the world, it is unbelievable.\n\nThank God for Elon Musk and for DOGE to uncover all the waste, fraud,  and abuse. I thank President Trump for securing our border and  deporting the murderers, rapists, terrorists, and gang members. I thank  him for going after terrorists. I thank him that we are not going to be  taken advantage of anymore…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688490/president-trump-is-getting-it-done-for-the-american-people"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…legislation does exactly what is necessary to ensure SBA  employees are safe.\n\nDespite inheriting one of the most secure borders in American  history, President Biden relaxed border policies, and today,  communities continue to deal with these consequences.\n\nI am talking about everything from crime against small businesses  forced to close their storefronts…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692097/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…that help meet the research and development needs of the Department of  Homeland Security.\n\nThese entities have produced technology that serves as a force  multiplier to our Border Patrol agents and include technology that  assists agents in cargo and vehicle screening that can detect illegal  substances attempting to be smuggled into the United States.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…system. They seized the means of production, and it  led to hyperinflation and complete economic collapse, which is why you  have all these Venezuelans trying to come over our border illegally,  Mr. Speaker.\n\nSadly, New York City chose to learn the hard way what socialism is,  and we, those of us who did not vote for this guy, are going to pay the  price.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…bloat. It  preserves the greatest battle-tested set of tax cuts for working  families that our Nation has ever seen or our economy has ever  realized. It doubles down on the border priorities of the most  successful enforcement efforts by a President in our Nation's history.  It realigns our economy in defense of American workers, American  energy, American…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…countless family-owned  small businesses from double taxation by expanding the death tax  exemption.\n\nThe One Big Beautiful Bill Act reverses 4 long years of Biden's open- border policies with a generational investment in border security,  including funding to complete phase 2 of the border wall.\n\nThe One Big Beautiful Bill Act modernizes our Armed…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…profit from  the political calculation of leftwing bureaucrats and judges.\n\nMr. Speaker, the folks I represent are still reeling from historic  Bidenflation, the effects of the border crisis, and the regulatory  agenda of the last administration. It is shameful to ask them to  shoulder the burden of paying U.S. Senators a half million dollars or  more for…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696683/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…provides  instructions to reverse Biden's assault on domestic energy, rein in  reckless spending, and deliver critical resources to the Trump  administration so we can secure our border and strengthen our national  security.\n\nFinally, I want to address the fear-mongering among our Democrat  colleagues. This budget resolution does not cut benefits for any…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the administration's accomplishments is that President  Trump is keeping his word. He is making America safer and stronger than  ever before.\n\nYou can look at the southern border. In a matter of months, President  Trump completely fixed the Biden border crisis. The President was right  when he said we didn't need more laws. We just needed a new President,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…3486.\n\nMr. Speaker, it is my privilege to open remarks on this important  legislation which holds a specific criminal category to account,  specifically those who exploit weak border policies to bring crime into  the United States.\n\nI certainly feel that it is appropriate, before I begin my remarks,  to note that today is the 24th anniversary of the September…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…foremost that if you are using labels like  ``moderate'' or ``progressive,'' you are missing the entire point. I  gave former President Biden hell for failing to secure our border. I  think that is a nonpartisan issue. That doesn't make me a moderate. I  campaigned with my colleague AOC against big corporations screwing over  my constituents and polluting…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…Mr. Speaker, I rise today in opposition to this resolution which  would terminate the President's national emergency in response to the  flow of fentanyl across our northern border.\n\nAs an Arizonan, I am all too familiar with the destruction these  weaponized opioids have caused, and I fully support President Trump's  mission to rid our Nation of this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699970/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…defense that will help us begin building the Golden Dome  missile defense shield to protect our homeland, begin to revitalize our  defense industrial base, help us secure our border because border  security is national security, begin to rebuild our munitions  stockpiles and critical mineral supply chains, and continue to improve  the quality of life of…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…CAREY. Mr. Speaker, today's vote really marks an essential step  toward fulfilling the promise to the American people to extend the 2017  Tax Cuts and Jobs Act, to enshrine border security into law, and to  move forward toward American energy independence.\n\nAfter enduring years of high inflation, American families and small  businesses urgently need…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689894/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]