[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…about. As a former special  narcotics prosecutor--that is me--I know a little bit about that.  Saying that you are going to focus and stop certain things from coming  across the border of Canada, as if it is coming across in a cluster  like it is an emergency, is just an out-and-out lie.\n\nThe fact of the matter is that if you look at the Federal  prosecutions--this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…closed even that door,  turning off a basic level of dialogue.\n\nNone of this makes sense. Tightening sanctions increases suffering,  which drives people to our shores and to the border, but the  administration won't even talk to Cubans about migration. How do they  plan to return those they want to deport? Do they think they can hold  Cubans in detention…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…their unlawful, abusive actions.\n\nYou want to disappear people from California? Just say that new  members of the latest criminal organization were found crossing the  southern border. You want Americans to surrender their rights? Well,  fearmonger and tell them that a special interest alien from a criminal  organization is operating a cell in their neighborhood.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…took her  mission on headfirst and investigated bullet holes in boats, houses  that had burned down, and wounded villagers with her international  activist group, the Cross Border Network. Alice never stopped looking  for a way to improve the lives of others or to push anyone to their  fullest potential. She lived her life to her fullest potential, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…in this area? This is when we were doing the  appropriations bill: Prohibition on detaining or deporting U.S.  citizens, reducing funding for ICE, prohibition on the use of Border  Patrol and CBP officers, a requirement for DHS law enforcement to use  body-worn cameras, require reporting on the use of force, training  standards--they should be trained…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Ally embraced this ideal, She worked hard every day  to serve the people of California's 52nd Congressional District.\n\nAlly led critical pieces of legislation, including the Border Water  Quality Restoration and Protection Act, and helped secure essential  funding for our district. In part because of her tireless advocacy, our  San Diego Congressional…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693025/recognizing-ally-castaneda"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Madam Speaker, I rise in strong opposition to H.R.  3486. Let's be clear. This bill is not about border security. It is  about pouring gasoline on a prison system that is already bloated,  broken, and unjust.\n\nWhile American families are begging us to release the Epstein files,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695363/stop-illegal-entry-act-of-2025"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…their leadership. Certainly, I also  thank the staff on both sides for the hard work that they have provided  on this difficult bill.\n\nI represent 280 miles of the U.S.-Mexico border. Let me be the first  to say this bill is not perfect. However, this bill is better than the  alternatives of either funding the Department under a continuing  resolution or…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Security employees out  there who have served us so well through so much difficulty, to the  Federal Emergency Management Agency, Homeland Security Investigations,  Customs and Border Protection, Transportation Security Administration,  they do critical work for us, and we apologize to them that we must  create uncertainty to them for the foreseeable future,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…that caused their customers to lose $8 billion would not have  happened.\n\nThis bill strengthens our national security by giving regulators the  tools they need to track cross-border transactions and stop digital  assets from being used to evade sanctions or fund our adversaries.\n\nThe bill is not perfect, and it does not resolve every issue. Like  many…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…with approximately $20 million invested in  them, taxpayer-invested money, are at the risk of being terminated by  OTA at this time. These projects include projects such as border  security, cybersecurity, counternarcotic security, and a few others.\n\nThe expiration of DHS' other transaction authority essentially will  mean inefficiency and waste, things…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688702/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…who visit Niagara Falls and the wine country in the Finger Lakes region  are from Canada. So many from Canada flood New York City every year.  And yet, this year, tourism and border crossings are down 20 percent.  Western New York and Buffalo depend on those border crossings all the  time.\n\nTrade between our Nations has been hurt. Jobs have been squandered.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…now with DHS  funding. It is a fascist army, and it is shameful.\n\nI grew up in southwest Detroit, Mr. Speaker, with 20 different  beautiful ethnicities. We were the northern border. What my community  and our community kept telling us back then during its creation,  literally, is they told us they are violating people's civil rights. We  do not feel safe…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699666/horrific-ice-abuses"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…resources to remove dangerous individuals, not those  contributing positively to our society and to our economy, not people  like Nelson and Gladys Gonzalez.\n\nI am all for a secure border, but what we are seeing today is not the  America that I know.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690924/recognizing-gladys-and-nelson-gonzalez"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I thank Ranking Member Pallone for the  time.\n\nMr. Speaker, I rise today in strong opposition to H.R. 3062, the  Promoting Cross-border Energy Infrastructure Act.\n\nMy concern is that this bill is going to be bad for our national  security interests, in addition to leading to rising costs that will  ultimately…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…election time, they  actually for a change keep the promises that they made to the public.  The President promised the idea that we would get America back on  track, secure our border, and reduce taxes for those hardest hit over  the last 4 years.\n\nWhen people look at the tax bill they are working on, what is called  the big, beautiful bill, the great thing…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…might not be a big  deal to the elites in Manhattan or San Francisco, but it does mean a  lot to the people of my district in North Carolina.\n\nNot passing this bill means our Border Patrol officers and our Coast  Guard won't have what they need to secure the border and stop the flow  of deadly fentanyl.\n\nIt doesn't stop there, Mr. Speaker. Opposing this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…desperate for attention and for power. Don't give  it to them.\n\nLet's set the record straight about what this budget resolution  actually accomplishes.\n\nIt will provide funding for border security, provide for our national  defense, and restore American energy independence. It will provide tax  relief for working families.\n\nOn border security, Biden's open-border…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…system. They seized the means of production, and it  led to hyperinflation and complete economic collapse, which is why you  have all these Venezuelans trying to come over our border illegally,  Mr. Speaker.\n\nSadly, New York City chose to learn the hard way what socialism is,  and we, those of us who did not vote for this guy, are going to pay the  price.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…counties in the United States. Senate Republicans won a 53-seat  majority, and House Republicans maintained the majority as well.\n\nAmericans gave us a mandate to secure the border, to rebuild the  economy, to unleash American energy, and to restore America's strength.\n\nHere we are 1 year later, and America is back on track. The results  are undeniable.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…CAREY. Mr. Speaker, today's vote really marks an essential step  toward fulfilling the promise to the American people to extend the 2017  Tax Cuts and Jobs Act, to enshrine border security into law, and to  move forward toward American energy independence.\n\nAfter enduring years of high inflation, American families and small  businesses urgently need…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689894/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…country that prompted a crisis  in countless communities, including my own, Americans' top concerns  coming back time and time again, poll after poll, were the economy and  our border. Democrats did no work to address those concerns.\n\nDid Vice President Kamala Harris address them? No, she did not. She  didn't make that sale to the American people when she…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…communities that actually respect the rule of law,  that actually put American citizens first, and that is not  controversial. It is just common sense.\n\nPresident Biden's open-border policies let in millions of illegal  aliens, unvetted illegal aliens, including dangerous, violent  criminals.\n\nThe woke policies of Democrat-run sanctuary cities, fueled by…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…provides  instructions to reverse Biden's assault on domestic energy, rein in  reckless spending, and deliver critical resources to the Trump  administration so we can secure our border and strengthen our national  security.\n\nFinally, I want to address the fear-mongering among our Democrat  colleagues. This budget resolution does not cut benefits for any…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…that people have access to  treatment. We are equally committed to ensuring that people that are  purveying this poison on our communities, our cities, bringing it  across the border, deserve to have their day in court, and deserve to  answer to justice. If it be the case that these are the people  poisoning our children, they should be put in jail and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692351/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "Mr. GUEST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3965) to establish in U.S. Customs and Border Protection a pilot  program to adopt dogs from local animal shelters to be trained as  support dogs, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…expensing strengthened American  manufacturing jobs.\n\nI joined law enforcement officers at a drug enforcement roundtable to  discuss how this bill invests billions of dollars in border security to  stem the flow of fentanyl into our communities.\n\nI celebrated 100 years of egg production with Creighton Brothers, a  century of hard work and family enterprise.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694794/promises-made-promises-kept"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…entered this country. This includes countless numbers of murderers,  rapists, child traffickers, smugglers, and individuals from countries  that support terrorism. Customs and Border Patrol caught 400  individuals on the terrorist watch list, leaving us the question of who  else was allowed to enter this country undetected.\n\nThat is why the Stop Illegal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…table.\n\nPresident Trump and House Republicans are fulfilling the mandate  given by the American people to restore economic prosperity, support  small businesses, secure our border, unleash American energy, invest in  rural America, and the list goes on.\n\nThis legislation cuts taxes on hardworking Americans, lowers energy  costs, brings jobs home, cuts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…They are fun-loving once  you get to know them.\n\nThe United States of America and Canada have been friends and allies  for decades. We are neighbors. We share a 5,525-mile border. I am proud  of that. We share history. We share values. We maintain longstanding  mutual security commitments. We are both members of NATO. Canada and  America are members…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]