[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…President, I believe, is abusing this authority. He calls it an  emergency. He is using the trade wars to supposedly force countries to  do things like changing their border policies.\n\nI believe it is time for Congress to start taking back some of that  power and considering how we are going to protect the family farm.\n\nWe know this--that in my State,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…percent. Mr. Speaker, there were 2,000 ICE arrests every day  recently. ICE is finally cleaning up the open-border policy of the  Biden administration. Yes, they were open-border policies.\n\nMr. Speaker, I hope that our colleagues will support the underlying  rule and the bills that we have considered before us today because we  need to secure our elections…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…communities that actually respect the rule of law,  that actually put American citizens first, and that is not  controversial. It is just common sense.\n\nPresident Biden's open-border policies let in millions of illegal  aliens, unvetted illegal aliens, including dangerous, violent  criminals.\n\nThe woke policies of Democrat-run sanctuary cities, fueled by woke…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…an  agenda pursued by elite, leftwing politicians. The elite, leftwing  politicians don't feel the impact of their reckless policies. Whether  it be pursuing open border policies or policies that fuel inflation, it  is normal citizens who feel the impact.\n\nToday, we start the process of restoring America's strength. Rather  than pursue a reckless, ideological…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688043/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…restraint--restore, protect,  preserve, and revive. The failure to act would yield only the opposite.\n\nOur Democrat colleagues would tear down the border wall and return us  to open-border policies. They would have us oversee a continued decline  in our military readiness despite unprecedented theaters of global  conflict. They would destroy our economy in their…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…true colors by voting  for taxpayers to continue paying for government handouts to folks who  shouldn't really be in this country in the first place, but for the  open border policies of the Biden administration.\n\nOne accusation I find particularly ironic from our friends across the  aisle has been this idea that we have somehow added redtape to Medicaid…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in this program but at  the southern border as well to admit hundreds of thousands, even  millions of individuals into the country during the Biden years and  their open border policies.\n\nBut even though this authority is supposed to be used only on a case- by-case basis, the Biden administration turned this exception into the  rule. Now we also know…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…air that grievance. Imagine if, during President Biden's  speech, each and every one of the Republicans in the House had stood up  and objected to the President's open-border policies or his runaway  inflation policies. The State of the Union could not be delivered. The  institution could not function.\n\nWhat is even more remarkable, though, than the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…today in support of this rule and the underlying  bill, H.R. 2931, the Save SBA from Sanctuary Cities Act of 2025.\n\nOver the past 4 years, the Biden administration's open-border  policies have allowed millions of illegal immigrants to pour into our  country. Making matters worse, Democratic politicians in cities across  our country have enacted sanctuary…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691945/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…these violent criminals and gang members from the  start of his Presidency.\n\nOn November 5, 2024, 77 million Americans, including myself, voted to  restore commonsense border policies to our Nation's Capital. The  President is providing that common sense, and I am deeply grateful to  have his strong leadership back in the White House.\n\nI thank President…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Protestors were engaging in       violence and vandalism--burning cars, attacking police       officers, and burglarizing businesses. The previous       administration's open-border policies and disregard for the       law led us to the chaos and lawlessness we are seeing today,       and it is President Trump's responsibility to restore law and       order.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…scale. While under President Trump's leadership, illegal  border crossings are down 95 percent from last year, yet we are still  suffering from the impacts of the open-border policies of the last 4  years.\n\nThe left did not just facilitate an open-border invasion, they have  made the American taxpayer pay for it, and we are still paying for it.\n\nUnder…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…America was suffering  direct consequences from the drug war, as I alluded to a moment ago.  Cartels in Mexico and Latin America took advantage of President Biden's  open border policies and refusal to act where action was required. Of  course, they made untold millions of dollars selling these drugs and  transporting them beyond their borders into the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…countless family-owned  small businesses from double taxation by expanding the death tax  exemption.\n\nThe One Big Beautiful Bill Act reverses 4 long years of Biden's open- border policies with a generational investment in border security,  including funding to complete phase 2 of the border wall.\n\nThe One Big Beautiful Bill Act modernizes our Armed Forces…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Mr. Speaker, it is my privilege to open remarks on this important  legislation which holds a specific criminal category to account,  specifically those who exploit weak border policies to bring crime into  the United States.\n\nI certainly feel that it is appropriate, before I begin my remarks,  to note that today is the 24th anniversary of the September…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…borders and  secure them, and then try to remove the dangerous criminals who are  walking the streets of the United States because of the radical  progressives and their open-border policies.\n\nI know my friend from Louisiana has a lifetime of service, not just  as a Congressman, but also in law enforcement. I wonder if my brother  from Louisiana would like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}]