[{"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. Speaker, this bill is not good for national security. That is  plain and simple.\n\nThis bill would require Customs and Border Protection to publish  sensitive detailed national security information on a monthly basis.  This information would give the bad guys around the world real-time  updates on DHS…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…were groups of women or men. My impression  was they were looking to see, where did my mother go? where did my  father go? where is my sister?\n\nI said to the Customs and Border Protection agent: Were these  children separated from their parents?\n\nHe said: Yes.\n\nI said: Where do you do that?\n\nHe said: We bring the family in through that door--the door was…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…himself.\n\nThis brazen denial of rights and facts is in the water at DHS  headquarters, and it is increasingly clear that this has become the  culture of ICE and Customs and Border Protection.\n\nThat is why I am standing here this week to say clearly: not another  dime for this kind of lawless immigration regime. We will not add to  the slush fund that Republicans…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…He  says this is a way to stop the flow of fentanyl into our country, but  he has forgotten a few inconvenient facts.\n\nFirst, it is that, in 2024, CBP, or Customs and Border Protection,  seized about 43 pounds of fentanyl along our northern border--about 1  percent of the fentanyl coming into this country. Now, it has long been  known that fentanyl…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…employees out  there who have served us so well through so much difficulty, to the  Federal Emergency Management Agency, Homeland Security Investigations,  Customs and Border Protection, Transportation Security Administration,  they do critical work for us, and we apologize to them that we must  create uncertainty to them for the foreseeable future,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…said Mexico would pay for.\n\nThat amount is nearly four times what Trump originally promised the  wall would cost, and it is ten times what the bill spends on Customs  and Border Protection personnel.\n\nThe ``One Big Ugly Bill'' allows the Homeland Security Department to  create a slush fund that will enable the worst impulses of the Trump  administration,…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691679/one-big-beautiful-bill-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Greene's tipping off  terrorists act, requires DHS to make public information it has long  deemed law-enforcement sensitive. That is because this bill requires  Customs and Border Protection to publicly report who is getting extra  screening and where that screening occurs in real time, which tips off  terrorists and other bad actors.\n\nUnder administrations…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…businessowners, and vital members of our community, this school year  begins in fear and heartbreak.\n\nJackie Merlos and her four U.S. citizen children were detained by  Customs and Border Protection and held for 2 weeks in a windowless cell  without access to legal counsel.\n\nAfter public outcry and a temporary restraining order from a judge,  these U.S. citizen children…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694771/toward-a-more-dignified-and-just-immigration-system"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…has been granted permanent resident status on       a conditional basis or who was granted DACA to U.S.       Immigration and Customs Enforcement, U.S. Customs and Border       Protection, or any designee of either such entity.\n\n(c) Limited Exception.--Notwithstanding subsections (a) and       (b), information provided in an application for permanent…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…fragile and so  constrained that it must shift the entirety of its focus to the border  security mission, at the expense of other national security  imperatives.\n\nMoreover, border protection is a civilian law enforcement mission.  Deploying large numbers of military forces to support the Border Patrol  is a gross misallocation of forces and raises numerous…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Nation,  strengthen civil liberties, and implement needed reforms to make the  country safer for all people. And in 2020, GAO helped Congress uncover  that U.S. Customs and Border Protection was using migrant care funds to  buy ATVs while children died in custody.\n\nMembers of Congress from both parties and across all congressional  committees have benefited…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to be investing in systems to make the  experience seamless. This means updating airplane screening technology,  modernizing TSA, full-strength staffing at Customs and Border  Protection, and extensive marketing efforts. New York City, which I  represent in part, is a major worldwide tourist destination.\n\nThere is still time to build this industry to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…prosecute criminals who are using these remote control autonomous  vessels.\n\nThe Coast Guard Authorization Act of 2025 also expands the Coast  Guard's and Customs and Border Protection's use of cutting-edge tools,  like tactical maritime surveillance systems, which are blimp-based  radar systems to find and interdict drug runners, poachers, and human…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…GUEST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 4071) to amend the Homeland Security Act of 2002 to enhance the  operations of U.S. Customs and Border Protection in foreign countries,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 4071…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…majority of the aliens with DUI convictions escape immigration  consequences. In fact, on its website just last year, the Biden-Harris  administration's U.S. Customs and Border Protection clearly stated: ``A  single driving under the influence (DUI) conviction is not grounds to  deny entry into the United States.''\n\nMoreover, the Board of Immigration Appeals…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "Mr. GUEST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3965) to establish in U.S. Customs and Border Protection a pilot  program to adopt dogs from local animal shelters to be trained as  support dogs, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…elected sheriff of Wayne County and  having served as president of the Indiana Sheriffs' Association.\n\nIt was as sheriff that Mr. Retter met with the U.S. Customs and  Border Protection to diligently detain illegal criminal migrants,  making the Sixth District far safer for Hoosiers to live and work in.\n\nIt was this past Tuesday in the joint session…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688602/recognizing-sheriff-randy-retter"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…southwest  border of the United States represent a significant and growing threat  to national security. Congress must address this deadly threat and  ensure U.S. Customs and Border Protection has the resources needed to  acquire counter-tunnel technology.\n\nSince 1990, officials have discovered more than 140 tunnels that have  breached the U.S. border, with…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…When we do that, we take away the power that  the cartels have. When the cartels are in power, human beings suffer.  There is no other way to look at it.\n\nCustoms and Border Protection data from earlier this month show that  Southwest border crossings are the lowest they have been in recorded  history.\n\nThink about that, Mr. Speaker. By the numbers,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…thing we needed all along was  a President who was not afraid to actually enforce the law.\n\nThe facts speak for themselves. During the month of June, U.S.  Customs and Border Protection saw the lowest number of encounters ever  on our borders nationwide. Apprehensions along the border reached a new  historic low on June 28, when CBP had the lowest number…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…reliquidation may be made       under paragraph (1) with respect to an entry only if a       request therefor is filed with the Commissioner of U.S.       Customs and Border Protection not later than 180 days after       the date of the enactment of this Act that contains       sufficient information to enable such Commissioner--\n\n(1) to locate the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…falsely--falsely--representing themselves  as family members. I think 45 minutes is worth it to save the life of a  child.\n\nAnd my PRINTS Act, which has been reintroduced, would give Customs  and Border Protection the authority to fingerprint noncitizens under  the age of 14 to combat the horrific practice called child recycling.\n\nJust this week, I also sent a letter to FBI Director…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…of the areas I think they will define is that there could be  better cooperation with the local law enforcement. However, this is not  the fault of ICE or Customs and Border Protection; this is the fault of  the mayor who is not allowing his administration to work with ICE, for  example, to apprehend criminal illegal aliens who are in their jails  and…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…reliquidation may be made       under paragraph (1) with respect to an entry only if a       request therefor is filed with the Commissioner of U.S.       Customs and Border Protection not later than 180 days after       the date of the enactment of this Act that contains       sufficient information to enable such Commissioner--\n\n(A) to locate the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…months, his bold action to secure our border and enforce  our immigration laws has led to a precipitous drop in illegal crossings  at the southern border. U.S. Customs and Border Protection recorded  just 11,709 encounters--apprehensions between ports of entry, plus  inadmissible aliens--at our southern border for the month of February-- 11,709.\n\nJust to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689044/border-security"}]