[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…about the funding of government,  which is the responsibility that we all have. And I want to be candid.  I take significant issue with the President when he says: Don't even  bother dealing with Democrats.\n\nThis always is a budget issue that has to involve Democrats and has  to involve Republicans. If we don't talk, we don't resolve differences  and we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…colleague: Isn't it incredible that all of these cuts  they are proposing in healthcare are done with a purpose in mind, and  that is to reduce the taxes on billionaires? Doesn't it bother my  colleague that these people whom he has been documenting who so  desperately need healthcare are going to lose that if our Republican  colleagues have their way simply…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…professionals in public service. And I fear that we are sending a clear  message to young officers, whether they are at the CIA or any of the  other intelligence Agencies: Don't bother building a career in  intelligence if you plan on telling the truth.\n\nMeanwhile, these aren't actions in a vacuum. Our adversaries aren't  slowing down. Cyber attacks, disinformation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, Republicans say they have a mandate.  President Trump has told his party, don't even bother working with  Democrats. Congressional Republicans wanted to go it alone when they  passed President Trump's One Big Beautiful Bill Act.\n\nThe American people are now finding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bothered to do their homework--or they were  guided purely by Project 2025's mindless opposition to multilateralism,  regardless of the facts. As far as I am aware, they did not bother to  consult anyone in Congress, including those who have regularly engaged  with Director General Azoulay and her professional staff.\n\nMost Republicans and Democrats have long…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…with equal  dignity, God's creation made in God's image, and I said--my words  weren't respectful enough.\n\nSo I lowered my tone, and I said: Excuse me, sir. I am sorry to  bother you, but do you need anything?\n\nHe turns around and looks at me, and he goes: I am hungry.\n\nNow, I have talked to a lot of you. A lot of different faiths. We  have a lot of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…we  need to go.\n\nIf you want permitting reform, don't come to me. I am not the  problem. Don't come to Democrats in the Senate. We are eager to do  permitting reform. Don't bother Chairman Capito and the Republicans.  They are ready to go too. Leader Thune has been very supportive of our  effort.\n\nThe problem isn't in the Senate. The problem is in the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Leader Hakeem Jeffries for putting together a plan and for  presenting something to the American people that stands in stark  contrast to nothing being put forward.\n\nIt doesn't bother me so much that Republicans aren't putting any  proposals forward, but they would deny a hearing on Social Security and  a vote on a measure that Congress hasn't addressed…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…the war on the environment that we are  engaged in here.\n\nMy colleague from Virginia laid out what this bill is all about, and  apparently, my colleague from Florida didn't bother to read the bill.  There is total authority within the Department not to buy vehicles that  might be damaged by a hurricane.\n\nBy the way, why was it allowed to rebuild an airbase…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695144/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…ensuring accountability for our tax dollars. She  couldn't name a single requirement of that law--not one. How is she  supposed to enforce our education laws when she didn't even bother to  study up before her Senate confirmation hearing?\n\nOn fighting for public schools, it is painfully clear that McMahon's  plan for our students and schools is in lockstep…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…reclassify after making progress, this  rule removes any real incentive to invest in cleaner technologies.  Instead of supporting innovation, it sends a clear message: Don't even  bother.\n\nDemocrats like to use the mantra of hope and change. This regulatory  approach says there is no hope, so don't change. That is not  environmental stewardship. That is Washington…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…without power or evacuated from their homes.  And when you hear ``flood insurance''--hey, I don't live in a coastal  State. I don't live in Florida or Louisiana. Why does it bother me? My  home will not get destroyed.\n\nI wish that were true. This isn't a one-State problem; it is a one- nation problem. All 50 States have National Flood Insurance Program…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…article. That is what goes on behind these microphones day  after day after day, is we have people who tell stories. We tell about  our feelings, but we don't seem to actually bother doing something  called math. The family slogan is: The math will always eventually win.\n\nI am going to do this a couple of times here.\n\nWe are in the middle of the reconciliation…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…diagnose it. So we called it the Acquired  Immunodeficiency Syndrome. And they all died. They all died.\n\nAnd I remember saying to one of the older physicians: Why do we even  bother treating them, because they all die?\n\nBut because there was an incentive for companies to come up with  cures, they did it. And they stopped dying, and they began living.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the CDC did an inspection and  found at least 20 potentially infectious agents, including HIV,  tuberculosis, and the deadliest known form of malaria. Yet, the CDC did  not bother to test any samples, even those with unknown contents,  making it impossible for the select committee to fully assess the  potential risks that this specific facility posed…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…United States. I can think of 12, 13 countries that today, if they  offer a 10-year bond, that 10-year bond goes at a lower interest rates  than the United States. Does that bother anyone? Does that tell anyone  anything? Is anyone listening?\n\nLook, I have chart after chart after chart.\n\nThere are ways we can communicate to the bond markets that we are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…countries, the debt is starting to scare  the hell out of bond markets. A bunch of our longer term--10 years and  out--have actually been operating very efficiently.\n\nDoes it bother anyone that France just took down their government  because they were trying to do some fiscal consolidation? They won't  let them deal with their debt, but they can sell a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I would ever have hoped to  have been at their age.\n\nWe start to work out charts like this. I am going to make some people  mad. As a matter of fact, I am not even going to bother with that one.  I will walk us through the straight number.\n\nWe are still vetting the number because we are doing predictions. All  of this could mean nothing if the Supreme…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…try to walk through some economics.  Then I am going to actually try to walk through some warnings that are  in the documents that are around us that very few people seem to bother  to read. Then I am going to actually do some things that are hopeful  because I think sometimes I am a bit dour, and I don't do enough of  this.\n\nFirst off, in August, Republicans…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}]