[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Constitution, including the right to due process and  the rule of law, have been trampled.\n\nICE agents, this so-called ``dream team,'' believe they are above the  law and not bound by the Constitution. We are on the slippery slope  into authoritarianism. Don't believe me? Listen to the President's own  words.\n\nIn a ``60 Minutes'' interview this week,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…``American Nightmare.''\n\nAptly named, this case started back in 2015 in Vallejo, California,  when Matthew Muller broke into the home of Denise and Aaron Quinn,  drugged and bound them, and kidnapped Denise. Muller then took Denise  to a cabin near Lake Tahoe where he sexually assaulted her and released  her 3 days later down in southern California.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689139/recognizing-seaside-police-department-chief-nick-borges"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is armed with the ax of truth and not  afraid to slam it into the tree of circumstance and let the chips fall  wherever they may, I believe that as such a person, I am duty-bound to  bring Articles of Impeachment to the floor of the House of  Representatives.\n\nI will do so because I believe what I said before he was elected this  time. I believe what…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Rhode Island be free.\n\nThe battle was fierce off Warwick Neck.\n\nWhen the gunsmoke cleared from the Gaspee's deck,\n\nThe Rhode Islanders had her as their prize,\n\nAnd her crew bound up in chains and ties.\n\nWhen the crew was ashore, Pawtuxet's Rangers\n\nAssured they'd present us no further danger.\n\nBack to the Bay, in the dark of the night,\n\nWent the Gaspee…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Chiafalo v. Washington, the Supreme       Court held that electors do not have discretion to decide how       to cast their Electoral College votes, but rather are legally       bound to follow the instructions given by their respective       states.\n\nAs Columbia Law School Professors Jessica Bulman-Pozen and       Olatunde Johnson have observed, it follows…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and incorporate the independent interconnectedness of our  world's indigenous peoples.\n\nThe estimated 476 million indigenous peoples spread across all parts  of our world are bound together by a common heritage, common wisdom and  common challenges that transcend often artificial lines of national  sovereignty. To recognize their international status…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Chiafalo       v. Washington, the Supreme Court held that electors do not       have discretion to decide how to cast their Electoral College       votes, but rather are legally bound to follow the       instructions given by their respective states.\n\nAs Columbia Law School Professors Jessica Bulman-Pozen and       Olatunde Johnson have observed, it follows…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…legal basis to continue.\n\nThey first recognized the legal parameters of the War Powers  Resolution back in September, but now the administration is arguing  that they are not bound by this law. They have changed their tune and  are contradicting their own arguments in order to get around the law.\n\nOf course, that won't stop them from pretending they have…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…a mission that would change       humanity.\n\nJane would save all of her wages, every shilling, pence and       pound, And she booked a ship to Africa, to Kenya she was       bound. In the camp of Louis Leakey, digging age-old skulls       from earth, He found something in her manner, recognized her       hidden worth.\n\n``You shall study chimpanzees in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…would needlessly undermine what little  progress has been made and actually raise questions about what problem  we are trying to solve.\n\nWe should be trusting our professionals bound by law, not House  Republicans to make sound decisions about Americans' retirement  savings.\n\nFor those reasons, I oppose the bill, and I encourage my colleagues  to do the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…people whose stories echo  our own because they are us. No matter where someone is born or what  language they speak, our grief over losing a loved one is the same.\n\nWe are bound together by that shared humanity, so we must be  relentless in our commitment to peace: peace rooted in diplomacy, peace  that is sustained with dialogue, and peace that insists,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Chiafalo v. Washington, the Supreme       Court held that electors do not have discretion to decide how       to cast their Electoral College votes, but rather are legally       bound to follow the instructions given by their respective       states.\n\nAs Columbia Law School Professors Jessica Bulman-Pozen and       Olatunde Johnson have observed, it follows…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…2(4)  of the United Nations Charter, which prohibits the threat or use of  force against the territorial integrity or political independence of  any state. The United States is bound by treaty to follow the U.N.  Charter. The Constitution makes treaties part of the ``supreme law of  the land,'' and the President is bound by his oath to ensure the laws…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…__________\n\nMy father was a proud Jewish American and serviceman who       fought in Okinawa. During the last years of his life, he was       bound to a wheelchair and unable to perform daily tasks       independently. The man who bathed him, dressed him, prepared       his food, pushed his wheelchair and drove him to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…the President  who today has accused them of somehow being responsible for their own  beatings. They have already given so much.\n\nMr. Speaker, the leader of this Chamber is bound by law to hang the  plaque in remembrance of what these brave men and women did on January  6, and there is no excuse, no excuse, for his moral failure.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698536/a-somber-day-of-remembrance"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…open to interpretation and subject       to one's own preference or prejudice. It's a key concept in       my business, journalism, where truth is the lynchpin. We are       bound to be truthful to the best of our ability and we are       prohibited from writing anything that we know to be false. We       can be fired for doing it.\n\nThat's the difference…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…country where  freedom still rings and the American Dream endures.\n\nTheir sacrifice is not just a chapter in our history; it is the  foundation of our Republic. We are duty-bound to remember them, to  honor them, and to ensure that their service is never forgotten.\n\nMay God bless the memory of our fallen warriors, and may He continue  to bless the United…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…and,  therefore, they come in here.\n\nI feel so sorry for our great President Trump. He was left with such  a mess when Joe Biden let in 10 million people, and he is now honor  bound to remove them from this country. That is why we have a mess in  Minneapolis.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698706/fixing-the-immigration-crisis"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…nominates; the Senate confirms.  That is how it works everywhere else in America, and that is how it  should work right here in D.C. A duly elected President should not be  bound by a bureaucratic commission when choosing judges. By ending this  broken system, we can fill vacancies faster, strengthen courts, and  ensure justice is delivered without…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Keith Self", "party": "Republican", "sentence": "Mr. SELF. Mr. Speaker, I rise today to salute our soldiers of  tomorrow, the service-bound academy students of the Third Congressional  District of Texas.\n\nThis district of Texas is home to some of the best and brightest  young people, and it is always an honor to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…as to the parade of horribles  of what could happen if we don't, as she would do here, tie President  Trump's hands and bind further legislatively beyond what he has already  bound himself to through his own 2020 Executive order.\n\nSo this is in place. It will remain in place. And there has yet to be  a single reason articulated as to why we should treat…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…author and noted journalist's recent The Gates of Gaza (A       Story of Betrayal, Survival, and Hope In Israel's       Borderlands), Little, Brown and Company. 2024 is bound to be       a classic.\n\nThis literary masterpiece offers eye-witness report from       that ``Black Sabbath'' with its shocking Holocaust images,       continuing to shake…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…ensuring that the VA sends  Congress the results of the VA review so that we can decide whether to  adjust the maximum coverage for VA life insurance programs.\n\nWe are duty bound to ensure that the families of our veterans are  taken care of after their loved one passes away. This commonsense bill  would provide us with the data to help Congress do…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Judiciary  Committee, like the gentlewoman from Georgia.\n\nWe may come at these things from slightly different perspectives on  different issues that come before us, but we are bound and joined  together here in wanting some commonsense, good government to make sure  that we know what we are dealing with, with respect to criminal laws.  For decades, the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…of Judaism), is Greenberg's own       triumphant accomplishment offering Jews and non-Jews alike an       encompassing scholarly yet accessible work of theological       art, bound to rank high as a pioneering beacon of light,       learning and enlightenment in our postmodern new age with       revolutionary promise as well as colossal dark threats to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…raised and grew up, but he always did it with a good-natured  smile and a quiet, respectful manner.\n\nJust 3 weeks ago, on December 15, I took my seat on an early  Washington-bound flight from Sacramento, about eight rows behind Doug.\n\nWhen I looked up, he was standing there in the aisle with an  outstretched hand. He leaned over, and he quietly said…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698711/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a community gathering place. It is their own Cheers, as longtime staff  member Dan Collar described. It is a place where locals and visitors  alike return year after year, bound by a shared experience of  belonging.\n\nThe Waterville Hotel serves as a gateway to the spectacular Pine  Creek Valley, the Pennsylvania Grand Canyon, and the Pine Creek Rail…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…American people do not think so.\n\nThat is why the House Committee on Oversight and Reform adopted  legislation that would allow the President to manage the workforce  without being bound by last-minute union agreements designed to  undermine him. That legislation, the Preserving Presidential Management  Authority Act, sponsored by Representative Cloud of Texas,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Vashem's chairman turns from his       respectful position ``as the official representative of       memory'' to someone who enables carrying on painful memories       which are bound to exact a heavy price on the living.\n\nThe Israeli military delegations' visits do have a       commendable educational purpose and value, binding a       torturous not too…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…legitimate interests of the international community.\n\n(4) The PRC has ratified the International Covenant on       Economic, Social, and Cultural Rights, and is thereby bound       by its provisions. The PRC has also signed the International       Covenant on Civil and Political Rights.\n\n(5) An official campaign to encourage Han Chinese migration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}]