[{"senator": "George Latimer", "party": "Democrat", "sentence": "…list this week when they shop and jot  down the prices they pay. List the date.\n\nSpecifically note the price of a loaf of bread, a gallon of milk, a  gallon of orange juice, a box of cereal, a dozen eggs, and a package of  butter. Stop in any store. Note the price of a package of gym socks and  a tube of toothpaste. When my colleagues gas up their cars,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695047/buckling-under-the-weight-of-rising-costs"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…emergency food distribution.\n\nThere, I talked to a single mother with a young child with  disabilities. She showed up in the cold 4 hours early for a food  distribution of a single box of food. Without her November SNAP  payment, she said that she would have to skip meals to make ends meet.\n\nI also talked to seniors who were deciding whether to purchase their…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697054/snap-cuts"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…afraid of this President. They are willing to lie  to the American people because they fear the tweet of a President more  than they fear the wrath of the voters at the ballot box. This will  come home to roost because 17 million people are going to lose their  healthcare.\n\nIn Texas, we are one of the largest creators of clean energy jobs.  Texas is the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693208/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…will continue to make clear that the  contributions of Black Americans will not and cannot be erased,  undermined, or undone.\n\nWe will continue to fight for access to the ballot box, fair  representation, diversity initiatives, and our fundamental freedoms,  which are, sadly, under threat each and every day.\n\nAs the conscience of the Congress, we will not…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…about making  someone show ID? Well, like many catchy sales pitches, this policy is  really a bunch of ``gotchas'' that will stand between millions of  voters and the ballot box.\n\nAccording to the Brennan Center, more than 9 percent of voting-age  American citizens, 21 million people, don't have proof of citizenship-- typically a birth certificate or…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…was a most unusual--most unusual-- comparison.\n\nI haven't put all the lyrics of the song up on my chart, but one of  the other lyrics was about sending the Ayatollah home in a box. I mean,  is this some kind of a joke? Is this the way we treat war now? We run a  victory lap, overstate it, and we turn it into a funny music video, or  we use a Hiroshima…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…those officers, a plaque  required by law--required by law. Instead of a sham committee, how  about you get a screwdriver and hang the damn plaque because every day  it sits in a box is another day Republicans dishonor the heroes who  defended this place.\n\nIf they insist on this little circus, at least investigate something  real, like why Donald Trump pardoned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans have blocked--get  this--debate on amendments that would protect SNAP and Medicaid for  millions of Americans and debate on amendments to protect access to the  ballot box, the foundation of our democracy.\n\nThey even blocked debate on bipartisan amendments which would provide  a permanent pay fix for Federal wildland firefighters and allow grants…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…shoe drives where you have a school or a company and you  see that everybody has some pairs of shoes that don't fit them that  still have a lot of good wear, then put them in a box and send them  off.\n\nThe same thing is true with aspirin and creams for people's hands.  They work with their hands. They need gloves to work with the soil.  They raise their…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…a wide range of wireless communications technologies,  including WiFi, GPS, and Bluetooth.\n\nThere are a whole lot of gamers who would love that Ralph Baer  invented the Brown Box, a prototype for the first multiplayer,  multiprogram video game system.\n\nThese are just a few of the innovative contributions that American  Jews brought to all of our lives.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…paying more because of the President.\n\nThe staple items for this classic American holiday cost, on average,  7 percent more than last year.\n\nTake my favorite side, stuffing. A box of stuffing mix has soared by  double digits. The centerpiece of many tables, turkey, is up 7 percent.\n\nIt is not just Thanksgiving food. Grocery prices are up. Families of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697059/increasing-costs-of-thanksgiving"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…decision in 2013. The bill would expand automatic voter registration  and allows for same day voter registration and protects against race- based discrimination at the ballot box. Democrats passed the John Lewis  Voting Rights Advancement Act through the House in 2021, but it was  blocked by Republicans in the Senate. The House Republican majority in…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…division, and  fear amongst us. In fact, the very foundation of our democracy is built  on the idea that the voices of our people are our most powerful tool,  exercised at the ballot box, the debate podium, and in our communities.  That is how we come together as a nation to form a more perfect Union.\n\nIndeed, the very concept of democracy was forged in that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695522/violence-nor-silence-is-the-answer"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…accountable; dismantled so that the political opposition  never has enough room to maneuver meaningfully.\n\nThere are still elections. The Executive doesn't try to stuff the  ballot box. Occasionally, at lower levels, the opposition still wins.  But what happens is that those structures of accountability are either  so degraded or so completely co-opted by…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…raises costs on everything, from energy bills to  prescription medications.\n\nThis bill is a grave mistake. If it passes, my Republican colleagues  may pay for it at the ballot box, but countless Americans will pay for  it with their lives.\n\nI urge my colleagues to have the moral courage to oppose this bill.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693160/one-big-beautiful-bill-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…house, a person can open up a  cooler and pull fresh vegetables out of there based on the honor  system. The bag says how much someone is supposed to pay for them.  There is a box with cash in it.\n\nMr. Speaker, try that in one of your metropolitan areas. While I hear  my colleague talk about how much help we in the small town need for  more government,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…youth mental health and grief, then  redesigning the children's waiting room at Valerie House to create a  more welcoming space. She repainted the room and assembled a resource  box filled with toys and activities to support the well-being of  grieving children. Her efforts will have a lasting positive impact on  the community.\n\nOn behalf of the 17th Congressional…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…White House  following the 2020 elections. They had the ability to make those  changes, but they took the country in the wrong direction.\n\nThat is why the country, at the ballot box, made the changes that  they made. They took the House out of Democratic hands and made  Republicans lead the House of Representatives. Then, they did the same  with the Senate…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…these attacks and  all who seek to harm our elected officials, regardless of party or  ideology.\n\nIn this country, we resolve our differences through spirited debate,  the ballot box, and by working through an intentionally designed  constitutional system left to us as our Founding Fathers' greatest  legacy.\n\nThe victims of this horrible attack were not…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…compete.\n\nNow, it looks like the reality of sounding like an idiot economist  around here doesn't buy you a lot of friends, Mr. Speaker. Yet, the  fact of the matter is the budget box that was just offered is an  opportunity to--Mr. Speaker, forgive me, my asthma and my lung  infection are going a little nuts right now--it is an opportunity to  stop our taxes…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the selfless acts  of service done by Diana Lawrence and the Troop Box Ministry to bless  our Nation's servicemembers.\n\nIt all began nearly a quarter century ago in the garage of the  Lawrences' residence in Hamersville, Ohio. One of Diana's family…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…may have been able to  intimidate Biden. But any attempt to fool or strong-arm President Trump  will not succeed. If Putin thinks he is going to pull the wool over his  eyes or box him into a corner, Putin is in for a very rude shock.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…did.  Yet, that attempt also, of course, failed.\n\nAll three of these attempts to undermine the opportunity for voters  to even vote on this fairly failed. It went to the ballot box. Newsom  led the campaign against it at the ballot box. At the end of the day,  Prop 36 passed overwhelmingly with nearly 70 percent of the vote in the  State of California.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…shopping cart;\n\nWhereas Evelyn Berezin invented the first true word-      processing computer and automated airline reservation system;\n\nWhereas Ralph Baer invented the ``Brown Box'', a prototype       for the first multiplayer, multiprogram video game system;\n\nWhereas Ruth Handler founded the toy company Mattel and       invented the Barbie doll;\n\nWhereas…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, let's go back to 1974, which was,  indeed, a big year. It was the year ``Blazing Saddles'' was a massive  box office success, ``All in the Family'' was the top-rated TV show,  and ``Happy Days'' premiered on ABC.\n\nMr. Speaker, it was that same year that Trinity Baptist College was…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689692/recognizing-50th-anniversary-of-trinity-baptist-college"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…would offend  every man who signed his name to our Declaration of Independence.\n\nI have good news for the American people. No longer will our  elections be governed by a check box if we do our jobs in this House  Chamber and our colleagues in the Senate do their jobs. No longer will  people pretend to be an American and, thus, influence our elected  leaders.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…pregnancy center and then share other  serviceable items with community partners. Ms. Furlong also visits the  Center each weekend when the facility is closed to check the donation  box and bring donated items inside to ensure they reach the intended  recipients. When volunteers are united in an important mission, it  naturally fosters camaraderie which is…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our elections.\n\nWe have already seen what happens when Washington refuses to act. We  have seen the chaos at the border. We cannot let that chaos spill over  into the ballot box. The SAVE America Act helps prevent that.\n\nThis bill delivers on one of President Trump's top priorities, and  that is to secure our elections and to make sure only citizens…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…cities like this one, who seem to have  forgotten the men and women in towns like Boonville and New Madrid or  their brothers and sisters, because ``American'' is not just a box you  check on a tax form but a sacred responsibility that binds us to one  another, an unbroken chain between our past and our future.\n\nI do not know what the future holds,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…grandparents, we prosecuted ministers, and we prosecuted  coaches.\n\nMr. Speaker, the only evidence you have is what that child can  testify to in front of a bunch of strangers in a jury box, a judge in a  dark robe, and people in our adversarial system because you rarely have  physical evidence in these cases. We sometimes, but rarely, have  extraneous evidence.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}]