[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Senator Booker, and others,  Secretary Rubio said again that he understood the importance of  continuing to fund emergency food aid.\n\nWhy isn't it being done? Why are there boxes and boxes of this  product sitting in warehouses in the United States, waiting for funding  to be restored when the Trump administration has said that they intend  to do so?…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…restore the program. They put in  purchase orders. They put out RFPs. They have tweeted. They have  posted. They have testified this program will be restarted. Yet,  thousands of boxes remain stuck in a warehouse in Rhode Island, instead  of getting to the children who need it.\n\nMr. Speaker, I will continue to speak on this floor every day until  those boxes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695735/edesia-nutrition"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…William County, the church expanded its mission--opening its doors to  the entire community.\n\nAs of today, volunteers come together once a week to package and  distribute food boxes to families across the community. What started as  a small operation has now grown into a critical lifeline for thousands.  The Neabsco Baptist Church has now provided food…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696800/recognizing-the-neabsco-baptist-church-for-serving-families-in-need"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…already.\n\nIt is good that the administration is saying that they intend to  continue providing this aid around the world, but they need to do it.  Again, there are thousands of boxes of this ready-to-use food sitting  in warehouses here in the United States that should be getting to the  children who need it.\n\nEvery day that the United States fails to provide…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…drag their feet.\n\nEdesia Nutrition, in my district, manufactures some of that food aid  designed to help starving children get back to health. After 8 months,  thousands of boxes are still sitting in a warehouse in Rhode Island  instead of getting to kids who are starving to death.\n\nNow, the administration finally awarded a contract a few weeks ago,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694817/restoring-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…and since the Trump administration came into  office in January, not a single dollar of that money has gone to buying  this promised lifesaving food aid. Instead, Edesia  has boxes of food stuck in warehouses, factory workers laid off, with  children suffering from severe malnutrition and famine.\n\nThis is food that has already been paid for by the American…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…specialized nutrition to bring them back to health, including the  nutrition manufactured by Edesia Nutrition in North Kingstown, Rhode  Island, in my district, where thousands of boxes of emergency food aid  have been sitting in a warehouse since Donald Trump and Elon Musk froze  the program back in January.\n\nThey continue to promise that the program is going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695582/release-food-aid-sitting-for-9-months"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…President of the United States.\n\nIt is steeped in tradition. It is a complicated system because we  don't have a direct election for a President, and it involves these  beautiful boxes that would be displayed here on the Senate desk. They  have the official statements and envelopes from all the secretaries of  state across the country saying: We are validating…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…district, has had to lay off  staff, leaving production of Plumpy'Nut slowed nearly to a halt.  Shipments meant for starving children have been stranded in warehouses.  There are boxes of this stuff sitting in warehouses right now with no  place to go. Every hour of missed production means 415 starving  children will not get the food they need to survive.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…technology viable? Is the  engineering done competently? Is there a market for it? Does it add to  our national or economic security?\n\nThe projects in question check all of these boxes, so what has  changed? The Department of Energy claims that it conducted a ``thorough  and individualized financial review of each award.'' It found that  ``these projects…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…This bill is only the latest Republican attempt to erect barriers to  the ballot box, following recent attempts to make it more difficult to  vote by mail or by ballot drop boxes. Just last week, the President  signed a sweeping executive order with several onerous provisions that  would risk disenfranchising millions of Americans.\n\nDemocratic bills,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…41st time to call on the  Trump administration to restore lifesaving food aid for children  starving around the world. Edesia Nutrition in my district is about to  send 15,000 boxes of this lifesaving food aid to children who are  starving in Gaza.\n\nNow, in the past, this would have been done with support from  America, from the U.S. taxpayers, and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…from malnutrition, the Trump administration has stopped  funding this lifesaving program.\n\nIn my district in North Kingstown, Rhode Island, there is a warehouse  with 90,000 boxes of Plumpy'Nut, lifesaving food aid that is designed  to save the lives of starving children whose organs are shutting down  and can no longer process conventional food.\n\nThis…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…arms. They need to be remembered.\n\nThe Government of the United States is only about one-quarter of our  economy, but 75 percent of our economy is private. People can send  boxes. They can remember them. They can send money through Western  Union to the people of Ukraine and to help those who are living in  Poland in order to help them meet the costs…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…prices, and they feel the harm. Food banks in  Ohio and across our Nation are seeing shelves go bare, school meal  programs, senior nutrition, and food pantry lifelines short. The boxes  going out to seniors don't have protein.\n\nWhen Federal food dollars are cut off, it doesn't just hurt the  hungry, it hurts the producers. Congress must restore these funds…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…both on and off  campus. She has volunteered her time at the local food pantry and  played a key role in a student-led campaign to collect non-perishable  items for blessing boxes in the community of Ozark, Arkansas, ensuring  those in need have access to essential resources.\n\nJayden is also blazing trails in traditionally male-dominated fields.  She…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…throats because we have turned our backs on  God. We are at each other's throats because nonstop there is a deluge  of imagery and horrific thoughts that are flooding into the in-boxes  and into the visibility of our children and, frankly, ourselves.\n\nCharlie Kirk was correct, that we have to focus on getting back to  church, getting our Nation, our families,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…of the Order of the Arrow scouting honor  society. On October 21, 2024, he earned the rank of Eagle Scout. For  his Eagle Project, Oliver constructed two raised bed planter boxes for  the Plano Chinese Alliance Church as a show of appreciation for the  Church's generosity in allowing Troop 219 to host meetings using their  space. In the planter boxes,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are tired of wondering whether their votes matter. They are tired of  wondering if those who have no right to vote--those who are  noncitizens--are actually packing our ballot boxes with illegal votes.\n\nI am more determined than ever to secure our elections, but in an age  of progressive, suicidal empathy, basic concepts such as voter ID and  proof of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a reflection on the past but a  celebration of what is to come.\n\nAs part of this milestone, ACCAP is launching a monthlong  celebration, including the placement of donation boxes throughout  Armstrong County. This is a wonderful opportunity for all of us to give  back and to ensure that ACCAP's vital work continues for generations to  come.\n\nMr. Speaker,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I am probably going to end up using these a couple of times here  because I think they make a point.\n\nThe way a reconciliation budget is laid out is it creates a series of  boxes. Here are all of these authorizing committees. We need you to  find savings. We need you to find those savings through modernization  and waste and fraud.\n\nWe are going to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…behind the States anymore in crafting a very good, commonsense piece of  legislation.\n\nThis bill is victim-centered. It is law enforcement-focused, as well.  It checks all the boxes of good public policy.\n\nMr. Speaker, I urge my colleagues to support it, and I yield back the  balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}]