[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…billionaires if my  colleagues on the other side of the aisle gave it to decreasing the  deficit.\n\nThis is the party that is trying to kill Social Security through the  DOGE boys, who are cutting out services for people who use the phone to  deal with their Social Security and eliminating employees from Social  Security. The majority is trying to kill…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689891/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…I rise to honor Coach Denise Osorio, a  youth mentor, mother, and community leader who calls the city of  Anaheim home.\n\nDenise is the head coach of the Anaheim High School boys' and girls'  water polo teams.\n\nDenise took on the challenge to rebuild Anaheim High School's aquatic  program after 20 years with no swimming pool and no swimming program.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…nonconsensual  intimate imagery. Mr. Speaker, the consequences, as you just heard, are  devastating for every victim, their family, and their community. It  happens to men and boys, to women and girls. Most often, it happens to  women and girls.\n\nAs AI becomes more prevalent in our everyday lives, Congress must  meet this moment. We must empower and protect…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…him; she named him.\n\nHere is what Charles Exum had to say to his friends, his colleagues,  on his cell phone:\n\nI fired 5 rounds and she had 7 holes. Put that in your book       boys.\n\nCool. I'm up for another round of ``[eff] around and find       out.''\n\nIt is the cruelty of seven bullets in her body, causing her almost to  bleed to death--a woman who…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…eliminated the uncertainty she felt as a child and  allowed her to pursue opportunities she otherwise would not have. She  is now a U.S. citizen, married, with two beautiful boys. She owns a  home. She manages a global team at a commodity trading company in  Connecticut.\n\nAnother DACA recipient who also came to the United States when she  was 9 years…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…champions at Hoover High School, who  dominated their competition and brought home the gold at the end of  their 29-3 season. Way to go, ladies.\n\nLikewise, Hoover High School's boys were also crowned 7A champions at  the end of their undefeated season. Go, Hoover Buccaneers.\n\nIn Tuscaloosa, we recognize the boys of Paul W. Bryant High School,  who took…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…programs alongside academic preparation.\n\nThe school is comprehensive and excels in athletics, as well. For  example, during the 2023-2024 school year, they were city champs in  boys' water polo, girls' basketball, girls' golf, girls' softball, and  girls' swim and diving. Whitney M. Young Magnet High School was also  the State champion in the Academic Decathlon…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…even mention Federal officers because they have to maintain  the pretense that Capitol officers did something wrong by defending us  against the violent rampage of the Proud Boys, the Oath Keepers, the  Three Percenters, and other extremist marauders who stormed the U.S.  House of Representatives and the Senate.\n\nIs that right or will the majority please…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…scheme.\n\nAlthough the land was conveyed to the city, the National Park Service  still retains a deed restriction. Today, the parcel is utilized, as you  heard, by the Oscar Cross Boys & Girls Club, which provides programming  for youth in the community. The club is a central part of the community  but faces challenges in accepting new members and a growing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Congressional  District that won their WPIAL championships this fall season. Those  champions are as follows:\n\nIn football, they are Aliquippa, Avonworth, and Seton LaSalle.\n\nIn boys' soccer, they are Fox Chapel, West Allegheny, and Deer Lakes.\n\nIn girls' soccer, they are North Allegheny and Fox Chapel.\n\nIn girls' tennis, they are Shady Side Academy and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699040/congratulating-wpial-champions"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…family. He and Rosemarie were married for over  60 years, and they raised two sons, Sean and Brian. Over the years,  Jerry spoke to me with such pride about the success of his boys. Truly,  his family was the center of his life.\n\nTo scores of Colorado lawyers, Jerry was a guiding light and voice of  reason. He gave us advice, set an example through his…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690315/in-remembrance-of-gerald-p-mcdermott"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…with your hard-earned Social Security benefits.\n\nMusk is coming after your Social Security. The top administrator of  the Social Security administration says that Musk's DOGE boys are  trying to break the system entirely. That will stop your hard-earned  benefits from reaching seniors and eligible recipients.\n\nSocial Security benefits are your hard-earned…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the CLARITY Act and the GENIUS Act.  We have talked about a lot of intricacies of crypto. The general public  does not understand all of this because the big  issuers, the big boys, literally kind of own all of the information.  They are the issuers, et cetera, et cetera.\n\nIt is time for the United States Government to take charge, and our  central bank…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Ministries, an  organization dedicated to building an orphanage and school in Haiti.  Over the past decade, Elevate Haiti has offered critical education and  housing for young boys.\n\nDuring Caribbean American Heritage Month, it is my great privilege to  recognize Roosevelt Mareus. His leadership and service continues to  inspire and uplift communities…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692566/recognizing-roosevelt-mareus"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…lights are everywhere. Liberation day is  just going to worsen the situation that we are seeing, not only for  people who are in the stock market, which, you know, they are big boys  and girls. They can handle themselves. It is really the people on Main  Street who are going to feel the brunt of a tariff policy that goes  completely in the opposite direction…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…public photos to  demand payment or further abuse. This drives severe trauma, self-harm,  and suicide.\n\nMore than three dozen teens have taken their lives in recent cases,  with boys aged 14 to 17 hit hardest. Reports of these horrible crimes  are surging. NCMEC, the National Center for Missing and Exploited  Children, reports that financial sextortion cases…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698863/combating-online-predators-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Congratulating Roanoke Valley Christian Schools Eagles\n\nMr. CLINE. Mr. Speaker, I rise today to congratulate the Roanoke  Valley Christian Schools Eagles varsity boys' basketball team for  winning the 2025 VACA State championship, securing back-to-back titles  and etching their names into school history.\n\nAfter graduating eight seniors last…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…compete in the national tournament  in Florida this July.\n\nI absolutely love coaching, and I don't think there is anything  better than that. I have been coaching most of these boys since they  were in second grade, and it has been amazing seeing them grow up,  compete together, and support each other like teammates always should.\n\nMy players--Kenny Ciscomani,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…``Ukie Nation''  proudly wear blue and yellow and play under the Philadelphia Ukrainian  Nationals Banner. Travel and club teams, including all skill levels,  are offered for boys and girls all year round. The UASC Tryzub is not  only notable for their achievements, but for giving back to the  community. The players develop and improve not only their…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…and Field program is organized by the Special  Olympics. Each team has a proportional number of athletes who are  eligible to participate in the Special Olympics and includes boys and  girls from grades 9 to 12.\n\nAs Manheim Township celebrates another Unified Track and Field team  championship, I sincerely congratulate the athletes and coaches that  have…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691919/congratulating-the-manheim-township-unified-track-and-field-team-champions"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…congratulate the high  school athletes from Wisconsin's Seventh District who competed in the  State championships during the 2025 spring sports season.\n\nDuring the individual State boys' golf tournament, Drake Card of  Hudson and Tucker Johnson of Neillsville took home the Division One and  Division Three State titles, respectively.\n\nFor girls' track and field,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692967/congratulating-high-school-athletes-from-wisconsins-seventh-district"}, {"senator": "John Rose", "party": "Republican", "sentence": "…now will feel compelled to do the same.                       Congratulating the Upperman Bees\n\nMr. ROSE. Mr. Speaker, I rise today to congratulate the Upperman High  School boys' basketball team on securing the first State championship  in program history last month. The historic matchup was a nail-biter as  the game was tied up for much of the night.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today to congratulate the Catalina  Foothills High School boys' swim team for winning the D2 State  championship.\n\nThe Falcons finished with a total score of 386, with senior Connor  Daggett winning gold.\n\nThe team finished first in three…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699071/catalina-foothills-high-school-boys-swim-team-wins-d2-state-championship"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…stormed Omaha Beach on June  6, 1944.\n\nBedford had the largest D-day loss per capita of any town in the  United States, losing 20 men on Omaha Beach. Known to many as the  Bedford Boys, they were amongst the first soldiers to land at Normandy  as part of Operation Overlord. Their stories of heroism and sacrifice  will be passed along from generation to generation.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…United States, and Chinese teams are taking a       majority of the prizes.\n\n(10) Girls participate in mathematical modeling challenges       at all levels at similar levels as boys, while in traditional       mathematical competitions girls participate less and drop out       at every stage. Students cite opportunity for teamwork, using       mathematics…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I rise today not just as a Member of Congress  but as the father of two Jewish boys. I speak for all the Jews across  the country, millions of them, who today go to the grocery store, their  jobs, and school and live their lives afraid of what might happen…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, I rise today to recognize the extraordinary  achievement of the 2025 Glenvar High School boys' swim team, the VHSL  Class 1 and 2 combined State champions. The Glenvar Highlanders  traveled to Richmond on February 27 and captured their second  consecutive State title,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Federal  agency.\n\nThis is why the smart decision Republicans are making today will  codify and make a strong decision because we finally have true  competition against the big boys that people say they are fighting  against.\n\nThis is a commonsense issue, and I am proud to support Congressman  Barr on this as a Member of the Financial Services Committee.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691497/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Committee. Driven by a passion for  service, Commander Lux was a founding member of American Legion Post  911 in Cedar Park, raising funds for the Gold Star Monument and  supporting Boys and Girls State programs. Commander Lux is a devoted  husband to his wife, Michelle, and a proud father to their two  children.\n\nI commend Commander Lux's dedication to his…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…parking lot to the University of Utah Huntsman Center basketball  game. There are always a few police officers there directing traffic  for the few hours of that. I had four boys under the age of 10 at the  time. I was trying to help get them out of their shell, talk to other  adults, and be a little bit more engaging with folks. I have kind of  forced…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}]