[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Braddock District\n\nMale Athlete: Tillman Abeyta, Football, Braddock Road Youth       Club; Female Athlete: Norah Garcia, Soccer, Annandale Boys &       Girls Club; Coach Carlos Santizo, Soccer, Braddock Road Youth       Club, Parent: Angela Santizo, Soccer. Braddock Road Youth       Club.                             Dranesville…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…because  nobody else would apply for the job.\n\nMr. Speaker, 30 years later, he has produced national high school  wrestling champs, State champs, CIF wrestling champs, both boys and  girls.\n\nMr. Speaker, it is often said that, when a person tastes success, it  changes their lives forever. Coach Glabb has helped thousands of  students discover their inner…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691910/recognizing-scott-glabb"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…are everywhere. Liberation day is  just going to worsen the situation that we are seeing, not only for  people who are in the stock market, which, you know, they are big boys  and girls. They can handle themselves. It is really the people on Main  Street who are going to feel the brunt of a tariff policy that goes  completely in the opposite direction…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Although the land was conveyed to the city, the National Park Service  still retains a deed restriction. Today, the parcel is utilized, as you  heard, by the Oscar Cross Boys & Girls Club, which provides programming  for youth in the community. The club is a central part of the community  but faces challenges in accepting new members and a growing wait…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…rise to honor Coach Denise Osorio, a  youth mentor, mother, and community leader who calls the city of  Anaheim home.\n\nDenise is the head coach of the Anaheim High School boys' and girls'  water polo teams.\n\nDenise took on the challenge to rebuild Anaheim High School's aquatic  program after 20 years with no swimming pool and no swimming program.  Under…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Opelika Arts Association, Lee County Salvation  Army, Achievement Center Easter Seals, Chattahoochee Council Boy Scouts  of America, Chattahoochee Historical Commission and Boys & Girls Clubs  of Greater Lee County.\n\nMayor Fuller has served the Alabama Municipal Electric Authority  (Chairman), Alabama League of Municipalities (Past President), Alabama…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…include a reservation requiring that--\n\n(1) the City of Paducah, Kentucky, not transfer or sell the       parcel of land to any other entity, except the Oscar Cross       Boys & Girls Club of Paducah;\n\n(2) if the City of Paducah, Kentucky, transfers or sells       such parcel to the Oscar Cross Boys & Girls Club of Paducah,       that the Oscar Cross…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Field program is organized by the Special  Olympics. Each team has a proportional number of athletes who are  eligible to participate in the Special Olympics and includes boys and  girls from grades 9 to 12.\n\nAs Manheim Township celebrates another Unified Track and Field team  championship, I sincerely congratulate the athletes and coaches that  have made…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691919/congratulating-the-manheim-township-unified-track-and-field-team-champions"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Nation''  proudly wear blue and yellow and play under the Philadelphia Ukrainian  Nationals Banner. Travel and club teams, including all skill levels,  are offered for boys and girls all year round. The UASC Tryzub is not  only notable for their achievements, but for giving back to the  community. The players develop and improve not only their soccer…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…service projects. That effort pays off in  character, confidence, civic service, and self-reliance of our young  people.\n\nEleanor and I are father and mother to three boys and two girls, and  we look forward to hopefully one day being the proud parents of five  Eagle Scouts.\n\nToday, Mr. Speaker, let's honor the Scouts, the volunteer leaders,  the parents,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, it was a pleasure to visit the Midvale Boys &  Girls Club recently to speak with the youth about success, grit, and  the power of their dreams.\n\nThis summer, over 200 young people, supported by 17 dedicated staff  members,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693107/recognizing-midvale-boys-girls-club"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…of the Year by the Lee County Community Foundation for his volunteer  work  and philanthropy. He has also served as a board member for the Sanford  Area Growth Alliance, Boys and Girls Clubs of Central Carolina, and Lee  County Education Foundation, among others.\n\nIn his career, Mr. Oldham's company's involvement in a variety of  projects, including critical…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Driven by a passion for  service, Commander Lux was a founding member of American Legion Post  911 in Cedar Park, raising funds for the Gold Star Monument and  supporting Boys and Girls State programs. Commander Lux is a devoted  husband to his wife, Michelle, and a proud father to their two  children.\n\nI commend Commander Lux's dedication to his community…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Paducah,  Kentucky.\n\nIt is an honor to serve the people of Paducah and McCracken County in  Congress. One of their community's most impactful institutions, the  Oscar Cross Boys & Girls Club has been a cornerstone of support and  opportunity for local youth for over 60 years.\n\nThe club is located on land currently owned by the city of Paducah,  which has…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…D-Patrick has invested hundreds of thousands of dollars annually in  an array of local Indiana organizations, such as Ark Crisis Children's  Center, Boone County Cancer Society, Boys & Girls Club of Evansville,  Evansville Philharmonic Orchestra, Mesker Park Zoo & Botanic Garden,  Ronald McDonald House Charities of Ohio Valley, Special Olympics  Indiana, Tri-State…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}]