[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…America right now.\n\nLast month, in San Francisco, four asylum-seekers were taken by ICE  after their hearings were over. In New York City, even a city official,  Comptroller Brad Lander, was detained by ICE while trying to support an  immigrant friend.\n\nIf they are willing to rough up city officials, mayors, and even a  sitting U.S. Senator, what does…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…to be commended. I recognize  Sharon Billings, Caitlin Cahill, Keith Engel, Aditi Ginuga, Anne  Leland, Cathy Olson, Dave Olson, Paula Ramaley, Cole Roepke, Adaline  Shinkle, Brad Shinkle, Diane Sjolander, and Anita Smithson.\n\nThe people of Minnesota's Third Congressional District are fortunate  to have them as neighbors, friends, and community members.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689743/recognizing-constituents-of-minnesotas-third-congressional-district-for-their-work-in-promoting-democracy"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Green, who  managed the credentialing contract; and the entire PILLARS development  team of Casey Bishop, Jason Blum, Roger Masse, Atul Patel, Silvino Da  Sul, Mehmet Yuksel, Brad Nathan, Claudette Archambault, and Jason  Tongarm.\n\nOn January 20, 2025, the world witnessed the 60th inaugural  ceremonies, as they have every 4 years since 1789, and I offer…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…profoundly missed.  His passing is a loss felt across the political spectrum and throughout  Illinois.\n\nMr. Speaker, my thoughts are with his wonderful family, especially  Brenda, Brad, and Elizabeth, along with our entire State, as we mourn  his passing and celebrate his extraordinary life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695630/in-memory-of-the-honorable-jim-edgar"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…The Gabelli Leadership Awards will be given to Paul Adler, chief  strategy officer of Rand Commercial; Adam Hammerman, vice president and  CEO of New York Medical College; and Brad Schwartz, a partner at Zarin  & Steinmetz law firm.\n\nThe Friedland Young Leadership Awards will be given to Samuel Adler  of Rand Commercial and Lee Lefkowitz, partner for Zarin…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698121/recognizing-jewish-business-network-awardees"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…police, shuttering prisons, massive unfunded spending  increases, and even government-run grocery stores.\n\nIn New York, job-killing comptroller, socialist, and reckless spender  Brad Lander refuses to condemn anti-Semitic language like globalize the  intifada, which calls for the death of the Jewish people. Many of  Mayor-elect Mamdani's policies are radically…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…known as HDHP.\n\nThis commonsense legislation, as you heard from the chairman, already  passed Congress last session under the leadership of my friends and  former colleagues, Brad Wenstrup and Earl Blumenauer. It is common  sense mainly because, as you heard from the chairman, chronic disease  is so common.\n\nMr. Speaker, 6 in 10 adult Americans have a…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…the freedom of  all Americans might have been at risk.\n\nThroughout this Nation's history, countless people have had to fight  for their right to be included. My good friend Brad Lang, and his  father, Donald, are powerful examples of that fight.\n\nIn 1942, Donald W. Lang, Sr., enlisted in the Army with dreams of  becoming a pilot. Like many men at the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Vasquez, Christina Sandstedt--who has been give privileges  of the floor this very day--Julia Wood, Terry Miller, Emily Yetter, Dan  Hillenbrand, Beth Spivey, Brendan Gavin, Brad Patout, Rick Berger, and,  as I said before, my adviser and personal friend John Keast.\n\nThat is a lot of names and a lot of effort and a lot of talent. That  is just the members…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…California, later serving as his  Legislative Director and then his Chief of Staff. Following Congressman  Herger's retirement, Derek served as Chief of Staff to Representative  Brad Wenstrup of Ohio. As Chief, Derek was known for prioritizing  first-in-class constituent services, a focus he has maintained  throughout his career in the House.\n\nAfter a short…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…just a thank you. We owe them respect, admiration, and our  unwavering support.\n\nMr. Speaker, I encourage my colleagues to do the same and to honor  the life of Deputy Sheriff Brad Reckling. May we always appreciate the  men and women in blue.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691379/recognizing-the-life-and-service-of-deputy-sheriff-bradley-j-reckling"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…2014. Christopher has served in many different roles  during his tenure and worked for Representatives Sean Duffy (WI-07),  Keith Rothfus (PA-12), Jim Sessenbrenner (WI-05), and Brad Wenstrup  (OH-02). I came to know Christopher when he began working as a Press  Secretary for the House Committee on Energy and Commerce under Chair  Cathy McMorris Rodgers…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…carjacking?\n\nWhat about the Rand Paul staffer who was stabbed in a bar five blocks  from here? I don't go there anymore. I don't go there anymore because  it is not safe.\n\nWhat about Brad Finstad, who got robbed at gunpoint?\n\nWhat about the staffers who got robbed 6 months ago?\n\nJustice Sotomayor's detail shot an 18-year-old multiple times because  he was trying…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…roles in the response,  including the Mississippi Emergency Management Agency, Mississippi  Department of Public Safety, the Mississippi Department of  Transportation headed by Brad White, Mississippi State Department of  Health, and Mississippi Forestry Commission. FEMA has also been on the  ground, providing $3.75 million in rapid emergency funding from…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Row, president;  Michelle Larsen, vice president; Patricia Cloud, treasurer; Anna Birch  DeWitt; Tayla Trujillo; Ally Orr; Nikki Hawley; Scott Wells; Tony  Hager; Bobby Pickle; Brad Diller; and Fleur Tremel.\n\nThose serving on the CDC Foundation Board include: Mark Zaback,  chairman; Jeff Bishop, treasurer; Robyn Landen; Shannon Orr; Peter Van  Houten; Pete…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Fast-forward to 2023, when local residents Jason McConnell and  Vanessa Brown, whose families had roots and ownership of the adjacent  country store, joined forces with longtime friend Brad Wyland to  revitalize both the hotel and the restaurant.\n\nTheir vision has been rooted in pride and preservation, honoring  family ties and restoring beloved menu items including…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Pietsch,       Bryan: Bloomberg News.\n\nPigman, Alexander: Agence France-Presse; Pilshchikov, Ivan:       Itar-Tass News Agency; Pinho, Faith: Los Angeles Times;       Plumer, Brad: New York Times; Poff, Jeremiah: Washington       Examiner; Politi, James: Financial Times; Pollard, Sonya:       Bloomberg News; Poon, Linda: Bloomberg News; Powers, Martine:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]