[{"senator": "Al Green", "party": "Democrat", "sentence": "…is going to go back to where he was. I don't think he  will. Even he understands that he was making a serious mistake.\n\nHere is the problem with that mistake: He has hurt the brand, the  American brand. He has hurt the image of the country. He has put the  country in a position such that people may no longer think that this is  the safest place for their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Thomas Blanford, Jackson Blodgett, Anthony Bocchino, Micah       Bock, Jody Bogoslavski, Savannah Bolender, Claire Bossong,       Scott Boswell, Taylor Bradley, Lindsay Brand, Matt Brennan,       Alyssa Bretan, Caroline Broom, Joseph Brown, Sarah Brown,       Alex Brunner, Britney Butler, John Byers, Larry Calhoun,       Jillian Cantrell, Molly…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…all over our country. It is a really a delightful thing.\n\nIt is important to our economy. We want to keep doing that, and we  want to sell our nameplates.\n\nJeep is a fantastic brand. I am not pushing, and I am not trying to  sell cars on the House floor. I am just mentioning that we are not  seeing a lot of them overseas, Mr. Speaker.\n\nWhen we have this…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…what I really want is for this person who was  never elected to get an upgrade on a plane. Make sure that you dedicate  $50 million of taxpayer dollars so that she can have a brand-new plane  so that she can cosplay wherever the hell she is going.''\n\nI have never heard that. I hear the gentleman. I am curious. What  Members of Congress have heard from…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…including the Smithsonian, their political  litmus tests for cultural programming, and now the attempted  transformation of the Kennedy Center into a monument to one man's  personal brand.\n\nThe Kennedy Center is the only memorial in Washington dedicated to  President John F. Kennedy, a President who believed that art belonged  to the American people, a President…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…available to all       members of the public without a background check and without       a prohibition on modification. Even with those safeguards,       these bills could open a brand new market for dangerous       weapons that are obtainable by anyone, including prohibited       persons. Despite the stated intent, these bills are not       designed to benefit…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…opportunity to succeed, play, and enjoy this incredible game.\n\nThis year, I was proud to march in the parade to celebrate their  opening day and commemorate the opening of their brand-new field.  Hundreds of spectators lined the streets to cheer on this year's  players, and it was heartwarming to see our community come together for  such a great cause.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, on February 13, President Trump said  something that few expected to hear. He said:\n\nThere's no reason for us to be building brand-new nuclear       weapons. We already have so many. You could destroy the world       50 times over, 100 times over. And here we are building new       nuclear weapons.\n\nWe're…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…voted against that bipartisan bill,  every single one.\n\nAs if that is not bad enough, every single Republican on the Rules  Committee also voted to create, out of thin air, a brand-new committee  to rewrite the history of what happened here on January 6, 2021.\n\nThey are so desperate to paper over what happened that day, to  whitewash it and to pretend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…insight but also her  kindness, dedication, and unwavering passion for public service. Her  excellent work has helped shape our message, build connections, grow  the New Dem brand, and advance the values we hold dear. As a  communicator, Emma is second to none.\n\nAs Chair of the New Democrat Coalition, and before that Vice Chair  for Communications, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Member as a humble staff  assistant, enhancing the caucus communications, directing  communications on energy policy for a senior Member of Energy and  Commerce or helping a brand new freshman establish her office as chief  of staff, Rikki approached every task with the same commitment--to make  life better for the people we serve.\n\nRikki's decade of…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "…1984, joining the Consumer  Products Division as Marketing Director for L'Oreal Paris in the United  States. She continued to foster her passion and built the L'Oreal  flagship brand from a small indie brand in the 80's into the No. 1  global beauty brand worldwide, behind the iconic phrase ``Because I'm  Worth It.''\n\nIn 2008, Carol transitioned from mass…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690596/congratulating-the-work-and-dedication-of-carol-hamilton"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Liberty Financial's  website, it says the majority of the company is owned by Donald J.  Trump.\n\nThis was a pretty exceptional request to make because his crypto  business was brand new. At the time, it was a pretty minor player. So a  $2 billion investment from a country like UAE would vault World Liberty  Financial into the stratosphere. And, in fact,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…privately with Gorbachev about the elimination of  all nuclear weapons.\n\nEarlier this year, President Trump said from the Oval Office: ``There  is no reason for us to be building brand-new nuclear weapons, we  already have so many. You could destroy the world 50 times over, 100  times over. And here we are building new nuclear weapons, and they're  building…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…was the first such  organization in our state dedicated to ensuring safety, order, and  security for Rhode Islanders. What began with just 21 officers  patrolling on Indian-brand motorcycles has grown into a modern,  technologically advanced law enforcement agency committed to the  highest standards of public service.\n\nFrom the earliest days of policing…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…production capacity in the process and will improve the  quality of our own munitions.\n\nSupplemental appropriations on Ukraine and Israel, in turn, backfill  our own stocks with brand new capabilities--not just 155-mm rounds but  air defenses and long-range fires, with specific investment in solid  rocket motors.\n\nThese investments help us prepare for conflict…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…the fields and courts, and even on the beaches, with the  introduction of Beach Volleyball this year, Sam Houston students are  reaching new heights. Dr. White has brought her brand of energy to Sam  Houston State University and the feeling on campus is electric.\n\nAs a Sam Houston State University graduate, I Could not be prouder to  offer this commendation…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Mr. SMITH of Nebraska. Mr. Speaker, I am glad to offer my thanks and  gratitude to James Min, as well.\n\nI appreciate the fact that when I was a brand-new Member of Congress,  a while back, that he has always been a great help not just to me but  to anyone who asks. I am grateful for his selfless public service. As  was said…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688733/offering-thanks-and-gratitude-to-james-min"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…overdoses as they happen. Emergency opioid overdose reversal  drugs are a lifeline, having the ability to save so many lives.  Currently, HHS regulations refer to certain name brand drugs, such as  Narcan, which can limit usage of other versions that may be more  readily available.\n\nMy amendment would require HHS regulations or guidance documents to  include…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691881/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…its agricultural success, Delano has experienced steady commercial  growth, attracting major businesses such as Wonderful Citrus, the  company behind the widely popular Halos brand.\n\nDelano is also a culturally rich and diverse community, shaped by  generations of residents from around the world. Since the arrival of  early settlers under the Homestead…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692510/recognizing-delano-ca"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…private offerings.\n\nMost current pathways to becoming an accredited investor are based on  your balance sheet, your wealth, and your income. This bill changes and  opens up a brand-new pathway allowing for investors' knowledge to be  the determining factor in whether they are able to become an accredited  investor.\n\nIn my view, wealth alone is not a particularly…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693887/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…creating a citrus empire  with the town serving as its commercial and shipping hub. He  constructed Florida's first citrus juice plant in 1921 and introduced  the ``Lifeguard'' brand of canned citrus juice, revolutionizing the  industry. The historic Floridian Hotel, built to accommodate buyers of  his citrus acreage, and the elegant Howey Mansion on the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Convenience Store News.\n\nGreg, the founder and CEO of Parker's Kitchen, has grown his business  from one store in 1976 to his 100th in a grand opening in April of  2025.\n\nHis brand has become a role model in business, being synonymously  described as clean, friendly, profitable, and philanthropic. Greg  exhibits the best characteristics of this award.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the land of opportunity that attracts millions of  individuals around the world each year. A few months ago, I had the  privilege of speaking at a naturalization ceremony for brand-new  American citizens who took their oath to the United States and  officially became fellow citizens. I was inspired by each of their  journeys in becoming Americans and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…its agricultural success, Delano has experienced  steady commercial growth, attracting major businesses such as Wonderful  Citrus, the company behind the widely popular Halos brand.\n\nDelano is also a culturally rich and diverse community, shaped by  generations of residents from around the world. Since the arrival of  early settlers under the Homestead…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Creek Farms in Warriors Mark.\n\nGeorge has transformed his family's 600-acre farm into a nationally  recognized regenerative livestock operation which produces a premium  beef brand.\n\nMotivated to help owners of small farms succeed, George also devotes  time to mentoring fellow beef farmers.\n\nMr. Speaker, I thank George Lake for his military service and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…8.\n\nBrady, III., Leonard: NEXSTAR MEDIA GROUP; Bragale,       Charles: WRC-TV/NBC-4; Braggs, Robert: SENATE RADIO-TV       GALLERY; Bramstedt, Chandler: VENTANA PRODUCTIONS; Brand,       Natalie: CBS NEWS; Brandt, Hannah: NEXSTAR MEDIA GROUP;       Brandus, Paul: WEST WING REPORTS; Brangham, William: PBS       NewsHour; Braun, Saskia: ARD German Radio…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…influenced  policy discussions.\n\nThroughout his career, Collis has dedicated himself to building and  leading effective teams and mentoring numerous colleagues. As a strong  brand ambassador, he has served on several boards, including the  Thurgood Marshall College Fund and The Congressional Award Foundation.  His dedication and leadership have left…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…excellent  endeavor to address hunger in our community. Harley took action by  collecting food donations, educating community members about food  insecurity, and building a brand new food pantry to serve her  community, which will have a positive impact on our community for years  to come.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690443/recognizing-harley-cross-gold-award"}]