[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…responsible for the disastrous collapse of a Brazilian tailings dam  that killed 19 people and spilled tons of toxic waste into a major  river in 2015. This disaster has been called Brazil's worst  environmental disaster.\n\nRio Tinto, the other co-owner of Resolution Copper, blew up a 46,000- year-old sacred aboriginal site in Australia in 2020.\n\nNow, just upstream…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…ad  he  doesn't like on TV featuring a Republican President by a province in  Canada and decide, ``I am just going to hike up another 10 percent''-- or something happened in Brazil--and I congratulate Senator Kaine and  Senator Paul on their recent overturning from this body--finally,  enough is enough; we are asserting our power. You are not going to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…there was a wasteful $21 million grant to  India. The fact is the grant never existed.\n\nIt goes on from there.\n\nThe President claimed that there was a national emergency in Brazil  to justify slapping a 50 percent tariff on a country where the U.S. has  run a trade surplus for over a decade. There is no emergency.\n\nHe shouted about the Epstein files,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, I am here for my, oh, I guess  umpteenth ``Time to Wake Up'' speech.\n\nThis one comes upon my return from Brazil, where I was the entirety  of the United States of America governmental presence at the COP. That  was it. Just me. Nobody else went. And not only did nobody else go-- this…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Republicans  voted for USMCA and 197 Democrats voted for USMCA. It was a bipartisan  effort.\n\nTariffs, as threatened or imposed, can have an outcome, but not when  we look at Brazil and say that we don't like the result of the  Presidential election and that we are going to impose 50 percent  tariffs, or that we are going to close a bridge as it goes to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699969/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, this week, the U.S. Senate voted to  terminate national emergency declarations that enabled President  Trump's tariffs on Brazil and Canada.\n\nNext week, November 5, 2025, the U.S. Supreme Court will hear a  majority of trade cases challenging President Trump's authority to  impose global tariffs under…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…why I oppose this resolution, and I reserve the  balance of my time.\n\nMr. Speaker, it occurs to me that as we are having this debate,  pretty much the rest of the world is in Brazil right now for the  climate conference. Of course, the Trump administration has  disgracefully pulled the United States out of the Paris Agreement once  again, and we have no…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…tariffs could add more  than $10,000 to the cost of a home. Coffee prices hit a record high  earlier this year, and now President Trump wants to put a 50-percent  tariff on Brazil--our largest source of coffee. As families do their  back-to-school shopping, they are going to see higher prices for  clothing and shoes. Those prices could go up by 35 percent…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Biden to Europe for a secret trip to Ukraine during the war.\n\nWhen people see Air Force One on TV, when they see it land in other  countries--whether in London or Tokyo or Brazil--they immediately know  that America has arrived. It represents not just the weight of the  Presidency but America itself, generations of history and international  leadership.…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…I maintain that the U.S.- Canada relationship is really the model for what a relationship between  two neighboring nations should be.\n\nI spoke yesterday with respect to the Brazil tariffs, and I talked  about the wrecking ball that Donald Trump is  taking to the American economy. There have been three academic studies  of the Virginia economy in recent…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…American people. He wanted  to protect his friend, as Mr. McGovern said, former President  Bolsonaro, so he then announced another pseudo emergency to impose yet  more tariffs on Brazil.\n\nThe law that Donald Trump is using for tariffs on everyday consumer  goods was, in fact, meant to respond to actual global emergencies, not  personal vendettas. That is why…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695525/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…things about  President Trump, hardly the basis for a fundamental economic decision  affecting the life of every American.\n\nAnd he has used trade to punish the entire country of Brazil for the  prosecution of its former leader, another friend and political ally of  Trump.\n\nThese are not economically based decisions. These are purely  personal, whimsical decisions…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…his valiant voice strong and clear before the free world's  leaders.\n\nThey all know that today's spider web of tyranny is spinning and  stretching its ugly net from Russia to Brazil, India, North Korea, and  South Africa, seeking a global necklace of repression and domination.\n\nYet, at Davos today stood the unvanquished, courageous leader of the  poorest…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Leader Schumer for  sponsoring the bipartisan legislation we voted on yesterday suspending  the emergency authority on which the President was acting to impose a  tariff on Brazil, a country, by the way, with whom we have a trade  surplus.\n\nWe are 9 months into this trade war with tariffs at the forefront. It  is a war with Canada. It sort of started…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…warning about the danger of tariffs, and, apparently, that got  Donald Trump's feelings all hurt.\n\nTrump is letting his delicate little ego drive U.S. trade, whether it  is with Brazil, Argentina, or with Canada. The consequence is that  Americans are paying more.\n\nThis isn't a laughing matter, really--no. Struggling families have to  pay thousands of dollars…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…industries, have to compete against companies abroad.\n\nMr. Speaker, when these big multinational corporations have to decide  if they are going to set up shop in Germany or Korea or Brazil or India  or wherever, we want it to be favorable taxwise to set up shop in the  United States. Therefore, I do believe that, when the final tax rates  are laid out by the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…average American  family.\n\nMr. Speaker, do you think they prefer to spend that $70 on a new pair  of shoes for their child or for ``girl-centric climate change  programs'' in Brazil?\n\nThat is the choice.\n\nCongress squanders hundreds of billions of dollars annually on  destructive subsidies and useless grants like these. Let us finally  take this first,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693724/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…cease-fire generally.\n\n``I don't want to just negotiate with you, President Trump,''  President Putin said.\n\nHe said: I want China to be part of the negotiations and India and  Brazil and South Africa--and get this; this will curdle your lunch-- North Korea.\n\nMama Gump said that stupid is as stupid does. President Putin is not  interested in peace. President…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…published by the Department of the       Treasury, Taiwan held $471,900,000,000 in foreign exchange       reserves, more than major economies such as India, South       Korea, and Brazil.\n\n(5) According to section 4(d) of the Taiwan Relations Act       (Public Law 96-8), enacted on April 10, 1979, ``Nothing in       this Act may be construed as a basis for…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…journalist. What if a President  decided they wanted to arrest him? Can they do that without a  congressional vote or permission?\n\nThere are arguments that the current President of Brazil has unfairly  imprisoned the previous President of Brazil. Now, you can have an  argument on both sides. You can listen to the facts, but would you want  your President to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]