[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…to make it a little easier, a little more  bearable.\n\nSo when Republicans come to the floor with a budget that threatens to  cut Medicaid so they can give tax cuts and tax breaks to the ultrarich,  the choice they are putting before us is making your lives worse and  make their lives better. It is making your healthcare worse to make  their bank accounts…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…to you what it feels like as a teacher when you have  a student who is struggling or has a disability and you see the moment  where they get it, the moment where the lesson breaks through and they  are receiving the information in the same way as the other students in  the classroom.\n\nI want to make sure that those students can continue to be educated…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…what our increase will be but we are going to have to make       cuts to other parts of our lives to afford them. It's not       right or fair to give very earthly people tax breaks while       increasing necessary expenses for average hard working people       who are barely getting by. I can't remember the last stress       free day we have had because…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…life  easier for anyone who is not a billionaire. In fact, while the rest of  the country gets sicker and poorer, Republicans are set to give their  billionaire donors new tax breaks.\n\nProtecting Medicaid is essential to our communities. That is why  House Democrats and I are demanding an up-or-down vote to protect it.\n\nI call on my Republican colleagues…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…lose employees.\n\nThe upside is that there is a very simple way to fix this, and it is  right in front of us: pass the bill that Senator Shaheen and I lead to  make these tax breaks permanent.\n\nTime is of the essence. Families and businesses are going to get  those dreaded letters in the mail any day now saying their premiums are  going up 75 percent.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…people who told us their health insurance premiums are  doubling and tripling. We heard from people who don't understand why  you guys moved at the speed of light to give tax breaks to billionaires  but won't lift a damn finger to extend the tax credits that help ensure  people's health insurance premiums don't skyrocket.\n\nThis CR, this dirty CR, which…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Gulf of Mexico.\n\nNo one is clamoring for a newly named body of water. They want lower  grocery bills. House Republicans' proposals to cut Medicaid and SNAP to  pay for tax breaks for billionaires will make life more, not less,  expensive for people in Westchester and the Bronx.\n\nThe President's thoughtless red light-green light tariffs are making  it…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690668/no-action-on-lowering-costs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the list.\n\nWe can debate waste, fraud, and abuse all day. The money that DOGE  has supposedly found in waste, even if you believe that number, is  totally offset by the tax breaks for billionaires in this resolution. I  mean, with all the chaos in our economy right now, does anybody really  believe that we have to help out billionaires, that they are…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Trump and Republicans' big, ugly  law makes the cost of healthcare go up and takes away healthcare from  working families.\n\nRepublicans hand out an average of $80,000 in tax breaks to every  millionaire. Where do they get this money from? Each millionaire tax  cut is paid for by taking away insurance from four people. Republicans  are stealing from the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…kids, and the Senator  from Kansas has outlined why milk is so good.\n\nOf course, I remember growing up and going to grammar school, and I  looked forward to milk. We had milk breaks, and it made a difference to  pay attention in those afternoon classes and to be active in your  sports activities right after that.\n\nThe second reason is that the dairy farming…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…he is breaking the law. It is clear that my Republican colleagues do  not have their priorities in order. In fact, it seems to me their only  priority is securing giant tax breaks for their billionaire buddies at  the expense of American families and businesses. H.J. Res. 24 fits  right into the Republican agenda of raising costs on hardworking  Americans.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…resolution. It does nothing to exempt  tips, Social Security, or overtime. We know they are not ultimately  going to do that because they need the $4.5 trillion to provide tax  breaks for hedge fund managers, multinational corporations, and  billionaires.\n\nNow, government is frustrating. It frustrates me often. It needs to  be improved. You know what is…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…help families and children. Medicaid  works.\n\nElon Musk is only interested in helping the richest among us. His  dream is to fully extend more than $4.5 trillion worth of tax breaks to  his billionaire friends and the wealthiest corporations in the world.\n\nHow will they pay for these tax cuts and pay for this massive  giveaway? Republicans want to pay…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688072/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…not what they bargained for.\n\nThe Senate should reject Mrs. McMahon because funding cuts for  schools, students, parents, and teachers all for the sake of  billionaire tax breaks--whose kids probably don't go to public  schools--is an awful idea. I am proud every Democrat will vote no.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688393/nomination-of-linda-mcmahon"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…than $2 billion in research funding being held up  so far this year. Two billion dollars isn't just lost opportunity, but  it discourages researchers from staying on the job, breaks their will  to continue to dedicate their lives to finding cures for things that  we, in America, view as dangerous.\n\nPresident Trump has canceled hundreds of NIH-supported…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…was  previously celebrated by this President himself. On October 3, 2020,  President Trump's Department of the Interior issued a press release  titled: ``Trump administration breaks ground on long-awaited Arkansas  Valley Conduit to bring safe, clean water to rural Colorado  communities.''\n\nEarlier that year, the President visited Colorado and praised…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the largest tax increase in U.S. history, while  providing the largest tax cut for working-and middle-class families  ever, with no tax on tips, no tax on overtime, and tax breaks for  seniors.\n\nH.R. 1 protects the 87,000 Missouri farms and countless family-owned  small businesses from double taxation by expanding the death tax  exemption.\n\nThe One Big…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…effective and  overall impact.\n\nThis is going to provide real relief to American families, workers,  and businesses. The bill expands the child tax credit, provides  critical tax breaks for small businesses and the working class, and  makes America more competitive on the global stage. It also makes the  Tax Cuts and Jobs Act permanent, like I mentioned, preventing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…rise $1,500, so  it won't feel relief from this provision. We don't feel what doesn't  happen.\n\nDemocrats are counting on this fact while stoking class resentments  over tax breaks for millionaires and billionaires, but millionaires and  billionaires don't work for tips. They don't get paid overtime. They  don't rely on Social Security. Working families…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "John Carter", "party": "Republican", "sentence": "…medical care to the  underfunding of infrastructure and climate resiliency projects and the  harmful poison pill riders, I just cannot in good conscience support  this bill.\n\nIt breaks my heart because we do have such a good working  relationship across the aisle with Chairman Carter and myself. I look  forward to working together to improve this bill. I…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…faster than  the top half. For the lower 10 percent, wages increased two times over  the 1 percent. People at the bottom and people in the middle benefited  more from the tax breaks.\n\nMr. ARRINGTON. Mr. Speaker, budgets are value statements. We value  letting working families keep more of their hard-earned dollars. We  value stewarding tax dollars, protecting…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Minnesota. Jim had attended Mount Carmel since its beginning       in 1938, first as a young boy with his parents, then as a       young handsome lifeguard during college summer breaks. He was       later a guest preacher for many years at summer adult camp       sessions. He continued to speak God's Word with joy until       health issues halted him at age…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…news. I believe it was Bernie Sanders who was criticized by The  Washington Post--again, The Washington Post--by giving three or four  Pinocchios when they say that these tax breaks that Republicans do just  go to benefit the wealthy. That is The Washington Post saying to call  it as it is. These are Pinocchios. These are complete lies that the tax  policies…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…able to  continue carrying to completion, the opportunity to also know that  their academic opportunity will continue, as well. That is all we are  attempting to do.\n\nMy heart breaks with that story, but my heart also says we want to  make sure--that is why I appreciate Representative Hinson's bill--it  expands the opportunity for the information that is…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…talk to my liberal brothers and sisters, and they  will turn to you and say that we should cut defense. That way, we can  give out more money. It is now number five.\n\nLook, it breaks my heart because we keep having these discussions,  and I have come behind this microphone for over a decade now and feel  like sometimes I am doing a junior economics lecture.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…honored to be a  part of this, and I am very thankful for the vision and the passion  that Congressman Knott has shown in pulling together this Special  Order.\n\nWhen a burglar breaks into your house, Mr. Speaker, you don't set a  place for them at the dinner table. That principle seems pretty  obvious. However, for some reason, radical progressives just…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…back to our  economy, which is exactly what this bill does.\n\nI will talk a bit about energy and agriculture, big industries for my  State in North Dakota. We are slamming the breaks on the Biden  administration's radical energy agenda. The one big, beautiful bill  repeals over $500 billion in the style of Green New Deal spending and  boosts mineral development…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…law is a magnet for future illegal immigration.  Sanctuary city policies are full of fraud like in Minneapolis. They  bring out the worst in the system, not the best, and it breaks down law  and order.\n\nWe have been talking for weeks about you wanting to fix things. You  are blocking a debate. I can't believe I am here. I thought we were  going to work…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…D.C. Council has completely  opted out of in the D.C. Income and Franchise Tax Conformity and  Revision Temporary Amendment Act of 2025. Seven of them are targeted at  tax breaks for individuals. This includes service workers relying on  tips as part of their wages, workers relying on overtime, senior  citizens relying on Social Security, and even residents…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…people's access to care by empowering them  with the same tax treatment, equal tax treatment, the corporations get.  Individuals should get the same tax deductions and tax breaks to be  able to have healthcare.\n\nMr. Speaker, we believe in expanded health savings accounts that you  can use for direct primary care to go to a doctor, have that doctor's…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}]