[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…and for the people:  that shared responsibility to spend that money wisely. But even in the  early years that I was here in the Senate, we were starting to see  signs of the breakdown of that relationship.\n\nIn the last conversation I had with Senator Hatfield before he passed  away, he said: What happened to the Appropriations Committee?\n\nNow, Senator…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…there are fewer constraints, fewer eyes, and fewer brakes  on how Vladimir Putin expands and modernizes Russia's nuclear forces.  In this wilderness, we would see a broader breakdown of norms on  nuclear weapons.\n\nBoth the United States and Russia have openly mused about potentially  restarting nuclear weapons testing. After we have worked so hard to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…cart. It is not enough to say: ``Get a  job, you bum.''\n\nWe don't know what they are going through. These are someone's  children, many of whom have suffered some catastrophic breakdown that  causes them to hear voices and to do things that they wouldn't  ordinarily do.\n\nWho are we to say: ``Get a job, you bum?''\n\nMany of them are people who served in our…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…The bill directs the Department of Energy to regularly assess the  supply chains for the components that keep our bulk power system  running--not after a crisis, not after a breakdown, but proactively.\n\nWe know the risks are real, Mr. Chair. Our Nation's electric grid is  the largest machine ever built, and it depends on thousands of  specialized parts:…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697893/electric-supply-chain-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Is anyone thinking about the potential blowback  that such a campaign could entail? Overthrowing the Maduro regime risks  creating more regional instability, not less. The breakdown of state  authority may create a power vacuum that the very drug cartels the  administration is ostensibly trying to destroy could exploit.\n\nJust as our misguided interventions…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…projections. For the trolls out there who immediately say, ``Well,  there is all this spending in the tax bill,'' most of that hasn't  started yet. If you actually look at the breakdown of what is going on,  what the two drivers of U.S. sovereign debt are, they are the very  things that we are not allowed to talk about. It is interest and  demographics.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…and tell the country why you voted against stopping sanctuary city  policy, which is one of the biggest magnets of illegal immigration that  leads to massive fraud and the breakdown of law and order.\n\nThe parties are in two different places. Democrats and Senator  Padilla believe that sanctuary policies are no problem. The  Republicans, including me…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…it again. Patrick Monahan, a  Democrat U.S. Senator, in the late 1960s put together a study, and he  warned the degree to which we had these programs contributing to the  breakdown in marriage, but nobody paid attention Patrick Monahan.\n\nAnother man who did a lot of work in this area was George Gilder who  wrote a couple of books, ``Men in Marriage,''…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "French Hill", "party": "Republican", "sentence": "…include--\n\n(A) an analysis of how reciprocal deposits have performed       since 2018, which shall include--\n\n(i) the use of quantitative and qualitative data;\n\n(ii) a breakdown of the usage of reciprocal deposits by       size of insured depository institution;\n\n(iii) the usage of reciprocal deposits during periods of       stress; and\n\n(iv) an…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…We borrow $6 billion a day. If that is $3.2 billion, you functionally  bought yourself 12\\1/2\\, 13 hours' worth of borrowing for the entire  year, and there is the mental breakdown. The left runs around and says:  Raise taxes. Okay. We are going to borrow 7.3 percent of GDP, which is  my latest number. Some of the other economists are around 7.2 percent…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…these systems interconnect so that if there is a problem  somewhere, we can bring power back in.\n\nThat is what makes our grid today so incredibly important. If there  is a breakdown in transmission somewhere, we can find other ways to  bring power to people's homes. If there is a breakdown there with  generation, we can find other ways to bring power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…matter of fact, the One Big Beautiful Bill Act went, to a  certain extent, in the opposite direction. I want to educate the  American public on this problem, and that is the breakdown of the  traditional family with a man in the household over the last 60 years  of America.\n\nAs this Congress tries to make America great again, it is hard to  imagine America…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…strategy.\n\nTo accomplish this, I ask the GAO to provide:\n\n1, how much money in total was publicly reported as lost to       waste, fraud, and abuse in California since 2016;\n\n2, a breakdown of fraud by economic sector such as       transportation, healthcare, housing, law enforcement;\n\n3, who the perpetrators of fraud are;\n\n4, what stolen funds are spent on;…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…explosion in families without a mother and father  at home is causing other problems for society. When I talk to law  enforcement, they feel one of the root causes of crime is the breakdown  of the American family.\n\nI am sure, like everybody around here who has been in politics for a  while, you sit in these committee hearings and hear the problems of  high…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…penalty of $25,000 or $30,000 for getting  married to the father of one's children. This affects so many other  problems that we have in America.\n\nThe crime problem is a family breakdown problem. The drug problem is  certainly not exclusive, but it is a strong element of the family  breakdown problem. In talking to teachers, particularly in the area of  special…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}]