[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…commitment to ensuring  fairness in Michigan's surrogacy laws has brought about meaningful  change for families across our community and state.\n\nTammy Myers was diagnosed with breast cancer in 2015, which resulted  in procedures that left her unable to have children. In 2021, she and  her husband worked with a gestational carrier to have their twin son  and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691857/recognizing-tammy-myers"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…country. Parents saying: My baby was born with a heart  condition costing millions of dollars before the Affordable Care  Act. Husbands saying: My wife was diagnosed with breast cancer, and we  couldn't afford it. Families saying: Dad had a stroke, and we couldn't  handle the cost.\n\nThat will not happen anymore because we are protecting these families…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698809/breaking-the-gridlock-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…tax credits,  she is not going to be able to purchase healthcare because there are  only 2 days left. And here is the kicker: Just 4 months ago, she was  diagnosed with breast cancer. She has already used up nearly all she  has in savings for the copays and coinsurance to get a diagnosis and  receive treatment.\n\nAnother constituent, a schoolbus driver…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…the National Institutes of Health. They  are cutting cancer research.\n\nIn my State of California, we were on the cusp of clinical trials  because a cure had been found for breast cancer. We were on the cusp of  clinical trials for a cure for prostate cancer. All of that has now  stopped because of cuts to the National Institutes of Health.\n\nThat is what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…ability to access higher education, and to the  very institutions that make up our collegiate system in the United  States.\n\nMs. FRIEDMAN. Yes. Besides being a mom, I am a breast cancer  survivor. After I was diagnosed, I found out that one of the treatments  that has been a revolution in terms of saving the lives of women  suffering from breast cancer…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…show a clear concern. Men die 6 years earlier than women due to  preventable health issues.\n\nProstate cancer and testicular cancer receive far less attention.  Even during Breast Cancer Awareness Month, people assume that is only  something that  women face. Yet, men also get and die from breast cancer.\n\nSuicide rates among men are significantly higher…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…refinancing of Social Security  in April of 1983, serving on the House Select Committee on Aging, while  also advocating for housing, pay equity, improved healthcare for women,  breast cancer research, the Rock & Roll Hall of Fame in Cleveland, and  the NASA Glenn Research Center, to name a few. Eventually, she moved  into the ranks of House Democratic leaders…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…that directly  benefit our service members and veterans. Over the years, this program  has supported lifesaving innovations in areas such as traumatic brain  injury. PTSD, breast cancer, and other conditions that  disproportionately affect our military community. Many treatments and  therapies that were once experimental are now standard care, thanks to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692417/introduction-of-medical-research-for-our-troops-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…would have to spend over 40 percent--get  that: 40 percent--of his income on health insurance alone just to  ensure his wife could continue to get her treatment for her breast  cancer.\n\nI also heard from Eric and his wife in Menomonie, WI. They both  retired from teaching after 30 years and are still not yet eligible for  Medicare. He  wrote to me that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…bills with their health  insurance premiums? Unfortunately, not if they drop coverage.\n\nThat includes my constituent Jess, a hair stylist in Chicago who was  diagnosed with breast cancer last year. Jess said that if the tax  credits go away, as they are supposed to on January 1, she would be  forced to pay more for healthcare and will have to make a ``lifestyle…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…meals for hungry kids and food assistance for working families  at risk.\n\nA constituent of mine, Martha, from Somersworth is raising her 15- year-old grandson and battling breast cancer while living on a fixed  income. Without SNAP, she wouldn't be able to keep food on the table.\n\nAnother constituent, Catherine, is a veteran from Manchester who has  type…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692014/food-assistance-for-working-families-at-risk"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…sick. They can't do that if they can't go to work. They can't do that  if they can't pay their bills, such as their hospital bills or other  medical bills.\n\nI am a two-time breast cancer survivor myself, and not a day goes by  that I don't think about how egregious not extending these ACA tax  subsidies is to the American people. I am a lucky person.\n\nI…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…she is out of luck with what they are proposing.\n\nIf a father gets a stroke, forget about it.\n\nIf you have a sibling with a disability, they don't care.\n\nIf your wife has breast cancer, you have big bills to pay because  they want to take away healthcare, whether it is Medicaid to tens of  millions of people, half a trillion dollars for Medicare for seniors…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696718/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…this--not lobbyists. They come and they  tell us about their stories of rare cancers. There are people on both  sides of the aisle who have marched for prostate awareness, for breast  cancer awareness. There is goodness and decency here.\n\nBut in 2024, this funding--it is a bill that passed in March. It was  now slashed--slashed--by 57 percent. And I told you…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…for women's health  research.\n\nThe Trump administration has rescinded women's research projects at  an alarming rate. These projects include lifesaving research on early  breast cancer detection and so much more. Trump even shut down the  Women's Health Initiative, our Nation's largest and most consequential  women's health study.\n\nMillions of women's…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sets us free when we start to realize the  things that are going on.\n\nWe just had a doctor of radiology in our office. He walked us through  the statistical abstract of breast cancer and the scans and showed that  his AI platform was remarkably more accurate. It is cheaper, faster,  and more accurate. Why wouldn't we embrace it? We don't reimburse it.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1860) to designate Regional Breast and Gynecologic Cancer Care  Coordinators to expand the work of the Breast and Gynecologic Oncology  System of Excellence at the Department of Veterans Affairs, and for  other purposes,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, October is Breast Cancer Awareness  month. October is the month that we bring attention to the plight of  those who have had breast cancer and educate others on the importance  of early detection.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Pennsylvania State  University, and received her Ph.D. in animal science from Cornell  University. She held a fellowship at the National Cancer Institute at  NIH and led breast cancer research at the University of Vermont.\n\nDr. Plaut then joined NASA and served as the lead scientist for the  International Space Station Biological Research Project, working…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}]