[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Speaker, national parks hold a sacred mandate. They are not just  places of extraordinary beauty. They are places of truth. Their purpose  is to preserve and interpret the full breadth of the American  experience: the good, the bad, the inspiring, and the painful.\n\nErasing history doesn't make it disappear. It makes us more likely to  repeat it. History…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…These bills       represent an unprecedented attack on the autonomy and home       rule of our local government and the more than 700,000       Americans that call it home. The breadth of these bills is       remarkable, and if passed, would result in an erosion of       accountability and public safety for the District of       Columbia. They range from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…using. It is called section 312.  Let's see how it has been used. Let's see if it has ever been used on  reconciliation. Let's see if it has ever been used completely on the  breadth of an entire reconciliation bill.\n\nLet's start by asking the question: Has it ever been used in a  partisan way? Well, in 2017, Crime Victims  Fund--no, no--a bipartisan decision.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…importance to him in ways that I might not agree with, but he  had a right to do this.\n\nHe had a right to life. He had a right to say these things in venues  across the length and breadth of this country and, I would say, across  the globe. These were his rights.\n\nHe had the right to be where he was and to do what he was doing.\n\nI don't know him as a person…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…These bills       represent an unprecedented attack on the autonomy and home       rule of our local government and the more than 700,000       Americans that call it home. The breadth of these bills is       remarkable, and if passed, would result in an erosion of       accountability and public safety for the District of       Columbia. They range from…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…the problem with that is you have a  bipartisan vision to serve the entire--these desks to me are now  representing the geography of the United States--to serve the entire  breadth and depth of our Nation, with all of our differences. Then, on  a partisan basis, meaning half the room, they decide what programs to  cut. That means a deal was done in the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…public and private  stakeholders around the globe, and it is staffed by incredibly  experienced engineers, technical experts, and tech policy professionals  who understand the breadth and depth of telecom and AI impacting our  country.\n\nI say this because I had the privilege of recently serving as the  Deputy Assistant Secretary and Deputy Administrator…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…race,  gender, or background, has the opportunity to thrive.\n\nIt reflects the notion that our strength as a nation lies in our  diversity, that our success is drawn from the breadth of our collective  experiences, and that our unity can be found not in the erasure of  differences but in the celebration of them. Today, this fundamental  belief is under…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…I ask every colleague on the other side of the aisle--I  have been there. I have had to make choices. Let's do the right thing  and make sure that every woman has the full breadth of the ability to  make the choices that she needs to make.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…deployments and turn these cities and States into armed  camps and police states. He will, in short, circumvent both Congress  and the judicial system because of the current breadth and expansive  powers under the Insurrection Act.\n\nWhen it was written, there was no danger of abuse. Now, there is.\n\nWhen 600 armed rebels attacked government troops during…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…They are more than 20 percent of the world's freshwater and  must be protected.\n\nThey provide drinking water to millions. They are home to a thriving  ecosystem for a wide breadth of species. They support countless jobs.  Our Great Lakes' fishing economy alone is worth more than $5 billion.\n\nUnfortunately, there are many threats jeopardizing the future…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…These bills       represent an unprecedented attack on the autonomy and home       rule of our local government and the more than 700,000       Americans that call it home. The breadth of these bills is       remarkable, and if passed, would result in an erosion of       accountability and public safety for the District of       Columbia. They range from…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…around the country about the  U.S. Constitution and American Government. Students display  understanding about historical and contemporary constitutional issues,  and their breadth of knowledge is incredibly impressive.\n\nI am proud to report that both top teams are from public high schools  in Oregon. Lincoln High School and Sprague High School won the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…These bills       represent an unprecedented attack on the autonomy and home       rule of our local government and the more than 700,000       Americans that call it home. The breadth of these bills is       remarkable, and if passed, would result in an erosion of       accountability and public safety for the District of       Columbia. They range from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…and Means Committee and has worked with Members who served on the  Budget, Oversight, and Education and the Workforce committees. It is  truly rare to find someone with his breadth and depth of experience  working in the House for as long as Daniel has. That is a testament to  his commitment to public service and his ability to gain the trust of  multiple…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…became a trusted,  reliable voice for generations of Nebraskans. After 33 years at KETV,  Rob's impact on our state's media landscape is nothing short of  significant.\n\nThe breadth of Rob's career was reaffirmed when he recently accepted  the Nebraska Broadcasters Association's award for Best Election  Coverage on behalf of KETV.\n\nWhether reporting on…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699390/recognizing-rob-mccartneys-outstanding-ketv-career"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Fern has claimed the lives of at least 26  Mississippians as of February 2. Each loss is heartbreaking and comes  with so many stories, as Senator Wicker reflected upon.\n\nThe breadth and severity of this disaster have left swaths of the  Delta and north Mississippi with landscapes littered with shattered  trees and downed power lines. Line crews in this…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…continued to expand. These cyber  actors are now looking across multiple sectors at once, which means  that our national response must be organized in a way that can match  the breadth of the threat.\n\nFederal responsibilities for protecting critical infrastructure are  distributed across several departments, and each department has  specific missions and…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…of a `state' '' and, with respect to the use of ``countries''       and applications for IMF membership, ``the absence of any       adjective in the Articles emphasizes the breadth of the       discretion that the Fund may exercise in admitting countries       to membership''. According to Mr. Gold, ``the desire to give       the Fund flexibility in…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…overreach, we       strongly urge the Bureau to refrain from exceeding its       authority and instead, commit to clarifying and narrowing the       scope of this rule. Given the breadth of the proposal and       ambiguity regarding its applicability, we urge the Bureau to       extend the comment period for an additional 30 days. This       additional time…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…chairman of the  Armed Services Committee, by the way--a Senator who knows probably more  about the military than anyone else here--has it exactly right.\n\nGeneral Caine has this breadth of experience, not just as a fighter  pilot with thousands of hours, combat hours, in flight but has worked  very closely with our intel services and has very significant…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…in the fight to protect our Nation.\n\nIt is time for Congress to codify DHS' Intelligence Rotational  Assignment program and ensure that our intelligence community has the  breadth of experience necessary to tackle the threats of tomorrow.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…moment today to look at the vast waste, fraud, and  abuse that exists in the State of California and the proposal that I am  working on to bring the full scale, extent, and breadth of it to light  so that we can work to address it using every tool that we have here at  the Federal level and to compel changes at the State level.\n\nThis is the simple reality:…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…Treasury, the  Executive Office of the President, the Federal judiciary, the District  of Columbia, and more than 20 independent commissions, departments, and  agencies.\n\nThe breadth of FSGG's jurisdiction is daunting, and there are many  who thought we could never get a bill done, let alone a bipartisan one.  I thank all the members of the FSGG subcommittee…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…policies of the One Big Beautiful Bill Act to lower costs, increase  wages, and expand job opportunities, I know America's industrial engine  will be unleashed to deliver a breadth of career empowerment not seen  at any time in our Nation's history.\n\nMadam Speaker, I yield to the gentleman from Georgia  (Mr. Carter).\n\nMadam Speaker, I yield to the gentleman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}]