[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Christians around the  world as well those beyond the Orthodox Catholic Church. Through his  engagement with Catholics, Lutherans, Baptists, Muslims, and Jews, he  has built bridges in advancement of a more peaceful and interconnected  world.\n\nI am personally grateful for his continued prayers on behalf of the  people of Ukraine, which provide hope and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…mike, for all of those who did not have  the opportunity to be viewed as full human beings in our great country,  for those who marched in the dust, for those who bled on the bridges,  for those who faced the dogs and the batons right here in the United  States of America, for those who met the fire hoses just to try to  claim their right to vote.\n\nMr.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…progress we can get is progress we must take.\n\nWhen it comes to transportation, we were able to increase funding for  air safety. We secured crucial investments for highways and bridges,  ports, and more. We rejected the House Republicans' plan to zero out  funding for Amtrak, making sure to meet the full Amtrak funding request  so our trains could keep running…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…about  that. What are you going to spend that money on? Parks? Public safety?  On the mental health challenges that I described earlier? On our  infrastructure? Our roads? Our bridges? Our schools?\n\nAnd the answer is: No, no, no.\n\nWell, what are you going to spend it on?\n\nWe are going to give tax breaks to the two wealthiest neighborhoods  in town and let…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…come from the  State of Michigan. We have major border crossings, some of the biggest  border crossings in America, and we are about to open one of the  largest new border bridges in the world, the Gordie Howe Bridge to  Canada. We need her. We needed her to staff that new bridge, to pay  attention when we had issues with CBP or Border Patrol, when…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Great Lakes Task  Force, I am profoundly grateful that our citizens united to restore the  heart of our islands along the mighty Maumee by, quite literally,  constructing bridges for the future. Our  community keeps delivering progress, and we all must lift our Nation's  motto up: ``e pluribus unum''; ``out of many, one.''\n\nNot against one another…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695469/resisting-the-temptation-to-divide"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…resilient. We talked about the risk of catastrophic  wildfire.\n\nWe passed a big infrastructure bill a couple years ago, and part of  that was not just protecting roads and bridges. It was also protecting  our natural infrastructure because of its connection with our urban  areas and the wildland-urban interface and more. That involved more  management…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…States, will have to come up with these funds  or deny basic services that they need for other things, like education,  public safety, healthcare, and providing for our roads and bridges in  our States. Notably, not every State will be subject to this change.\n\nLate into the night, the Republican majority jumped through hoops to  exempt noncontiguous States…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693232/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…people.\n\nMy family's path to the middle class was made possible because of the  labor movement. My grandfather emigrated from Ireland and worked as a  union laborer building bridges. It was hard work in unsafe conditions.  Those conditions are significantly better because of the building  trades unions.\n\nMy father was a firefighter and became president…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…him the Congressional Gold Medal beneath  this Capitol dome.\n\nMr. Speaker, in honoring Patriarch Bartholomew, we recognize a man  whose life's work has been the building of bridges, between East and  West, faith and justice. His  enduring witness to peace and extraordinary work for humanity is an  inspiration to us all. May his example continue to inspire…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Gaza City. It is obvious that he is trying to destroy it.  Yes, he is trying to destroy it. There will be no home for the  Palestinians. They have already destroyed roads, bridges, schools,  hospitals. Mr. Netanyahu doesn't want peace. He wants all of Palestine.  I speak in specificities, all of Palestine. He doesn't want peace.\n\nIn fact, the Knesset…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…among the  foremost.\n\nGrounded in faith and expansive in impact, their mission exemplifies  what it means to live out the gospel in a divided world--breaking  bread, building bridges, and showing that we have more in common than  in conflict.\n\nMr. Speaker, I ask my colleagues to join me in honoring Mission  Mississippi of Leflore County for their vital…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…became a tireless advocate for better support services, leading  to the creation of a full-time interpreter position she now proudly  holds. Beyond translation, she builds bridges, fosters understanding,  and empowers families to thrive. A first-generation college graduate  and proud daughter of Puerto Rico, Kayla's work embodies compassion,  resilience,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…transportation  departments lacking sufficient inspectors to contract privately  employed inspectors temporarily. Our bill ensures public safety by  requiring that all federally funded bridges, tunnels, and roadways are  inspected objectively and thoroughly under the highest safety  standards. This work can and should be done by skilled, qualified  inspectors employed…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…state. As Commissioner of NHDOT, Bill has fostered a supportive  work environment and spearheaded multiple major transportation projects  to help improve Granite State roads, bridges, and infrastructure.\n\nA lifelong Granite Stater, Bill grew up in Rollinsford, New  Hampshire, and went on to earn a Bachelor of Science in Civil  Engineering from the University…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…ability to issue necessary permits for development projects across the  State, including: projects to restore Florida's Everglades; projects to  build or improve sidewalks, bridges, utilities, roads, and highways;  solar energy projects; and other projects that impact grid reliability.\n\nThe ability for States to take the lead in regulating their natural…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…areas  such as pesticides, aerial fire-retardant use, and so much more.\n\nThe bottom line is that without reforming the Clean Water Act,  America cannot efficiently build roads, bridges, pipelines, ponds,  dams, levees, airports, homes, farms, and other infrastructure that we  need.\n\nThis bill acknowledges that we can both protect our natural resources  and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…smaller programs from  cumbersome regulatory burdens. It revitalizes the national defense  industrial base by establishing the defense industrial resiliency  consortium, and it bridges the ``Valley of Death'' by creating the  Bridging Operational Objectives and Support for Transition Program to  efficiently align high-potential technologies with unmet operational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695147/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…our universities' classrooms and research labs would be a catastrophic  mistake.\n\nIt has been proven that the CCP does use programs like Confucius  Institutes, not to build bridges or promote culture, as they may say,  but to expand their influence inside the United States for malign  purposes. This legislation would put an end to this egregious national…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…the social programs put together.\n\nThat is what is called a work requirement. What is wrong with that?  Those who can work should work. Our welfare programs were meant to be  bridges, not parking lots. Congresswoman Ocasio-Cortez and the  socialist wing of her party want us to reverse all of that.\n\nWhat else do they want us to do? Well, they are upset…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…as he meets with the President, the Secretary of State, and  Congress. I recognize and celebrate his lifelong dedication of  peacemaking and his steadfast efforts to build bridges between East and  West, Christian and Muslim, and all people of good will. May his  presence here remind us of our commitment to remain ``One nation under  God, indivisible,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Journal/Dow Jones; Brasfield, Ashley:       Daily Caller; Bravin, Jess: Wall Street Journal/Dow Jones;       Brennan, Eamonn: S & P Global; Brest, Michael: Washington       Examiner; Bridges, Olivia: CQ Roll Call.\n\nBrittain, Steven: Thomson Reuters; Broadwater, Luke: New       York Times; Brodey, Sam: Boston Globe; Brooks, David: La       Jornada; Brooks, David:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…programs, scholarships, lectures, and partnerships, the  Foundation has enabled countless young people to develop the  leadership, knowledge, and character needed to build bridges across  cultures and to contribute meaningfully to both the United States and  the Korean-American community.\n\nIn doing so, the Foundation exemplifies the best of our national…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Stateswoman in Aviation'' award.\n\nMary's contributions are aptly described as ``the wise, trusted  relational bridge to many and varied aspects of the aviation  community.'' The bridges Mary has built have been used for decades by  industry leaders, government officials, and organizations to refine  policy aims, regulatory enforcement, and market conditions…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…transcends generations.\n\nOver the decades, it has built a strong foundation of fellowship and  support, uplifting those who served, commemorating those we've lost,  and building bridges within Georgetown. Its events have become more  than social gatherings--they are touchpoints of history, community, and  service.\n\nTheir passion for service, fellowship, and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693998/recognizing-the-navy-club-of-georgetown-sc"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…his  impact will be felt well beyond his time in uniform. I thank him for  his service and wish him all the best in his retirement.                            Honoring Jake Bridges\n\nMr. HARRIGAN. Mr. Speaker, I rise today to honor a young man from  North Carolina's 10th District, firefighter Jake Bridges of Hickory,  who died while serving his community.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692830/recognizing-chief-reed-baer-on-his-retirement"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Minnesota's leading employers. Brian has contributed in  many ways to the growth and development of Minnesota's First  Congressional District, building many of the roads and bridges that  connect us to our families and neighbors.\n\nTo me, there is no one more deserving of this Lifetime Achievement  Award. I congratulate Brian on earning this accomplishment…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688312/recognizing-brian-mathiowetz"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…TX; Matthew David       McCoy, Allen TX; Nickole Sophia Rios, Allen TX; Joaquin Cruz       Vargas, McKinney TX.                            u.s air force academy\n\nSophie Belle Bridges, Prosper TX; Taylor Rae Carroll, Allen       TX; Sara Elizabeth Compton, Prosper TX; Bryce Tanner Denton,       Anna TX; Corbin Benzi Glass, Parker TX; Garrett Christopher…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…live in the streets is not  helping them. You are hurting them. Get them mental health counseling.  Get them a shower. Get them a job. Get them help. Letting them live  under bridges is not helping them. It is wrong. The fact that I have to  sit up here and tell you this makes me sad.\n\nWe are going to make this city safe. We are going to show the world…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…area providing panoramic views of the  falls and the gateway to the larger historical park.\n\nThe Great Falls Scenic Overlook Trail Bridge is one of two year-round  pedestrian bridges connecting visitors to the falls. It serves  approximately 300,000 visitors annually and links the park's visitors  center to the falls' viewing platform.\n\nMr. Speaker, this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691128/redesignation-of-paterson-great-falls-nhp-facilities"}]