[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…colleagues will join me in rigorous  oversight of the Trump administration's approach to VA's budget.\n\nThere are two other provisions in this bill I would like to discuss  very briefly. This legislation would codify the Veterans Experience  Office, or VEO, which was first established during the Obama  administration. I appreciate that the Senate incorporated…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…going down the path of negotiation with Russia, we must act to  strengthen our hand in these negotiations.\n\nIronically, Russia is in a very weak negotiating position. Let us  briefly review Putin's situation.\n\nOver the course of 3 years, Ukraine has inflicted a staggering cost  on Russia. Putin has lost 200,000 soldiers, and many hundreds of  thousands…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Senate stands. Let's first read what the Senate has in S.J. Res.  90. This is a resolution brought before the Senate and has been voted  on but was voted down.\n\nLet's examine briefly an excerpt from the resolution.\n\nThe resolution reads: ``A joint resolution to direct the removal of  United States Armed Forces from hostilities within or against Venezuela…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…to  protect their interests.\n\nSenator Lisa Murkowski says: ``This was one of the hardest votes I  have taken during my time in the Senate.''\n\nLet me just editorialize there briefly. This should not be a hard  vote, Senator Murkowski. This should be a ``hell no'' vote on behalf of  the people you were sent to Washington to represent. It is a ``hell  no''…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…reverse Robin Hood.\n\nMr. Speaker, I am grateful for the opportunity to share the story of  this beautiful little girl.\n\nMs. PELOSI. Will the gentlewoman yield?\n\nMs. PELOSI. Just briefly, I want to make this further point. Ms.  Schrier has been so eloquent, and all of us associate ourselves with  her remarks and the professional knowledge that she brings,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…colleagues to  support this bill that would help our government be better in helping  those constituents in times of need all across this country.\n\nMr. Speaker, I want to say briefly in closing that, as you have  heard, this legislation has tremendous bipartisan support and will  remove burdensome processes at the IRS to make government work better  for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…court orders, including orders from the  Supreme Court of the United States of America. He is defiant. You heard  him say now in two venues--I am going to speak about them briefly in  just a moment. He said in two venues that he is not going to honor the  necessity for a person to have what we call due process. In two venues,  he said it.\n\nNow, the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…occurrence. It is part of a broader pattern: the weaponization  of the Department of Justice and the United States Treasury to reward  allies and to punish perceived enemies.\n\nLet me briefly highlight just a few other examples.\n\nEarlier this year, the Trump Department of Justice agreed to a $5  million settlement with an estate of a January 6 rioter who was killed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the antithesis of democracy.\n\nThe substance of this bill is irrelevant since there is never  jurisdiction for Congress to legislate on local D.C. matters. However,  I will briefly discuss it.\n\nD.C. allows noncitizens to vote in local elections because it  believes that all adult residents deserve a say in their local  government. While D.C. law allows…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…USC--the University of Southern  California--published a study that said that the reduction of air  pollution was paying off; kids were breathing healthier.\n\nLet me read just briefly from their findings, summarized in a  National Geographic article from March of 2015 that said:\n\nIn the study published in the New England Journal of       Medicine, researchers…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…beloved Boundary  Waters at risk of toxic pollution from a foreign-owned mine.\n\nIf that weren't enough to convince my colleagues that this resolution  is a terrible idea, I will briefly touch on the abuse of the  Congressional Review Act itself that this resolution represents.\n\nThe Congressional Review Act, or CRA, has been used to overturn rules  finalized…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…served this Nation with distinction. Some  stepped forward while hiding who they were, forced to choose between  their truth and their country. Others served openly when policy briefly  aligned with principle. All of them served with honor.\n\nMr. Speaker, these are Americans asking to serve their country and to  put their last full measure of devotion on…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…that to  happen. So I tried as chairman to always find something we just might  agree on, Democrats and Republicans would agree. The issue which I am  going to address very briefly this morning is one of those issues.\n\nThere was a time when the Senate Judiciary Committee was so equally  and evenly divided that people thought we would accomplish nothing,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…district, which it has  previously done.\n\nThe substance of H.R. 2056 is irrelevant since there is no  justification for Congress to legislate on local D.C. matters, but I  will briefly discuss it.\n\nConsistent with Federal law, the position of the Major Cities Chiefs  Association and D.C.'s values, D.C. limits cooperation with Federal  immigration agencies.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the bill be considered read a third time and passed; and that the  motion to reconsider be considered made and laid upon the table.\n\nMr. BLUMENTHAL. I want to respond very briefly to my colleague from  Mississippi and my friend, the chairman of the Armed Services  Committee. We have worked together, as he does always, in a bipartisan  way on armed services…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…expire  at the end of this year. If we don't get a tax bill done, then you are  just going to see a significant tax increase across everything.\n\nMr. Speaker, I will also talk briefly about some of the individual  provisions because it is important to talk about the small business  corporation, S corps, LLCs, all the various different types of  businesses…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…colleagues for being here to share  their perspectives as we look back on some of the significant wins that  we have experienced over the course of the last year. I wanted to  briefly share a little bit about stuff that doesn't get as much  attention.\n\nAs a proud father of four boys, we know that family is everything.  Family is at the center of Utah values,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…no-brainer. I hope  my Senate colleague from California is on the floor here ready to give  this bill his full endorsement and not object to it.\n\nLet me just talk about this bill, briefly. Again, it already passed.  It passed the House in July, so if we pass it right now, it is going to  go to the President of the United States' desk for a signing. And this…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Lockamy.\n\nI have known Richard for as long as I can remember. With age, I  admire, respect, and appreciate the man Richard is, and that admiration  is growing with every day.\n\nBriefly, Richard grew up in Benson, North Carolina, the oldest of  four. He attended Shaw University, followed by North Carolina State  University, where he received a graduate degree…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…thrilled to be able to  highlight some of the many things that we have accomplished in the  preceding calendar year.\n\nHonoring Mark Roman\n\nMr. MOORE of Utah. Mr. Speaker, I will briefly add that I had the  opportunity to serve on Chairman Smith's Ways and Means Committee, and  I have seen the work that Mark Roman did, mostly behind the scenes, the  stress…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…beginning with our obligation to provide for the  common defense. In particular, our work to deliver full-year Defense  appropriations is not finished.\n\nSo I would like to talk briefly about what must come next after  interim government funding is extended and what is at stake for our  national security. The U.S. military is not immune from the disruptive…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…his  meritorious actions. He later worked in aviation electronics in North  Carolina before being honorably discharged in 1945. During the conflict  in Korea, Walter was also briefly called back to duty from the  Reserves.\n\nAfter his service, Walter has continued to be an upstanding American  citizen, patriot, and family man. He met his late wife Irene,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…at a young age. In 1943, he graduated high school and joined  the United States Army Air Forces the following year. Johnny served as  a tail gunner on a B-24 bomber and was briefly stationed overseas for  six months. As a result of his meritorious service, he received the  Purple Heart, an Air Medal with Oak Leaf Cluster, the European-African- Middle…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…today in strong support of my resolution to  repeal the Biden administration's Bureau of Land Management Resource  Management Plan for North Dakota.\n\nFirst, let me respond briefly to my colleague from Colorado's  comments about energy costs. His constituents, the dear people of  Colorado, and many other constituents in blue States, like New York and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…understand why he  is clearly not the least.\n\nMr. MOORE of Utah. Mr. Speaker, the gentleman from Florida never  disappoints, and I thank him for his remarks.\n\nMr. Speaker, I will briefly close with some of the comments I have  made before.\n\nPresident Trump in November, along with congressional majorities--the  House majority stayed in Republican control. The…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…leaving an indelible mark  on the arts in Ohio's Second Congressional District.\n\nCarl served as the band director at West Union High School, the choir  director at Manchester briefly, and later as music supervisor across  the whole school district. Carl built West Union's marching band from  the ground up, starting out with only 13 students and ultimately…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…never ever be used as pawns in this kind of  grotesque partisan gamesmanship.\n\nSo I will not modify my request.\n\nMr. JOHNSON. Absolutely.\n\nMr. JOHNSON. In reclaiming my time briefly, let me emphasize the fact  that if you pass this now--again, to the Senator from Michigan, I am  literally begging him: Do not object. Do not object. It is still going  to…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…County Sheriff's  Department.\n\nA proud son of southern Minnesota, Sheriff Lange joined the  department right out of high school as a jailer-dispatcher. He then  went on to work briefly in North Mankato before returning to the  sheriff's department for good.\n\nIn 2002, he was elected sheriff, a position he has proudly held for  the past 23 consecutive years.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698459/recognizing-sheriff-dave-lange"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…people from across the world. This July will  mark the 62nd annual Trans-Tahoe Regatta.\n\nThe Tahoe Yacht Club has exhibited endurance and resilience over the  past century, briefly closing over COVID-19 but overcoming the  challenges of that time to reopen to a wave of new members. Today, the  Tahoe Yacht Club boasts a membership of 450 individuals and…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…many,  many years since we have completed the full appropriations process, and  there were lots of challenges in a divided nation and a divided  Congress.\n\nI just wanted to briefly, this evening, as we conclude this process  in the Senate, take a moment and thank the chair and vice chair of the  full Appropriations Committee, Senator Collins and Senator…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}]