[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Fannie Mae executive shared confidential mortgage pricing  data with a competitor at the direction of Bill Pulte, the Director of  the Federal Housing Finance Agency. In his brief tenure, Director Pulte  has weaponized his office to target Democrats with allegations of  mortgage fraud.\n\nEarlier this year, Fannie Mae has terminated hundreds of my  constituents,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…diligently to support the implementation of my Pregnant Workers  Fairness Act, working to ensure it was protected in the appropriations  process, and helping to organize an amicus brief supporting the bill.\n\nShe has also been a champion of my bill, the Living Donor Protection  Act, which received 225 cosponsors in the 118th Congress due to  Alison's hard work.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…International, MedGlobal, Human Rights  Watch, Norwegian Refugee Council, HIAS, CARE, and the dozens of faith- based organizations--for being here and always being available to brief  Members of Congress but, more importantly, to get food to folks who  desperately need it.\n\nThis resolution is going to be rejected today with the objection  presented by the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…been in words, whether  it has been in deeds, have been supportive of the Jewish State of  Israel and of Jewish Americans.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, I will be brief. I do want to reemphasize how important  it is that Mr. Van Drew has worked collaboratively with our side of the  aisle on a bipartisan resolution that is not a ``gotcha''…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Public Health Service Act (PHSA), of which the Energy and       Commerce Committee has sole jurisdiction. Yet, contrary to       the statute, the HHS FY 2026 Budget in Brief proposes to       eliminate SAMHSA and move some of its functions to a new       Administration for a Healthy America (AHA). If this becomes       reality, there will no longer…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…but he goes on to talk about how the Republicans  are supporting these programs, and it is simply not true.\n\nMr. Chair, I have in front of me the ``Fiscal Year 2026 Budget in  Brief'' that came from the Department of Health and Human Services.\n\nOn page 35 to 36 of the document, it says: ``The budget eliminates  the following programs to align investments…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Well, we have to close down the  Department of Education because students aren't doing as well now ever  since the Department of Education existed.\n\nIf you will engage in a brief colloquy with me, and let's talk about  why that is an erroneous assumption.\n\nMs. BONAMICI. Absolutely.\n\nMs. BONAMICI. That is why we have Federal education research, which…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…chains control all of the grocery stores  in the country. Albertsons and Kroger, two of the big grocery chains,  actually tried to merge, and I was so proud to lead the amicus brief  with other Members of Congress to actually oppose that merger. Thanks  to Democrats and the FTC under Lina Khan, we were able to stop that  merger because we know and we have…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, initially, I want to make a very brief  comment on the legislation my colleagues Senator Heinrich and Senator  Kaine are advancing and which will be voted on later this afternoon. I  am proud to be a cosponsor of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…our  constitutional duty to an administration that, at every turn--at every  turn--has deemed us irrelevant; an administration that, for too long,  deferred its obligation to brief Congress and has reportedly threatened  to take steps to choke off the amount of information we have and need  to assess the impact and the consequences of unilateral military…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Massachusetts TPS       Committee                                __________\n\nHello, my name is W.V., and in 2009 my life changed       unexpectedly.\n\nI traveled to Florida for a brief vacation. During that       time, a family member living in New Jersey became seriously       ill, and I traveled there to assist her. Before I was able to       return to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…said, this is the people's House, a  House that I have great reverence for.\n\nMr. Speaker, I wonder if I might, via the Speaker, make a request to  the chairwoman to engage in a brief colloquy. Perhaps that could  provide the viewing public a sense of real debate, as opposed to us  just giving speeches.\n\nMr. Speaker, with much respect to the gentlewoman,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "Mr. SCHNEIDER. Mr. Speaker, I include in the Record links to three  articles. The first is: The American College of Obstetricians and  Gynecologists. ``Issue Brief: Crisis Pregnancy Centers.'' https:// schneider.house.gov/sites/evo-subsites/schneider.house.gov/files/evo- media-document/crisis-pregnancy-centers-rep-schneider.pdf.\n\nThe…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…past several years, this  administration has repeatedly tested the limits of Executive power-- ordering strikes in Iran and Yemen and now the Caribbean, while  refusing even a brief consultation with Congress. Each time, the lines  blur a little further. Each time, the balance of power tilts a little  more toward the Executive.\n\nThis body, the U.S. Senate,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…trying to block a vote on whether to end these  tariffs so they don't have to go on the record. It is why a few minutes  before this speech, President Trump blinked, announcing a brief pause  but we will be doing the same dance again in a couple of months.\n\nIt is time to simply end the chaos. That is why I introduced a  resolution to end these tariffs, but…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689861/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…today.\n\nI am also thankful to all of our brave law enforcement officers in  Minnesota, along with our Federal partners who were able to locate and  capture the killer, ending his brief reign of terror on our State.  Without their quick response, there may have been many more victims.  Thanks to their dedication and professionalism, justice will now be  delivered.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…success of shared-space arrangements among Federal agencies.\n\n(b) Briefing.--Not later than 6 months after the date of       enactment of this Act, the Administrator shall brief the       Committee on Transportation and Infrastructure of the House       of Representatives and the Committee on Environment and       Public Works of the Senate on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…one year-period, the       following:\n\n``(A) For each license application or other request for       authorization, the name of the entity submitting the       application, a brief description of the item (including the       Export Control Classification Number (ECCN) and reason for       control, if applicable), the name of the end-user, the end-…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…identification of, and information reasonably       sufficient for the covered platform to locate, the intimate       visual depiction of the identifiable individual;\n\n(iii) a brief statement that the identifiable individual       has a good faith belief that any intimate visual depiction       identified under clause (ii) is not consensual, including…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I will be brief with this explanation.  I will first say that it is so nice to see our economy moving in the  right direction. This bill will give more opportunities to Americans to  invest…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692777/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of items identified pursuant to subsection (b)(1); and\n\n(B) include in such agreements penalty provisions for       noncompliance.\n\n(2) Briefings.--The President shall brief the congressional       committees specified in subsection (c)(1) on negotiations to       establish agreements described in paragraph (1) beginning not       later than 30…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Air Force at Barksdale Air Force Base.\n\nThe aircraft is one of the three remaining B-24 relics from World War  II, originally named Rupert the Roo II.\n\nRupert will undergo a brief restoration process and will join a B-17  Flying Fortress to become the newest centerpiece of the museum.\n\nThese two machines represent the complete collection of the aircraft…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693104/recognizing-the-national-museum-of-the-mighty-eighth-air-force"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…law.\n\n(5) Briefing.--Not later than 30 days after the submission       of each terrorism threat assessment under paragraph (1), the       Secretary of Homeland Security shall brief the appropriate       congressional committees regarding each such assessment. The       head of any other relevant Federal department or agency shall       join the Secretary…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…signed  into law in order to protect our communities.                      California High-Speed Rail Update\n\nMr. KILEY of California. Mr. Speaker, I rise today to provide a brief  update on the California high-speed rail,  which, thankfully, in an overwhelmingly bipartisan vote, this House  just voted to cut funding off for. The President just signed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "James Risch", "party": "Republican", "sentence": "…less than 2 hours. Those troops  engaged with some unfortunate Cuban guards, who are no longer with us,  for 27 minutes. That is what this was made up of. It was incredibly  brief, targeted, and very successful.\n\nThe War Powers Act requires a President to submit a report to  Congress within 48 hours of ``introducing U.S. forces into  hostilities.'' The…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…recruit on a sacred national mission of accompanying Israeli       high-schoolers, military personnel, VIPs, and ordinary adult       tourists to Poland seeking a very brief exposure to a death       camp site. The heavy-laden theme is made bearable by a       genuine literary talent utilizing a relieving dose of sarcasm       and deprecating self-loathing.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…to  serve as Senate President pro tempore. From this leadership position, I  open the Senate daily, lead the Pledge of Allegiance, and often take  the opportunity to deliver brief remarks during what we call morning  business.\n\nSince 1986, every minute of the people's business conducted here in  the Senate Chamber has been made available live to the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "James Risch", "party": "Republican", "sentence": "…targets and in an even more carefully calculated time, much  like what he did with General Soleimani in his first term that was so  successful.\n\nThe strike on Iran was a single, brief strike at three nuclear bomb  facilities that ended the conflict between Israel and Iran. It was on  behalf of a close ally, Israel, and on behalf of the world, which is  unanimously…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…undermine our national security.\n\nWe conducted a 40-minute operation to remove a drug-trafficking  narcoterrorist, and Democrats are acting like we started world war III.\n\nFor that brief, targeted action, they now insist Congress must step  in and tie the President's hands.\n\nLet's be clear about how ridiculous this resolution truly is. It  orders the United…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…26  years on the force.\n\nDuring his time in Ferguson Township, Chief Glenny held roles that  included patrol officer, traffic enforcement, and police sergeant.\n\nThen, after a brief stop in Colorado to serve as the police chief  there, Chief Glenny returned to Pennsylvania to proudly serve the  people of Gettysburg.\n\nDuring this time, Chief Glenny worked…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}]