[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for the rest of their lives. This award  is a testament to James's hard work, determination, and perseverance at  Drake Middle School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate James Millard on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689697/recognizing-james-millard"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for the rest of their lives. This award  is a testament to Makila's hard work, determination, and perseverance  at Oberon Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Makila Cordova on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691484/recognizing-makila-cordova"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…them for the rest of their lives. This award  is a testament to Caleb's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Caleb Gallegos on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691160/recognizing-caleb-gallegos"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…in Queens.\n\nIn just 3 years on the force, Detective Diller made over 70 arrests  and was honored with three Excellent Police Duty medals. His colleagues  remember him as a bright, positive presence, always eager to learn,  deeply dedicated, and truly passionate about the job he loved.\n\nThe names I mentioned are not just names on a list. They were  fathers,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…of their lives. This  award is a testament to Fernanda's hard work, determination, and  perseverance at Jefferson Jr./Sr. High School and is clearly just the  beginning of a bright and promising future.\n\nIt is my honor to congratulate Fernanda Orozco Saenz on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691035/recognizing-fernanda-orozco-saenz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…them for the rest of their lives. This award  is a testament to Alexis's hard work, determination, and perseverance  at Excel Academy and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Alexis DeLeo on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690022/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…them for the rest of their lives. This  award is a testament to Isabella's hard work, determination, and  perseverance at Excel Academy and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Isabella Ekman on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690024/recognizing-isabella-ekman"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the rest of their lives. This award  is a testament to Luke's hard work, determination, and perseverance at  Arvada West High School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Luke Setelin on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689681/recognizing-luke-setelin"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…them for the rest of their lives. This award  is a testament to Kai's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Kai Weiss on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691740/recognizing-kai-weiss"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…their lives. This  award is a testament to Alexander's hard work, determination, and  perseverance at Jefferson Jr./Sr. High School and is clearly just the  beginning of a bright and promising future.\n\nIt is my honor to congratulate Alexander Aro Cavillo on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690160/recognizing-alexander-aro-cavillo"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…against the  Constitution of the United States, and he would have to have been tried  then in the House and the Senate on that impeachable offense.\n\nThis resolution draws a bright line. It affirms what should never  need reaffirming, that elections belong to the States, the Constitution  belongs to the people, and no President--ever--stands above either.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the rest of their lives. This  award is a testament to Sarbelio's hard work, determination, and  perseverance at Drake Middle School and is clearly just the beginning  of a bright and promising future.\n\nIt is my honor to congratulate Sarbelio Guevara Gonzalez on achieving  the Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689790/recognizing-sarbelio-guevara-gonzalez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…them for the rest of their lives. This award  is a testament to Zoe's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Zoe Kante on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692041/recognizing-zoe-kante"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for the rest of their lives. This award  is a testament to Alicia's hard work, determination, and perseverance  at Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Alicia Montoya on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689448/recognizing-alicia-montoya"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…leave       our home or operate normally in the world. How do you move on       from knowing someone tried to kill you and the people you       love?\n\n``The agents pointed the bright lasers attached to their assault  rifles at each of us'' when they came to his home. ``They even pointed  their weapon at my fiancee,'' who was pregnant at the time. He has…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…help those around him build a stronger foundation in  finance.\n\nI look forward to seeing Keaton's continued impact in central  Arkansas  and wish him the best of luck in his bright future in banking.            Honoring John Edward Hain, Jr., on His 100th Birthday\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to honor John Edward  Hain, Jr., who celebrated…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…her church, the Cathedral  Church of the Advent in Birmingham, and was loved by everyone there.\n\nIn her obituary, it says:\n\nNot only did her personal faith shine out like a bright       Christmas star, but she loved others as real people, not as       objects. Ella loved God with her whole heart and she loved       people--with her whole heart!\n\nThe…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…celebrate the  removal of a virulently anti-American, illegitimate communist dictator  who was trafficking drugs into our country and then help the Venezuelan  people build a bright future that restores the glories of their past,  turning a nation that was the most dangerous, anti-American country in  our backyard into the most stable and prosperous pro-American…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…recognitions affirms what Iowans already know: Iowa  Stead Family Children's Hospital is a place of hope, healing, and  leadership.\n\nThe future of children's health in Iowa is bright, thanks to the  tireless work of everyone at the University of Iowa Stead Family  Children's Hospital.", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696467/recognizing-stead-family-childrens-hospital"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…community and its heritage.\n\nMr. Speaker, it is my privilege to represent the people of Flagler  Beach in Congress. Here is to 100 more years of community, resilience,  and a bright future for this coastal gem.            Recognizing Lake County Superintendent Diane Kornegay\n\nMr. FINE. Mr. Speaker, I rise today to recognize Ms. Diane Kornegay  for her…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…service and dedication to our community, people like you are  undoubtedly taking up that mantle.\n\nI take deep pride in knowing that the future of the 4th District of  Arkansas is bright because of the people proudly representing High  Impact Movement. People who invest in our youth, pour into their  families, and strengthen our communities through their time,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…as she completes her senior year of high  school and goes on to tackle new challenges.\n\nI congratulate Makennah on her fourth State title. I wish her the  best in her very bright future.    Congratulating Portsmouth High School Girls' Basketball Team on Ohio                           Division V State Title\n\nMr. TAYLOR. Mr. Speaker, I rise today to congratulate…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…the speed of light  is part of the reason this industry was created.\n\nWhat do those tokens represent? Either securities, commodities or  real world assets? We have needed a bright-line test since this market  began to decide who regulates them.\n\nI introduced the first piece of legislation on this back in 2018  called the Token Taxonomy Act. Think of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693776/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…energy. I am for all of the above, but if you remember what the  Secretary said, he said he is for the best of the above. There are  areas where the Sun shines and the Sun shines bright, and it shines  bright on my old Kentucky home. There are areas for that. There are  areas where solar makes sense, where wind makes sense, and where fossil  fuels make sense.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…see our schools across this country in a state of  crisis. The nation's report card that recently came out revealed truly  shocking declines in student achievement, but one bright spot in this  otherwise very troubling picture has been Teach For America, otherwise  known as TFA.\n\nWhat TFA does is recruit recent college graduates to go teach in the  toughest…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…anniversary, Sunshine Week continues to be a crucial  reminder of the need for transparency and open government. To control a  government as big as ours, it takes a lot of very bright light shining  on every Agency. As Justice Brandeis wrote in 1913, ``Sunlight is said  to be the best of disinfectants.''\n\nTransparency brings accountability and the public's…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…fulfilling retirement.                  Honoring the Memory of George Whittenburg\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor the memory  of George Whittenburg, a bright young man taken from us far too soon  following a tragic car accident on January 30.\n\nGeorge was a 21-year-old student at the University of Georgia from  Austin, Texas. He…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…support of 10,000  volunteers and not one red cent of taxpayer money.\n\nThese special young athletes embody the spirit of perseverance on the  court and in their lives. They have bright futures ahead of them, and  we are proud.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690567/special-olympics-indiana-youth-basketball-tournament-pride"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…provisions that Republicans enacted through  the reconciliation bill, this CRA will ensure that American energy  remains affordable, reliable, and abundant.\n\nAmerica's future is bright as we unleash responsible natural  resources development to meet our energy and mineral leads, to create  jobs, and to drive economic growth across the country.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…example for young  people in Pennsylvania's 11th District and beyond who aspire to careers  in dairy and agriculture. I congratulate him and look forward to seeing  all that his bright future holds.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696415/congratulating-kyle-welk-on-being-named-the-2025-merle-howard-award-winner"}]