[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…students who are often underrepresented,  underserved, or overlooked by traditional higher education--providing  the support, flexibility, and access they need to pursue a brighter  future. Over the last 125 years, they've helped students prepare for  careers that truly matter in health care, business, public service and  beyond.\n\nI am proud to represent…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694738/recognizing-rasmussen-university-for-their-125th-anniversary"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…neglect public schools at our peril. They educate  nearly 50 million students--our future. It is time that we treat public  education as the priority it must be if we want a brighter future for  our children and our grandchildren and our country.\n\nWe should embark on a new public school movement--one that will  strengthen and support the education profession,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…seen  this story before.\n\nYet despite the dark clouds gathering above 1600 Pennsylvania Avenue,  Black Americans have long battled bigotry, broken barriers, and built a  brighter future despite the odds.\n\nThe fight is familiar. Black history teaches us the power of  resilience, resistance, and relentless struggle. That is what I owe my  constituents,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…healthcare in American history, cutting over $1 trillion.\n\nThe bill recklessly adds $3.4 trillion to the U.S. debt, and interest  rates will climb.\n\nCongress can create a much brighter future for America by defeating  this big, bloated bonanza bill for billionaires.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693166/one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Patriarch Bartholomew's dedication to  his faith, raising concern for the environment, and promoting peaceful  coexistence is a blessing to us all that spreads optimism for a  brighter future.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695494/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…reality and reflects Moreno Valley Unifier's belief that  education is not just about academics--it is about providing students  with the foundation they need to build a brighter future.\n\nMr. Speaker, the opening of the Health and Wellness Center is a  potent example of how schools can serve as hubs of hope and  opportunity. I commend Moreno Valley Unified…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695914/congratulating-the-moreno-valley-unified-school-district-health-and-wellness-center"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…served over 8,500  kids in our region, including 376 in this fiscal year. They do  incredible work to help place children in permanent homes and set them  on a path for a brighter future.\n\nThe funding CASA receives from the Victims of Crime Act is now on the  chopping block. These cuts will put a strain on already stretched thin  court-appointed special…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Representatives to ensure that this vital legislation makes it  to President Trump's desk. When it does, the President will have a  generational opportunity to secure a brighter future for children  across the country. Their lives depend on the ability of us to act.                                  ______\n\nBy Mr. DURBIN (for himself, Mr. Merkley, and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…offer no  solutions.\n\nWe are here doing the work of that today. We are taking price  concerns off of the back of industries. We are preserving jobs. We are  creating a brighter future for our communities by getting rid of this  eleventh hour rulemaking that was put forward by the Biden  administration.\n\nThey had all the power to make this country move…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…of our  students, these young people are not only learning about agriculture  but also taking initiative to serve their neighbors, strengthen their  school, and build a brighter future.\n\nLed by adviser Lynne Phillips and officers Harlie Brooks, Madison  Ballard, Bella Kaplan, Allie Englert, Camberlee Lockhart, Cadence  Flint, Alexis Clark, Silas Dutton,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Senate is a  huge win for schools, for students, for parents, and for American dairy  farmers. We are giving students more choices, schools more flexibility,  and ensuring a brighter future for our farmers.\n\nWhole milk delivers 13 essential nutrients and has enough fat content  to help students absorb vitamins like A, D, E, and K. It is also packed  with…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…1 will make America safe, strong, and  prosperous once again and, most importantly, give our children, like my  daughter, Jane, who is here with me today, a better and brighter future  in this, the greatest nation in human history.\n\nMr. ARRINGTON. Mr. Speaker, I would just remind the gentlewoman from  Minnesota (Ms. Craig) and my Democratic colleagues…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…every single one of her students is deeply inspiring and has left a  permanent mark on all who learn from her.\n\nHer work is directly contributing to a bigger, better, and brighter  future for Cochise County.\n\nMr. Speaker, I thank her for always uplifting her students. May she  enjoy this well-deserved recognition. Once again, congratulations to  Shanequa…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…commitment under IDEA, we fail millions of  children who deserve a fair shot at success. Passing the IDEA Full  Funding Act is a step toward fairness, responsibility, and a brighter  future for all.\n\nMr. Speaker, I urge my colleagues to support this essential  legislation.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…them off the street and  walked them through the booking process. I told them then that they  have a potential for a better life and a better day, but their path to  a brighter future comes through my jail. I advised them to take that  time in that jail to reflect upon their life and the potential that  they have to turn themselves around.\n\nYears later,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…proud that their hard work has paid off. As these talented  students prepare for their next endeavors, I wish them the best of luck  and blessings for an even brighter and more victorious future.\n\nGo Bearcats.\n\nIn God We Trust.                  RECOGNIZING GORDON LONGHORNS BASEBALL TEAM\n\nMr. WILLIAMS of Texas. Mr. Speaker, I rise today to recognize the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and accountability for the past are important, but with a  thorough investigation complete and the responsible individuals held  accountable, we can look to a better and brighter future for the United  States-Saudi relationship.\n\nWith all of this in mind and the fact that, at this time and place,  this resolution is not in the best interest of the United…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697011/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…grow. We are  making  America safer and stronger, investing in law and order here at home and  a strong military to safeguard our national security. We are creating a  brighter future with new opportunities for Americans wherever they live  and whatever their American dream may be.\n\nI want to take some time today to talk about how Republicans' agenda…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…about military security and making sure that  we make the next innovations and reach the next frontier. Dominance  means not just military, but it also means jobs and a brighter future  for so many.\n\nWhen you talk about jobs in the space industry, it is not a job to so  many; it is a career. The dedicated folks at NASA are moving forward  with these…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…window.\n\nMr. Speaker, I think most would agree that advancing a political  agenda at the expense of retirement savings is wrong. Let's be clear:  Americans invest to secure a brighter future for themselves and their  families, not to bankroll Democrats' radical initiatives and pet  projects and take care of their crony capitalists.\n\nRetirement plan sponsors…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…student in America.\n\nThis important milestone shows how far we have come in educating  students with disabilities, and the legacy of this landmark legislation  means a brighter future for all.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…administration  left our Nation facing a lot of challenges, but we are turning the page  on the Biden administration's failed policies, and I firmly believe  there is a brighter future ahead.\n\nI look forward to hearing from President Trump tonight as he outlines  his vision for American greatness.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}]