[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…fourth Arizona officer to fall in the  line of duty in just the past 12 months.\n\nMy thoughts are with his wife, family, his many good friends, and  colleagues. I hope his memory brings comfort and strength in the  difficult days ahead.\n\nOfficer Facio's ultimate sacrifice, his courage, and his selflessness  will never be forgotten.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…challenges. We don't surrender to  cynicism and lies. We work together. We do hard things. We do what it  takes to build a better future for our country, and we do it in a way  that brings all of us along together, and that includes ensuring that  all of us have healthcare. That is the way we created Medicaid. That is  the way we expanded Medicaid. And it is…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…to be a global leader in AI.\n\nWith strong AI literacy and education guidelines, we can lead with  clarity, govern with integrity, and ensure the innovative breakthroughs  AI brings can continue serving the public good.                    Benjamin Guerrero-Cruz Detained by ICE\n\nMs. RIVAS. Mr. Speaker, 3 months ago, I shared the story of Benjamin  Guerrero-Cruz,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696867/artificial-intelligence-is-here"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…police officer. He has done more, not only served in  one or the other, but served both, and did so with honor, decency, and  respect. I think the benefit of having him here, he brings a lot to the  table about this issue because I know that he has served and worked in  Mr. Neguse's actual district, in his territory, as well. I hope maybe  he will speak about…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…affordable for over 20 million Americans.\n\nI mean, come on. Get real.\n\nJust to make sure that we all know that they aren't serious,  Republicans included a poison pill which brings us closer and closer to  a nationwide abortion ban. They are going after abortion even in States  where it is legal.\n\nI mean, who the hell asked for this? This is like a plot…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…depositor, Mr. Speaker. That puts every American's  deposit at risk.\n\nAmendments were introduced to fix every one of these problems, and  every one of them was rejected, which brings me to a final point: Do  you know who really benefits from crypto? Corrupt politicians do.\n\nJust last week, the United Arab Emirates sent $2 billion to convicted  money launderer…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Philadelphia Eagles fanatic. Pulling up in his  truck, people come out of their homes when they hear him because they  trust him, and they look forward to the playful banter he brings along.  They know that he knows their names, their stories, and their teams.  They know he will make sure they leave with enough food for the week  and maybe a little extra.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…by the way, is also a Republican attempt to cover up how  they are raising energy prices for American families in the Energy and  Water appropriations bill. Renewable energy brings down the cost of  electricity. Trump and Republicans are destroying this clean and  affordable energy by cutting its funding in half. They are doing this  to benefit the fossil…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Dole, a  historic mansion in Crystal Lake, for the community to enjoy.\n\nSince 2011, Ms. Merkling has been the driving force behind the 4th  Fridays Art Event at The Dole, which brings together photography, art,  and music to enrich the local cultural landscape. Held ten times a  year, this program fosters collaboration among a diverse range of  artists and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…bring down inflation. It has gone up. He promised to  reduce the trade deficit. It has reached a record high.\n\nAmericans literally cannot afford 3 more years of this, which brings  me to the heart of the matter, the No. 1 way President Trump has  worsened the state of our Union. He has taken a diverse, complicated,  and sometimes fractious country--which…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…decade resulted  in many of those drugs being discovered and being sold to American  families and bringing relief to them in ways no one imagined.\n\nThat progress and the hope it brings to patients and families is why  I am absolutely dismayed to see how President Trump has dismantled  medical research in America during his 100 days in office.\n\nWas that what…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…from Harvard College and a  Juris Doctorate from Yale Law School and served as a law clerk to  Justice William J. Brennan Jr., on the Supreme Court of the United  States. He brings a distinguished record of leadership across the  private sector, public service, and international affairs. Mr. Cotton  spent 25 years at NBC Universal, including 20 years…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…also share a respect for Sam Brown's service to our  Nation. As a veteran--as a decorated veteran--who has earned  appreciation for his service, the kinds of qualifications he brings to  this office are impressive. But this nominee was advanced out of  committee by a 10-to-9 vote. So it is clear he does not have unanimous  support.\n\nHe said, when he was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…electricity.\n\nHe said that ``blue State offshore wind policies . . . lock in high  prices.''\n\nZeldin criticized the economic impacts of wind.\n\nWright said that ``wind and solar brings us . . . less reliable  energy delivery and higher electric bills.''\n\nSo all three of them have falsely asserted that offshore wind will  raise electric bills.\n\nIn court proceedings,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…national recognition. His commitment to excellence,  sustainability, and community exemplifies the very best of the 49th  Congressional District.\n\nJust as importantly, John's work brings people together. His  restaurants serve as welcoming gathering places where neighbors,  families, and visitors connect over memorable meals and shared  experiences. Through…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699850/recognizing-john-resnick-as-january-2026-constituent-of-the-month"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Iowa, I have seen incredible work being done by people like Shane  Sawyer, an Air Force special operations combat veteran who helps lead  the Quad Cities Veterans Network. He brings veterans together, not just  to socialize but to survive, to reconnect with the tribe they lost, to  rediscover their identity, and to talk to people who understand what  they…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691507/no-wrong-door-for-veterans-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…communities is a  grid without enough electricity. In every facet, our modern life is  uniquely dependent on a reliable and affordable electric grid.\n\nMadam Speaker, H.R. 3628 brings common sense back to integrated  resource planning, and I urge my colleagues to support the legislation.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697887/state-planning-for-reliability-and-affordability-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…wind because we have this fascination that we have to  bring this very expensive type of energy production somehow to the  United States, and the gentleman from New Jersey brings up the point.\n\nThe fact of the matter is, Mr. Chair, these new windmills that they  propose off my district are twice as high as the ones that they have  initially proposed.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695162/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…like them to try taking that message, the message that they  refuse to provide resources to their communities to combat opioid  abuse, back to their constituents.\n\nThis bill brings resources to our constituents to combat opioid  abuse. That is what we are talking about. It is that simple. They can  hate the President, or they don't have to, but don't…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…service. He served as USDA  general  counsel during President Trump's administration and now sits on the  U.S. Court of International Trade, both roles confirmed by this body.\n\nHe brings a deep understanding of rural America because he has lived  it. His family has farmed in Tennessee and Kentucky for generations.  That firsthand knowledge, combined with his…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692280/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…have already seen this  time and time again in the Northeast. In the Northeast, shortages have  already threatened reliability and driven prices through the roof.\n\nThis bill brings long-overdue accountability and coordination to the  Federal permitting process for interstate natural gas pipelines. It  strengthens FERC's lead role, requires State and Federal…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…The fact that this horrible man should brutally stab this innocent  woman, that is part of the national narrative right now. The fact that  we are dealing with that horror brings us to hold accountable every  judge that let him go and every prosecutor that refused to force  charges upon that man, every elected official and politician that stood  for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…State's College of Agricultural Science, on the panel.\n\nThis year, we celebrated passage of my bill, the Whole Milk for  Healthy Kids Act, which will be soon signed into law and brings back  the option of whole milk and 2 percent milk, including flavored, to our  schools' meal programs. Dairy farmers from across the Commonwealth  championed the Whole Milk…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…production in  vast, new, improved ways. Again, modernize the grid and increase  reliability. Those things are key.\n\nWe want to make sure that we are doing that because that brings down  the cost of living and brings down the cost of power. When things are  more reliable, we have more opportunities to provide power in many  different ways. That brings…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…median income for Massachusetts was  $113,900, meaning that households making up to $170,850, which is  nearly double the nationwide median household income, qualify.\n\nH.R. 4758 brings the dream of homeownership back to millions of  Americans.\n\nBy the way, let's talk about electricity costs again. We talk about  this a lot, reliable power, affordable power.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…any transparency whatsoever. A small business can  go all in on a contract proposal only to watch it vanish like that with  no reason given. That is unacceptable.\n\nH.R. 789 brings much-needed transparency and accountability to this  process. It requires agencies to disclose why a solicitation was  canceled because our small businesses deserve to know.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…many fat kids in America, and we need to get  more of them out running cross-country.\n\nFounded 25 years ago by local teacher Heidi Bresson and her husband,  Mike, Active4Youth brings free cross-country programs to as many as  6,000 elementary students each fall. In a city where many families face  economic hardship, this may be the only chance some children…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, the One Big Beautiful Bill Act,  some say it is the bee's knees. What is the buzz?\n\nBasically, it brings better jobs, bigger paychecks, and booming  communities. The One Big Beautiful Bill Act is about boosting wages,  backing small businesses, bolstering border security, and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693038/buzz-from-break-rooms-to-backyards"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Congratulating Dr. Anjan Bose\n\nMr. BAUMGARTNER. Mr. Speaker, as a proud alumnus of Washington State  University, I rise today to celebrate a tremendous achievement that  brings national recognition to our State and to one of our leading  institutions of higher learning.\n\nPlease join me in congratulating Regents Professor Anjan Bose of WSU  for receiving…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Act ushers in the golden age of America,  as our great President says, where taxpayers, not illegal immigrants,  are put first. It eliminates taxes on tips and overtime and brings tax  relief to seniors. It saves and sustains Medicaid so it is there for  those who truly need it. It secures our southern border, making every  community safe.\n\nAll that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693179/one-big-beautiful-bill-act"}]