[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…willing to fight for families, for their future, and for their  health.\n\nWithout food stamps and healthcare, children like Wylie will suffer.  Families will be pushed to the brink. I am here fighting every day for  Tiffany, for Wylie, and every other mother and American family who  deserves that stability.\n\nWe must fight this awful Republican budget…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691477/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Americans' minds: What the  heck is going on?\n\nThis administration is not draining the swamp. They are torching the  country. The global economy is in chaos. We are teetering on the brink  of recession. Administration officials are telling us we should perhaps  prepare to ration dolls and toys this Christmas. Yet, they want to  debate renaming the Gulf of Mexico.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…healthcare system that we have today  doesn't work for anyone except if you are an insurance company. I hear  it from Vermonters all the time: Our healthcare system is on the brink,  and every choice Republicans make leads us further into collapse.\n\nRepublicans have no plan for healthcare, and they never have. For the  last 15 years, all they have done…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696754/medicare-for-all"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…North Carolina, Republicans have  sought to cancel 65,000 votes in a judicial election--an estimated  2,000 to 8,000 of which were military and overseas voters.\n\nWe are on the brink of exporting this injustice nationwide on a much  greater scale. Senator Padilla is right to sound the alarm about this,  and I am proud to join him. We want to help our fellow…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…statement  regarding House Republicans' proposed cuts in Medicaid:\n\n``The latest Federal proposal to gut Medicaid is reckless. Physicians  and hospitals will be pushed to the brink, forced to close their doors  and unable to continue care for their patients.''\n\nMr. Speaker, that is because when this funding leaves those rural  hospitals, then not only…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of all blood and urine samples of their patients in  Gaza.\n\nIsraeli officers charged with monitoring conditions inside of Gaza  have told their commanders that it is on the brink of starvation.\n\nMr. Speaker, for too long Congress has been complacent and complicit  about the suffering of the Palestinian people in Gaza. We need to speak  out and demand…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691407/gaza-needs-immediate-humanitarian-aid"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…on the internet for us to argue about. We all  know what we saw. We all know what we saw. I remain hopeful that Leader  Thune and other Republicans can walk us back from the brink, but I am  not so sure anymore.\n\nSo as Trump's Department of Homeland Security raises the stakes and  continues with a series of provocations to justify increasingly  authoritarian…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…today we are close to forgetting that profound blessing. Instead  of prioritizing deescalation, we see a resurgence of the same Cold War  mindset that once pushed us to the brink of annihilation. We see  hawkish perspectives pushing the U.S., Russia, and now China to a new,  three-way nuclear arms race.\n\nProponents tell us that this buildup will make…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…shine a light on what remains the most serious existential  threat facing our country and our planet. It is too easy to forget in  these days of polycrisis that we are on the brink of a new nuclear arms  race.\n\nVery soon, one of the last remaining pillars of the nuclear arms  control regime, the New START treaty, is due to expire. This treaty  restricted…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…as you have rightly pointed out, that is just the beginning of  the disaster because there are hundreds of rural hospitals in this  country that are right now living on the brink of disaster. If Medicaid  reimbursements drop by just 5 or 10 percent, those rural hospitals are  out of business. The same can be said of thousands of drug treatment  centers…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…these credits will hit working families the hardest. In a  city where the cost of living is already sky high, premium spikes will  push many in New York's Ninth District to the brink of losing coverage  altogether.\n\nHouse Democrats stood united for more than 40 days to prevent this  outcome. We fought to shield families from exactly this kind of  financial…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…since the Cold War,'' Representative Jim McGovern said       this spring when reintroducing a House resolution ``urging       the United States to lead the world back from the brink of       nuclear war and halt and reverse the nuclear arms race.''       With 21 cosponsors, the resolution ``calls on the president''       to take major steps toward sanity,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…or worse.\n\nSo 100 days into Donald Trump's second term, what exactly do  Americans have to feel good about? Is it that Donald Trump's trade war  has pushed our country to the brink of recession? Is it that his  tariffs will cost families an average of $4,700 annually? Is it that  CEOs and business owners are warning about rising costs, empty shelves,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…leaders in my State who know our hospitals  are speaking to this injustice. Medicare provides nearly 19 percent of  all hospital revenue. It allows rural hospitals already on the brink to  keep their doors open--rural hospitals.\n\nIt would take safety-net hospitals that serve uninsured and  underinsured populations. Without Medicaid, with these cuts, these…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "…top  priority. That has not been the case. The American people are poorer,  and it is more expensive to live here as a result.\n\nMr. Speaker, the economy is teetering on the brink. Every single  piece of evidence tells us that a vote for this bill is a vote to make  things worse, and I urge a ``no'' vote.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693158/one-big-beautiful-bill-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, I thank the gentlewoman for  yielding time.\n\nMr. Speaker, we are on the brink of a historic moment. This is a day  I have worked toward for a long time. Throughout my time here, I have  fought for legislative reforms that will restore a Member-driven…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699307/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…prosecuting--vindictive prosecution--is wrong,  period. Whether the administration is a Democrat or a Republican,  vindictive prosecution is wrong, period.\n\nWhat we are on the brink of with respect to the Chair of the Federal  Reserve is the pot calling the kettle black. We can't come here and  talk appropriately about the Arctic Frost investigation, we…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…American people.\n\nDoes the gentleman from Pennsylvania agree?\n\nMr. ROY. Right.\n\nMr. ROY. Zero. Now, if we are lucky--if we are lucky--we might get a  handful if pushed to the brink. Remember, we got four or five of them  to vote for, I think, the SAVE Act.\n\nLet's bring that up for a second. Should we not--in addition to  guaranteeing that we secure the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…industry felt the brunt of the administration's attack more than the  coal industry. Coal mines, coal-fired power plants, and the communities  they support were pushed to the brink of collapse.\n\nThe 2024 amendment to the Miles City Resource Management Plan would  have cut off access to 30 percent of the Nation's coal reserves.\n\nThe vast majority of Americans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694891/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…women of the FAA.\n\nFor 43 days, while the Democrats kept our government closed, the  aviation system that they rely upon and the traveling public depend  upon was pushed to the brink.\n\nAs a member of the Aviation Subcommittee, I have seen up close how  critical a fully functioning system is to safety and commerce.\n\nThe Indianapolis International Airport…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697078/commending-air-traffic-controllers-and-faa-employees"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…American people that despair is never destiny. Let me repeat that.  Despair is never destiny. He told them that courage, unity, and faith  could rebuild an entire nation from the brink of ruin.\n\nMr. Speaker, today the Iranian people are living through their own  era of hardship--economic collapse, political oppression, and constant  fear. Yet, they continue…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…dangerous, violent  criminals.\n\nThe woke policies of Democrat-run sanctuary cities, fueled by woke  politics, have become magnets for chaos, stretching public resources to  the brink, and crowding out citizens who actually follow the law.\n\nWhat happens? Well, it often depletes the public resources meant for  U.S. citizens.\n\nMoving SBA offices into nonsanctuary…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…for a shutdown they  neither caused nor deserved. The pain has been all too real for far too  many Americans, including families struggling without paychecks,  seniors on the brink of hunger with food assistance lapsed, airports in  chaos, and communities bracing as programs that they rely on were  stalled or stopped altogether.\n\nWith yesterday being…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}]