[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…manner.''\n\nIt is not too costly. It is financially sound. I regret that the  Richard Star Act will not be passed today, but I have another measure  that I would like to bring to the floor. And it is, with regret, that  we are not providing unanimous consent to the bill itself.\n\nAnd I understand the points made by my colleague, but I would like to  present…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…We need a nationwide solution. We have the votes for this fix. Four  Republicans joined us in the petition to bring this bill to the floor.\n\nWe must pass it. We must bring it to the floor, pass it in the House,  and send it over to the Senate this week. President Trump must sign it  into law. If we don't, here is the reality: Families will drop health…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…doing a closed rule.\n\nMy Republican colleagues have been complicit in these 80 closed  rules. Nearly 9 out of 10 times, the majority party has not been  allowed to bring amendments to the floor. They are getting blocked by  their own leadership time and time again. How does that feel?\n\nAgain, this is a terrible rule, and I urge a ``no'' vote. I reserve…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Kennedy  is putting children's lives at risk by restricting access to vaccines.\n\nThere is a lot this Congress could be doing this week, but the first  bill Republicans bring to the floor in 2026 is about showerheads. It is  almost impossible to believe. To make matters worse, this bill will  actually drive up monthly utility bills for American families.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…are warning us they will have to close their doors  in a matter of weeks if this tariff war doesn't end.\n\nMr. Speaker, the three bills the Republicans are choosing to bring to  the floor this week have nothing to do with the existential threat that  these tariffs are posing to our Nation's small businesses. The lack of  courage to stand up for our Nation's…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…figure out  what we can buy.\n\nTo add insult to injury, we should be working together on legislation  that will help our neighbors back home. What bills do the Republicans  bring to the floor of the House today, the day of the State of the  Union Address? They bring a bill that is going to make things more  expensive. They are going to make electricity bills…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…billionaire Epstein class while the rest of America struggles just to  get by.\n\nWith all of that going on, with families begging for relief, this is  what Republicans bring to the House floor today: more bills about  appliances. This Republican majority has brought up more than a dozen  appliance bills. The lobbyists for the appliance manufacturers sure…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…between what the Republicans want and  are actually doing and what American families really need.\n\nHere are some of those policies that the congressional Democrats  would bring to the floor if we had four more Members in our Caucus:\n\nDemocrats will support working families. The first thing we will do  to support working families is to expand the child tax…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…could actually aid,  abet, and assist law enforcement officers in their work. Unfortunately,  we have not had from the majority a single bill that  they are willing to bring to the floor to increase any funding for  local law enforcement. On the contrary, the emissaries from DOGE--and  here I don't necessarily hold my colleagues accountable for this…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…made on  the campaign trail.\n\nIt is time for Congress as a coequal branch of government--and,  Speaker Johnson, if you are listening, please, you have the ability to  bring to the floor a countermeasure to the International Emergency  Economic Powers Act and stop the madness in terms of where this  administration is taking our economy.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…question really is, what do we say to that  family? What is the answer that we say that we cannot negotiate? What  is the answer that we say to them that we cannot bring it to this  floor? What is it that you would like me to say to the American people?  What is it my colleagues on the other side that don't stand united with  us for the people want…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…your constitutional authority.\n\nFor almost 2 years now in this cause I have met with leadership. I  have exhausted all tools in my legislative toolkit to be able to bring  this to the floor. As I was met with much opposition, I finally used  the last tool that I had at my disposal which was something known as a  discharge petition where I collected 218…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689415/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…best.\n\nPart of the process in the Committee on Rules that we have adopted  over the generations is to say: No, we are not going to allow that. We  are not going to bring that to the floor, and I think that is  appropriate.\n\nIn fact, as the Speaker knows or can learn of, I have long advocated  for much stricter germaneness rulings here on the floor,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…representing both political parties.  It expresses support for the Iranian resistance and its vision of a  free, secular, and nonnuclear Iran. I urge the leadership to bring it  to the floor for a vote.\n\nOur Declaration of Independence proclaims that whenever a government  becomes destructive of the natural rights of its people, it becomes  their right…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…like this.\n\nWe shouldn't have to have this law.\n\nWhy? Because the District of Columbia should be following the Federal  law in the first place. We shouldn't have to bring this to the floor.  We shouldn't have to engage in this debate. I shouldn't have to explain  these things. However, we are going to, by God, require that our  Nation's Capital comply…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…supermajority. We have plenty of folks who are willing to  be able to step up and say that is a reasonable thing to be able to do.  The problem is, it takes consent to actually bring it to the floor. It  is just a simple issue of do we have the ability to be able to vote on  this today? If we don't, we are stuck.\n\nNow, it only takes 60. We definitely have 60 votes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…again, I thank my  colleagues, Representative Houlahan and Representative Fitzpatrick, and  my long working relationship with Ranking Member Morelle for being able  to bring this to the floor.\n\nIt is correctly noted that as we approach the 250th anniversary of  the United States of America, I think it is true and important that we  put this statue here…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}]