[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Academy Award for his costume design work in the movie ``Wicked.''\n\nPaul's first Academy Award will join a crowded trophy case that  contains an American Cinematheque Award and a British Academy Film  Award, both for his costume design in ``Wicked.'' He also won Critics  Choice and Costume Designers Guild Awards for his work on the film.\n\nWhile this is Paul's…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688615/recognizing-paul-tazewell"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Ukraine'' reported that natural gas prices       reached their highest levels since December 2022, with       December futures settling Thursday at $4.646 per million       British thermal units, up 67 percent from a year ago. For       every one dollar increase in the Henry Hub natural gas price,       consumers pay on average $34 billion more for natural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…antithetical to the history of our democracy and all democracies.\n\nJohn Adams, prior to becoming President, took on one of the most  unpopular cases in American history, representing British soldiers who  had participated in the Boston Massacre. Why did he do that? Why take  on such an unpopular cause? Because he understood the importance to a  democracy of the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the  throne and sought to amend the Bayonet Constitution--a document King  Kalakaua was forced to sign under threat of violence from a group of  predominantly American and British businessmen, which significantly  reduced the monarchy's power and disenfranchised most Native Hawaiians.  Fearing the Queen's desire to restore power to the monarchy and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…to President Putin.\n\nThe historical irony is unmistakable, since Munich is a place that  has inauspiciously become a shorthand for the ``appeasement'' of  tyrants.\n\nIn 1932, British Prime Minister Neville Chamberlain left his meeting  with Adolf Hitler in Munich. And after surrendering Czechoslovakia in  exchange for a peace pledge, when he returned to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…anniversary of the river being free,  the return of the salmon through canoe journey. This is an endeavor in  which Tribal canoe families journey from around the Salish Sea and  British Columbia to come to land, to celebrate, to commemorate their  history, and to promise to preserve the land, water, and ecosystem for  seven generations forward.\n\nThis legislation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Mr. Speaker, it is with great respect and admiration that  I recognize the outstanding contributions of Nick Alton, who has served  as Minister Counsellor Political at the British Embassy in Washington  for the past four years. Throughout his tenure, Nick has been  instrumental in strengthening the special relationship between the  United Kingdom and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…actually thought a lot about this problem  because they had watched their monarch. They had watched the King of  England use the powers that he had in order--not to protect the British  people but to amass enormous wealth. He used those powers both to  control dissents and protests domestically, but he also used those  powers in order to compel other nations…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…nervously       fingering muskets or clubs or handspikes--were silent as they       drew closer and closer to the silhouette of a schooner a       short distance away. A white British ensign fluttered from       the schooner's topmast in a humid breeze.\n\nA sentry on deck peered into the darkness, catching sight       of the approaching boats.\n\n``Who comes…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Marshal and Keeper of the Keys to the Capitol, using enslaved labor.  Ringgold helped lead President James Madison and several members of his  Cabinet to safety during the British burning of the White House years  earlier during the War of 1812.\n\nFormer Maryland Governor Samuel Sprigg purchased the property for his  daughter and nephew William Thomas…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Arguably, Mr. Franklin's most important accolade is that he is the  only person to have signed formally all three foundational documents  separating our new Nation from the British monarchy.\n\nThe Treaty of Paris, the Declaration of Independence, and the Bill of  Rights, together known as the Charters of Freedom, boast the signatures  of some of our Nation's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…shot and  killed on March 5, 1770, in what became known as the Boston Massacre.  His murder stirred the revolutionary fervor and America's fight for its  liberation from the British.\n\nSo, why is it that all of us were taught about the Boston Tea Party  but nothing about the Boston Massacre?\n\nThe life of Crispus Attucks is far less documented than his…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…scientific understanding, his role as the first  Postmaster General created the foundation of our modern mail system,  and he was resolutely committed to freeing the Colonies from British  rule.\n\nHe helped draft both the Declaration of Independence and the United  States Constitution, and he negotiated the treaty that ended the  Revolutionary War. His genius…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…saying: Cheers. Thanks for the fries.\n\nI whipped my head around, looked in the rearview mirror, giving him  all the telepathy I could. I need to get home. I need to turn on the  British baking show--I should say the American baking show, American  baking shows. And there is nothing worse than cold McDonald's french  fries. But Kevin doesn't move the car.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Istanbul, he  witnessed a massive pogrom against the city's Greek neighborhoods that  left them looking ``like the bombed parts of London during the Second  World War,'' as one British journalist reported. While the police  ``stood idly by or cheered on the mob,'' according to a report of the  U.S. consul, 4,000 Greek shops and 2,000 homes were sacked and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…played in our Nation's war for independence.\n\nThe Battles of Saratoga were the most significant turning points and  one of the most decisive American battles of the Revolution. British  General Burgoyne tried to seize control of the strategically important  Hudson River Valley, but his campaign ended in defeat at the Battles of  Saratoga, where he surrendered…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…experience as a saxophonist with wind  bands, big bands, and variety bands in the Lehigh Valley and  Philadelphia areas, and has performed internationally in Great Britain  and the British Virgin islands.\n\nIn retirement, Mr. Parker looks forward to guest conducting, running  clinics and teaching lessons online, as well as continuing to play his  saxophone. He…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…one man or even one body of men to initiate hostilities.\n\nIn Federalist 69, Alexander Hamilton stated the Constitution gave the  Presidency fewer war powers than those of the British Monarch and that  the American President would be restricted to conducting the operations  of the Armies and Navy. In other words, the Constitution, the  declaration of war,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…the United States and the War on Terror  in Afghanistan.\n\nSince their first mission began, more than 18,000 Danish soldiers  have deployed to Afghanistan with American and British forces.  Throughout their deployments in Afghanistan, 43 of their soldiers lost  their lives fighting alongside American soldiers, defending our freedom  and holding the Taliban…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…given to the town in  remembrance of its citizens, Lyman Hall and Button Gwinnett, who  bravely signed their names to the Declaration of Independence, in  direct defiance of British rule.\n\nAdding to the town's historical significance, another Midway resident  by the name of Nathan Brownson served in the Continental Congress from  1776 to 1778, helping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694770/recognizing-the-city-of-midway-georgia-on-its-centennial-celebration"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…not exist if not for a  series of legendary events that took place nearly 250 years ago.\n\nIn September 1777, General Horatio Gates led Continental Army troops  against the British empire in present-day Saratoga County. In the  ensuing Battles of Saratoga, American colonists forged a turning point  in the Revolutionary War by routing the British invasion…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, I rise today to honor Scouts Across  America. Scouts Across America carries forward with a remarkable legacy  that began with Robert Baden-Powell, a British Army officer whose  simple idea was that outdoor skills, teamwork, and service could build  better citizens and a better world.\n\nRobert Baden-Powell served with the British…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we don't have a choice. Is anyone else at  least at all freaked out a little bit looking at what is happening  around the world right now, what is happening to French bonds, British  bonds, Japanese yields on the long end of the curve? When you see the  long end of the curve going up and up, that lets you know the entire  world is getting really nervous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…China, Zhu moved to  Canada where he set up dozens of corporations to steal valuable  American intellectual property and unlawfully transfer it to China. The  Supreme Court of British Columbia found that he committed fraud on an  epic scale, resulting in a $330 million judgment.\n\nHe then fled to America, assumed an alias, David He, and set up  several more…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…informal bodies. The number of sharia courts in Britain has grown to 85  since they first began operating in the country in 1982.\n\nPolls have found that 41 percent of the British public believe that  Muslim immigrants have had a negative impact on the United Kingdom.  Nearly half think that Muslim women are pressured into wearing a hijab.  Almost a…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…being a member       of the Lutheran Health and Banner Health Systems boards from       1990-2005. Being on these boards sparked his love of travel,       taking trips to the British Isles, Scandinavia, Europe, the       Middle East, and Australia. He led many bus tours throughout       the U.S. and tour groups 19 times to Israel, Jordan, and       Egypt.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]