[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…most unproductive, dysfunctional Congress  in modern American history.\n\nDid they learn anything from it? No, they did not learn a thing. This  Congress they have taken that broken model and somehow made it worse.\n\nAs of last night, they have racked up over 50 closed rules in just 5  months. More than 90 percent of the bills they bring up have no  amendments,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Mexico, Maryland, Michigan, Hawaii-- the list is long--please listen to the stories of real U.S. companies,  workers, and communities that are being devastated by job losses and  broken promises. Meanwhile, inflation and prices are steadily on the  rise due to the GOP's reckless tariffs.\n\nFirst, we must ask why the Trump administration is stopping the  investment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…that the first bill I  will introduce as a Member of Congress is the Protect Veteran Jobs Act.  The men and women who serve our country deserve our unwavering support,  not broken promises.\n\nThe indiscriminate firing of veterans by the Trump administration and  Elon Musk's DOGE dishonors the unwavering commitment that these public  servants have dedicated…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688234/democratic-proposals"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…because  everybody in America is subsidizing it right now with their tax  dollars. That is the only reason that it ever became competitive. It is  because we are subsidizing a broken system.\n\nGreen energy is consistent in its inability to produce baseload  energy, reliability, or consistency. It is not consistent in its  ability to transmit even down the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…information  about special interest aliens than DHS publishes about known suspected  terrorists.\n\nToday, DHS publishes suspected terrorist information on a monthly  basis, broken down by Border Patrol and ports of entry. No other data  is published.\n\nHere, my colleague from Georgia wants DHS to publish more information  about special interest aliens…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…on us to stand up, fight back, and use every tool we have to  oppose this agenda because this has been 100 days of chaos, cruelty,  and cuts.\n\nThe Trump administration has broken the economy, broken the law, and  broken our alliances.\n\nIn just 100 days, this White House has shrunk the economy, raised  prices, and put us on track for a recession.\n\nNow,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…barracks for  unaccompanied servicemembers and establish clear timeliness standards  for maintenance work orders.\n\nNo servicemembers should be forced to live with black mold, broken  plumbing, and unsafe conditions. I have walked through those barracks  myself.\n\nRepublicans said no, again. I guess they are fine sending troops off  to war and combat and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…of my constituents just turned 18 and was so terrified he  couldn't even answer questions. He was afraid to say anything. He will  be deported because he is caught up in a broken immigration system.\n\nWe will not let them disappear into the system. We will not stand by  and let ICE bring more violence to our cities and open detention  facilities in rural…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699660/horrific-ice-abuses"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…student athletes who, again, rose to  the occasion to take the UConn women's basketball program into further  heights with its 12th national title. All records are made to be  broken, but it is hard to even imagine any other school's team that  could come close to 12 national titles.\n\nThey were led by Paige Bueckers who is going to be one of the greats…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…insurance.\n\nNo one in this room would say that we are paying too little for  healthcare right now.\n\nAnd I don't always agree with Senator Sanders, but I can say there is  no more broken system in America than healthcare right now. It needs  full rebuilding. We may disagree on some of the ways to do it, but the  Republicans offered zero plan, zero ideas. Hell,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696657/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…will not sit idly by as this administration  jeopardizes our children's futures and undermines the fundamental right  to an education.\n\nThese aren't budget cuts. These are broken promises to children with  disabilities. We cannot build a stronger nation by cutting off critical  support for those who need it most. We must fully fund and support the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…RANDALL. Mr. Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, I am glad to be here together on the House floor today  to lead a conversation about how we fix our broken healthcare system.\n\nAcross our country, working families are feeling the pain of rising  costs from every direction. Donald Trump and congressional Republicans  have failed…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…have probably seen the pictures of him being caught and  beaten by the mob, which that day was wielding Confederate battle  flags, American flags, baseball bats, steel pipes, broken furniture,  you name it, to attack our officers.\n\nThese people gave blood, sweat, and tears. Several officers died in  the aftermath, including Officer Brian Sicknick who died…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…I that were here on our own in this very Chamber  and made that walk, which in the morning had been a big celebration of  our democracy; but this time we were walking over broken glass, we were  walking by marble pillars spray-painted with racist vulgarities. But we  made that walk, and our democracy prevailed.\n\nBut in one of President Trump's first…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Franklin Township Police Department                                   OKLAHOMA\n\nBartlesville Police Department\n\nComanche County Sheriff's Department\n\nTemple Police Department\n\nBroken Arrow Police Department                                    OREGON\n\nEagle Point Police Department\n\nTualatin Police Department\n\nAstoria Police Department…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…presented by H.R.  4922, including the establishment of a website on District of  Columbia's juvenile crime statistics.\n\nPassage of this bill will go a long way to correcting the broken,  soft-on-crime policies here in Washington, D.C., that coddle criminals  and place at risk the good, honest, and hardworking people who call the  District home.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…inflation.\n\nWhen Democrats passed the Inflation Reduction Act and spent $1  trillion on subsidies, inflation hit a 40-year high. It is clear that  pouring taxpayer money into our broken healthcare system will only  drive prices higher.\n\nAs we debate healthcare costs, the solution is not spending more. It  is time for real, market-driven reforms that allow…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697139/skyrocketing-cost-of-healthcare"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…budget resolution is a framework that will  allow us to deliver on the demands of the American people to secure the  border, eliminate wasteful spending, revitalize Biden's broken economy,  and safeguard our economic prosperity by providing permanent tax relief  for working families. I hope our Democratic colleagues will join us in  those efforts.\n\nThis…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…provide  aerial refueling, spare engines, and contested logistics in the Pacific  Ocean.\n\nSome of the most important provisions in this bill help the Pentagon  fix many of its broken and antiquated processes. It gives Secretary  Feinberg the ability to accelerate and find, test, and buy the tools  that warfighters want and need, both hardware and software.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699327/consolidated-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Communist Party--propaganda is flooding  the world to fan the flames of a narrative that Friedman seems to  embrace, and it is this: Their narrative is that President Trump has  broken the World War II liberal international trading system.\n\nThis charge is ridiculous, and it gives a pass to the real culprit.  The Chinese Communist Party broke the system a…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…you should be deported. There  are some people I think are apparently for limited amnesty or no  immigration laws at all and say we should only be deporting people who  have broken the law. Obviously, that would mean that if the only law  you have broken is coming here in the first place, probably 98 or 99  percent of the 8 million people who entered…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699858/who-should-be-deported"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…need. Even though they are in wheelchairs,  they are not voiceless and will show up with their power. If that  doesn't break our hearts, I don't know what will.\n\nWe have a broken system that prioritizes the wealthy, corruption, and  loyalty to President Trump over the health and well-being of people  like Julie. There are 8.6 million people who will…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…processes under the Clean Water Act  more efficient, consistent, and transparent while continuing to protect  our Nation's water quality.\n\nOur Clean Water Act permitting regime is broken.\n\nWhen it takes up to 18 months to receive a permit under just the  Clean Water Act to build a pipeline, dam, road, pond, or home,  something is simply wrong.\n\nWhen wastewater…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…taxpayers are paying for it. There is  no free lunch when it comes to this.\n\nThe enhanced premium tax credits don't lower the cost of healthcare,  but they are a bandaid on a broken bone.\n\nBy the way, we can prove this.\n\nIn 2014, taxpayers covered 68 percent of an ObamaCare exchange  enrollee's premiums. By 2020, 60 percent had become 80 percent, meaning…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…give them comfort that  if the cancer that I got in 2011 hits them, that they will be able to  go get care because they can't afford it. They can't afford it because  we have broken it. We didn't break it, Democrats broke it.\n\nRight now, Republicans have a choice: Go along with Democrats to  continue to socialize healthcare, continue to enrich insurance…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…are needed to keep the cost of health insurance premiums down. In  reality, ObamaCare is too expensive to afford without the subsidy. So  what they are doing is propping up a broken system.\n\nIn fact, since 2013, the ObamaCare benchmark plan premium has  increased by 237 percent--more than three times the rate for employer- sponsored healthcare plans that…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…always deferred to the Agencies,  until now.\n\nThey literally broke their own policy. They literally violated their  own legal counsel. So now, we are in a quandary. GAO has broken their  own legal counsel. We have an issue that will have well over $100  million worth of effect onto the country. It is now a near nationwide  mandate on electric vehicle…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…will overturn today imposes unnecessary and  duplicative labeling, certifying, and reporting requirements for  various appliances and commercial equipment. This is part of a broken  system that needs major reforms. The American people are done paying  for it with higher costs, created by government bureaucrats, for at- home appliances.\n\nUnder the Biden…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688546/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. Speaker, I rise in opposition to $100 billion worth of bailouts  for a broken system that is fueled by Democratic mandates.\n\nMr. Speaker, I rise in opposition to subsidizing insurance plans for  wealthy people. Any support for the bill ensures that subsidies…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…good-faith  talks with Ukraine and the United States. And he has never engaged in  any talks that were in good faith.\n\nPutin repeatedly bombs civilians. He has forged a trail of broken  promises. He, and only he, chose--unprovoked--to start the largest land  war in Europe since World War II. Putin, and only Putin, did that.  Where in any of this has there…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}]