[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…McGARVEY. Mr. Speaker, Louisvillian Tim Nicolazzi has dedicated  his life to service. He served in the Air Force and then Army,  deploying to Kuwait and Iraq, where he earned a Bronze Star.\n\nAfter his honorable discharge, Tim's call to public service brought  him to HUD, where he has helped victims of domestic abuse in Louisville  find safety, helped veterans…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688676/veterans-deserve-better"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…very  best of our military.\n\nIn recognition of her outstanding contributions, Major General  Clellan has been awarded the Legion of Merit with Bronze Oak Leaf  Cluster, the Bronze Star Medal, the Meritorious Service Medal with two  Bronze Oak Leaf Clusters, and the Parachutist Badge.\n\nOn behalf of the people of Colorado and the United States Congress,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Kentucky,  before joining the Marine Corps in 1988, rising to become the 19th  Sergeant Major of the Marine Corps, the highest-ranking enlisted  Marine.\n\nIn 2010, he earned a Bronze Star with Combat V after running through  dangerous territory to reach a fellow Marine who had been struck by an  IED.\n\nHe most recently served as the senior enlisted adviser…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694976/recognizing-sergeant-major-troy-black"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…liaison officer,  bringing aid and support to local villages.\n\nHe received several medals recognizing his courageous service over  four campaigns in Vietnam, including the Bronze Star, the Army Air  Medal, and the Army Valorous Unit Award. He is most proud, however, of  his Combat Infantry Badge, which he received for his bravery in ground  combat as…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…deployed overseas for the Vietnam war,  serving as an infantry rifle platoon commander and a regimental sniper  platoon commander, as well. His service earned him both a Bronze Star  and a Combat Action Ribbon, as well as the respect of the marines he  served with.\n\nOver his 30 years of service, General Lopez served in a number of  critical leadership…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…leadership positions,  including Deputy Commanding General for the 1st Marine Expeditionary  Force.\n\nHe earned numerous honors, including the Navy Distinguished Service  Medal and Bronze Star with a Combat V, marking a distinguished military  career.\n\nIn addition to his military achievements, Brigadier General Lopez  worked in aerospace and defense, served on…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697743/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…degree and completion of numerous prestigious  leadership courses. Her dedication to excellence is further highlighted  by her numerous awards and decorations, including the Bronze Star Medal  and the Meritorious Service Medal with three oak leaf clusters. She has  also been recognized with multiple Airman and Noncommissioned Officer  of the Year awards…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Cory Mills have  called into question the veracity of the account of events which formed  the basis of a recommendation that Representative Cory Mills receive an  award of a Bronze Star, bestowed in 2021, for his service under enemy  fire in Iraq in 2003;\n\nWhereas, in August 2024, Representative Mills provided the Daytona  Beach News with documents purporting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Sergeant Major Black ran  through uncleared territory to rescue a wounded Marine struck by an  IED. For this act of extraordinary courage under fire, he was awarded  the Bronze Star Medal with Combat ``V'', a testament to his unwavering  commitment to those he led.\n\nHis exceptional leadership culminated in his appointment as the 19th  Sergeant Major…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the soldiers of the Eighth Regiment assisted  in the liberation of the concentration camp at Dachau. He was awarded  two Purple Hearts for his service. He also received a Bronze Star and  the French Legion of Honor, as well as several other medals.\n\nAfter completing his military service, he started O.H. Mullen Sales  in the 1950s and owned and operated…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…States  Army and served with the Military Assistant Command, Vietnam (MACV) as  an advisor for the South Vietnamese Army. For his meritorious service,  he was awarded the Bronze Star, Air Medal, and Vietnam Cross of  Gallantry.\n\nCorbett was first elected to the Celina City Council in 1999. In  2002, he was elected to serve as the Mayor of Celina and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Officer Academy at Fort Lee, Virginia. While deployed  to Iraq as a Platoon Sergeant and First Sergeant with the 65th Engineer  Battalion, Master Sergeant King earned the Bronze Star for his  leadership and valor. He personally planned and led 72 combat logistics  patrol missions throughout Iraq in support of Operation Iraqi Freedom,  accomplishing each…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…distinguished career, Ms. Prehoda received a plethora  of awards and commendations, including, but not limited to, a Joint  Service Achievement Medal, a Navy Unit Commendation with a bronze star,  a Meritorious Unit Commendation, a Global War on Terrorism Service  Medal, and a Presidential Unit Citation for OIF combat support. Upon  retiring, Ms. Prehoda continues…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…later returned to the 101st Airborne to serve as its Chief of  Operations and executive officer for battalion operations. For his  outstanding service, Rob has earned two Bronze Star Medals, three  Meritorious Service Medals, the Army Commendation Medal with Valor, the  Army Achievement Medal, the Air Assault Badge, and the Combat Action  Badge. While…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "John Carter", "party": "Republican", "sentence": "…years. During his career, he courageously served our nation  in both Iraq and Afghanistan. His exemplary service earned him numerous  awards and accolades, including the Bronze Star, Legion of Merit,  Defense Meritorious Service Medal and Army Commendation Medal, among  many others. He is a graduate of the U.S. Army War College, Ranger  School, Airborne…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…forward to seeing further successes in  his future.\n\nGarrett has many accomplishments in his time of service, including  being awarded the Purple Heart Medal, Legion of Merit, Bronze Star  Medal and many more. But it's clear his most beautiful life  accomplishments have been marrying his wife, Lorna, and becoming a dad  to Tucker.\n\nI hope Garrett celebrates…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696037/congratulating-garrett-illerbrunns-career-in-the-us-armys-82nd-airborne-division"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…was voted the most musical in his senior year.\n\nFollowing graduation, Tony enlisted in the United States Navy and  proudly served during the Korean war. He was awarded the Bronze Star  after more than 30 years of service. Returning home, Tony worked at  Bear Mountain, Lederle Laboratories, and New York Telephone/Verizon,  retiring after 30 years of professional…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…fought in the Battle of the Bulge as part of  Company B, 18th Infantry Regiment, 1st Infantry Division. It was during  that battle that Jim earned three Battle Stars and a Bronze Star.  Although injured by shrapnel during battle, Jim never received  treatment, thus never receiving the Purple Heart.\n\nFollowing Jim's combat service, he served as a guard…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Infantry Division, and  volunteered at a Catholic leper colony outside of Saigon. His bravery  and patriotism in Vietnam earned him numerous commendations, including  the Bronze Star Medal with a ``V'' for Valor.\n\nUpon returning to Texas, Dr. Gosney continued his dedication to  service. He opened his own veterinary practice in Temple, Texas in 1970…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689327/saluting-the-service-of-dr-gary-l-gosney"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…career, he distinguished himself  through professionalism, courage, and selfless service. His commendable  service was recognized with numerous decorations, including the Bronze  Star Medal, the Army Commendation Medal, the Army Achievement Medal,  the National Defense Service Medal, the Combat Medic Badge, the  Parachutist Badge, the Driver and Mechanic…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Cory Mills have called into question the veracity of the account of  events which formed the basis of a recommendation that Representative  Cory Mills receive an award of a Bronze Star, bestowed in 2021 or  afterwards, for his service under enemy fire in Iraq in 2003;\n\nWhereas in August 2024, Representative Cory Mills provided The  Daytona Beach News with…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…distinction, embodying the highest standards of  military excellence. His bravery and leadership in combat were  recognized through numerous awards, including the Purple Heart, the  Bronze Star Medal, the Army Achievement Medal, the Army Good Conduct  Medal, the Southwest Asia Service Medal, the National Defense Service  Medal, and the Army Service Ribbon.\n\nThe…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…Guard Bureau.\n\nNearing 30 years of distinguished service, Sergeant Major Watts  served with valor in Operation Iraqi Freedom and Operation Enduring  Freedom, earning the Bronze Star Medal and Combat Action Badge. A  graduate of the United States Army Sergeants Major Academy with  advanced degrees, he exemplifies unwavering commitment to excellence.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693703/recognizing-sergeant-major-harold-m-watts-iii-service-to-the-national-guard-bureau"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Market Garden and the Battle of the Bulge, and led  under fire in some of the most consequential battles of World War II.  For his courage and sacrifice, he was awarded a Bronze Star and a  Purple Heart.\n\nAfter the war, Colonel Shames continued serving our Nation,  eventually retiring as a colonel, and later made Virginia Beach his  home, where he became…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699640/colonel-edward-shames-post-office-building"}]