[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…mockery of itself  for the whole world to see by voting to abstain from a resolution in  the United States on a peaceful and just end to this war. Can you  believe it? Putin brutally invades Ukraine, the whole world sees it and  knows it, and Donald Trump, out of obeisance, sucking up to Putin,  abstains from a resolution simply on a peaceful and just…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…tomorrow, the day after tomorrow, or next week. Not much surprises me  anymore.\n\nMr. Speaker, I have watched my majority friends completely abandon  their policy positions, brutally anti-immigration because of this  President, obliterating free trade, completely leaving behind  everything that the Republican Party used to stand for, praising  Vladimir…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699372/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…desegregate the city, and a young woman named  Marion King, participating in those efforts, carrying in her arms her  3-year-old daughter and 5 months pregnant at the time, was brutally  beaten for demanding the desegregation of Albany, GA. That was July of  1962.\n\nJust this week, the Atlanta Journal-Constitution announced that the  Cold Case Records Review…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698140/civil-rights-cold-case-records-collection-reauthorization-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Congressional Endangered  Species Caucus, I rise today in opposition to this amendment.\n\nI can't believe that we are here again considering this unpopular  amendment. It was brutally defeated last year, and it was crushed the  year before, both times with bipartisan support.\n\nThe Endangered Species Act has wide popularity, but our current  biodiversity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695233/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enforcement, and then  they want to rewrite the truth about what happened on January 6? How  can we trust Republicans, who want to ignore the fact that Trump  pardoned people who brutally assaulted law enforcement officers? How  can they be trusted?\n\nHow can anyone trust Republicans, when they negotiated spending  bills, bills which have become law only to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…about Steven Tendo from Vermont, an asylum seeker and a pastor.  He was arrested and detained outside the medical center in Shelburne  where he works, and he said it was done brutally and it was done at  gunpoint. This is not a threatening man. He is currently now being  denied medication for his diabetes.\n\nICE is in such a rush to meet its quotas set by…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…limit prosecutors' ability to hold  some of the worst child predators to account legally. The question may  appear to be technical, but the human consequences are grave and  brutally simple.\n\nTitle 18 of the United States Code, section 2251(a), criminalizes the  production of child sex abuse material. For decades, prosecutors have  used the law to target…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…military force on a foreign  nation without Congressional approval--Article I, Section 8--is a clear  violation of the most important legal document of our country.\n\nHistory brutally taught our country what asymmetrical warfare is  after enduring 9/11 here at home.\n\nCongress must reassert our constitutional authority before the  American people are dragged…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692692/congress-must-reassert-our-constitutional-authority"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…possible.\n\nIt is unacceptable that a U.S. Senator, in his own home State,  elected by millions of people, went to ask a question for his  constituents, to get an answer, and was brutally thrown to the ground  and handcuffed. That is wrong, and I cannot believe that we don't have  Senators on both sides of the aisle calling this out as outrageous.\n\nThis is…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…democracy.\n\nTrump pardoned, glorified them, even empowering some of them in key  administration offices. We cannot allow him to rewrite history.\n\nDo not forget. Police were brutally attacked, injured, and killed for  doing their job to enable a peaceful democratic transition of power.  They still bear the scars. So does our democracy.\n\nDo not forget democracy…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…State of Arizona, we are mourning the death of 14-year-old  Emily Pike, a member of the San Carlos Apache Tribe. Emily disappeared  from Mesa earlier this year and was  found brutally murdered 2 weeks later off of U.S. Highway 60.\n\nMonths later, her case remains unsolved. Emily Pike, like Hanna  Harris 30 years ago and hundreds and hundreds of native women…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690670/expression-of-outrage-on-national-day-of-awareness-for-missing-and-murdered-indigenous-women-and-girls"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…appreciate his willingness to work in a bipartisan fashion to  fix our government's permitting process. It is a process that, as we  know, can be bogged down, burdensome, and brutally bureaucratic,  leading to unnecessary delays that make it very difficult to increase  affordable housing, improve our infrastructure, and advance important  energy and transmission…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697712/studying-nepas-impact-on-projects-act"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…administration  handed them.\n\nAlthough they are not facing any imminent threat, nor any  persecution, according to this administration, these farmers were  victims who were being brutally killed as a part of a genocide. These  claims are absolutely false.\n\nWe must ask ourselves: Why wasn't any grace extended to those fleeing  the Democratic Republic of the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691340/make-refugee-policy-same-for-all"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…the Capitol Police, Metropolitan Police Department, and  numerous other departments risked their lives to protect us and our  democracy.\n\nAs seen here, these officers were brutally assaulted with flag poles,  bear spray, stun guns, knives, and bats. Over 140 officers were wounded  and sustained injuries from the attack. Many still deal with the mental…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…the voices of rural America aren't just heard  but are truly prioritized within our government.\n\nRunning a small business is really an act of faith. It is hard work,  often brutally hard work, and it is extraordinarily important work  because rural small businesses are the beating hearts of communities  across America, and in every corner of my home State…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697281/office-of-rural-affairs-enhancement-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…under dangerous and unpredictable  circumstances.\n\nA recent incident in my district highlights what that commitment  looks like. Last month, in Bartow, Florida, a man who had brutally  assaulted and held his own parents hostage later opened fire on  responding officers during an intense confrontation at a local shopping  center. Despite the danger, members…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…as the Jocelyn Nungaray National Wildlife Refuge to forever  commemorate the life of 12-year-old Jocelyn Nungaray, who was  tragically killed on June 17, 2024.\n\nJocelyn was brutally murdered in Houston, Texas, last summer. Two  illegal Venezuelan aliens, both reported members of Tren de Aragua, the  gang notoriously known around the country, have been…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693448/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…these doors, each plays an  important role. Unfortunately, not everybody respects all of our law  enforcement officers.\n\nIn this very building, January 6 insurrectionists brutally attacked  the Capitol Police and law enforcement officers from multiple  jurisdictions. More than 140 police suffered injuries and went to the  hospital. Five officers died.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…when he invaded the German-speaking  regions of neighboring countries in Europe, including Poland. That is  who Vladimir Putin is.\n\nRegrettably, the people of Russia are led brutally by Putin, this  world-historical villain.\n\nUkrainians will continue fighting against his unprovoked attacks but  not because they hate peace. The Ukrainians will continue…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…beatings, solitary confinement, and very bad living  conditions. This is what they did when they took over. They came after  us, held our people hostage, and treated us very brutally.\n\nIn 1984, the United States made Iran a state sponsor of terrorism  under U.S. law because of the way the Iranian regime, under the  Ayatollah, was conducting himself. They…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…hiking trail in Maryland  in 2023.\n\nIf this was about justice, their hearts would have broken for the  family of Laken Riley, a 22-year-old nursing student in Georgia who was  brutally murdered while out for a jog nearly 2 years ago this day,  beaten and strangled to death by a Venezuelan illegal because she  fought back when he tried to rape her.\n\nThe two…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…didn't cut a single service. You didn't take  anything away from someone, but what you gave is my kids a chance to  survive.\n\nLook, part of this I don't like. I am going to be brutally honest. I  wish there were more cuts. I don't like the amount of borrowing here,  but if this is the moment that opens up a chance for someone like  myself, who has spent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…up saying they want more spending, more money, more  regulation on their competition understand this. Let's go through some  of the basic math facts, and then let's have a brutally honest  conversation of how we stabilize and how far we can actually go.\n\nAll right. An oldie but a goodie, and the numbers are actually worse,  but I didn't want to print…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Republicans and Democrats agree that we need durable,  long-lasting, and long-term pressure on Iran.\n\nOn October 7, the world witnessed the horror of Iran-backed terrorism  as Hamas brutally murdered over 1,200 innocent people in Israel.\n\nIran has been sponsoring Hamas for years. They were sponsoring  terrorists on the battlefield that I and many of our colleagues…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…First, the unthinkable happened 2 weeks ago here in the streets of  the Nation's Capital when two staffers from the Israeli Embassy, Yaron  Lischinsky and Sarah Milgrim, were brutally murdered. Sarah was one of  our own: a Kansan, a native of Overland Park, and a proud graduate of  the University of Kansas who cared deeply about the shared human  dignity…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…under 17, multiple  DUIs, child fondling, and illegally reentering the United States  previously. When ICE conducted an enforcement operation in November to  arrest him, he brutally beat an ICE officer with a metal coffee cup. He  caused a severe laceration of the officer's mouth and burns to the  officer's face.\n\nWhere are my Democratic colleagues' concern…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…talking to me the way  you did and handling me the way you did and making me realize that my  path to a better life began through jail.\n\nThe fact that this horrible man should brutally stab this innocent  woman, that is part of the national narrative right now. The fact that  we are dealing with that horror brings us to hold accountable every  judge that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of walk  through how I make it work. Okay?\n\nI have come here and done a presentation showing that if this is our  demographics, we are going to have to be willing to have a brutally  honest conversation.\n\nLet me walk through a concept. Back in the 1970s and 1980s, what was  the world conflict? It was for hydrocarbons, oil. The previous decade,  much of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…a well-run, Western,  honest country like Israel, Greta Thunberg got more joy out of engaging  in protests or whatever these people do to try to help the Hamas group  that brutally killed a thousand people.\n\nOur country has to identify Thunberg syndrome and see what we can do  to prevent it from taking over our country. Because just as Greta  Thunberg…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…``Jocelyn Nungaray National       Wildlife Refuge Act''.       SEC. 2. FINDINGS.\n\nCongress finds the following:\n\n(1) On June 17, 2024, 12-year-old Jocelyn Nungaray was       brutally murdered in Houston, Texas.\n\n(2) Two illegal aliens who were allegedly members of the       Tren de Aragua gang have been charged with her murder.\n\n(3) On March 4, 2025, President…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}]