[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Pennsylvania State University Police and Public Safety       Department\n\nUpper Gwynedd Township Police Department\n\nScranton Police Department\n\nWaynesboro Police Department\n\nBucks County Sheriff's Office                                 RHODE ISLAND\n\nSouth Kingstown Police Department\n\nTriverton Police Department\n\nHopkinton Police Department…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…I rise today to recognize the valuable  contributions of Americans for Native Americans (ANA), a dedicated  organization primarily supported by benefactors from Central Bucks  County, which lies within my district in Pennsylvania.\n\nANA is dedicated to improving the lives of Native Americans in the  Hopi, Navajo, and Zuni Nations in the American Southwest.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694745/recognizing-bucks-county-americans-for-native-americans"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…proprietor of Bucks  Country Gardens in Doylestown, Pennsylvania--a business that has, for  more than six decades, helped beautify homes and enrich communities  throughout Bucks County and beyond.\n\nFounded in 1961 as Royer Nurseries, the family run business has  become a cornerstone of the local community, known for its commitment  to excellence, creativity,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…courageous battle against stage IV pancreatic  cancer, Diane continues to give of herself--to her family, her  neighbors, her country, and, above all, to the veterans of Bucks County  and Southeast Pennsylvania. She is not simply enduring--she is  inspiring.\n\nDiane was born in Philadelphia but found her true home in Levittown,  where she has lived for…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…unique identity while  addressing the everyday needs of its residents and visitors alike.\n\nUnder his leadership, New Hope continued to strengthen its position  as one of Bucks County's most recognizable destinations, balancing  tourism with quality of life for those who call the borough home. Mayor  Keller's service exemplified integrity, approachability,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…FITZPATRICK. Mr. Speaker, I rise today with deep pride and  gratitude to recognize a truly remarkable individual from my district-- Chief Glenn Forsyth of Newtown Township in Bucks County, Pennsylvania.\n\nThis year, Chief Forsyth is celebrating an incredible milestone--50  years of continuous service with the Newtown Fire Association.\n\nLet me repeat that:…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691839/recognizing-chief-glenn-forsyths-50-years-of-service-with-the-newtown-fire-association"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor and commend Mayor  Joe Taylor of Langhorne Borough, Bucks County, Pennsylvania, a devoted  public servant whose life's work reflects unwavering commitment,  integrity, and the highest ideals of civic leadership.\n\nSince making Langhorne…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Speaker, I rise today to recognize and commend  Mr. Paul Calderaio for his extraordinary dedication to public service  and his lasting contributions to Buckingham Township in Bucks County,  Pennsylvania.\n\nPaul's commitment to service began early in his life while living in  Florida. That dedication only deepened after he and his family made  Buckingham Township…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698361/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and celebrate  the 100th anniversary of Solebury School, located in beautiful New  Hope, Pennsylvania. Solebury School has been a cornerstone of  independent education in Bucks County, known for its close-knit  community, academic excellence, and commitment to fostering  intellectual curiosity and character in young people.\n\nSolebury School was founded…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and outreach. By offering a welcoming place for  worship to the residents of Feasterville, Langhorne, Oakford, and  Trevose, the parish has been a steadfast presence in Bucks County for  three-quarters of a century.\n\nCelebrating 75 years as a parish also means celebrating 75 years as  their self-titled Family of Faith. Through grounding their lives…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor a remarkable  leader, dedicated family man, and proud son of Bucks County--Mr.  Michael J. Mabin, Jr., President and CEO of PennFab, Inc.,  headquartered in Morrisville and Martelli Companies, headquartered in  Ivyland.\n\nMike Mabin is more than…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Moffett of the  Buckingham Township Police Department. Today, I proudly commend him on  his well-earned retirement, following decades of committed service to  the people of Bucks County.\n\nLieutenant Moffett's distinguished career in public service began in  1981, when he served as an EMT with the Bucks County Rescue Squad and  Bensalem Rescue Squad. Two…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an incredible  individual from my district. Brian Kern of Bucks County, Pennsylvania  has served the Neshaminy School District for the past 32 years. On July  1, Principal Kern retired from his career in public education, closing  a chapter…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Citizenship, Jenya fulfilled  her dream through opening her very own small business. Today, Beauty  Mood's popularity and success makes a difference in the lives of many  Bucks County individuals--an area I proudly serve and represent.\n\nUltimately, Jenya Rahazhynskaya's story serves as a shining example  of how dedication and ambition lead to success.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…today to recognize an  outstanding constituent from my district, Mrs. Susan Harkins. It is my  distinct honor to celebrate her remarkable 45 years of service with the  Lower Bucks County Chamber of Commerce.\n\nSince joining the Chamber in 1980, Susan has been instrumental in  supporting business and leadership development in Lower Bucks County.  She began…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Mr. Speaker, I rise today with deep admiration and  appreciation to recognize a truly outstanding individual from my  district--Volunteer Firefighter Mr. Larry Newman from Bucks County,  Pennsylvania.\n\nThis year, Mr. Larry Newman is celebrating 40 remarkable years of  continuous service with the Yardley-Makefield Fire Company.\n\nLarry's story began long…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}]