[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…had five townhall meetings  across northwest Oregon in urban, suburban, and rural areas. Not one  person, not one of the thousands who attended, asked me to support a  budget that cuts Medicaid, gives tax breaks to the wealthiest, raises  the cost of living, or undermines safety and security, but that is what  we are voting on today.\n\nThe Republicans…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688036/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…rip-off cuts at least $880 billion from Medicaid, the  program that 80 million Americans, including 9 million veterans, rely  on for health insurance coverage.\n\nThis extreme budget also cuts $230 billion from SNAP. Every year,  SNAP helps almost 43 million Americans, including over 1 million  veterans, put food on the table.\n\nRepublicans aren't just going…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…percent of the cost.\n\nIn Virginia alone, that is going to be $450 million. That in and of  itself may not sound like a lot, but Virginia is also facing a hole  blown in its budget through cuts to Medicaid.\n\nVirginia now is being forced to implement work requirements it  decided not to implement because when it looked at the other States  that did, the administrative…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…know that answer based on how  many cosponsors we get for my legislation that simply codifies Donald  Trump's executive order.                    Opposing Medicaid and NIH Budget Cuts\n\nMr. KHANNA. Mr. Speaker, I rise today to oppose the cruel budget cuts  on Medicaid and NIH. I don't want to sensationalize. I just want to  give some of the facts.\n\nThe…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…them discretion that I don't think they should have. I have to say I am  concerned about the way he has used that discretion in some of these  processes.\n\nThey have made budget cuts, for example, to VOCA. That stands for the  Victims of Crime Act. They are cutting grants to help people who are  victims of crime.\n\nWhy would he take a step like that?…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…this out-of- control administration.\n\nTruly, the difference between the bills we have in front of us and  President Trump's absurd budget request or  the House Republican budget that cuts like there is no tomorrow or  another yearlong CR that enables all kinds of misuse and corruption by  Trump is night and day. Because Democrats were at the table, there…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…I know I have heard of her countless accusations of  Department of Education overreach or that the Department is just too  big. Now, if we are saying this because of the budget cuts Republicans  are starving for to underwrite the tax rate for the wealthy, let me  remind us all that the Department of Education is the smallest Agency  in the Cabinet by…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…million monthly users, including my kids. More  broadly, PBS and NPR tell the American story through arts, culture, and  history programs.\n\nLet's be clear: This is not about budget cuts or making government  efficient. This is a gutting of an institution that many people,  especially those living in rural areas, rely on for information and  trusted programming.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Donald Trump and Republicans in this House are launching a full scale  assault on our Nation's ability to think, learn, and to innovate.\n\nLet's look at the facts. Trump's budget cuts funding for the National  Science Foundation, National Institutes of Health, STEM education, and  even basic K-12 public schools. He has tried to crush public service  loan…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…not being able to  replace data, and endangering the ultimate viability of potentially  lifesaving treatments.''\n\nThere are lives that might not be saved because of these budget cuts.  So it is time that Congress gets involved, that we fight for the  science that we believe will save lives, move our country forward and  grow our GDP, and help our farmers…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…farmers tens of billions of dollars in lost exports. Markets are  shrinking. Input costs are soaring, making it hard for farms to stay in  business.\n\nWe see the sweeping budget cuts and mass layoffs at critical agencies  like NOAA and the Bureau of Reclamation, threatening the services that  farmers depend on: water deliveries, weather forecasting,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…more than $500  million, which will put at least 32 million households at risk of  eviction and homelessness.\n\nJust this week, Trump released a heartless fiscal year 2026 budget  that cuts 26 billion from rental assistance programs, including public  housing, housing choice vouchers, project-based rental assistance, and  housing for seniors and people with…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…probably die.\n\nThese are the stakes. Every corner of my district, every corner of  the great Hoosier State, and every corner of our country will be  impacted by these very cruel budget cuts.\n\nUnder this budget, 14 million people will lose healthcare. Millions  will lose SNAP benefits. Those aren't just numbers. These are people  like Arica, Carol Ann, and Bethany.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691462/gop-tax-scam-hurts-women-and-families"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…According to this nonpartisan Center on Budget and Policy Priorities,  a nonpartisan policy and research institute, this is what they write:\n\nThe House Republican budget would require deep cuts to       Medicaid, and recent statements from House Energy and       Commerce Committee Chair Brett Guthrie suggest the Affordable       Care Act's . . . Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…munition production, creating stockpiles of  critical weapons that we know we need for the future, investing in  cutting-edge technologies--and would reject some of the Trump budget  cuts in aid to Ukraine, to Taiwan, and to our Baltic allies, who are  making positive progress in key areas.\n\nOur work together on this bill has generally been a positive  experience…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, I rise today to introduce a budget that  balances over 5 years. My budget, the Six Penny Plan, the Six Penny  Plan budget, cuts 6 percent of all spending to rebalance in just 5  years.\n\nI am able to introduce this budget because neither Republicans nor  Democrats introduced a budget this year. So…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hearing down the hallway the  Senate, they are talking about doing their reconciliation budget and  setting a floor, saying: We are not going to allow the Senate to pass  budget cuts of less than $3 billion. Huh?\n\nI am upset that ours is so anemic at like $1\\1/2\\ trillion, but if  they do $3 billion, it is functionally a half a day of borrowing. This…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…That is a 19-percent  increase. And we are also doubling our spending on the Strategic  Petroleum Reserve.\n\nSo to sum up, the Energy and Water bill vis-a-vis the current budget  cuts spending by 2.8 percent. We increased defense spending by 2.7  percent. We paid for that increase and accommodated the decrease in  overall spending by cutting nondefense,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…the American families who  sent us here to deliver on President Trump's agenda. I understand  Medicaid is not explicitly named in this bill, but achieving $880  billion in budget cuts within E&C's jurisdiction is not an easy task.\n\nI also ask that leadership remain committed to working with my  colleagues and me to produce a final product that strengthens…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688025/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]