[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…means that 4 million Americans could lose  their coverage entirely. And that is not an exaggeration because that  is based on the nonpartisan data from the Congressional Budget Office.\n\nNow, according to a report that a number of us commissioned from the  Georgetown Center on Health Insurance Reforms, eliminating these tax  credits will disproportionately…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…them beautiful. He says they protect American workers, but here is the  cold, hard truth: The American people are paying them.\n\nJust today, the nonpartisan Congressional Budget Office confirmed  what families already feel--American consumers are paying 95 percent of  these tariffs. They pay at the grocery store. They pay in higher energy  bills. They…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699977/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to oppose the big, bad  billionaire bill, especially the cuts to Medicaid.\n\nAccording to the Congressional Budget Office, this bill will result  in more than 13 million people across the country losing health  insurance coverage, and people with disabilities will be the hardest  hit.\n\nMedicaid…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…agreement:  no cuts to Medicare.\n\nWell, that didn't last long. The cuts to Medicare just had to be well  hidden, and that is what this bill does.\n\nWe have asked the Congressional Budget Office what it means. How big  will the cuts be? When will they take place?\n\nWell, here is the outcome: Given the magnitude of this massive  increase, it will create a $45 billion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…when you  connect them to a medical home, are healthier. That is why I am so  concerned about the big, ugly bill that we passed 2 weeks ago.  According to the Congressional Budget Office, it will strip 16 million  Americans of health insurance and make the issue of disparities in  men's health worse.\n\nI will pick on one piece of that bill that hasn't gotten…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Americans. Again, those premiums are going to  be cut. As a result, people are going to lose their health insurance.  That is not me saying that. That is the Congressional Budget Office,  the neutral umpire that calls balls and strikes around this Congress  who is saying that.\n\nAgain, they have calculated that 15 million Americans will lose their  health…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…big, ugly  GOP tax scam is set to add $3 trillion to the deficit, $3 trillion. To  be clear, that isn't me saying that. That is the independent,  nonpartisan Congressional Budget Office, CBO.\n\nIt isn't just CBO. Every other reputable independent analysis of the  bill, including the Joint Committee on Taxation, Yale Budget Lab, and  Penn Wharton Budget…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…betrayal of the American people, this bill  is also a massive, new unfunded mandate on States. Don't just take my  word for it. The nonpartisan experts of the Congressional Budget Office  said title I of the bill, the Agriculture Committee's portion of this  awful bill, would impose intergovernmental mandates by requiring  States, for the first time ever,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…costs for  everybody goes up. It only makes sense. Uncompensated care gets cost  into the system that is passed on to the rest of us.\n\nEarlier this month, the Congressional Budget Office confirmed that  the House's reconciliation bill, if enacted, would cause 16 million  people to become uninsured--so that is the Congressional Budget  Office--so again,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…continue to fight for the policies.\n\nI am on the Energy and Commerce Committee that was told in a markup  on March 7 to find $880 billion worth of cuts. The Congressional Budget  Office it says can't do that unless there are cuts to Medicaid. I have  heard some of my colleagues say, well, we are not going to address  vulnerable populations, and they include…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…already underway, as we speak, but let's address the  erroneous reasons that it was vetoed.\n\nFirst, it does not appropriate or authorize any new spending. The  Congressional Budget Office verified that.\n\nThis bill in no way bestows special treatment, as it was alleged in  the veto message, because the site wasn't authorized when it was  inhabited.\n\nOn these…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…billion in       2026 [alone].\n\nThat is the end of the article. This is not a hyperbole or scare  tactic. These are real possibilities. Even the nonpartisan  Congressional Budget Office has said there is no way to meet the  Republican budget resolution dedicated cuts without cutting Medicaid or  Medicare.\n\n(Mr. MORENO assumed the Chair.)\n\nTonight and into…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and Exchange Commission.\n\nHe issued Executive Order 14255 which now requires all rules written  by the financial regulators to be reviewed and approved by the White  House budget office. This means this bill would hand over to the  President the ability to write the rules he wants to advance his crypto  operations.\n\nNot only that, under the Trump administration,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…month, House Republicans  passed the biggest cut to Medicaid in history as part of their scheme  to fund giant tax breaks for billionaires. As the nonpartisan  Congressional Budget Office just announced this morning, the GOP tax  scam now cuts 16 million people, up from 13.5 million people, from  their healthcare, all to give tax breaks to their billionaire…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, today, we got the news that the  Congressional Budget Office, the CBO, confirms Donald Trump's ``Big  Ugly Betrayal'' is going to kick at least 10 million Americans off  their health insurance and spike our national debt by another…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693882/budget"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Papenfuss, Deputy Director       of Budget Analysis.                                                 Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. Speaker, for all the reasons that I have identified, changes need  to be made in the credit investor rule. After 40 years, I think the  changes proposed by the gentleman…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…be clear: That is just not true.\n\nYou can't cut something from someone who was never or is no longer  eligible to receive it.\n\nAccording to the nonpartisan Congressional Budget Office, of the 7.8  million people Democrats say would lose coverage, 4.8 million are able- bodied adults with no kids who could work, but don't. Another 1.4  million are in the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692933/medicaid-should-serve-the-truly-needy"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…suppression fleet.\n\nThis lifesaving authority protects our aerial firefighters and brings  in revenue from military aircraft that are not needed. In fact, the  Congressional Budget Office anticipates this legislation will reduce  government spending.\n\nOur brave first responders work tirelessly on the front lines,  fighting wildfires that continue to get…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…single board that gets me the most hate mail.  It also is the truth. This is the 30-year projection. If my colleagues  look at the 30-year projection from the Congressional Budget Office--I  didn't produce this. They did, and we believe it is already way out of  date because of the change in interest rates--Social Security and  Medicare and their interest…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Papenfuss, Deputy Director       of Budget Analysis.                                                 Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. HILL of Arkansas. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. HILL of Arkansas. Mr. Speaker, I rise, as I said, in support of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Speaker, I thank Ms. De La Cruz for this important measure, and I  urge our colleagues to support it.\n\nMr. DAVIDSON. Mr. Speaker, I include in the Record the Congressional  Budget Office estimate for this bill.      H.R. 225, HUD TRANSPARENCY ACT OF 2025, AS REPORTED BY THE HOUSE             COMMITTEE ON FINANCIAL SERVICES ON JULY 15, 2025 ------------------------------------------------------------------------…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…a fee-for-service  basis and receives no direct appropriations--I want to make sure that  everybody understands that--my team, my staff, has talked to the  Congressional Budget Office to make sure that there is no score with  this. The news is, as I just mentioned, this bill does not score.\n\nI am confident--I sincerely hope, for the people of Miami Lakes…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…result in additional spending or loss of       revenue.                                                 Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. Speaker, the gentleman is an essential leader in our committee  and also the chairman of our Subcommittee on Digital Assets, Financial  Technology, and Artificial…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…under paragraph (1)       shall include the following:\n\n``(A) The operational details of the Office, including the       name of the Assistant Administrator, the budget of the       Office, and the number of full-time employees employed by or       detailed to the Office.\n\n``(B) A summary of the activities conducted under       subsection (c).\n\n``(C)…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…again, because everything  is about the money.\n\nThe last board and the one that always seems to upset people because  they don't want to know the truth, the Congressional Budget Office-- this one is a year out of date. The numbers are actually apparently  worse, but we haven't had the update yet. The Congressional Budget  Office estimates that over the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…2025. ---------------------------------------------------------------------------------------------------------------- Source: Congressional Budget Office; Joint Committee on Taxation\n\nMr. DAVIDSON. Mr. Speaker, I urge my colleagues to support this bill,  and I yield back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…CRA will unleash  Montana's coal industry and generate millions of dollars in revenue for  the Federal Government and the State of Montana.\n\nAccording to the Congressional Budget Office, this CRA will generate  $16 million in revenue for the Federal Government over the next decade.  This resolution also protects approximately $46 million in annual  revenue…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…urge my colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. JORDAN. Mr. Speaker, I include in the Record an estimate from the  Congressional Budget Office for this bill.      H.R. 988, A BILL TO AMEND TITLE 36, UNITED STATES CODE, TO MOVE THE PLACE OF INCORPORATION AND DOMICILE OF THE NATIONAL WOMAN'S RELIEF CORPS  TO ILLINOIS,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699502/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Speaker, I urge my colleagues to support the bill, and I reserve  the balance of my time.\n\nMr. JORDAN. Mr. Speaker, I include in the Record an estimate from the  Congressional Budget Office for this bill.\n\nH.R. 3497, MEDAL OF SACRIFICE ACT OF 2025, AS ORDERED REPORTED BY THE           HOUSE COMMITTEE ON THE JUDICIARY ON DECEMBER 18, 2025 ------------------------------------------------------------------------…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it for me--saying if  interest rates went up 1 percent on this policy baseline, and I am  tired of talking about it, in the 30-year window, you broke the  Congressional Budget Office's model. Let me say that again. We broke  the CBO's model. It went over 250 percent. The problem is their  computer only goes to 250 percent. It just hit it.\n\nWe are now…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}]