[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…to join me, my wife Vivian, and the more than  765,000 people of Georgia's 2nd Congressional District in honoring  Bishop Dr. Frederick Williams, Sr.--a pastor, a prophet, a builder, and  a beloved servant whose life of faith, intellect, and action made our  communities stronger and kinder. We mourn his passing, we celebrate his  harvest, and we pledge…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…to former Congressman Luis  Gutierrez.\n\nAn immigrant from Mexico and the son of a bracero, Chuy Garcia has  spent 45 years as an organizer, public servant, and a coalition builder  who never loses sight of the people he serves. He has been a steadfast  champion for dignity, equity, and justice across Chicago.\n\nHe stepped out of this race for one reason…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Ecumenical Patriarch has been  received with the highest honors by our Nation's leaders.\n\nFor more than three decades as Ecumenical Patriarch, His All-Holiness  has been a bridge-builder between peoples and nations. He has convened  leaders of the Abrahamic faiths in pursuit of peace and reconciliation.  He has boldly raised the conscience of the world to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…of Seattle's  oldest and largest African American churches for forty-three years as  pastor of Mount Zion Baptist Church. He was not only a spiritual guide,  but a community builder who tripled the size of his congregation during  his time as pastor at Mount Zion. McKinney was a founding member of  Seattle's First Human Rights Commission, which successfully…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…role moral guidance can play in promoting cooperation and  understanding.\n\nHis All-Holiness Ecumenical Patriarch Bartholomew of Constantinople,  has been called the Bridge Builder and the Patriarch of Peace by  Christians and non-Christians alike. I am proud to welcome a peacemaker  of his caliber to the Capitol.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697433/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-of-constantinople"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…children. His personal attention and  institutional leadership to address issues that transcend borders or  religious affiliation have led him being hailed as ``The Bridge  Builder'', ``The Patriarch of Peace'', and the ``Green Patriarch.''\n\nEcumenical Patriarch Bartholomew's words and deeds have been in  pursuit of justice, love, and reconciliation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…false, President Trump's comments deserve a score of minus 10. China is  not scamming Europe and the U.S. on wind power. It is, in fact, the  most aggressive domestic user and builder of wind power in the world.\n\nI raise this point, Mr. Speaker, not to play gotcha--although this is  a pretty embarrassing gotcha--but rather to remind the House that,  right…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, it is a profound honor to recognize His  All-Holiness Ecumenical Patriarch Bartholomew, known throughout the  world as the ``Bridge Builder'' and the ``Patriarch of Peace.'' As the  spiritual leader of over 250 million Orthodox Christians, he has  dedicated his life to the pursuit of reconciliation, understanding,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Christianity  worldwide.\n\nAt 85 years old, All-Holiness Ecumenical Patriarch Bartholomew  remains at the forefront of the global struggle for religious freedom.  Known as the ``Bridge Builder'' and the ``Patriarch of Peace,'' he has  worked tirelessly to foster dialogue, reconciliation, and cooperation  across nations and faith. He has stood firmly against racism,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…because the government should get out of the way and not stand  in the way of the American Dream.\n\nBack home in Missouri, I have seen exactly what these mandates do. A  Kansas builder showed that so-called green energy codes save homeowners  only about $125 a year but add more than $1,200 a year to families'  mortgages.\n\nIt is simple, folks. If a policy…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698635/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…supply  means lower costs, and more provision of capital into the real economy  from community financial institutions that know the borrower, that have  a relationship with that builder, the more supply of housing stock to  help lower the cost.\n\nInflation and high prices are always a function of a supply-demand  mismatch. If we can help incentivize more capital…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…determined by surface  hydraulic features--can mean that credits available at a nearby wetland  bank cannot be used if they are too far away.\n\nWithout available credits, a builder's second option is in-lieu fee  programs; however, not all States offer this option, or builders can  use a permittee-responsible mitigation. Still, most builders are not…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…been known as a  fiscal hawk throughout my time in public service, but she is pretty  comparable, giving me a run for my money on that banner.\n\nDebbie has also been a bridge builder and mentor. Even when factions  arise, Kansans continue to trust her leadership and count on her to  help bring people together. It is one of the reasons why she has made…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…our Nation's Capital is an occasion for pride  for my constituents and all Orthodox Christians who call America home.\n\nPatriarch Bartholomew is known worldwide as a bridge-builder, working  tirelessly to promote peace, dialogue, and respect among all different  faiths. He is also a champion for protecting our natural environment,  earning him the title…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…President and CEO of PennFab, Inc.,  headquartered in Morrisville and Martelli Companies, headquartered in  Ivyland.\n\nMike Mabin is more than a successful businessman--he is a builder of  community, a job  creator, and a champion for working families in Pennsylvania's First  Congressional District. Through his leadership, generosity, and vision,  Mike has…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Chiefs Association, and the National  Fire Protection Agency. For his exceptional work, he has earned two  Meritorious Service awards, the Career Achievement Medal, the City  Builder award, and the Agency Best Practices award from the Celina  Police Department and Fire Department. I would like to thank Mark for a  lifetime of public service and dedication…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "…and Muslim  leaders, strengthened Christian-Muslim relations, and championed  environmental issues worldwide. Because of this work, he is endearingly  known as the ``Bridge Builder and Patriarch of Peace.''\n\nHis All-Holiness's commitment to interfaith harmony, human rights,  and global peace exemplifies the highest levels of compassion and  unity. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695394/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…in Texas.\n\nFor his outstanding contributions and service, Sean has earned  numerous accolades, including the Outstanding Leader Award from the  City of Celina, the Community Builder Award, and the Celina Varsity  Cheer Parent of the Year Award. He has also been recognized by the  Celina Fire Department and received a proclamation from the Collin  County…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…lives but he plays an  instrumental role in mentoring student teachers and collaborating with  his colleagues.\n\nMr. Albano is known by others for being a Union Hill legend, a  builder of traditions, and a cultivator of character. He is treasured  by his school and community for his reliability, kindness, positivity,  and generosity.\n\nI am confident the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…complex to  navigate. However, Amy's ability to cut through the red tape made her  an invaluable resource and help to many throughout the state.\n\nAmy was also a great team builder. She created the Simpson Staff  Spotlight. It is a fun survey that highlights a staff member or intern,  so we all get to know each other better--something everyone on the…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}]