[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…pillar of faith, service, and fellowship in the Hampton  community.\n\nIn the early 1950s, Reverend Beverly W. Fox, then pastor of Phoebus  Assembly of God, led efforts to build a new house of worship. With the  support of the community, a modest sanctuary was completed and  dedicated as Bethel Assembly of God. In the summer of 1955, Reverend  Fox and…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to introduce legislation to build  a new national cemetery in Hawaii. I am joined by my Hawaii colleagues,  Congresswoman Jill Tokuda, and Senator Mazie Hirono, who is introducing  the companion bill in the Senate.…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…Congress has  authorized and appropriated, with bipartisan support, for critical  services. He is withholding it. President Trump froze funding that  helped Michigan communities build new radio towers, prepare for natural  disasters, and construct safe and modern infrastructure.\n\nAnd when the President breaks the law to give a windfall to some  States and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…and the  small manufacturers who can't afford to go to Mar-a-Lago to ask for  special deals. They are the builders who are paying thousands of  dollars more for materials to build new homes, and they are everyday  people who are stuck with higher costs, working themselves to the bone  and who can't keep up with their bills.\n\nIn Donald Trump's America,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699968/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…becoming  prohibitively expensive. While we know that permitting reform will help  lower costs, the Trump administration is dismantling the permitting  process that we use to build new energy projects and get cheaper  electrons on the grid.\n\nPut simply, costs are high. We need reform, and the President is  blocking our ability to do just that. It is no…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…National Doral in April--April--of this year. The Trump  Organization has signed $5.5 billion in real estate deals with a Qatari  Government-owned firm, and it is going to build a new development on  government-owned land in Serbia and Oman. The Trump Organization has  already received $5 million from Oman. These are violations of the  emoluments clause…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…didn't survive the hardships of our birth to, only 250  years  later, allow the way of the despot and the way of the mob to become the  way of the future. Surely we did not build a new nation conceived in  liberty only for its Capitol to one day be stormed by a mob at the  behest of a President because he refused to acknowledge the basic right  of every…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…can to stop clean energy that will help lower costs for  the American taxpayer.\n\nThey are rolling back programs that help build low-cost power. They  are making it harder to build new wind, solar, and transmission  projects. Projects that were already planned, financed, and under  construction to deliver cheaper electricity are now stalled or  scrapped.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…suffer while billionaires rake in the dough with  great healthcare. You never have to worry about the billionaires and  their healthcare. They are, in fact, giving money to build new wings on  hospitals--they have so much money--to make sure they and their  families get the care they need at that hospital.\n\nBut it is going to be unaffordable for the families…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Ciscomani) in introducing this bipartisan  legislation.\n\nFor too many veterans, the transition from military service to  civilian life comes with uncertainty about how to build a new career  and support their families. By expanding in-person and hybrid training  options for skilled trade programs, we are bridging skills gaps across  the country, empowering…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…transmission  channel for climate risk into markets through premium increases,  tighter terms, higher deductibles, nonrenewals, and I would add  mandates like homeowners having to build a new roof on their home to  get insurance coverage.\n\nIt matters what insurance companies think about this because those  insurance companies have both a fiduciary duty and a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…as they celebrate their  historic 50-year milestone of promoting equal rights for women and  girls. It is my privilege to recognize the powerful impact made by NOW- NJ to build a New Jersey where everyone, regardless of race, gender  identity, or background has the freedom and opportunity to thrive.\n\nSince 1975, this multi-issue, multi-strategy organization…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697164/recognizing-the-50th-anniversary-of-the-national-organization-for-women-of-new-jersey"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…construction materials, appliances, and furniture have  skyrocketed, gone through the roof. When you raise the cost of lumber,  steel, and other materials builders rely on to build new homes, you  slow down construction. And when supply can't keep up with demand,  prices go up. That is not just ideology; that is simple economics.\n\nSimilarly, Trump's self-imposed…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…allows for the removal of fuels that  promote unnaturally intense wildfire. This helps to create a healthier  forest and reduce wildfire risk.\n\nThe bottom line is that when we build new roads in protected areas,  we risk more fires, not fewer.\n\nIn States like Idaho and Utah, more than 35 percent of roadless lands  have had work done to help reduce fire in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…for every single student  in our State.\n\nI, for one, as a public school kid, was deeply proud to carry the  Federal enabling legislation. It is why I fought for funding to build  new schools at To'hajiilee, Sandia Pueblo, and Mescalero Apache. It is  why I am carrying legislation to increase teacher pay, to protect BIE  in Tribal schools, to create a…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698935/protecting-education-for-children-with-disabilities"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…years, these extra fees paid for by California  taxpayers, which are in addition to the State budget itself going up  over 50 percent during that time period, were used to build out this  new 911 system. The State spent $450 million building out this 911  system.\n\nJust last week, it was announced that after spending all of this  money, the State is scrapping…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…limit some of the Federal spending and limit some of these  programs that raised costs.\n\nI gave this statement earlier on how existing home prices go up when  it costs more to build new houses. The same thing is true when my  colleagues suddenly throw billions of dollars at having subsidies on  only electric appliances. If they really want to help people…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…reach a wider  base of early-stage companies.\n\nH.R. 4429 ensures our policies are helping capital move efficiently  and effectively, empowering those taking risks to build something new,  and helping good ideas grow into great companies.\n\nI thank Chairman Hill for his support, and also I thank Congressman  Casten for joining me and co-leading this commonsense…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…though we produce electricity cleaner with our fossil  fuels than any other country in the world.\n\nGuess what we can do, Mr. Speaker. If we can continue to move forward  and build new plants and show how this new technology can be used, we  can then be the ones who are exporting it to sub-Saharan Africa and  India instead of having the Chinese exporting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…encourage businesses to make more manufacturing jobs?\n\nOr should we encourage local governments to raise taxes?\n\nFinally, in the future as we determine how we are going to build new  apartments, should we encourage the builders of the apartments to go  through the government accepting lavish tax credits?\n\nOr should we do it the way we always have in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Chairman, as the designee of Chairman Cole, I move to  strike the last word.\n\nMr. SHREVE. Mr. Chair, my amendment provides $55 million to build a  new aviation maintenance hangar and operations building and renovate  the existing hangar space at our Shelbyville, Indiana, Army Aviation  Support Facility.\n\nMr. Chair, 900…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692960/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Republicans are going to go out and tell the  morality of people's taxes not going up next year. What we did in the  reconciliation budget: incentives to invest in America, to build new  plants of equipment, for working people to have some things to actually  draw them back into the labor force, no tax on tips, no tax on  overtime, some of these things.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…which passed the House with  overwhelming bipartisan support.\n\nHousing affordability is a supply problem, and for too long, Federal  policy has made it slow and expensive to build new homes.\n\nPresident Trump and Secretary Scott Turner advanced housing reforms  that  cut blue tape, expanded supply, lowered the price of lumber, and  brought mortgage rates…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699948/housing-for-the-21st-century"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…notification, expands access to healthcare, prevents the elimination of  uniformed  doctors, increases access to specialty care, and authorizes over $335  million to renovate and build new medical centers, hospitals, and  clinics.\n\nMore importantly, this bill puts the final nail in the coffin of the  Biden DOD's woke bureaucracy. The FY 2026 NDAA includes essential…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697792/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…ourselves in a stronger position.\n\nRight now there is a provision in the tax code called low-income  housing tax credits, and what it means is that if a developer wants to  build a new development, they would get a credit equal to 10 percent of  the cost of the building over 9 years, which, right off the bat, sounds  like the government is paying for 90…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Cumberland. After a decade of strategic planning and  investments, the U.S. Army Corps of Engineers awarded a lease site for  Tony Sloan and his business partner, Tom Allen, to build a new  commercial marina on Lake Cumberland, the first in over 60 years. When  Marina at Rowena opened in 2017, Tony revived the storied life of  Rowena, a once-bustling community…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…housing projects, cutting red tape and making  rural housing easier to build.\n\nIf we are to help more Americans achieve the dream of homeownership,  we must make it easier to build new homes. That means getting  government out of the way and allowing developers to build faster and  at a lower cost.\n\nI look forward to continuing my work to make homes affordable…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697479/making-homes-affordable"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Mr. TAYLOR.  3426, as amended.\n\nMr. Speaker, H.R. 3426, the CASE Act, limits the size of courthouses,  by directing the General Services Administration, or GSA, to only build  new courthouses that accommodate courtroom sharing.\n\nSpecifically, the CASE Act codifies the judiciary's current courtroom  sharing policies for magistrate, senior, and bankruptcy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…offering hands-on  help, inkind donations, and support wherever it's needed. In 2024, Joan  made a generous gift to the Raising Hope for Hospice capital campaign  to help build a new in-patient unit in New Port Richey. The soon-to- open Gulfside Center for Hospice Care will provide 24-hour support for  patients in their final days, meeting a critical…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}]