[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…government shutdowns.\n\nUnder federal law, NCPC has approval authority for the development of  D.C.-owned buildings located in the ``central area,'' including the  location, height, bulk, number of stories and size of such buildings.  D.C. is required to consult with NCPC on the development of D.C.-owned  buildings outside the central area, but NCPC has only…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696109/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-national-capital-planning-commission-and-the-commission-of-fine-arts-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-the-commissions"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…facilities within walking distance to the grocery store.\n\nThe grocery store bought enough fresh food, produce and meat, that  made it sustainable for the market to buy fresh food in bulk and know  it would be sold. That is 10 percent of their revenue.\n\nTheir worry is that when people lose their SNAP benefits, they can't  count on that bulk anymore. It will be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…trillion dollars' worth of tax cuts for the wealthiest  1 percent of Americans.\n\nThere will be table scraps in the Republican bill for middle-class  consumers and families, but the bulk of the tax cuts are going to the  very, very wealthy--millionaires and billionaires; frankly, people who  have done tremendously well in this country over the past several…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Nutrition Programs derives primarily       from two sources--annual appropriations and funds transferred       from the Section 32 account, the latter of which constitutes       the bulk of Child Nutrition Programs funding. See 7 U.S.C.       612c-6(b)(1).\n\n12. Section 32 refers to a mandatory appropriation (7       U.S.C. 612c) that receives 30 percent of customs…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…already said he  would come back and pass. We are so close.\n\nI realize there may be hard partisans. I know there are liberal  unions that have now come out against us. But the bulk of the public  sector unions are for it. They prefer my bill over anything else. They  may also support it because this is permanent. This ends using the  Federal workforce…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…why the Electric Supply Chain Act is on this floor this day.\n\nThe bill directs the Department of Energy to regularly assess the  supply chains for the components that keep our bulk power system  running--not after a crisis, not after a breakdown, but proactively.\n\nWe know the risks are real, Mr. Chair. Our Nation's electric grid is  the largest machine…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697893/electric-supply-chain-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…intelligence across State, local, Tribal, and  territorial partners.\n\nIn recent years, the Office of Intelligence and Analysis has faced  criticism for overreach in its handling of bulk data that raises  privacy concerns for the sensitive information of U.S. citizens.\n\nThis legislation will mandate that all DHS intelligence products  undergo comprehensive reviews…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696751/strengthening-oversight-of-dhs-intelligence-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…House Resolution 951,  I call up the bill (H.R. 3616) to require the Federal Energy Regulatory  Commission to review regulations that may affect the reliable operation  of the bulk-power system, and ask for its immediate consideration in  the House.\n\nThe Clerk read the title of the bill.\n\nMr. WEBER of Texas.  3616.\n\nMr. WEBER of Texas. Madam Speaker, I…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…label notice shall be displayed on the principal display       panel in a clear and conspicuous location reasonably visible       to the user of the covered product.\n\n(5) Bulk packaging.--\n\n(A) In general.--In the case of a covered product sold in       bulk at retail, the symbol and label notice shall be       displayed on both the outer packaging…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…legislation will leverage power sector experts  spanning the industry to improve DOE's understanding and strengthen  supply chains that are essential to meet the growing needs of our bulk  power system.\n\nDuring my tenure in Congress, I have remained focused on the security  of the bulk power system and have championed efforts to enhance the  resilience of our…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…particular is  critical to increasing the supply of housing.\n\nThis bill does exactly that. It lowers the regulatory burden on those  community financial institutions that provide the bulk of these  construction loans. This is the bill that the Committee on Financial  Services passed, and we passed it with bipartisan support because the  problem is obvious: We…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…the power generation  and grid reliability.\n\nIt strengthens Federal accountability, streamlines communication, and  puts in place commonsense guardrails needed to protect the bulk of the  power system.\n\nSince introducing this bill in the spring, I have heard from energy  leaders across Ohio--energy co-ops, utilities, manufacturers, and grid  operators--who…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…for       discharging a ``firearm'' than a less-than-lethal device.\n\nDespite these issues, federal, state, and local law       enforcement agencies still have the ability to bulk order       less-than-lethal projectile devices and traditional lethal       firearms       directly to their facilities, as 18 U.S.C. Sec. 925(a)(1)       provides an exception…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…take steps necessary and practicable       to ensure that 100 percent of the gross tonnage of the       equipment, materials, or commodities (computed separately for       dry bulk carriers, dry cargo liners, and tankers) which may       be transported on ocean vessels is transported on privately-      owned commercial vessels of the United States, as…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of Energy to conduct ongoing  assessments and report to Congress on the components and infrastructure  supply chain needed to secure the reliability and affordability of our  bulk power system.\n\nIt is no secret that we find ourselves in the middle of an electric  reliability crisis that is threatening the integrity of our bulk power  systems and an affordability…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for it, can be higher. When you look at, for  example, the rebates for prescription drugs that are available at the  Federal level because the Federal Government negotiates in bulk, that  is not available for this population that is covered by State funds, so  we are actually paying more than we would for our own citizens.\n\nMr. Speaker, this outrageous…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]