[{"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, I rise to congratulate the College of San  Mateo's football team, the Bulldogs, on becoming back-to-back  champions. Their dramatic 28-27 victory in the California Community  College Athletic Association Championship was their impressive third  title…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699641/congratulating-college-of-san-mateos-football-team"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Bridge High School Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to congratulate the  graduates of Stone Bridge High School's class of 2025.\n\nIn their time as Bulldogs, this class has left a lasting legacy in  the form of a mural to represent hope for the future. They excelled  across a wide range of fields, including journalism, data science,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…CLYBURN. Mr. Speaker, I rise a proud South Carolina State  University alumnus to congratulate its football team on their new  title, the 2025 HBCU national champions. The Bulldogs erased a 21-point  half-time deficit, scoring three touchdowns in the third quarter to win  the Cricket Celebration Bowl in a four-overtime thriller over Prairie  View A&M…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699194/south-carolina-state-university-football-team-2025-hbcu-national-champions"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I rise to say Go Bulldogs and Go Jaguars,  better known as Malcolm X Shabazz High School's boys basketball team  and Arts High School's girls basketball team, the champions of Newark  Board of Education's…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698891/champions-of-newark-board-of-educations-holiday-basketball-tournament"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…way to achieving the Division VI State Girls  Basketball Title. In their effort to surpass all other teams in the  Division VI State Basketball Playoffs, the Columbus Grove Bulldogs  overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Columbus Grove Lady Bulldogs  defeated the Rootstown Rovers to win their first…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690078/recognizing-columbus-grove-high-school-winning-the-division-vi-state-girls-basketball"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…but in life.\n\nI am honored to help Coach Lewis celebrate this occasion and the  positive, lifelong impact he has had on so many lives. Congratulations  to Coach Lewis. Go Bulldogs.", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688921/harlem-high-school-baseball-field-named-after-legendary-coach-jimmie-lewis"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, I am happy to congratulate the Big Spring  Marching Bulldogs from Big Spring High School in Newville,  Pennsylvania, on earning the Cavalcade of Bands Liberty A Conference  Championship.\n\nThis year's Band performed, ``Catch Me If You…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698290/congratulating-the-big-spring-high-school-marching-bulldogs"}]