[{"senator": "Dina Titus", "party": "Democrat", "sentence": "Petty bureaucrats  take pleasure in harassing him, summoning him to their offices to  question him about irrelevant issues, blocking his efforts to make  repairs in the few buildings still under his control, and issuing  veiled threats about what he says and does when he travels abroad."}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "These aren't just nameless, faceless  bureaucrats; these are Americans who signed up to serve our country by  taking care of veterans."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "What will happen in practice is that SEC bureaucrats  and political appointees will get to choose what is material and what  is not."}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "We cannot allow them to be dismissed amid political and       economic maneuvering by unelected bureaucrats like Elon Musk,       who have placated the legislature and judiciary while       wielding outsized influence over public policy, all while       bypassing democratic accountability."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Further, we often hear, mostly from the other side of the aisle,  about how unelected bureaucrats in Washington, D.C., are making too  many decisions about Federal spending."}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "They are not faceless bureaucrats."}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "I am always surprised when folks are  talking about unelected bureaucrats."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "We really cannot leave  these decisions to unelected bureaucrats in Washington who don't know  where McCook, NE, is, who don't know the issues facing the Santee Sioux  Nation, who don't understand where Greeley is, where Gothenburg is--and  some, probably, where Omaha or Lincoln are."}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "We are ensuring  bureaucrats cannot hide and escape tomorrow."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I believe that this Republican Congress,  this Republican House and Senate, and this Republican-led White House  have the opportunity today to transform healthcare for the American  people so that it can be affordable, so that they can have choice and  they can go to the doctor of their choice, and to empower doctors and  patients, not insurance bureaucrats and government bureaucrats."}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "In my lifetime, the number of  rules and regulations written by unelected Federal bureaucrats, the  people in the real world that we all represent--in my case in eastern  Kansas--must comply with, has quadrupled."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "That is why I introduced a bill called the FDA Modernization Act 3.0  to compel the FDA's career bureaucrats to finally implement the will of  the Congress and the American people."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Instead of investing in modern systems, Pentagon bureaucrats keep  pouring millions year after year into ancient systems that belong in  the junk heap."}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "We have to put the investor--that  retiree, that person who is desperate for returns so that they can  retire--first, not second, behind social issues that bureaucrats have  decided is the primary goal."}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "They do not invest their  hard-earned savings so that Federal bureaucrats can push ideological  priorities."}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Speaker, I rise today in strong support of the Housing for the  21st Century Act, a bill that advances exactly what Americans voted  for: fewer bureaucrats, more builders, lower costs, and real results."}, {"senator": "Brian Jack", "party": "Republican", "sentence": "Effectively, the Biden administration and the government were trying to  alter the market on their own by picking winners and losers, which is  something that consumers should do, not unelected nameless bureaucrats."}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Washington bureaucrats are  now telling them to replace perfectly good refrigeration equipment at a  nationwide cost of nearly $1 billion just to meet an arbitrary, one- size-fits-all efficiency target."}, {"senator": "French Hill", "party": "Republican", "sentence": "Speaker, let me say that, again, we are talking about unelected  bureaucrats in an agency that is not following the strict direction of  Congress and have overreached in how they have proposed this rule at  the last minute at the end of the Biden administration."}, {"senator": "Rick Allen", "party": "Republican", "sentence": "The American people are done paying  for it with higher costs, created by government bureaucrats, for at- home appliances."}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "If we hire more bureaucrats to look  at a computer screen and do nothing in the Department of Defense, that  is also supposed to be a sign of a booming economy because we have more  jobs."}, {"senator": "Roger Williams", "party": "Republican", "sentence": "The transparency measures in this bill are critical to expose the  harmful actions taken by bureaucrats behind closed doors and to  highlight the harm done to hardworking small and family-owned  businesses across the United States."}]