[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that the lights don't  go out--technical people--actually treat wind as reliable baseload  energy through formulas that that ISO has developed.\n\nAnd clean? Yes, it is clean. It burns no fossil fuel.\n\nAnd yet the Trump administration twice has tried to shut down that  project--twice. Just yesterday, they got blown up in Federal court for  the second time…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…charge was brought;\n\nBecause never a traitorous tale was told.\n\nRhode Island stood steady, silent, and bold.\n\nThe spark that was struck in the Gaspee Raid\n\nLit a flame that still burns in our hearts today.\n\nAnd the lesson from then is a lesson now,\n\nThat every American still will avow.\n\n``However majestic your powers may be,\n\nYou should heed our warning:…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that would run       $500 a month. We live with the anxiety.\n\nWe live with the anxiety. We live with that anxiety that millions of  Americans live with; that erodes them; that burns at their spirit. That  anxiety that has put millions of Americans in bankruptcy. That anxiety.  That anxiety that I can't afford my medications. That anxiety that I  can't…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…evening,       though we know she'd ask us: ``Why? I have lived the life I       dreamed of underneath the broadest sky.''\n\nAs we mourn for you, dear Jane, your great legacy burns       bright, And the world's a kinder place because you brought us       to the light. For in every child who plants a tree, in every       soul who cares, In every word of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…into outdoor recreation season.\n\nAgain, I have mentioned already the role that the Forest Service  plays in wildfire mitigation; that is, thinning the forest, doing  prescribed burns, doing the work that will prevent catastrophic  wildfires.\n\nIn my district, Fire Chief David Walker says the Forest Service is  the primary firefighting force for something…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to come together,  find common ground, and help people who are wondering: Come January 1,  how am I going to afford this health insurance? What am I going to do  when my kid burns his hand and ends up in the burn unit with a bill of  $15,000 that I can't afford to pay? What am I going to do if my baby is  born prematurely and has to stay in the NICU…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…annual event fundraising is a breakfast to be held this Sunday,  December 14, in Castle Royale in Yonkers, where State Senator Nick  Spano is chairman with Tom Meier and Gail Burns as co-chairs.\n\nWe salute their good work and the individuals and groups honored at  this year's breakfast, including Dr. Iyad Annabi, who is receiving a  Lifetime Achievement…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697681/operation-santa-claus"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…organization in 1969. Its members joined  the LHSAA. Almost every high school in the LHSAA has a mixed  enrollment.\n\nTeam Roster Included: Virgil Alexis, Michael Ben, Winston       Burns, Ken Cobette, Gary Craddock, Oyd Craddock, Charles       Cross, Donald Davis, Kurt Davis, Travis Duroncelet, Joseph       Evans, Greg Fernandez, Bernard Gaines, Zachary Gaston,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…many generations will gather at  Hiroshima and Nagasaki. Very few survivors of those atomic bombings  remain with us, but their stories endure. The disturbing photos of the  burns and the radiation sickness endure.\n\nIn those cities, those gathered will recommit to preserving the  memory of the destruction, and to plead with current and future  generations…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…was, my  identity, somewhat shifted and changed.\n\nMore than 200,000 people were killed, most of them civilians. Some  died instantly. Others suffered for months or years from burns,  radiation, and grief.\n\nMr. Speaker, 80 years after the erasure of two cities we have still  not learned the lessons of these terrible bombings.\n\nThere are an estimated 13,400…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…what is the best of America. They are taking Elmo  off the air because they gave billionaires a tax break. They are  defunding Tribal radio and rural broadcasting while Trump  burns through $56 million of taxpayer money on golf and throws himself  a $45 million birthday parade.\n\nRepublicans are engaged in waste, fraud, and abuse. That is the  definition…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the atomic bombs of 1945 caused unimaginable horror.  Some died instantly, many over subsequent days and months. Others  suffered for the rest of their lives, afflicted with burns, radiation,  and cancer.\n\nThe modern nuclear weapons of today are orders of magnitude more  horrifying. It is incumbent on all of us to ensure that these weapons  are never…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…University and my uncle was a smokejumper. I served in  the U.S. Forest Service.\n\nYears of fear and hesitation around commonsense tools like select  timber harvest and controlled burns have left many of our forests  dangerously overgrown and chronically undermanaged. We need to harvest  more timber for the economic revenue it produces and for the reduced…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Mr.  Mark Burns, president of Gulfstream Aerospace Corporation, on his  induction into the 23rd annual Living Legends of Aviation.\n\nFounded in 2003, the Living Legends of Aviation awards recognize…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…paid the ultimate sacrifice in the War on Terror.  Tens of thousands more carry with them the scars of war: living with  missing limbs, shrapnel, nerve damage, brain injuries, burns, scars.  Some live with paralysis and are confined to wheelchairs. The mental  wounds of war are also present as we remember the more than 30,000  veterans who have committed…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…While  shouting, ``Free Palestine,'' Soliman attacked the peaceful  demonstrators with Molotov cocktails, resulting in the hospitalization  of at least eight people who suffered burns and other injuries. At  least one of the victims had survived the Holocaust.\n\nAccording to the Justice Department, Soliman stated he planned the  attack for more than a year.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you have  protesters out there saying we can't allow the databases to talk to  each other. Have we lost our minds?\n\nI want to do this just as an example because this one just burns me.  Between Christmas and New Year's, I went up and spent 3 or 4 days up in  the Navajo Nation. I took my little 9-year-old daughter. Yes, I have a  9-year-old and a 2\\1/2\\-year-old.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…conducted an enforcement operation in November to  arrest him, he brutally beat an ICE officer with a metal coffee cup. He  caused a severe laceration of the officer's mouth and burns to the  officer's face.\n\nWhere are my Democratic colleagues' concern about the ICE officer who  put his life on the line and gets mauled and has a laceration across  his face…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…firefighter Jake Bridges of Hickory,  who died while serving his community.\n\nJake was just 20 years old. He was born in Cleveland County, raised  in Shelby, and graduated from Burns High School in 2023. Not long after  that, he joined the Hickory Fire Department as a certified firefighter  and EMT.\n\nHe hadn't been on the job long, but you wouldn't have…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692830/recognizing-chief-reed-baer-on-his-retirement"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…banishing an independent redistricting commission somehow  supports independent redistricting. We are told that we should fight  fire with fire, even if that means the whole world burns.\n\nThis perversion of Federal elections simply cannot be tolerated by  the United States Congress. We have a duty to protect the rights of  voters in selecting their Representatives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Huenerfuerst, Annegret: DEUTSCHE WELLE TV; Huenerfuerst,       Nils: DEUTSCHE WELLE TV; Huertas, Adiel: AL JAZEERA ENGLISH;       Huether, Andrea: NATIONAL PUBLIC RADIO (NPR); Huey-Burns,       Caitlin: CBS NEWS; Huff, Daniel: AP-BROADCAST; Huff,       Priscilla: GRAY TELEVISION; Hufford, Allyson: HEARST       TELEVISION INC; Hughes, Amani: INDEPENDENT TELEVISION…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "French Hill", "party": "Republican", "sentence": "…other local  leaders and outdoor recreation groups in our State.\n\nRest assured also, Mr. Speaker, the current forest management plan  for Flatside already includes prescribed burns, fire suppression  techniques, and reiterates the authority of management to protect the  area from fire, insects, and disease.\n\nSo, I thank my friend, Mr. Westerman, for working…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Cameron: Tax Notes; Brugger, Kelsey: E&E News; Buble,       Courtney: Law360; Buehler, Katherine: Law360; Bur, Jessica:       Nextgov/FCW; Burke, Lauren: Black Virginia News; Burns,       Tobias: The Hill; Burris, Tyrah: Tax Notes; Byington,       Lillianna: Bloomberg Industry Group; Byrnes, Jesse: The Hill;       Cahlink, George: Bloomberg Industry Group;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}]