[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…standard legislative  procedure so they could sell out our Afghan allies to protect  themselves politically from Trump's wrath. They threw our allies and  our military under the bus.\n\nTrump's weaponization of the horrific shooting of the National  Guardsmen, before we had even gathered the full facts, to scapegoat  Afghan allies and immigration communities,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…of the most ambitious capital programs in its  history. This included a $30 billion transformation of the region's  major airports and the full reconstruction of the Midtown Bus Terminal,  laying the foundation for world class transportation facilities built  for the 21st Century.\n\nMore than the projects completed or milestones reached, Mr. Rick  Cotton's…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…disproportionately  on our low-income and rural constituents and our communities of color.  They deserve so much better. They deserve our support, rather than  throwing them under the bus.\n\nOur permitting systems do need to be improved, and we have found a  way in our State to do that. This is a false solution that attacks  essential clean water safeguards and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698018/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…as a  distinguished member of the President's Club.\n\nBefore full-time ministry, Bishop Williams worked at McGregor Golf  for eleven years and later served the community as a bus driver for the  Dougherty County School System and as a dispatcher with the Albany- Dougherty 911 Communication Center. An entrepreneur, he owned The  Gentlemen Shop, G & W…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…going into effect April 2. The very next morning, he announced 25  percent tariffs would go into effect today. The whiplash is hard to  imagine.\n\nI spoke, last month, about a bus company, C&J Bus Lines, in New  Hampshire that was worried about these tariffs and what it would mean  for the bottom line. Well, the CEO moved up his delivery date to get…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…when we say that the Republican Party has  turned into a cult, this is what we mean. Our Republican colleagues are  pushing a bill that would throw their constituents under the bus, a  bill that flies in the face of everything they claim to stand for, all  because Donald Trump wants a bill-signing photo op by the Fourth of  July.\n\nMy Republican colleagues…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693238/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…no mistake, these files will come out. It is no longer  a question of if, only when, and whether the White House chooses to  stand with the survivors or throw them under the bus.\n\nDexter).\n\nMr. McGOVERN. Mr. Speaker, I am surprised the gentlewoman brought up  the unanimous consent request, but I am glad she did because I want the  Record to be clear.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…know anybody there, with his wife and child. He becomes  the pastor of a church. He is still writing his dissertation at night,  and then he becomes the leader of the Montgomery bus boycott. Talk  about gifted leadership.\n\nNot too far into that--they were a few days in, actually--the White  segregationists realized that this bus boycott was serious. They…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…student, he told his  automotive instructor on graduation day that he wanted to be a teacher  one day, too. He has 15 years of industry experience in dealerships and  six years as a bus mechanic for Jackson Local Schools. Joseph is most  passionate about sharing his love for automobiles with students, seeing  them grow more confident as they acquire the knowledge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…All of this will put their businesses at risk, and it will do so when  they are also facing higher costs for inputs because of these tariff  taxes.\n\nTwo weeks ago, I visited a bus company that runs buslines between the  seacoast of New Hampshire and Boston and New York. They are facing  $500,000 in added costs because of these tariffs. Now, on top of…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…of mine had a pregnancy scare, to a time when I was in college, to  being a volunteer in the bay area where I was on a rapid response line  in case someone needed to take a bus 3\\1/2\\ hours from their college  campus into the city. That is because that was the only place they  could access either maternity care, OB/GYN care, or access abortion  care.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…people off of the  services because you are constricting access.\n\nI don't know about you, but I don't want to see a bunch of seniors  struggling in a car or trying to get on the bus to go to the Social  Security office that now has shorter hours and longer  lines because they are trying to get a claim that they have earned. Who  tells a 75-year-old, a 68-year-old,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…betrayal.\n\nCHC is committed to protecting Dreamers. Those are young people on  average that have been in our Nation for over 20 years. They are nurses  and teachers. They are bus drivers. They are members of the Armed  Forces. They own their own small businesses, they own their own homes,  and yet we cannot regularize their status. We support Dreamers.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…drink  from a filthy colored water fountain when there was a pristine White  water fountain right next to me. I know. I lived it.\n\nI remember how I had to sit in the back of the bus, and if there  weren't enough seats for Anglos--we called them White people. I don't  like the term. But when there weren't enough seats for Anglos, then I  had to move. I know.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the call to protect his neighbors. After graduating from  Carver High School in 1965, Sheriff Bowens rolled up his sleeves and  worked wherever his community needed him: as a bus driver, ensuring  children arrived at school safe and ready to learn; as a mechanic at  Dawson Motor Company, tending to the machines that helped his neighbors  make a living;…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Customs  Enforcement officials live in your town. They are just like the  township cop that you know who stands by your school in the morning  when your kids are getting off the bus. They are the same people. They  are the same people.\n\nHow is it that my colleagues on the other side of the aisle can  somehow make book and tell you that you must support…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…them and their loved ones in danger.\n\nThe ICE officer in Minnesota who opened his voicemail to hear a  caller tell him:\n\nI hope your wife dies. . . . I hope you get hit by a bus       and you're paralyzed and your wife leaves you.\n\nThe FBI agent in Minneapolis who received a voicemail promising to  kill him, his wife, and his daughter, stating ``I am…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…American.  Being with them is in your own interest if you believe in religious  tolerance. Being with Israel means you reject a regime that would take  a 16-year-old girl off a bus and beat her to death because she didn't  have a head cover. This is evil we are fighting. They are as evil as  the Nazis.\n\nNow, 80 years later, we are having a debate about…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Ragsdale, who lost her life saving five  little girls--her guitar was found down the Guadalupe River just  yesterday; and the spirit of all the little girls who were riding in  the bus as they left Camp Mystic, singing hymns and expressing their  faith. They were looking at the destruction that they couldn't possibly  comprehend as they left that camp, but…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…It is an assault on our way of  life in northern Minnesota.\n\nMadam Speaker, I am not opposed to Americans having the ability to  purchase and drive an electric car, truck, or bus if they so wish. In  fact, I support their choice to do so. We should support and embrace  consumer choice.\n\nWhat I am opposed to is unelected bureaucrats in Washington or…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Homeland  Security, which includes, among other things, ICE funding, TSA funding,  FEMA funding, and the Democrats voted no.\n\nNow, that is not all. Right about now, there is a bus leaving. There  is a bus leaving the Capitol grounds and headed for an airport.  Democrats are on that bus who just voted to defund the paycheck of the  TSA agent making $40,000…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, I rise today to recognize Bryce Michael for  his heroic actions and dedication to helping our Nation's students.\n\nBryce is a bus driver for the Columbia School District in Brooklyn,  Michigan, and was driving students home when a kindergarten student  placed a quarter in her mouth and began to choke.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691360/recognizing-bryce-michael-for-heroic-actions"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…1990-2005. Being on these boards sparked his love of travel,       taking trips to the British Isles, Scandinavia, Europe, the       Middle East, and Australia. He led many bus tours throughout       the U.S. and tour groups 19 times to Israel, Jordan, and       Egypt. Two trips to the Passion Play Performance in Germany       were tucked into his…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…or a third time, I  watched the prosecution by U.S. attorneys actually prosecuting  individuals there through that process, getting them a felony and then  putting them on a bus back to Mexico again.\n\nThey are following the law. They are going through exactly what the  process is doing. They are doing the legal process.\n\nI also heard over and over again…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…funding  for most rural counties. When last reauthorized in 2023, this program  delivered more than $281 million nationwide to help keep teachers in  classrooms and students on the bus.\n\nI represent rural counties like Pend Oreille, Stevens, Ferry, and  Columbia Counties, where school leaders tell me how essential these  funds are to keeping programs running.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}]