[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…despair.\n\nThe Republican agenda would dramatically increase premiums for more  than 198,000 Oregonians, including my constituent Teresa from Clatsop  County. Teresa, a small business owner, runs a small flower and produce  farm. Like many small business owners, she purchases her coverage on  the Oregon health care exchange. Because of Republicans' refusal…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…person--should be left without healthcare. No mom or dad should have  to forego their own health insurance because they can't afford to pay  for their kids and themselves. No small business owner should have to  go without coverage to pay the bills.\n\nThat is exactly what is happening right now. It is happening all  because this leadership here in this House refused…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…bill came together in a way that I think the Founders might have  envisioned. Last Congress, the Committee on Small Business heard from  my constituent Cody Clark, a small business owner, a disabilities  rights advocate, and I think the only person who has ever performed a  magic trick in front of our committee.\n\nHe testified on the challenges that entrepreneurs…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…monthly health bills to skyrocket for millions of Americans. The  rising cost of healthcare goes beyond the individual. It affects Black  small business owners.\n\nA small business owner in my district owns several coffee shops and  worries about her employees being able to afford healthcare. She feels  responsible for her employees, but healthcare is a…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Heritage Month to recognize an exceptional public servant from  Rochester, New York: Marlene Henry.\n\nAs the owner of PeppaPot Catering, Marlene Henry is far more than a  business owner--she is a quiet but powerful force for good in our  community. Time and again, she has offered her culinary talents in  service of others, often at her own expense. Whether…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692569/recognizing-marlene-henry"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…credits.\n\nSusan, from Foster, Rhode Island, a marketing consultant, is seeing  her insurance go up from $600 a month to $2,100, a 250 percent  increase.\n\nSarah, a small business owner from Cranston, is seeing her premiums  go up more than $5,000 a year. Hillary, from Providence, her family of  four is going to be paying $10,600 more next year for the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696996/extend-the-tax-credits"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…are part-time workers. They are small-business workers  who have seen their premiums more than double, and they deserve so much  better.\n\nThat includes Yohanna, a small business owner in Tampa and the mother  of a daughter with Down syndrome, who without enhanced tax credits  defaults to an insurance plan where every visit will cost her $150 for  a copay.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698595/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, imagine being a farmer choosing between  insurance and seed, a small business owner weighing a doctor's visit  against payroll, families hoping nothing goes wrong because they are  one ER visit away from being homeless. This is the reality for rural  America…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…role of salesman, compliance officer,  marketing professional, and more, often juggling a variety of business- related activities to support their business.\n\nWhen a small business owner submits a proposal to work with the  Federal Government, they invest considerable time and resources into  making their submission the best it can be. They are also forced…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…numbers. You see, it is not about  the politics, as our chairwoman said. It is about people. It is about  everyday people.\n\nLet me tell you the story of Tracie, a small business owner, who  wrote that her family's premiums have tripled. Before the tax credit,  they were paying over $1,000 a month just to stay insured. With two  children in college, she…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…what they represent. Janice, however, resides,  Mr. Speaker, in the Seventh Congressional District, represented by  Congressman  Tom Barrett. She says that she is a small business owner,  a mother, and an ACA recipient in Michigan, who recently spoke about  how Trump's tariffs would potentially force her to close her business,  which has given her family…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…businesses and  raising prices on families across the country. I am hearing from  communities across Washington about the devastating impact of these  tariffs. A small business owner in my district told me he is being  tariffed out of business. I know my colleagues are hearing the same,  especially from farmers who are often the first and hardest hit…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699902/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…founding. Please help me continue to       do that by protecting TPS and creating a permanent path to       residency in this country.\n\nThank you for your time, Jose Urias\n\nBusiness Owner & Co-Coordinator of the Massachusetts TPS       Committee                                __________\n\nHello, my name is W.V., and in 2009 my life changed       unexpectedly.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…countries.  American small businesses pay the tax. Main Street is paying this tax.  And President Trump is taxing food and clothing and toys and even tea.  And as a small business owner reminded me, the last time there was a  tax on tea, there was a revolution in our country that began in Boston.\n\nSmall businesses have no lobbyists, no Mar-a-Lago, no golden…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…all it can to support       America's job creators, not pick and choose winners within       the small business community based on nothing more than where       a small business owner was born.\n\nWe urge your office to oppose H.R. 2931 and H.R. 2966 as       both proposals undermine the       SBA's capacity to carry out its mission and strip resources…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…manufacturers by  $213,000 and require an additional 2,905 hours of compliance paperwork,  just paperwork, a major burden, particularly for small businesses. As a  small business owner myself, I understand how crushing regulations like  these harm the small businesses that drive our economy, especially in  rural communities like northeast Georgia.\n\nLast…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…is about ensuring we have the validation mechanisms in place to  ensure the rule of law. It is about prioritizing Americans. It is about  making sure that when a small business owner like those in Texas, or  anywhere else, fills out an application, they know the system is fair  and the resources are theirs to access.\n\nWith every bill codifying President…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…restaurants, and she serves on  the board of the Texas Restaurant Association and is a former  chairwoman of the Texas Restaurant Foundation.\n\nAnother impressive woman small business owner was Hortencia Camargo,  the owner of C4 Transport and Hacienda La Hortencia and a licensed  Realtor in McAllen, TX, and she is also the founder of GRASP, which  advocates…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…detrimental impact on small businesses and the consumers. If small  businesses thought this was going to benefit their businesses, I  guarantee you, Mr. Speaker, as a family business owner, we would invest  in it. We would not have to be mandated to invest in it.\n\nThis final rule does not even meet the statutory requirements laid  out in ECPA for new or amended…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…highly  visible leader in the Rockwall County and Royse City communities. Since  moving to Royse City in 2001, he has served as a committed public  servant, volunteer, business owner, and devoted family man. He and his  wife, Katie, have three sons, all of whom graduated from Royse City  ISD. Throughout their time in the district, Mr. Branch has been…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…I rise today in celebration of National  Small Business Week, a time to recognize the hardworking men and women  who are the engines of our economy.\n\nAs a former small business owner myself, I know the long hours,  risks, and deep sense of responsibility that come with signing both  sides of a paycheck. Small businesses are more than storefronts. They…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…relieved that it will be  easier to pass his family farm to the next generation because this  historic legislation doubles the death tax exemption.\n\nI spoke to a small business owner in Monroe who will now be able to  invest more in his operations and grow his family business due to the  progrowth policies.\n\nI talked to a waitress in Cassopolis who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695325/delivering-for-hardworking-michiganders"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…should not  reward sanctuary cities with permanent SBA infrastructure. That is not  just wrong, quite frankly, it is insulting to every law-abiding  taxpayer and every small business owner struggling to stay afloat.  These offices have got to be moved.\n\nThis legislation is another example of House Republicans working to  codify President Trump's executive…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…that our payment system is outdated. Many of our financial rails  date back to the 1970s and 1980s, before the internet transformed how  we live and work.\n\nWhen a small business owner in Cheyenne uses a traditional payment  system to send a payment to a supplier overseas, they face delays up to  10 days and 2 to 5 percent transaction fees. This isn't…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…trillion per year.\n\nDo you know what the difference is between a tax and a regulatory  command, Mr. Speaker? With a tax, the Federal Government says to, in  this case, a small business owner: Give me your money, and we will  spend it on priorities that we decide. With a regulation, the Federal  Government says to that same small business owner: You take your…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…moves the needle toward empowering small businesses by  reducing red tape. To say that that doesn't save money to small  business, then obviously she has never been a small business owner.\n\nIf we want America to succeed, it starts on Main Street. I urge my  colleagues to join me in supporting the Small Business Regulatory  Reduction Act of 2025.\n\nMr. WILLIAMS…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…strawberry lemonade  smoothies, the Funky Buffalo is always offering new drink recipes.\n\nThe Funky Buffalo is run by Kendra. She is a wife, a mom of three,  and now a bold small business owner. She and her husband, Chris, have  poured their hearts into this place creating not just a business but a  blessing for our district.\n\nTheir family is directly affected…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…America are  benefiting from the One Big Beautiful Bill Act.\n\nThis is one of the most profamily, prosmall business, proworker  legislation ever signed into law. As a small business owner myself and  chairman of the House Committee on Small Business, I understand  firsthand how policies coming out of Washington, D.C., can directly  impact the day-to-day…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…time. While large corporations can afford expensive consultants and  trial-and-error experimentation, many small businesses do not have the  luxury to do that. For a small business owner like myself, every dollar  matters. The AI-WISE Act helps bridge that gap.\n\nThis bill directs the SBA to provide clear, accessible, and practical  guidance that helps small…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…accelerated motion toward  resolving this issue and moving forward with appropriations.\n\nI will close by just citing one conversation I had yesterday.\n\nI spoke with a small business owner from Delaware. Her name is Jan.  She is a stage IV cancer survivor. She is a small business owner.\n\nShe told me yesterday that, without the Affordable Care Act, she  would…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]