[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…weakening existing SEC oversight.\n\nThis bipartisan legislation will open the door for more investment in  BDCs, thereby unlocking more capital for small and mid-sized businesses  across the country. The most important thing that our financial  institutions and capital markets do is provide capital for businesses,  particularly small, medium-sized, and growing…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…American families  and the economy do not. It is up to Congress to reject those desperate  gambles by the President. Congress must also act to ensure that small  businesses across the country get their money back as soon as possible.\n\nAnd how about the families who paid for these products that have been  taxed by the Trump tariff tax? They deserve relief…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…relates to the attack that has taken place on farmers in this  country, and I will tell those stories. The stories need to be told as  it relates to the attack on small businesses in this country, and I  will tell those stories. The stories need to be told as it relates to  the unprecedented assault on veterans in this country. How dare this  administration…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…public health crisis. The COVID-19  pandemic left our country in shambles, with millions of people losing  their jobs and shuttering hundreds of thousands of businesses all  across our country.\n\nCongress appropriately stepped up, passed several pieces of  legislation to support American small businesses and workers, and  helped the country to get back…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…chairs of the House Small Business Committee and House  Science Committee.\n\nSince the SBIR and STTR programs closed their doors, I have heard  from hundreds of small businesses across the country that are being  forced to lay off employees, cease critical research, and may soon have  to close their doors for good. Passing H.R. 5100 is not just a matter…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…why I continue to support the Minority Business Development  Agency, which has now been defunded and dismantled, even though it has  provided critical support to businesses all around the country.\n\nLet me just continue on. You know, it is absolutely disturbing and  upsetting to walk through what is happening in our country under  President Trump and his…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…ship it out to overseas? The truth is, it  ain't that hard.\n\nThe reason why we are having this conversation about permitting is  really, really simple. Half of the businesses in this country, by  definition, are below average. A competitive market does not reward  below-average businesses. Now, we find ourselves in a position where  energy industry participants…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Illinois, on the occasion of National Roofing Week between June 1-7,  2025.\n\nNational Roofing Week honors the efforts of thousands of roofing- related workers and businesses across the country, as well as the  industry's commitment to public service in general. National Roofing  Week is a valuable reminder of the significance quality roofing has on  every…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…Affordable Care Act tax credits that helped millions of Americans  afford their premiums will expire. These tax credits have been a  lifeline for families and small businesses across the country. They  have allowed people to see their providers, to fill their  prescriptions, and to get the procedures that they need.\n\nThese tax credits are enormously popular…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…is a 10-percent  tariff--tax--already in place right now, since April 2, on every good  coming into our country. So this is a very dangerous place to put the  small businesses of our country.\n\nEven as the vast majority of small businesses are seeing massive  tariff-induced cost hikes, this administration is offering exemptions-- exemptions--for billion-dollar…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…billion.\n\nThis bill ensures that will no longer happen again. It protects  taxpayer dollars, ensuring that they go where Congress intended: only  to the legitimate small businesses of our country.\n\nMr. Speaker, I thank my colleagues for bringing this forward.  Government efficiency is a good thing, but there is a right way to go  about it and a legal way to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…together on, but for some reason, over the last 6  months, it seems that Washington, D.C., is intent on doing everything  that it can to make it harder for small businesses in this country to  operate.\n\nLet's reset. Let's prioritize tax relief for small businesses and the  middle class instead of the rich. Let's eliminate these tariffs on  products…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Thank you so much for your leadership.\n\nAnd I rise to join them in highlighting the devastating impact  President Trump's economic policies are having on small businesses  across our country. Small business owners are struggling in President  Trump's economy.\n\nLet me just say this: 97 percent of all the companies in America that  engage in trade are…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…irreparable.\n\nThe cancellations will mean lost jobs for Americans, lost educational  opportunities for students. It will mean higher energy bills for  households and businesses across this country.\n\nIt will make it even harder for folks who are already struggling to  make ends meet because of the affordability crisis instigated by this  administration's tariffs…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…just against our adversaries, but against  allies like Canada, Mexico, France, Germany, and other countries. It  has been devastating to the American economy and businesses across the  country.\n\nHe ran for election telling the American people that he was going to  make their economic lives better and that he was going to help them  financially be better…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…has become clear: Time is working  against us. We cannot allow these critical programs to expire. Failing  to extend these programs would be a disservice to small businesses  across the country. Put simply, American innovators cannot operate in  uncertainty, and national security cannot afford an innovation gap.\n\nAs chairman of the Small Business Committee,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695452/extension-of-sbir-and-sttr-authority"}, {"senator": "French Hill", "party": "Republican", "sentence": "…this rulemaking is a clear  example of undemocratic and unjustified action. The CFPB gave the  public just 30 days to comment on this proposal. That is 30 days for  businesses across the country, Members of Congress, State regulators,  and the public to weigh in on a rule that has potentially profound  consequences for digital commerce, one of the most…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…duplicative, or unclear regulations that make it harder  for them to hire, grow, and innovate.\n\nSince 1976, the SBA Office of Advocacy has served as a voice for  small businesses across the country. The Office of Advocacy works to  encourage small business success through the government's legislative,  regulatory, and administrative process. When it comes…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…This extension will provide critical time for law  enforcement to track down criminals who have defrauded the U.S.  Government and hold them accountable.\n\nSmall businesses across our country, including in my home district of  central and eastern Montana, deserve an SBA that efficiently supports  local job creators and isn't undercut by fraud.\n\nMr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…delivered. Republicans cut taxes for Americans. We  eliminated wasteful Washington spending. We rolled back regulations  that strangled businesses and punished small businesses all across the  country. We restored American energy dominance.\n\nToday, America is safer, more secure, and more prosperous than it was  when Joe Biden left the White House a little over…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…to be competitive and to grow.\n\nSmall businesses are pivotal to the success of our Nation's economy.  I join my colleagues this week in celebration of the small businesses  that keep our country thriving, and I will work with them to ensure  that there is opportunity long into the future.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Scholten.\n\nArtificial intelligence is increasingly being used to streamline  operations, reduce costs, and boost productivity for small businesses.  For many small businesses across the country, adopting these tools  remains out of reach because they lack the staff, the expertise, or the  capital to do so.\n\nMadam Speaker, the AI for Main Street Act helps…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Administration on any overly  burdensome and costly regulations they must deal with. I think we can  agree that we should do everything we can to help protect our small  businesses in this country.\n\nFinally in this rule, we also will be considering H.R. 4312, the  SCORE Act, led by Representative Bilirakis from Florida and the  chairmen of each subcommittee…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…combined provided over $44 billion in grants and  funding for small businesses during the pandemic. Unfortunately,  fraudsters stole COVID relief funds from small businesses across the  country. These fraudsters hope that the statute of limitations for  their crimes will pass, allowing them to skirt justice.\n\nAs Congress, we cannot let this happen. American…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697227/sba-fraud-enforcement-extension-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…trying to reduce emissions and operate  more efficiently.\n\nIt is not just a problem for North Dakota. This rule affects  manufacturers, energy producers, and small businesses all over the  country. This approach raises costs, discourages innovation, and forces  companies to think twice before making long-term investments in cleaner  technologies.\n\nThis is…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…hard has always been the standard for small business owners,  but when the Biden-Harris administration created $1.8 trillion in  additional regulatory costs for businesses across the country in just 4  years, small business owners felt the brunt of that pain.\n\nH.R. 2965, the Small Business Regulatory Reduction Act of 2025,  supports the Trump administration's…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}]