[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…save anything.\n\nIt continues to eviscerate small businesses in order to benefit the  greediest, biggest corporations and their CEOs, who don't even need the  Small Business Administration. Do you know who does? Small businesses  that just want customers, employees, and the chance that SBA affords  them to attain success.\n\nThis bill actually punishes…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691941/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…dignity, and freedom for Americans with disabilities, but  to drive economic growth.\n\nThis bill, my bill, our bill, creates an essential partnership  between the Small Business Administration and the National Council on  Disability to help individuals with disabilities pursue self- employment, dignity, launch small businesses, and thrive in the  workforce.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691779/thinkdifferently-about-disability-employment-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…priorities at home and abroad.\n\nThis bill supports the small businesses and entrepreneurs that fuel  the American economy by providing more than $1 billion for the Small  Business Administration and increasing funding for entrepreneurial  development programs by $13 million.\n\nSmall businesses employ nearly half of the American workforce. At a  time when so…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…really proud to be a part of cosponsoring this legislation  because what it is going to be is a commonsense solution to empower an  important office within the Small Business Administration, the Office  of Advocacy, to represent small businesses on international issues.\n\nIt is a critically important seat at the table for our small  businesses at a time…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687955/small-business-advocacy-improvements-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…they foster innovation, and they drive our local communities forward.  They should be who we lift up and support, and they rightly are the  beneficiaries of many Small Business Administration programs.\n\nHowever, far too often, we have scammers taking advantage of these  worthy programs. We saw this, for example, during the COVID-19  pandemic, when the Paycheck…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…was always both an ardent participant and learned scholar of democracy.  He floated in books. Steve was a lifelong student, earning degrees in  literature, history, business administration, and law. He never stopped  learning.\n\nHe loved baseball. Do not get in his way when there is a baseball  around and basketball, as well. He was at one time the ``beloved…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…through the deficit, $37 trillion  over 30 years, while they are trying to gut the infrastructure that  helps small businesses survive.\n\nThey have attacked the Small Business Administration. They have a  bill on the floor this week that would take SBA out of our communities.  They slashed the New Mexico Minority Business Development Agency. We  are talking…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691939/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…legislation with the gentleman from New York (Mr. LaLota) and the  gentleman from Michigan (Mr. Thanedar).\n\nThis bill would require the Department of Energy and the Small  Business Administration to enter into a memorandum of understanding  that would improve collaboration between these two agencies. This joint  agency effort would expand opportunities for…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…we have had tighter and  tighter bank regulations, banks have been reluctant to lend money to  small businesses except where their risks are guaranteed by the Small  Business Administration. SBA loans are, of course, limited.\n\nWe need BDCs to provide investment and to provide management  assistance to growing businesses that are often underserved by…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…our country. It  is still an epidemic.\n\nNo. 69, threatened to block a media merger if CBS didn't change its  reporting.\n\nNo. 70, gave DOGE access to sensitive Small Business Administration  data.\n\nNo. 71, Signalgate.\n\nNo. 72, abducted Rumeysa Ozturk off the streets of Somerville, MA--a  graduate student whom I just visited in prison in Louisiana. The…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…struggled throughout the pandemic.\n\nIn Oakland's downtown, for instance, many of these institutions are  fighting day in and day out just to stay afloat. I thank the Small  Business Administration employees who work hard to support them.\n\nThese wonderful Federal employees have been connecting with small  businesses in our district with emergency assistance,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Grandview school system before moving onto  William Jewell College where he graduated with his bachelors in 1967.  To further his studies, obtained a master's degree in business  administration from the University of Missouri-Kansas City. In addition  to his education endeavors, Jim served during the Vietnam War in the  U.S. army as First Lieutenant and was…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…efforts to  undermine American small businesses by the very agency tasked with  fueling them.\n\nLet me be clear. This is what H.R. 2931 would do. It would allow the  Small Business Administration to gut punch the small businesses it is  supposed to serve, just to punish cities that embrace their immigrant  communities.\n\nTargeting sanctuary cities, as this bill…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…H.R. 2987, the  CEASE Act, which would place a statutory moratorium on the number of  Small Business Lending Company licenses that can be issued by the U.S.  Small Business Administration.\n\nWhat does this bill do? It will cap the number of SBA 7(a) nonbank  lenders who can give loans to America's small businesses, a reasonable  endeavor that could have…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Sec. 4.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 2965) to       require the Administrator of the Small Business       Administration to ensure that the small business regulatory       budget for a small business concern in a fiscal year is not       greater than zero, and for other purposes.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Representatives Meuser and McIver.\n\nH.R. 1804 is an important piece of legislation that brings an  additional layer of transparency in the fight against fraud in the  Small Business Administration's flagship 7(a) loan program.\n\nThis bill would require the SBA Office of Credit Risk Management to  submit annual reports to Congress on the 7(a) loan program. The…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 788) to provide for Department of Energy and Small  Business Administration joint research and development activities, and  for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…has saved $115 billion.  That amounts to--order, please.\n\nMs. ERNST. That amounts to $714 per taxpayer.\n\nMs. ERNST. Some of DOGE's findings include that the Small Business  Administration gave out more than $300 million in loans to thousands of  children 11 years and younger; Agencies were paying for tens of  thousands of unused software licenses; and…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688898/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, pursuant to House Resolution 916,  I call up the bill (H.R. 2965) to require the Administrator of the  Small Business Administration to ensure that the small business  regulatory budget for a small business concern in a fiscal year is not  greater than zero, and for other purposes, and ask for its…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…I rise today along with my colleague, Democratic Member  Mrs. McIver, in support of my bill, H.R. 1804, the 7(a) Loan Agent  Oversight Act, which provides the Small Business Administration with  the oversight capabilities to monitor its flagship loan program  responsibly. This bipartisan legislation requires the SBA Office of  Credit Risk Management…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691855/9999"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…compete. Yet, they continue to serve as the  backbone of our economy, driving innovation, creating jobs, and keeping  the American Dream alive.\n\nAccording to the Small Business Administration, firms with fewer than  500 employees account for 43.5 percent of our Nation's GDP. Since 2019,  they have been responsible for over 70 percent of net new job creation.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…DOWNING. Mr. Speaker, I thank the chair for yielding me time.\n\nMr. Speaker, small businesses are the backbone of Montana's Second  District. According to the Small Business Administration, small  businesses employ roughly 67 percent of all Montanans. That is well  above the national average.\n\nThese businesses historically have difficulty accessing the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692758/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…description of a Secretary of Education is to manage a  bureaucracy that runs a number of funding programs. By all accounts,  Linda McMahon did a great job running the Small Business Administration  in the last Trump administration. I have no reason to believe that she  cannot run the Department of Education. I think she understands the  difference between the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…entering the workforce with the hands-on skills employers desperately  need.\n\nThis bipartisan legislation offers a commonsense solution. H.R. 1642  requires the Small Business Administration's resource partners to  provide small businesses with vital information on how to hire  graduates of career and technical education programs.\n\nIn addition, it ensures…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Following her honorable discharge in 2005, Mrs. Gramer continued to  pursue excellence. She earned two degrees: one in Early Childhood  Development and another in Business Administration. She successfully  operated a home childcare business while raising her three children.  Once her children reached school age, she discovered a new calling:  serving…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the Department of the Interior;\n\n(8) the Department of Health and Human Services;\n\n(9) the Office of the Director of National Intelligence;       and\n\n(10) the Small Business Administration.\n\n(d) Designations.--The Assistant Secretary shall--\n\n(1) not later than 120 days after the date of the enactment       of this Act, designate--\n\n(A) critical industries;…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…incredible  contributions.\n\nThe ThinkDIFFERENTLY About Disability Employment Act takes a critical  step towards breaking down these barriers. This bill directs the Small  Business Administration and the National Council on Disability to  collaborate in providing resources and assistance to individuals with  disabilities who want to start their own business…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691778/thinkdifferently-about-disability-employment-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Security death files. The oldest person in America is, what, 114  years old? We took people over 114 years old and then wondered how they  were getting loans at the Small Business Administration.\n\nForgive my math. I am doing this from memory from last week. There  were like 3,300 people who were over 114 years old who got SBA loans.  Mr. Speaker, $300 million…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 1621) to require the Administrator of the Small  Business Administration to submit to Congress a report on the  entrepreneurial challenges facing entrepreneurs with a disability, and  for other purposes, as amended.\n\nThe Clerk read the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691756/entrepreneurs-with-disabilities-reporting-act-of-2025"}]