[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Today, I rise to share the story of Cheryl from Cleveland Heights, a  constituent whose life could be upended by cuts to SNAP and Medicaid.\n\nCheryl is a retired small business owner who ran an advertising  company with her husband for 25 years. They were forced to close that  business due to their health issues.\n\nCheryl lives with chronic respiratory…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691428/gop-tax-scam-hurts-women-and-families"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Heritage Month to recognize an exceptional public servant from  Rochester, New York: Marlene Henry.\n\nAs the owner of PeppaPot Catering, Marlene Henry is far more than a  business owner--she is a quiet but powerful force for good in our  community. Time and again, she has offered her culinary talents in  service of others, often at her own expense. Whether…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692569/recognizing-marlene-henry"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…then canceled the  solicitation. Unfortunately, any small business working on a bid lost  all the time and money they had invested in the proposal.\n\nLast year, a small business owner testified that it cost him an  average of $10,000 per proposal. If that solicitation was later  canceled, the government did not have to provide him with any  assistance…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691759/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…of  them are starting off the year without access to care.\n\nI hear from families all across north Texas every day begging for  help. One constituent in Dallas, a small business owner with a child  who has type 1 diabetes, told me plainly: ``I need these tax credits so  my baby can survive.''\n\nThis is life or death for so many families in our communities.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698596/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…what they represent. Janice, however, resides,  Mr. Speaker, in the Seventh Congressional District, represented by  Congressman  Tom Barrett. She says that she is a small business owner,  a mother, and an ACA recipient in Michigan, who recently spoke about  how Trump's tariffs would potentially force her to close her business,  which has given her family…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…wants to support exporters. Well, here is an American small  business and an exporter, and because of what this President is doing  with his reckless trade war, this small business owner might go out of  business.\n\nMr. Chatila said to me:\n\nWhen I came, this was the American dream, which is why we       built it. But now, you see it in front of yours eyes.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…businesses and  raising prices on families across the country. I am hearing from  communities across Washington about the devastating impact of these  tariffs. A small business owner in my district told me he is being  tariffed out of business. I know my colleagues are hearing the same,  especially from farmers who are often the first and hardest hit…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699902/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…all it can to support       America's job creators, not pick and choose winners within       the small business community based on nothing more than where       a small business owner was born.\n\nWe urge your office to oppose H.R. 2931 and H.R. 2966 as       both proposals undermine the       SBA's capacity to carry out its mission and strip resources…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…person--should be left without healthcare. No mom or dad should have  to forego their own health insurance because they can't afford to pay  for their kids and themselves. No small business owner should have to  go without coverage to pay the bills.\n\nThat is exactly what is happening right now. It is happening all  because this leadership here in this House refused…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…founding. Please help me continue to       do that by protecting TPS and creating a permanent path to       residency in this country.\n\nThank you for your time, Jose Urias\n\nBusiness Owner & Co-Coordinator of the Massachusetts TPS       Committee                                __________\n\nHello, my name is W.V., and in 2009 my life changed       unexpectedly.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to lift up the voice of Julie  Robbins, a small business owner from Akron, Ohio, who is sounding the  alarm on behalf of hardworking Americans across the country.\n\nEarthQuaker Devices is a homegrown success story in downtown Akron,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…numbers. You see, it is not about  the politics, as our chairwoman said. It is about people. It is about  everyday people.\n\nLet me tell you the story of Tracie, a small business owner, who  wrote that her family's premiums have tripled. Before the tax credit,  they were paying over $1,000 a month just to stay insured. With two  children in college, she…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…people are already stretched thin.\n\nI have heard from families across my district who are forgoing  coverage this year because of the absurd premium increases.\n\nA small business owner in Bremerton said that her new monthly premium  for her family of three would be more than her mortgage, costing  $35,000 a year. She is now being forced to look for a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…already exists. Wow, that is  groundbreaking. Neither of them does anything about the number one  issue that I hear from small businesses, and that is tariffs.\n\nEvery small business owner I talk to says the same thing: The tariffs  are killing them. The tariffs are making prices skyrocket. The tariffs  are slowing down business.\n\nThese guys don't care. They…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, imagine being a farmer choosing between  insurance and seed, a small business owner weighing a doctor's visit  against payroll, families hoping nothing goes wrong because they are  one ER visit away from being homeless. This is the reality for rural  America…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…manufacturers by  $213,000 and require an additional 2,905 hours of compliance paperwork,  just paperwork, a major burden, particularly for small businesses. As a  small business owner myself, I understand how crushing regulations like  these harm the small businesses that drive our economy, especially in  rural communities like northeast Georgia.\n\nLast…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…is about ensuring we have the validation mechanisms in place to  ensure the rule of law. It is about prioritizing Americans. It is about  making sure that when a small business owner like those in Texas, or  anywhere else, fills out an application, they know the system is fair  and the resources are theirs to access.\n\nWith every bill codifying President…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…restaurants, and she serves on  the board of the Texas Restaurant Association and is a former  chairwoman of the Texas Restaurant Foundation.\n\nAnother impressive woman small business owner was Hortencia Camargo,  the owner of C4 Transport and Hacienda La Hortencia and a licensed  Realtor in McAllen, TX, and she is also the founder of GRASP, which  advocates…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…detrimental impact on small businesses and the consumers. If small  businesses thought this was going to benefit their businesses, I  guarantee you, Mr. Speaker, as a family business owner, we would invest  in it. We would not have to be mandated to invest in it.\n\nThis final rule does not even meet the statutory requirements laid  out in ECPA for new or amended…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…highly  visible leader in the Rockwall County and Royse City communities. Since  moving to Royse City in 2001, he has served as a committed public  servant, volunteer, business owner, and devoted family man. He and his  wife, Katie, have three sons, all of whom graduated from Royse City  ISD. Throughout their time in the district, Mr. Branch has been…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…I rise today in celebration of National  Small Business Week, a time to recognize the hardworking men and women  who are the engines of our economy.\n\nAs a former small business owner myself, I know the long hours,  risks, and deep sense of responsibility that come with signing both  sides of a paycheck. Small businesses are more than storefronts. They…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…relieved that it will be  easier to pass his family farm to the next generation because this  historic legislation doubles the death tax exemption.\n\nI spoke to a small business owner in Monroe who will now be able to  invest more in his operations and grow his family business due to the  progrowth policies.\n\nI talked to a waitress in Cassopolis who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695325/delivering-for-hardworking-michiganders"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…strawberry lemonade  smoothies, the Funky Buffalo is always offering new drink recipes.\n\nThe Funky Buffalo is run by Kendra. She is a wife, a mom of three,  and now a bold small business owner. She and her husband, Chris, have  poured their hearts into this place creating not just a business but a  blessing for our district.\n\nTheir family is directly affected…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…that our payment system is outdated. Many of our financial rails  date back to the 1970s and 1980s, before the internet transformed how  we live and work.\n\nWhen a small business owner in Cheyenne uses a traditional payment  system to send a payment to a supplier overseas, they face delays up to  10 days and 2 to 5 percent transaction fees. This isn't…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…trillion per year.\n\nDo you know what the difference is between a tax and a regulatory  command, Mr. Speaker? With a tax, the Federal Government says to, in  this case, a small business owner: Give me your money, and we will  spend it on priorities that we decide. With a regulation, the Federal  Government says to that same small business owner: You take your…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…time. While large corporations can afford expensive consultants and  trial-and-error experimentation, many small businesses do not have the  luxury to do that. For a small business owner like myself, every dollar  matters. The AI-WISE Act helps bridge that gap.\n\nThis bill directs the SBA to provide clear, accessible, and practical  guidance that helps small…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…should not  reward sanctuary cities with permanent SBA infrastructure. That is not  just wrong, quite frankly, it is insulting to every law-abiding  taxpayer and every small business owner struggling to stay afloat.  These offices have got to be moved.\n\nThis legislation is another example of House Republicans working to  codify President Trump's executive…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…that helps small  businesses obtain affordable financing for the acquisition of fixed  assets, such as land, buildings, and heavy machinery.\n\nTo obtain a 504 loan, a small business owner must contribute 10  percent of the total project cost as a form of downpayment. However, if  a small business is seeking financing to build something like a surgery  center…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699166/main-street-parity-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…America are  benefiting from the One Big Beautiful Bill Act.\n\nThis is one of the most profamily, prosmall business, proworker  legislation ever signed into law. As a small business owner myself and  chairman of the House Committee on Small Business, I understand  firsthand how policies coming out of Washington, D.C., can directly  impact the day-to-day…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…accelerated motion toward  resolving this issue and moving forward with appropriations.\n\nI will close by just citing one conversation I had yesterday.\n\nI spoke with a small business owner from Delaware. Her name is Jan.  She is a stage IV cancer survivor. She is a small business owner.\n\nShe told me yesterday that, without the Affordable Care Act, she  would…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]