[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Speaker, I am grateful for the opportunity to speak as we take up  a set of five bipartisan bills that will expand services available to  our country's 36 million small businesses.", "title": "Made in America Manufacturing Finance Act", "date": "2025-12-01"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "If this is what bringing business acumen to government function looks  like, then it is pretty clear we need to prevent our government from  becoming a dumpster fire like X or one of Trump's corrupt corporations.", "title": "Department of Government Inefficiency", "date": "2025-02-25"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "His broad experience in civic, business, and community affairs  positions him well to lead at this pivotal moment for transit in our  region.", "title": "Recognizing Mr. Randall Bryant's Selection As Chairman of the Dart Board of Directors", "date": "2025-10-24"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "These companies knew what their business  was doing all along, and they chose to hide the evidence of their own  scientists and do nothing.", "title": "Unanimous Consent Request--S. Res. 550", "date": "2026-01-13"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "No one asked for this, not the stakeholders, not the business  community, and, most importantly, not the people of Missouri.", "title": "Missourians' Serious Concerns", "date": null}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Far too often, bureaucratic barriers and complex government jargon  prevent small business owners, especially veterans and immigrant  entrepreneurs, from accessing and securing Federal contracting  opportunities.", "title": "Plain Language in Contracting Act", "date": "2025-06-03"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "These are not just  abstract qualities; they are tangible assets that veterans bring to our  businesses, our communities, and to our government.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Small business owners are often resource constrained.", "title": "Transparency and Predictability in Small Business Opportunities Act", "date": "2025-06-03"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "The fiscal year 2026 Financial Services and General Government bill  provides critical assistance to small businesses in the Twin Cities by  rejecting cuts to Community Development Financial Institutions (CDFI)  Fund.", "title": "Supporting H.R. 7006", "date": "2026-01-27"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "1642, the  Connecting Small Businesses with Career and Technical Education  Graduates Act.", "title": "Connecting Small Businesses with Career and Technical Education Graduates Act of 2025", "date": "2025-06-03"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Elmwood Park is a wonderful place to live, to shop, and to do  business.", "title": "Defending Social Services and Programs", "date": "2025-04-08"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "I  have joined many colleagues in doing so once again to recognize and  celebrate the great contributions of Filipino Americans to our country,  in government and law, music and entertainment, sports, business and  countless other ventures.", "title": "Recognizing Filipino American History Month", "date": null}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Speaker, I am pleased to be here today as we debate the first set  of Committee on Small Business bills.", "title": "Assisting Small Businesses Not Fraudsters Act", "date": "2025-02-24"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Velazquez), who is the distinguished ranking member of the  Small Business Committee.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "There are better ways to run  a business.", "title": "People, Not Statistics", "date": "2025-03-05"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "The regular meeting day of the Select Committee on       Intelligence for the transaction of Committee business shall       be every Tuesday of each month that the Senate is in session,       unless otherwise directed by the Chairman.", "title": "U.S. Senate Select Committee on Intelligence Rules of Procedure", "date": "2025-02-26"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Hoskins' daughters, Dudley Hoskins Bostic and Molly  Hoskins Scarbrough, who continue to lead the business today with the  same dedication and vision that their father demonstrated nearly a  century ago.", "title": "Recognizing Hoskins Drug Store's 95th Anniversary", "date": "2025-04-01"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "4366, the Save Local Business Act, under a closed rule; and H.R.", "title": "Providing for Consideration of H.R. Protecting Prudent Investment of Retirement Savings Act; Providing for Consideration of H.R. Flexibility for Workers Education Act; Providing for Consideration of H.R. Empowering Employer Child and Elder Care Solutions Act; Providing for Consideration of H.R. Tipped Employee Protection Act; and Providing for Consideration of H.R. Save Local Business Act", "date": "2026-01-13"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "They promote economic vitality, advocate for local  businesses, and offer critical resources such as training, marketing,  and networking.", "title": "Recognizing the Greater Hernando County Chamber of Commerce", "date": null}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "John went on to attend Manhattanville University earning his business  degree in 2023.", "title": "Recognizing Jim Monaghan", "date": "2026-01-08"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Following the passage of the GI Bill, Jim attended Kansas State  University, where he graduated with a bachelor's degree in business  administration.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Under Stan's leadership, the Moshannon Valley Economic Development  Partnership has developed two business parks, two multitenant  buildings, a revolving loan fund program, $2.9 million in housing  rehabilitation programs, and the Philipsburg Main Street Program.", "title": "-9999", "date": "2025-12-01"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Greg, the founder and CEO of Parker's Kitchen, has grown his business  from one store in 1976 to his 100th in a grand opening in April of  2025.", "title": "Congratulating Greg Parker, Retailer Executive of the Year", "date": "2025-06-10"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mayor Black leaves behind a strong foundation built on partnership  with an exceptional professional staff and the business community.", "title": "Recognizing Mayor David Black", "date": "2026-01-13"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Today, over 90 percent of initial public offerings are filed by EGCs,  but when an EGC spins off part of its business to create a new public  company, that spinoff does not currently get the same treatment,  despite originating  from a company already recognized as an emerging growth company.", "title": "Encouraging Local Emerging Ventures and Economic Growth Act of 2025", "date": "2025-06-23"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Does that give us a sense of just how addicted the  bureaucracies, the society, and the business models out there are to  U.S.", "title": "It's the Math", "date": "2025-04-07"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "I am also grateful to Chairman  Williams of the Committee on Small Business for working with me to  ensure that my community, El Paso County and Colorado Springs, isn't  swept up in the radical sanctuary policies coming out of Denver,  Colorado.", "title": "Save Sba From Sanctuary Cities Act of 2025", "date": "2025-06-05"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Casey Mulligan to be the Chief Counsel of the Office  of Advocacy at the Small Business Administration.", "title": "-9999", "date": "2025-07-31"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "(c) Effective Date of Proclamation.--A proclamation under       subsection (a) shall take effect not earlier than 2 business       days after the President submits to the Committee on Finance       of the Senate and the Committee on Ways and Means of the       House of Representatives a report on the proclamation and the       reasons for the modifications to the Harmonized Tariff       Schedule under the proclamation.", "title": "Haiti Economic Lift Program Extension Act", "date": "2026-01-12"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "That is because adopting the very technologies, the cures,  the things we can do, this army of lobbyists outside this door loses  their blanking minds because we are requiring them to either change  their business models or make the bureaucracy do it differently or  maybe come up with the conclusion we shouldn't do it at all.", "title": "Facing Fiscal Reality", "date": "2025-11-20"}]