[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…importance of getting capital to  our small businesses in rural areas.\n\nI strongly support this legislation, which would require the SEC's  Office of the Advocate for Small Business Capital Formation to report  on capital access issues faced by small, rural businesses.\n\nCurrently, the SEC small business advocate reports on small  businesses that are minority…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…together in a bipartisan way on behalf of  strengthening the SBA's flagship 7(a) loan program.\n\nFor too long, a few bad actors have damaged one of the most  successful small business capital access programs in the Federal  Government. By giving the SBA the tools and authority it needs, we can  root out bad behavior and minimize fraud without punishing loan…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691856/9999"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…public. This  is the very data that assists the agencies in carrying out their  missions.\n\nThis bill streamlines the ability of the SEC's Office of the Advocate  for Small Business Capital Formation to carry out its mission by  exempting it from the requirements of the act in the same way the SEC's  Office of the Investor Advocate is exempted. In effect,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693955/improving-access-to-small-business-information-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…important part in the reopening of Madera  Community Hospital.\n\nUnder Mr. Varney's direction and guidance, Madera County has seen  significant growth in revenue, housing and business. Capital  improvements flourished under his watch with the Madera County Justice  Center as well as Fire Station No. 3 and the upgrading of Fire Station  No. 11 through a cooperative,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…today in support of my bill, H.R.  3422, the Promoting Opportunities for Non-Traditional Capital Formation  Act. This bill deals with the Office of the Advocate for Small Business  Capital Formation, which is an independent SEC office that was  established to advance the interests of small businesses.\n\nThe office proactively works to identify and address…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692704/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Americans, small  businesses, and entrepreneurs a stronger voice at the SEC.\n\nH.R. 3351 offers a straightforward solution to empower the SEC's  Office of the Advocate for Small Business Capital Formation, the  advocate, making it a more effective champion for American  entrepreneurs.\n\nMr. Speaker, I also rise today in support of my bill, H.R. 3382, the  Small…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3422) to amend the Securities Exchange Act of 1934 to  require the Advocate for Small Business Capital Formation to provide  educational resources and host events to promote capital raising  options for traditionally underrepresented small businesses, and for  other purposes,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…but very real obstacles when trying to  raise capital.\n\nH.R. 1190 ensures that those voices aren't left out. The bill directs  the SEC's Office of the Advocate for Small Business Capital Formation  to proactively engage with rural communities, study the structural  funding gaps that they face, and tackle their challenges when crafting  policies.\n\nThis…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692759/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…idea into a reality.\n\nTo help with some of those challenges facing small businesses, the  Securities and Exchange Commission created an Office of the Advocate  for Small Business Capital Formation.\n\nEach year, the Office of the Advocate for Small Business Capital  Formation hosts events across the country, including California.\n\nThese events aim to support…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…manufacturing,  distilling, and real estate, and a primary driver in the success of all  of these businesses was access to capital.\n\nThe SEC's Office of the Advocate for Small Business Capital Formation  was created for just this reason: to identify capital access problems  that small businesses face. However, rural small businesses are  currently excluded from…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692758/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3351) to amend the Securities Exchange Act of 1934  to specify that actions of the Advocate for Small Business Capital  Formation are not a collection of information under the Paperwork  Reduction Act, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693954/improving-access-to-small-business-information-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…STUDY AND RULEMAKING.           (a) Study Required.--          (1) In general.--Beginning 5 years after the date of       enactment of this Act, the Advocate for Small Business       Capital Formation, in consultation with the Investor       Advocate, shall conduct a study on the effect of the       amendments made by section 2 on the businesses and startup…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}]