[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…want to make sure that the economic might of the United States of  America continues to lead the free world.\n\nWhile this Chamber may be largely empty because we remain very busy  in the Nation's Capital, and I do not expect my colleagues to listen to  me deliver such an address, Mr. Speaker, I do  dare say, Mr. Speaker, that this is something that we…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…this important broadcast system, so that people  know when they are in the region and can translate that communication,  so that air traffic controllers and other aircraft in a busy airspace  know when the military is there.\n\nWe know what happened when a Black Hawk involved in the January 29  collision wasn't actively transmitting its location. We know…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…facts that our critics never seem to       remember. When we took office in 1980, we faced a dusty shelf       of reports which pointed out our predecessors had been so       busy spending money on new lands for parks that they       seriously neglected basic upkeep of the magnificent parks we       had. So, we temporarily put off acquiring new parkland…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…dangerous pollution and are essential to fighting  the climate crisis.\n\nMake no mistake: That would have immediate impact for our  communities, for every family living near a busy highway, every child  using an inhaler, and every senior who can't go outside on a high  pollution day. This is a direct attack on over 50 years of precedent  that recognizes…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…coverage to pay the bills.\n\nThat is exactly what is happening right now. It is happening all  because this leadership here in this House refused to lift a finger.  They were too busy helping Big Banks, Big Oil, Big Tech, and whatever  billionaire needed a handout.\n\nThis Congress musters up the will to spend trillions of dollars on  tax breaks for billionaires…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…anonymous inbox, the  contents of which, as the ranking member articulated, we know virtually  nothing about, will do nothing to help small businesses.\n\nWhile the majority is busy claiming to fight bureaucracy by creating  new bureaucracy, they are ignoring the real crisis small businesses are  begging us to address: the looming lapse of the enhanced…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…pollution.\n\nRepublicans also don't want us to know that, while this bill gives  FERC more responsibilities that it cannot meet and does not want, the  Trump administration has been busy gutting the agencies that are  already working to ensure that we have a reliable grid.\n\nFor example, the Trump Department of Energy eliminated the Grid  Deployment Office last…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…colleague pointed out did pass in a  bipartisan way and now is in the Judiciary Committee.\n\nThe reason I am down here is not to drag my dear friend down here  because he is a busy man, and I wanted to go over to him before this  conversation started to apologize, but I needed to make this point on  the floor in this kind of standoff.\n\nHe is asking us…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…position for our auto industry  against China, which is already running ahead of us in the future  technology of electric vehicles; and worse health outcomes,  particularly in busy areas where there is lots of traffic--not to  mention having the majority of the country's economy overruled by a  minority of the country's economy, where the majority of the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…in the Scholastic  Independent division after earning a final and near-perfect score.\n\nThe WGI Championship was the final competition in the Matrix M3  percussion ensemble's busy season, after competing in seven different  contests across the Midwest. The group is a perfect example of why  Ohio's 13th Congressional District is known as the birthplace…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690946/congratulating-matrix-m3-indoor-percussion-ensemble"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the same  policy, is going to virtually double.\n\nI can tell you, this is a hard-working lady. I have come to know what  it means to be in your sixties and still working as a busy waitress in  a busy restaurant. It isn't easy, physically demanding. She has had  orthopedic surgeries and other problems occasioned by the fact that it  is just an act of life.…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…here to stop this big, ugly bill from moving to the Senate. If  Republicans have the courage of their convictions, then they will vote  ``no.''\n\nWhile Republican leadership is busy playing procedural games trying  to slip this through, let's talk about what they are attaching this  rewrite to.\n\nThe Republican rescission package is based on a scam, a con…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the brilliance of invention inside  our own borders, and we must never tie our future to imports or foreign  crude.\n\nThe good news is that our citizens and inventors have been busy  inventing our new energy future inside our borders right here at home.\n\nMr. President, if your staff allows you to watch this speech, I  personally invite you to join me with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…waivers--until now.\n\nMy Republican colleagues say this is about protecting consumer  choice. Well, let me ask: Who is really choosing this? Not the parents.  Not the residents near busy highways. Not the doctors and nurses. Not  even the drivers.\n\nIt is the polluters. This dependence on fossil fuels allows Big Oil  CEOs to turn drivers upside down at the pump…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…cut the cost of living.  Instead, he is cutting off part of the White House for his new  billionaires' ballroom.\n\nFamilies are missing car payments, but Donald Trump is too busy  building his ballroom to notice.\n\nThe price of coffee is up nearly 30 percent, but at least Donald  Trump will have a fancy, new ballroom in the White House. The price of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…remaining.\n\nMr. CRANE. Mr. Chairman, a vote against this amendment is a vote to  preserve the status quo, censorship, unrest, and erosion of our values.\n\nThe American people may be busy, but they are not stupid. With this  vote, they will see clearly who is fighting for them and who is not.\n\nMr. Chair, I urge my colleagues to vote ``yes,'' and I yield back…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…providers, and farmers and ranchers can all  count on Debbie to help them.\n\nToday is her last day as a full-time employee, but retirement for  Debbie doesn't mean an end to a busy and engaged life. She is  transitioning to more time in her favorite roles as wife, mother,  grandmother, and daughter. She will be spending far more time with  family while…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…avoid it is  because almost all this growth of this borrowing is interest and  Medicare. It turns out it is really not Republican or Democrat; it is  demographics. We are so busy trying to get elected next time, we need  something to blame them, and they want to blame us.\n\nIf you stand up here and try to actually fix problems, you will get  the crap…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…``yes'' on last week's CRA to halt the  Biden-era implementation of a natural gas tax that would harm our  Nation's energy producers and consumers.\n\nThe Democratic Party is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.  However, they have lost sight of the kitchen-table issues affecting…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Manhattan.  On that night, Sergeant Leap, along with Sergeant Carl Johnson,  responded to reports of an armed robbery and apprehended a suspect  after pursuing him on foot through busy traffic. During the struggle to  detain the suspect, the assailant fired a shot, wounding both  sergeants. Additional officers arrived on the scene, and working  together, they…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691041/recognizing-nypd-sergeant-christopher-e-leap"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to. They may not have children to devote time to.  They may be financially well enough off.\n\nYou very rarely see Thunberg syndrome on somebody who has three jobs.  They are busy with their life. They are going from job to job and  working all the time. You would rarely see Thunberg syndrome in, say,  somebody with four kids, because four kids is very…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, it has been a busy year here in the U.S.  Senate. The new Republican majority has been working hard to deliver on  our promises to the American people, and while there is still more to  accomplish,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…fires,  conducting search and rescue operations, responding to criminal  activity, and preventing vandalism and resource destruction.\n\nFor example, just over 1 year ago, on a busy Fourth of July weekend,  Yellowstone National Park law enforcement officers neutralized a  potential shooter headed toward a busy dining area in one of the most  popular areas…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…cosponsor of  the CLARITY Act, for 1 minute.\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, may I ask how much time is  remaining.\n\nMr. THOMPSON of Pennsylvania.  He is a very busy  man.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, it has been such an honor  to work with G.T., French, Angie, Don, Brian, and so many others on  something that is real.\n\nIt…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…during the voting  season. In addition to his volunteer work, his wife Phyllis, who is his  high school sweetheart of 50+ years, and his children and grandchildren  keep him busy.\n\nIt is clear Jerry Phillips has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…numbers drop so much, allowing our  law enforcement to go back.\n\nIf I can just make this one last statement: I won't ever forget  standing at that port, which is incredibly busy--lots of trucks coming  through, lots of Customs screenings and everything, all the things that  are happening--and I asked the Customs folks there: What has changed?\n\nThey…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Doug  LaMalfa.\n\nAs you know, Doug was a happy warrior who cared immensely about his  country, his State, and the people he served. A few years ago, he took  time out of his busy schedule to travel with me to Arizona to better  understand the border crisis and the serious impact it was having on my  State as well as his own. Doug was always willing to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698733/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…bureaucrats, and empower the American people?\n\nMr. ROY. I thank the gentleman for his time.\n\nMr. ROY. I wish him safe travel back to Missouri, and hopefully, next  week, we can get busy saving the American people from a broken  healthcare system.                       America Under Attack From Within\n\nMr. ROY. Mr. Speaker, I am going to take a few minutes in…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…recommit.\n\nMr. Speaker, Republicans are here in Washington this week to continue  to work on behalf of the American people. This is, in fact, Police  Week, but we have been busy this year, this Congress delivering for the  American people.\n\nIn this Congress so far, we have passed legislation to secure our  elections, H.R. 222, the SAVE Act; hold rogue…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…him  to wrap up so I could go to dinner. He was always there for me.\n\nTonight, we ran over time with the amount of people who wanted to  come and take time out of their very busy schedules to come and share a  brief message. They sat for an hour to spend 60 seconds to reflect on  your dad and your husband.\n\nI hope you can take from that some sense of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698670/protecting-healthcare-for-millions-of-americans"}]