[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Claire Bossong,       Scott Boswell, Taylor Bradley, Lindsay Brand, Matt Brennan,       Alyssa Bretan, Caroline Broom, Joseph Brown, Sarah Brown,       Alex Brunner, Britney Butler, John Byers, Larry Calhoun,       Jillian Cantrell, Molly Carpenter, Luke Catanzaro, Paloma       Chacon, Christy Charbonnet, Daniela Chirinos Vasquez, Peter       Chong, William…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President; Peter Burleigh. US       Ambassador, retired; Scott Busby, Former Deputy Assistant       Secretary of State; Prudence Bushnell, US Ambassador,       retired; John Butler, Rear Admiral, U.S. Navy, retired;       Constance Carrino, Senior Foreign Service Officer, USAID,       retired; Steven Cash, Former Senior Advisor, DHS, Former       Chief…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…such a vile act is the pervasive ugly rise in  political violence.\n\nWe have witnessed it in my home State of Pennsylvania with the  attempted assassination of Donald Trump in Butler; and, again, with the  arson attack on Governor Josh Shapiro's home on Passover with his  family sleeping upstairs; and again in Minnesota with the murder of  House Speaker…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Disability Information Network; The Door Legal Services       Center; The Law Office of Brett E Marston; The Law Office of       Elliot P. Forhan; The Law Office of Leslie A. Butler, PLLC;       The Law Office of Timothy J. Deffet; The Price Law Firm; The       Public Interest Law Project; The Right to Immigration       Institute; The Shattuck Law Office…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, today I rise to honor a lifetime of  service of one of my constituents, Colonel William Woodard Butler, the  2025 Veteran of the Year for Virginia's Fourth Congressional District.\n\nWith over 38 years of service between Active Duty and the Reserves,  Colonel Butler has devoted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…continue to inspire. While the media has often  ignored or misrepresented Black voices, thanks to leaders like Dr.  Pulliam, those voices are amplified and preserved.\n\nDr. John Butler, Boxing Champion: In 1953, Dr. Butler became the  first Grand Rapids boxer to win a National Golden Gloves title, an  accomplishment that cemented his legacy in the sport.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…draft of the Constitution gave Congress the power to ``make  war'' rather than to ``declare war.'' This was debated, and during the  debate over this, South Carolina's Pierce Butler rose to defend the  proposition that the new American Government should vest the war-making  powers with the President.\n\nSo this one man from South Carolina rose and said,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Jeffrey: New York Times; Burghardt, Peter: Sddeutsche       Zeitung; Burke, Melissa: Detroit News; Burley, Tahirah: New       York Times; Buskirk, Howard: Communications Daily; Butler,       Desmond: Washington Post.\n\nByrne, Maria: New York Times; Cameron, Christopher: New       York Times; Capaccio, Anthony: Bloomberg News; Capdepon       Sendra, Esteban:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…David Hershbine, Autumn Kerby, Andrew Kerby,       Isabella Russell\n\nAP: Elliott Lee\n\nAR: Daniel Bragg, Easton Everett, Braden Lisowe\n\nAZ: Metin Akkaya, Saraa Alshawa, Iris Butler, Joaquin       Galindo, Malaika Hayat, Daniel Johnson, Tessa Leon, Mckenna       Leon, Roshni Nagarakanti, Noureen Nakshbandi, Merissa Richey,       Nicole Spry, Yiyi Sun,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…reflected Bob's own gentle  strength.\n\nToday, we celebrate a life of service, music, and quiet devotion, a  life that touched all who knew him.\n\nRecognizing Chiefs of Police Robert Butler and Edward Kinney\n\nMr. MILLER of Ohio. Mr. Speaker, today, I rise to recognize two  individuals: Independence, Ohio Chief of Police Robert Butler, and  Medina, Ohio Chief of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…political violence is not the answer\n\nMr. JOYCE of Pennsylvania. Madam Speaker, this past weekend marked 1  year since the attempt on President Trump's life in Butler County,  Pennsylvania. While we thank God that President Trump's life was not  taken, we mourn the loss of an innocent father, firefighter, and proud  Pennsylvanian, Corey…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…train in  rural America, we know that they are more likely to stay in rural  America.\n\nFinally, I want to applaud the University of Dubuque for announcing  the John and Alice Butler College of Osteopathic Medicine. This will  help educate more doctors in the State of Iowa.\n\nWith all of these efforts, Iowa is set to continue leading in the  training of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690631/medical-student-match-day-achievement"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Julie Poole\n\nOffice of the CAO: Marcus Suydam, Shawn Sessoms, Steve       Hunter, Brandon Braxton, Andreal Little, Myrtle Norma, Carol       Swan, Richardo Underwood, Lisa Butler, George Vallandingham,       Alfonzo Wallace, Jamie Harvey\n\nOn behalf of the entire House community, I want to once again  congratulate, acknowledge, and thank these employees…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…used to sit up there, and she used  to watch me every day. She used to tell me every day: Randy, God has a  plan.\n\nNow, I believe that when Donald Trump's life was saved in Butler,  Pennsylvania, it was so that he could save the world. It is an honor of  a lifetime that God's plan for me is to come and help all of you  implement that plan.\n\nHowever,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…seven were Kansans.\n\nKiah Duggins, a civil rights attorney and a Wichita native, was set  to begin teaching at Howard University School of Law.\n\nLindsey Fields, a professor at Butler Community College and the  president-elect of the National Association of Biology Teachers, was  traveling to our Nation's Capital to advocate for the issues that  mattered…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…election to benefit Kamala Harris and to  harm President Trump, and it is the same Google that suppressed search  results of the attempted assassination of President Trump in Butler,  PA.\n\nBig Tech has waged a war on conservatives for too long. It is time  that the American people see accountability out of these platforms.", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Ava-joye: SCRIPPS NEWS; Burr, Thomas: NEXSTAR MEDIA GROUP;       Burton, Matthew: ABC NEWS; Bustamante, Jacob: CNN; Bustillo-      Martinez, Ximena: NATIONAL PUBLIC RADIO (NPR); Butler, Garry:       NATIONAL PUBLIC RADIO (NPR); Butler, James: DIVERSIFIED       COMMUNICATIONS, INC. (DCI); Butler, Norman: NBC NEWS; Cabral       Pichardo, Juan: CNN; Cadenhead,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  an outstanding group of students from Wellsboro, Pennsylvania.\n\nThe team from Rock L. Butler Middle School recently placed fifth in  the Nation in this year's Capitol Hill Challenge, a remarkable  achievement.\n\nThe 16-week financial education competition brings together…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692754/recognizing-rock-l-butler-middle-school"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate East Donegal  Township Manager Jeffrey Butler on his retirement.\n\nFor over four decades, Mr. Butler has dedicated himself to our  communities, both in the private sector and in the public sector. After  graduating from…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687958/congratulating-jeffrey-butler-on-his-retirement"}]