[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…in economic output, created 1.3 million jobs, and supported  more than $80 billion in wages alone. And this is part of a larger  pattern. The Bureau of Economic Analysis calculated that the economic  output of outdoor recreation in 2023 was over $1 trillion.\n\nIf the administration builds roads in these places, we not only lose  these experiences, but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…economic crisis that would be rolled upon States and rural areas and  communities and cities. It is a moral crisis that speaks to the soul of  our Nation.\n\nIt is a deliberate, calculated--and being calculated right now--it is  a deliberate and calculated attack on healthcare for Americans in  order, again, to give tax cuts to the wealthy.\n\nIf the enhanced…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…because of H.R. 1 is 10 million, 7.5 million people on  Medicaid and another 2 million people who get their insurance through  private health plans on the exchange.\n\nThey also calculated the debt impact in terms of H.R. 1 because of  the massive giveaway to billionaires and the top 1 percent of this  country. They determined that the bill is going to add…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…infinite numbers to the right of the decimal point and  there would be no pattern. This means we're down to a mere infinity  digits yet to be found. To date, it has been calculated to over 202  trillion digits. But there is still new math to be discovered. And  mathematics is critical to everything we do. It's the language of  science, engineering,…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Labor Department has finally dismantled decades of hard- fought protections for our communities. These rollbacks are not just  isolated attempts. They are part of a broader, calculated effort to  weaken the rights, safety, and dignity of America's workers in the  hopes that no one would notice.\n\nBut guess what, Mr. Speaker?\n\nWe have noticed. We will not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…government runs a surplus. When expenses exceed revenues, the  government runs a deficit.\n\nThe federal budget operates on a fiscal year, meaning surpluses and  deficits are calculated annually. When the government runs a deficit in  any given year, it must borrow money to cover the shortfall. This is  done primarily through issuing government bonds. Additionally,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…religious  organizations--Catholic, evangelical, Jewish--that have been doing this  work in many instances for more than a century, in  such an orchestrated, intentional, and calculated way as President  Trump.\n\nMatthew: ``I was a stranger and you welcomed me in. I was sick and  you cared for me. I was hungry and you fed me.'' This is a bedrock  belief of…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…libel, with respect to any  subject. It even means, according to the Supreme Court in the  Brandenburg decision in 1969, the ability to advocate violence except  in a manner calculated to induce immediate violence.\n\nWe forget the First Amendment at our peril. It is the keystone of our  liberties, and we almost disgraced ourselves by traducing it a few…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695637/first-amendment-is-keystone-of-our-liberties"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…I was anticipating that first check, I  multiplied the amount that I was making, $3.35 per hour, by the number  of hours that I expected to work during that pay period. I calculated  the total, and, Mr. Speaker, that money was already spent.\n\nI couldn't wait to go to Albee Square Mall in Brooklyn and get some  new sneakers so I could look fresh like…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…not me saying that. That is the Congressional Budget Office,  the neutral umpire that calls balls and strikes around this Congress  who is saying that.\n\nAgain, they have calculated that 15 million Americans will lose their  health insurance as a result of this measure which was passed by the  majority and jammed through in the dead of the night.\n\nIn…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…our economy.\n\nMr. WALBERG. Mr. Speaker, I would make mention that for gym  memberships offered by an employer and other benefits, health insurance  benefits, they aren't calculated in overtime either.\n\nThis brings us together on those issues. In fact, I believe it makes  certain that there is more opportunity for small businesses especially  to have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…even  for the many instances where officers were fired upon but, fortunately,  were not struck.\n\nMr. Speaker, ambush-style attacks are some of the most dangerous.  They are calculated and often deadly, leading to higher rates of both  injuries and fatalities. That is why I introduced this legislation to  ensure that we are doing all that we can at the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…explained why they chose to make  these tax credits expire. I am still waiting to hear the answer for  that.\n\nIn the meantime, we have our bill that will lower premiums,  calculated by CBO, in the individual market by 11 percent, as opposed  to the 5 percent that would happen if we just passed the enhanced tax  credits. Not just the 7 percent in the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…payable under section 3313(c) of this title, the educational       assistance payable to the individual under this chapter shall       be paid--\n\n``(A) in a lump sum calculated by multiplying--\n\n``(i) the total amount of contributions described in       paragraph (1)(A) with regards to such individual; and\n\n``(ii) the sum of the number of months…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…that follows       through the period at the end and inserting the following:       ``, commencing on January 1, 2026. The adjustment of the       Dollar Amounts shall be calculated by the Secretary using the       percentage change in the Price Deflator Index of Multifamily       Residential Units Under Construction released by the Bureau       of the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…obesity is the single biggest expense in our society. Yes, we are  not supposed to say that. Mr. Speaker, please don't tell anyone.\n\nLast year, the Joint Economic economists calculated $9.1 trillion  additional of healthcare spending. Is it moral with what we do in food  policy, nutritional support, how we deliver healthcare? Maybe the  concept of helping…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of all of what you think of  as government, nondefense discretionary, and you could get rid of all  of defense, and my math on the top of my head--I probably should have  calculated this before coming behind the microphone--you would still  need about another $400 billion to cover borrowing that covers  Medicare. Think about that.\n\nThere are those who…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…disrespect. A  Member once did this to President Obama. He apologized, and he was  reprimanded.\n\nI didn't hear an apology from Mr. Green right now. What I heard was  deliberate, calculated defiance.\n\nThe whole reason for this building to exist and the whole reason for  this House Chamber is to exchange our views, sometimes very sharply  different views, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688497/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually today. We are waiting for the update, but we  have done some back-of-the-board math. The math is much uglier because  interest rates are up substantially from when we calculated this 2  years ago.\n\nYou functionally have a country that--this one is from 2 years ago-- the 30-year debt, we were going to borrow $124 trillion. If you remove  Social Security…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "John Rose", "party": "Republican", "sentence": "…at so many military  installations.\n\nJanet Mello ruthlessly plundered more than $100 million from this  program meant to support the children of our military heroes. This  calculated betrayal was not only a staggering act of theft but a cruel  assault on the very families who sacrifice the most for our Nation's  freedom. By draining critical resources,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…who says: I saw on cable news this, so why don't you fix it? I say that  I would be happy to fix it, but realize that the Corporation for Public  Broadcasting--I think that calculated to paying for 2 hours, 15 minutes  of borrowing in an entire year.\n\nMr. Speaker, it is the lack of understanding of the scale of this  math. There is hope. There is a way…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "James Risch", "party": "Republican", "sentence": "…hates any kind of kinetic action but realizes that as  Commander in Chief he has to take them at times.\n\nThe President did take a single strike against Iran at carefully  calculated targets and in an even more carefully calculated time, much  like what he did with General Soleimani in his first term that was so  successful.\n\nThe strike on Iran was a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}]