[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…House think a war with Iran is a good idea. Let  them put a war authorization on the table. Let's debate that. Let's  debate that in front of Virginians and Kansans and Californians and  hear what our constituents have to say. Let's debate that in the full  view of people whose spouses are in the military or whose kids are in  the military. Let's have…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…way to go. This is why my California Democratic Caucus colleagues and I  are urging the Trump administration to deliver nearly $34 billion in  disaster funding to help Californians recover. This includes funding  that supports rebuilding homes and schools, restoring critical road and  water systems, reopening small businesses, and helping communities…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…it, is for one reason: to  make sure that the saltwater in the Pacific Ocean does not intrude far  enough into the estuary that the whole system that tens of millions of  Californians depend on and that all the farmers in my friend's district  depend on doesn't salt up and cease to function.\n\nThe Speaker doesn't have to believe me about it or choose between…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…enacted by the Biden  administration and House and Senate Democrats and instead continued  issuing subminimum wage certificates.\n\nReminder to people around the country and Californians: The Federal  minimum wage is $7.25. They were being paid below that.\n\nIn doing so, this administration is turning back the clock on  disability rights. Multiple States,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…actions again demonstrating that Donald Trump  and Republicans in Congress are stopping at nothing to attack  California for the audacity of working to protect the health of  Californians and for having the audacity to lead the clean energy  economy.\n\nBut as I have said repeatedly over the last couple of days, it is not  just what Donald Trump's EPA and Senate…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Allegheny-Blue Ridge Alliance       (ABRA); American Bird Conservancy; American Hunters &       Anglers; Big Mountain Dreams; BlueGreen Generation; Bolder       Options; Californians for Western Wilderness; Cascade Forest       Conservancy; Center for Biological Diversity; Change the       Chamber; Clean Water Action Minnesota; Colorado Mountain…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…live  with disabilities in their own communities and get the support, love,  and affection of those communities and their families.\n\nIn California alone, almost 15 million Californians are on Medicaid.  1,906,300 Californians on Medicaid have a disability. Of those, 992,000  people are working, aged 19 to 65. A million people in California with  disabilities…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…both in the effects it  will have on California and on this body--in California, in particular,  because it means that this Congress is abolishing the filibuster so  that Californians will have to breathe dirtier air. That is what this  is about. They want to abolish the filibuster so that polluters can  pollute more and Californians have to breathe dirtier…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…efforts to make our cars and trucks less fuel efficient.\n\nIndeed, it will also cost us in higher medical bills. The waiver for  the Advanced Clean Cars II rule will save  Californians some $13 billion in spending on healthcare for respiratory  ailments.\n\nThe health and cost benefits are even greater under the heavy-duty  truck regulations. In the heavy-…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Middle-class  Americans who are earning more than $62,000 are no longer eligible for  the Federal premium tax credits, doubling cancellations from 8 percent  to 16 percent.\n\nCalifornians are switching to bronze plans to save on premiums, but  these plans carry higher deductibles. For pregnancy care or cancer care  treatment, costs can more than double compared…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…California alone, that would include more than 7 million women.  This would force those women to pay $130 just to get the passport they  need to vote. With nearly a third of Californians lacking passports,  this bill would cost them more than $1.25 billion statewide.\n\nIf you have to pay to vote, that is called a poll tax, plain and  simple. It is also unnecessary…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…is not the mission of the  Marines. They aren't trained for this. Sending them on ICE raids will  only provoke confrontation.\n\nThe President is playing with the lives of Californians, and the  military is the pawn in his political game. He wants to create a  conflict that will allow him to invoke the Insurrection Act or martial  law--God only knows why--but…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692322/denouncing-ice-raids-in-southern-california"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…hardworking individuals who are in this country legally and providing  for their families so they, too, can have a chance at their American  Dream.\n\nI know California, and Californians are tough and resilient. Last  month, I met with Mariela from Panorama City. Mariela stepped up to  support her family and neighbors because street vendors like her mom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695175/happy-birthday-to-california"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…rejection of this  lawless and cruel regime. This cannot become the status quo. This  cannot become the new normal for America, for Alex Pretti and Renee  Good, for the Californians detained without cause and without  convictions, like those suffering in detentions facilities like  California City whom I met, along with Alex Padilla, last week.\n\nFor…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…procedurally--no amendments allowed,  very limited debate.\n\nColleagues, as I said here yesterday, it is not just the ``why''  Republicans are willing to endanger the health of Californians, it is  also the ``how'' they are doing it that is threatening.\n\nA bit of history. In 1967, the Clean Air Act passed this body under  regular order by a vote of 88 to 12.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…served in a variety of roles for  three separate Members: Representatives Bill Thomas, Kevin McCarthy,  and Vince Fong.\n\nHis unwavering dedication in service to countless Californians over  his 25 years in the people's House is extremely admirable, and I know  there are many other people who agree.\n\nThis institution and the world needs more people like…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688721/recognizing-james-min-after-25-remarkable-years-of-service"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…explicitly partisan  goals and zero public input. It is one that tears communities apart  while doing special favors to Sacramento insiders.\n\nDo the voters want this? Do Californians want to overturn everything  they had previously voted for? Emphatically they do not.\n\nPolling shows that two-thirds of voters, an overwhelming majority of  Democrats, Republicans,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…transportation dollars where they are needed: toward  improving our roads, repairing potholes, alleviating traffic, on things  that will actually benefit the quality of life for Californians.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, Californians could soon be  paying over $8 a gallon for gasoline. That is the result of the  disastrous policies that have been imposed by Gavin Newsom and the  California Legislature's…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…into the most popular State to leave.\n\nWe have a Governor who believes that because he has a supermajority  in the legislature, he can run roughshod over the rights of  Californians and continue to cause the quality of life in our State to  decline.\n\nHere in Congress, we have tools to fight back. I set out at the  beginning of this year to use whatever…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…comprehensive review to see just  how staggering the problem is, just how many tens of billions of  dollars our citizens are losing. Maybe that would be a better way to  give Californians a higher return on their investments.\n\nRather than increasing the budget to $349 billion, rather than  imposing an absolutely ruinous wealth tax that will give our State…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…has repeatedly chosen to decouple from Federal tax relief, denying  hardworking families and small businesses much-needed breathing room  after years of Bidenflation.\n\nCalifornians are struggling with some of the highest taxes and cost  of living in the Nation and are getting no relief from Governor Newsom  and Democrats in Sacramento.\n\nMr. Speaker,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699679/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…go where they are needed when it comes to transportation  and that is to improve our failing roads, to alleviate traffic, and to  actually improve the quality of life for Californians.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699380/no-more-tax-dollars-for-californias-high-speed-rail"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. I have good news for Californians. Today is  the beginning of the end of high-speed rail, the biggest public  infrastructure disaster in U.S. history.\n\nA few months ago, I joined Secretary of Transportation…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691937/high-speed-rail-in-california"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…bear the financial  burden of Biden's border crisis. Texas taxpayers have to shell out  $8.88 billion a year to pay for the illegal aliens who invaded their  State. For Californians, it is almost $22 billion.\n\nBy the way, fact number five, in some States, in a complete affront  to citizens, illegal aliens can get mortgages, bank loans, insurance,  driver's…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…proud sponsor of this bill, H.J. Res. 89, but  also as a proud Californian.\n\nThis bill would overturn the EPA's waiver granting California the  ability to decide for all Californians what cars they drive and what  trucks they use to deliver their goods.\n\nThis waiver was granted in the waning moments of the Biden  administration, and I believe it was…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…said that the  Governor's refusal to fund Prop 36 is ``a joke.'' This is coming from a  fellow Democrat mayor in California. Newsom's refusal to fund the  initiative that Californians passed is a joke.\n\nHe doesn't have the money for it, I guess, even though he does have  $200 to $250 million to call an off-year special election in order to  return us…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "John James", "party": "Republican", "sentence": "…of the  entire trucking industry in Michigan and the United States. Does anyone  in this Chamber actually believe that this is the United States of  California? Perhaps Californians do, but in Michigan we do not want to  be dictated by Sacramento. There are about 49 other States that would  agree.\n\nGavin Newsom may be content with being the number one…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…under the Congressional Review Act to  reverse California's ban on gas-powered vehicles, to stop a single  individual, Gavin Newsom, from dictating what tens of millions of  Californians and other Americans are allowed to drive.\n\nMadam Speaker, let me tell you where this ban came from. It was  September 23, 2020. California was in the throes of the worst…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…from its purpose of protecting the coast.\n\nFrom blocking SpaceX launches to obstructing fire prevention  projects, the commission has repeatedly threatened the safety of  Californians and weakened our national defense, while  needlessly undercutting innovation and economic progress.\n\nThe need to rein the commission in has now become urgent as we face…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]