[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…Chief Rodriguez was brought to the United States when he was 4 years  old as an undocumented immigrant. He got his opportunity at the  American Dream thanks to former California Governor and Republican  President Ronald Reagan. He then served our country in the marines for  6 years through two wars.\n\nToday, Chief Rodriguez is our Santa Ana chief of police.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…followed here, but  simply didn't want to.\n\nThe third avenue that they could have undertaken was to go talk to  California. This is California's waiver. Last I heard, California had a  Governor. Last I heard, the United States has a President. They could  talk. They could invite the fossil fuel industry into the room. They  could invite the auto industry…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…lap around the track at school and your  chest would burn. We can't go back to those days.\n\nWhen President Richard Nixon signed the Federal Clean Air Act in  1970, California, under Governor Ronald Reagan, was given a waiver,  letting us set stricter air pollution rules than the Federal  Government.\n\nOver the years, Republican and Democratic leaders alike,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690620/clean-air-isnt-a-partisan-issue"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Speaker, a column from The Washington Post.  This story from The Washington Post is dated June 9, 2025. It reads as  follows. This is the style of the story. It reads: ``California  Governor Gavin Newsom says Trump is stepping toward authoritarianism.''\n\nAn excerpt from the actual story reads: California Governor Gavin  Newsom should be arrested.\n\nThis is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Los Angeles to  justify and legitimize Donald Trump's dangerous decision to deploy the  National Guard and U.S. Marines on American soil, all without the  consent of California's Governor or a request from local leaders and  law enforcement.\n\nThat is why I worked with Representative Zoe Lofgren to introduce a  resolution that condemns violence, supports…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…disastrous experiment, yet  when Governor Newsom was asked, he said that rolling back this policy  was ``not on my docket.'' Let's be very clear: Saving Medicaid in  California is not on Governor Newsom's docket.\n\nFortunately, we are fighting back and looking to take measures here  that will ensure that tax dollars of Californians are reserved to  provide…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…all of our property taxes  and income taxes were tax deductible so we could raise taxes.\n\nI am sure right now, particularly in the more liberal States--places  like California with Governor Newsom, places like New York--the  Governors and State legislators are waiting to see if they can increase  the deduction for State income taxes and for local property…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…criminal activity, like retail theft,  and to get treatment for folks who have repeated drug offenses. The  Governor opposed this effort to make crime illegal again in California.\n\nThe Governor's first attempt to undermine this voter-qualified  citizen initiative was what was called a poison pill. The scheme went  like this: Newsom had the legislature pass…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…``threat'' to  the public, called ICE reckless, suggested the State is at war with  Federal officers and under attack by ICE, and smeared ICE as the  ``modern-day Gestapo.''\n\nCalifornia Governor Gavin Newsom likened ICE to ``secret police,''  calling them authoritarian, and calling on the people to push back.\n\nIllinois Governor JB Pritzker claimed ICE is turning…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the  country has been shocked by the horrifying images coming out of Los  Angeles, but what is also shocking are the brazenly false statements  made by the Governor of California.\n\nGovernor Newsom has asked us not to believe our eyes, not to believe  the scenes that we are all seeing of officers being attacked, of cars  being lit on fire, of roadways being…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692292/controlling-riots-in-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, the moment of reckoning for  California Governor Gavin Newsom has arrived. While I have been  fighting to protect Medicaid benefits for Californians, the Governor's  irresponsible actions are now threatening deep cuts…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691000/protecting-medicaid-benefits-in-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…courses has gone from 1 out of every 100 to 1 out  of every 8.\n\nThis truly jarring state of affairs comes in spite of a massive  increase in education funding in California. Indeed, since Governor  Newsom came into office, the overall education budget has increased by  almost $40 billion. Yet, what is the outcome of that? We have students  at a fairly selective…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…bipartisan support throughout the process.               Protecting Women and Girl's Sports in California\n\nMr. KILEY of California. Mr. Speaker, today, I am calling on  California Governor Gavin Newsom to immediately issue an executive  order to protect women and girls sports in California and ask the  legislature for legislation codifying in law that…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, yesterday California Governor  Gavin Newsom finally backed down from his irresponsible, reckless  policy of providing full-scope Medicaid, Medi-Cal coverage to every  person who is income eligible…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}]