[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the United States, Donald J. Trump--I know it pains my colleagues to  say that, ``President of the United States Donald J. Trump''--for his  decisive action. I thank him for calling both sides out on the cease- fire.\n\nI point out to my colleagues on the other side of the aisle that, as  of right now, the cease-fire is holding, and most of the world wants…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I am proud to reintroduce the Justice for  Shireen Act today. I thank my House Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of Defense and  Director of National Intelligence, on the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…talks.\n\nWe know now why he threw a fit and acted so defensively--because,  sadly, we may well have been right. Donald Trump and Kristi Noem have  spent months attacking FEMA, calling for its elimination, slashing its  budget, and hollowing out its workforce. And, now, their own chaos is  catching up with them in the worst, worst way.\n\nNow, they are trying…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to stop rolling over for  Donald Trump. Their constituents, as well as ours, are affected by this  delay in providing affordable health insurance. For months we have been  calling attention to the need to act now, and this shutdown was  avoidable. The path to stopping it was available. And shortening it,  assuming it will occur, is still a possibility,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…absurd. It is unserious, ineffective, and beneath the  dignity of this institution.\n\nChanging the name of the Gulf of Mexico won't change the fact that  the world will keep calling it exactly what it is, the Gulf of Mexico.\n\nThis isn't just about a name. It is about an administration using the  power of the Federal Government to bully the press, going…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690943/gulf-of-america-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…are going to hurt even more.\n\nI sure hope that people out there are paying attention. Call the  people who represent you. Tell them what your fears are. I know people  are calling me, and I am standing up here to appeal to my Republican  colleagues and let the American people know what is going on right now,  why they should be concerned.\n\nThis is a…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…corruption of DHS's mission has directly contributed to the  chaos and violence we have seen in Minneapolis and communities all  across our country. That is why Senate Democrats are calling for  commonsense reforms--reforms like ensuring DHS officers wear clear  identification so people know who they are dealing with in law  enforcement and can hold them accountable;…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "Mr. GALLEGO. Mr. President, last week, I stood here and introduced a  simple resolution calling on the Justice Department to release the  Epstein files, but a Republican Senator blocked it.\n\nIn the week since, even more damning information has come out, and  now we know…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…solve.\n\nThe burden should not and cannot fall entirely on us, but leadership  comes with a responsibility. We have the responsibility to continue to  do our part. The moment is calling us.\n\nOnce again, I will rise in this Chamber every single day until the  administration does what it says it is going to do and continues  funding ready-to-use therapeutic…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…prosecutions for this fraud began in 2022  during the previous Biden administration.\n\nThe administration says their immigration policies are intended to  protect America. I am calling their bluff. What they have done instead  is to effectively halt legal immigration for a long list of countries,  all of which have majority non-White populations. This was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…citizens are deported, when the budget resolution calls for the largest  proposed cut to Medicaid ever, surely, we can say these things are  wrong, no?\n\nThe American people are calling for leadership. They are calling for  solutions to help them afford basic necessities. They want to be able  to tell their loved ones it is going to be okay, but they are…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…further laid out his fascist vision for the Department of Justice.\n\nHe has targeted watchdog organizations like the Citizens for  Responsibility and Ethics in Washington, calling them scum, and  independent media outlets, like CNN and MSNBC, labeling them as  organizations that ``literally write 97.6 percent bad about me,'' are  political arms of the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Undermine Separation of Powers\n\nMr. MENENDEZ. Mr. Speaker, in recent weeks, the Trump administration  and House Republicans have set their sights on the Federal judiciary,  calling for unprecedented changes to our courts, attacking the  character of dedicated Federal judges, and attempting to undermine the  separation of powers that has upheld our democracy…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…from government services to  the American people, including education, all to pay for tax cuts for  the richest Americans and Big Business.\n\nIn the Senate, the Republicans are calling for an unspecified $9  trillion in cuts. In the House, the Education and Workforce Committee  must provide a minimum of $330 billion in cuts from education and job  training…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…wrongfully  imprison and charge protesters.\n\nThe Georgian people have protested for over 150 consecutive days and  are still protesting today, especially on Sundays. They are calling for  free and fair elections and the release of political prisoners.\n\nThe United States has long supported freedom in Georgia and now is no  different. The MEGOBARI Act is…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…man. He and his  wife, Katie, have three sons, all of whom graduated from Royse City  ISD. Throughout their time in the district, Mr. Branch has been a  constant presence--calling football games on NFHS, helping set up the  run-through for varsity football games, preparing pre-game meals,  coaching youth football, and later volunteering as an announcer…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…to recognize the Monster  Energy American Motocross professional supercross racer Aaron  Plessinger on his remarkable victory and his second career win under  what many are calling the worst conditions in track history this year.\n\nThis wasn't just a race. It was a test of endurance, resilience, and  unwavering determination. In the face of deep ruts,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689821/congratulating-supercross-rider-aaron-plessinger"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…joined the Jones County  Sheriff's Emergency Operation Center, working as a dispatcher,  operations officer, reserve deputy, and canine deputy.\n\nIn 2005, Paul continued his calling at MEMA as an area coordinator,  serving for 11 years in that role. During that time, he and his wife,  Traci, whom he married in 1999, welcomed their son, Caleb, through…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697326/recognizing-paul-sheffield"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Epstein's victims, not  political points.\n\nMr. Speaker,\n\nMr. Speaker, those of us who did not sign the discharge petition are  just as concerned about the victims or, as some are calling them,  survivors as our colleagues who signed the discharge petition.\n\nWe share contempt for anyone who abused anyone else. I have stood on  this floor many times, Mr. Speaker,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Services running smoothly, not just during the holidays but  all year round. She embodies the four key values of Metro's culture,  including: Character, Chemistry, Competency, and Calling.\n\nIt is clear Judy Salvador has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690992/recognizing-judy-salvador"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…delays, and made  it harder for law enforcement agencies to access less-than-lethal tools  designed to specifically de-escalate situations and to save lives.\n\nDemocrats are calling that clarity a loophole. In reality, the only  thing that this bill closes is the gap between outdated law and modern  policing. Instead of supporting officers who want safer…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…powered our homes, and  helped build the greatest economy this world has ever known. It is  ridiculous to neglect this.\n\nI feel today is a Paul Revere moment, where we are calling to  everyone to realize that the meltdown is coming. What I mean by that is  the grid is going to melt down. Simply, all one has to do is go back in  time three Christmases…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…against ICE agents. This string of threats is a result of  months of violent rhetoric coming from the other side of the aisle.  Whether in political office or in the media, calling for violence  against law enforcement is simply unacceptable.\n\nWhile a small group of people call for this violence, I know that the  American people which overwhelmingly…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Officer of Patrol Squadron VP-10 of the United  States Navy, also known as the Red Lancers.\n\nWhen it comes to leadership in the Navy, it's more than just a title.  It is a calling, a duty, and a profound responsibility. It requires  vision, dedication, and commitment to those who serve. Commander  Russell has already demonstrated these qualities in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia Hospital Association.\n\nThis award honors physicians who give their time and expertise to  strengthen their institutions and improve lives. Dr. Connelly embodies  that calling through his commitment to patient care and medical  education.\n\nIn addition to serving patients, he plays a vital role as the  associate program director for Memorial's internal…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699008/dr-tim-connelly-receives-2025-georgia-physician-hero-award"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…awards to female athletes who are unjustly deprived; and  issue those athletes an apology.\n\nThis will simply restore fairness, common sense, and sanity in  California. I am calling on California's political leaders to comply  with these conditions immediately.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692907/warning-californias-political-leadership"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Services running smoothly, not just during the holidays but  all year round. She embodies the four key values of Metro's culture,  including: Character, Chemistry, Competency, and Calling.\n\nIt is clear Ellen Tantillo has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690680/recognizing-ellen-tantillo"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…strongly urge the current  FBI and intelligence community leadership to aggressively investigate  those evacuees who require it and bring these matters to a close.\n\nI am also calling on the Trump administration to ensure that its  findings are declassified to the fullest extent possible. Why? Because  the public has a right to be made aware--in fact, fully…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693254/afghan-evacuees"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…his memory as we  share this.\n\nWe have a lot of folks who want to share a message, and we are going  to kick it right off. I am just going to go around the room and start  calling on people as we move forward.\n\nWe are going to first hear, of course, from the California  delegation.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman for his  remarks.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…service, this  dynamic Army Veteran duo continues to embody the very best of the  American Red Cross. After a lifetime of service in the military, they  chose to extend that calling with the American Red Cross for the last  five years--and we are truly grateful. Every day, they give their time,  energy, and hearts to advance the mission of the organization.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}]