[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…stipulated that it must be  used for specific stated purposes or ownership would revert back to the  United States.\n\nLands with reversionary interests like these have what is called a  clouded title, which limits allowable uses and development. In this  case, the reversionary interests originate from the initial conveyance  that provided public land for…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691118/reversionary-interest-conveyance-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…planning out are we going to get to go on a  babymoon before she arrives. I woke up the next morning, and my  placenta ruptured. I started bleeding. I was panicked. My husband  called the ambulance. He said I was as white as this piece of paper.\n\nWe rushed to the hospital, and I remember hearing the doctor in the  emergency room saying that everything looked…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in ICE and end the  violence. Now, it is the House's turn to do its job, but a band of MAGA  radicals want to highjack government funding to push an outlandishly  toxic bill called the SAVE Act that would disenfranchise millions of  American citizens.\n\nJust a few hours ago, Donald Trump said he wants to nationalize  elections around the country. That…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699484/government-funding"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and the community of African  descent in Akron, Summit County, and surrounding areas.\n\nFive years ago, the Akron Rites of Passage Institute introduced a  community initiative called the Legacy Building Project to support the  ongoing growth, development, and long-term sustainability of the  African American community.\n\nTerrence Shelton, a co-chair of the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Vought blatantly defunded Army Corps construction  projects in blue States like Washington and California and steered  hundreds of millions of dollars to red States instead. I called that  out for what it was--a politically motivated abuse of power that was  only possible because we were operating under a slush fund, full-year  CR.\n\nThis year, we made sure…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Pacific Air Forces and later the  first Black Chief of Staff.\n\nWhat is woke about being a commander of the Pacific Air Forces?\n\nNone of the other commanders before him were called woke. They were  all called commanders.\n\nSo why was he called woke and fired?\n\nWell, Mr. Speaker, I think you know why.\n\nIn March 2025, part of Project 2025, Arlington National…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…just point out that the University of Kansas  teaches climate science. The University of Kansas teaches climate  science. It even teaches about this stuff. It has a course called  ``Anti-Environmentalism and Climate Change Denial in America,'' in  addition to a ``Climate and Climate Change'' course, a ``Climate Change  and Hazards Planning'' course,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…independent from political pressure, insulated  from partisanship, and rooted in data and discipline.\n\nWhen I first came to Congress, Mr. Speaker, I was a member of what  was then called the Banking, Housing, and Urban Affairs Committee, now  the Financial Services Committee. At that committee, as it is today  under the new name, we heard from the Chair of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the local legislature, the Council, has 13  members. If D.C. residents do not like how members vote, residents can  vote them out of office or pass a ballot measure. That is called  democracy.\n\nCongress has 535 voting Members. None are elected by D.C. residents.  If D.C. residents do not like how Members vote on local D.C. matters,  residents cannot vote…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…public service each year. Additionally, the Commission set targets  for ensuring there are more than enough qualified individuals seeking  to serve in the Armed Forces, and it called for modernizing government  personnel systems to attract and enable Americans with critical skills  to enter public service. The Unity through Service Act would help to  implement…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Revolutionary War.\n\nThat painting, Mr. Speaker, is a testament to a man who so eagerly  relinquished his power and who only reluctantly reclaimed it when the  American people called him to serve as their first President.\n\nIt is a symbol of the peaceful transition of power upon which our  democracy depends.\n\nMr. Speaker, 5 years ago today, that painting…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…in 2001. It is time to finish what we started.\n\nWe are speaking of a family that didn't merely participate in the  American experiment but helped define it. Thomas Jefferson called John  Adams the Colossus of Independence, and his thoughts on government  frame the very Constitution we swear to uphold every day we report to  work here in our Nation's Capitol.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697632/adams-memorial-great-american-heroes-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in Alabama, Kansas, Louisiana, Oklahoma--will be  unable to pursue more cures. Our hospitals, already scaling back  operations thanks to budget cuts and the President's so-called ``Big  Beautiful Budget Bill,'' will be forced to diminish services even more.\n\nThe scientists and doctors of tomorrow may decide to forego their  profession entirely or bring…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…to feed their families.\n\nThese are real people who come to my townhalls, who write to us, and  who call my office. They are real people like Aneliese, a single  mother, who called our office urging us through tears to protect SNAP,  saying: I will have no way to feed my child. I am extremely stressed  out, and if they cut food stamps, I don't know what…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691411/gop-tax-scam-hurts-women-and-families"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…rare spectacled eiders nesting on  the Coastal Plain.\n\nIn fact, the Arctic Refuge is home to hundreds of iconic wildlife  species, including 200 species of birds that have called this landscape  home since long before humans stepped on this continent.\n\nSimply put, the Arctic Refuge is the crown jewel of the American  National Wildlife Refuge System,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…steadfast commitment to defending our  homeland. From the Revolutionary War to the present, our marines have  demonstrated outstanding courage wherever and whenever they are called  to serve.\n\nI encourage my colleagues to join me as we honor those currently  serving in or retired from our uniformed services and commemorate those  who gave the last measure…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698198/recognizing-veterans-day"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…comply often underreport.\n\nInvestigations by the Trump administration discovered that there was  $6.5 billion in previously undisclosed gifts and contributions provided  to so-called elite colleges, and this money came from countries that  pose serious national security threats to our country.\n\nIn 2020, the Department estimated that schools had anonymously…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…implementing the Democrats'  natural gas tax that the Biden administration finalized late last year.\n\nCongressional Democrats and President Biden mandated this new tax  under the so-called Inflation Reduction Act, which was, of course, the  Inflation Acceleration Act, taking inflation all the way up to 9  percent. The Environmental Protection Agency issued its…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…flag, the flag we  all honor as American patriots? The one thing that we know about the  Pride flag is that it represents only one portion of those who serve.  That is not called inclusivity, sir. That is called division. That is  why for the first time since the previous administration took over, we  have actually hit our recruitment numbers in every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…approval  for a proposition our voters strongly oppose, the Governor has resorted  to two strategies: disenfranchising voters and defrauding them.\n\nFirst, the Governor has called a sudden, impromptu, off-year, low- turnout special election, asking a partial electorate to overturn the  will of our full electorate. To further suppress voter participation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "John Thune", "party": "Republican", "sentence": "…they were enacted in 2021. Now, in 2021, as most people remember,  we were kind of past the pandemic, and that particular legislation, the  Inflation Reduction Act--the so-called Inflation Reduction Act,  obviously not the case--passed in August of 2021. We were well past the  pandemic, but it gave the Democrats an excuse to put more Federal money…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…this position, he saw an opportunity to strengthen  Congress's Article I obligations and create positive and lasting  institutional change. The Select Committee had what Derek called  ``squeaky wheel authority'' to call attention to longstanding problems  and challenges for the House, and he used that authority to  relentlessly pursue solutions. His insistence…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…micromanage Israel's  operations and even interfere with Israeli politics. And at every turn,  the progressive left and isolationist right hyperventilated about the  specter of so-called forever war.\n\nFortunately, Israel held its ground. Israelis certainly weren't  enthused about a ground war in Gaza. Their leaders knew that war would  be difficult. But they…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the  legislature for legislation codifying in law that men shall never  compete in women's sports in California again.\n\nToday, the Governor, on his newly established podcast called ``This  is Gavin Newsom,'' came out with a statement that surprised many on  this topic. He said that when it comes to men competing in women's  sports, he said: ``I think…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…care reduced emergency room services.\n\nNonetheless, the Biden administration in the use of 1115 waiver  authorities put forth new guidance that allowed States to rely on so- called hypothetical expenditures that let States spend Medicaid dollars  on services that were over budget and unrelated to the core functions  of the Medicaid program.\n\nSome examples…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…S. 2125 ``evidences more support       for conservation in Arkansas than Anthony, Alexander and       Hammerschmidt.'' The Pine Bluff Commercial Appeal in an       editorial called ``Tower of Strength'' demonstrated powerful       support for the State's tourism resources by saying, ``Let's       not skimp when it comes to saving something so valuable--and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…door. I am proud that House Republicans and President Trump  have the opportunity to right this egregious wrong implemented under  the Biden administration.\n\nThese shouldn't be called fees. They should be called insurance for  our constituents.\n\nMr. Speaker, I urge my colleagues to support this resolution.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689852/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…of terror that has  gone on now for decades.\n\nTwice before, Iranians were on the verge of overthrowing this regime.  In 2009, as Iranians took to the streets during the so-called Green  Movement, they looked to the United States for support but got only  silence. In 2016, the American Government sent $1.7 billion in cash to  the mullahs on shrink-wrapped…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, many times, under both Republicans and  Democrats, I have come to the Senate floor to raise concerns and  warnings about how immigrant children called unaccompanied children are  handled by Republican and Democrat Departments of Health and Human  Services. When immigration people don't have the capabilities or  probably the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…accountable through disciplinary procedures or  performance management processes.\n\nI urge my colleagues to buck Federal union bosses. Put Americans  first and oppose the so-called Protect America's Workforce Act.\n\nGeneral Leave\n\nMr. COMER. Mr. Speaker, that was a long minute for the leader of the  Democratic Party to advocate for more work-from-home…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}]