[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…murdered in 6  weeks alone.\n\nThe so-called Gaza Humanitarian Foundation, backed by the Israeli  Government and the Trump administration, is a deadly sham. The United  Nations calls it a death trap.\n\nThe Israeli soldiers have even admitted it themselves. They were  ordered to deliberately shoot unarmed Palestinians, many of them  children, calling it a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693848/starvation-in-gaza"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…which the gentleman does not share, even though  Erie, Pennsylvania, will benefit, assuming the commission can be stood  up. Maybe our Vice President can help us with that. He calls Ohio his  home, though he does not come from the Great Lakes region of Ohio.\n\nMr. Chair, if you look around our country, for many, many years my  part of America lost jobs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…instead, focus our attention on responding to  the actual crisis at SAMHSA.\n\nLet's stop this performance. Instead, let's do the right thing and  walk out right now and meet, make calls, and work together to stop this  madness. Let's actually do something to meet this moment before it is  too late and we no longer have an agency focused on behavioral health.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…House is supposed to be.\n\nFarmers are going bankrupt, but Trump is too worried about the  construction of his ballroom to help.\n\nThe cost of baby strollers--or, as Donald Trump calls them, the  things you carry babies around in--those are going up, but Trump is too  busy building his fancy ballroom to notice.\n\nSo my friend Jeff Merkley is exactly right.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…number of those events, in Mansfield, Colchester, and Old  Saybrook, Connecticut, with very packed rooms. The issue that was of  most concern was H.R. 1, what President Trump calls the one big,  beautiful bill.\n\nWhile Congress was away, the Congressional Budget Office had a chance  to finally zero in on final numbers in terms of the impact of H.R. 1,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…move forward with some pace, we  accommodated that.\n\nI thought, Great. We are trending well. We are going to wake up in  the morning; we are going to get on some conference calls; and we are  going to see whether there is a pathway.\n\nI don't know whether there would have been a pathway, but I know  today that the majority party in the U.S. Senate decided…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…care.\n\nHowever, when they move outside the VA network, problems start to  pile up. Records don't transfer and systems don't update with the  latest data. That means more phone calls, more waiting, more back and  forth, more frustrations.\n\nWomen veterans and their families could be using this energy and time  on their treatment and their journey to recovery.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695418/women-veterans-cancer-care-coordination-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…are meritorious; and the contention       that a constitutional amendment is required to admit the       Commonwealth into the Union is incorrect. The D.C. Admission       Act calls for a proper exercise of Congress' express       authority under the Constitution to admit new states, a power       that it has exercised 37 other times since the Constitution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…of these cuts, the administration should be strengthening  efforts to address forced organ harvesting and trafficking.\n\nH.R. 1503 shines a light on this horrible practice and calls on the  State Department to make its annual reporting on the issue more robust  and more in-depth. Not only does it call for more regular assessments  of the problem, it also…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…have right now is reality.\n\nThen he said to me: Do the Republicans you work with know that they  can get cancer, too? Are any of them going to stand up? Don't they get  these calls from their constituents? Why don't they care?\n\nI see them all looking away. How would you have me answer that  question?\n\nI tried. I did my best to explain the psychology of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690445/nih-cuts-affecting-cancer-patients"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, Rabbi Abraham Heschel once sent a telegram  to John F. Kennedy. Referring to racism in this country, he said: ``The  hour calls for moral grandeur and spiritual audacity.''\n\nNow, 62 years later, we see the excessive brutality of ICE agents.  Peaceful protesters are tear-gassed in the face. A pastor…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698887/be-the-voice-of-moral-grandeur-and-spiritual-audacity"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…of the strong civilian workforce that  our national security, veterans, and communities across this country  rely on.\n\nMs. TOKUDA. Our Hawaii Government Employees Association calls the  President's action a direct attack on working Americans. That is why I  stand firmly with our union ``ohana'' ``family'' across the country in  rejecting these union-busting…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697988/protect-americas-workforce-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…decision to end TPS would be a devastating       disruption to the social and economic fabric of our city.\n\nIn recent weeks and months, my office has been inundated       with calls, emails, and walk-ins from constituents who are       afraid, confused, and desperate for guidance regarding TPS.       They are asking about legal resources, immigration attorneys,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…forcing out  tens of thousands of people who worked for the government--many of them  doing the science and tech work that I just talked about--the  Democratic staff report calls it: The $21 billion blunder, analyzing  the waste generated by DOGE.\n\nDOGE didn't focus only on science and tech, but its impact has been  resonating there for sure in a very…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…stronger. It increases uncertainty. It fuels worst-case assumptions and  raises the risk of a dangerous miscalculation.\n\nThat is why I am proud to be leading H. Res. 100, which calls on both  Russia and the United States to continue abiding by the numerical  limits set under New START, even in the absence of a successor treaty.\n\nI thank the 24 Members of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…Subcommittee on the National Intelligence Enterprise.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I thank the chairman.\n\nMr. Speaker, I have, as other Members, gotten a number of calls over  the last couple of days about whether or not I think the President did  the right thing or not. I will read this to you: ``. . . President of  the United States of America,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…communities seem to be dominating news headlines, Patriarch  Bartholomew presents an alternate vision: ``War in the name of religion  is war against religion,'' he tells us. He calls on people of faith of  all traditions to be ``peacemakers'' and protectors of the Earth.\n\nThere are thousands of Greek-Americans living in Arizona's 8th  Congressional District,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…and as  responsible as the predators who created them.\n\nI am talking to Snapchat, to Instagram, and to TikTok. All of them  will have to comply within 48 hours when a victim calls and demands and  tells you that you have to remove those images. There are no more  excuses. You, Big Tech, have to take it down.\n\nLet's talk to the bullies, to the predators,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…the two branches that we do  have an obligation to keep an eye on. We keep an eye on the executive  branch, and the minority being the branch not of the President  generally calls the strikes, the balls, and not the home runs. That is  okay. They do it, and they have been doing it for 250 years. I commend  them.\n\nWe also have an obligation to come together,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…very best in local journalism, combining  heart, hustle, and hometown pride. Covering Savannah's Saint Patrick's  Day is no small task. It is an all-hands-on-deck event that calls for  early mornings, late nights, and unwavering dedication.\n\nEveryone involved in that broadcast played a vital role. From  producers and anchors to editors, photographers,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693027/recognizing-wtoc-tv-in-savannah-georgia"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…access       telecommunications relay services. Individuals outside the       United States should use the relay services offered within       their country to make international calls to the point of       contact in the United States.\n\nSUPPLEMENTARY INFORMATION: The National Forest System Lands       described in this Order are within Lake, Cook, and Saint…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…member of the  Apparatus Committee, Chairman of the Board of Trustees, and Vice  President of the Langhorne Firemen's Relief Association, all while  still responding to emergency calls and supporting daily operations.\n\nMr. Speaker, the measure of a true leader is not found in titles  alone, but in the lives improved because they cared. Mayor Taylor has  responded…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…have introduced a bipartisan  resolution to recognize C-SPAN2 and the public service it provides the  American people through its live, nonpartisan coverage. Our resolution  calls for television providers, including streaming services, to make  C-SPAN public affairs programming available to all Americans in  realtime on all platforms.\n\nFor tens of millions…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…Florida's oldest living World War II veteran and among  the oldest surviving veterans of the Second World War in the United  States. He is a proud member of what history rightly calls the  ``Greatest Generation''--ordinary Americans who answered the call, did  extraordinary things, and helped save the world.\n\nThey did not do it for recognition. They did…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…into a website could potentially blur the  lines between banking and commerce and, therefore, be subject to the  CFPB oversight in the future.\n\nHowever, Dodd-Frank explicitly calls for an exclusion for the  merchants from the CFPB's regulatory purview. That idea that a merchant  engaging in a commercial financial activity due to payment activities  in…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the  team supported individuals and families along a pathway to rebuild  their lives. Between September 28 and October 18, 2024, the team  managed an overwhelming volume of calls--1,194 through their direct  line and another 1,214 through work phones. Yet every call was met with  care, professionalism, and actionable solutions, reflecting the team's…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "John Carter", "party": "Republican", "sentence": "…designee of Chairman Cole.\n\nMr. CARTER of Texas. Mr. Chairman, I rise in favor of the amendment.  It includes various priorities related to veterans' health care and  benefits and calls for improvements to our military bases.\n\nMr. Chairman, I urge its adoption, and I reserve the balance of my  time.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I reserve the balance…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the  team supported individuals and families along a pathway to rebuild  their lives. Between September 28 and October 18, 2024, the team  managed an overwhelming volume of calls--1,194 through their direct  line and another 1,214 through work phones. Yet every call was met with  care, professionalism, and actionable solutions, reflecting the team's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the  left has imposed upon our Nation's ability to prosper and advance. It  codifies President Trump's executive orders that identify the resources  that we can develop and calls forth the powers of prosperity that those  resources promise.\n\nIt restores freedom to meet the challenge that Daniel Webster set  before us by realigning our institutions on…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699690/critical-mineral-dominance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this resolution recognizes the right to assemble and  protest peacefully, condemns unequivocally the violence perpetrated  against Federal, State, and local law enforcement, calls on local and  State-elected leadership to work with the Federal Government to end the  violent riots and restore peace, and expresses gratitude to law  enforcement officers,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]