[{"senator": "Dave Min", "party": "Democrat", "sentence": "He called  this a hoax.", "title": "Epstein Files Transparency Act", "date": "2025-11-18"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "I  authored one of them called the Basic Health Program.", "title": "Healthcare", "date": "2025-12-10"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "They called it Food for Peace,  and it sent American-grown grain to hungry people around the world.", "title": "Restore Funding for Lifesaving Food Aid", "date": "2025-07-16"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "The so-called rescissions package continues a destructive Republican  pattern: Cut now and ask questions later.", "title": "Rescissions", "date": "2025-07-14"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "For time immemorial, the Ute Mountain Ute Tribe has called the vast  landscape of the Southwest home--the mountains, canyons, and rivers  that have sustained the Weenuche people for countless generations.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "5, called to end birthright citizenship through an Executive  order, which is unlawful because it cannot override the Constitution of  the United States.", "title": "Trump Administration First 100 Days", "date": "2025-04-30"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Regardless of what they are  called, surprise fees that consumers do not expect make it impossible  to comparison shop and impose undue burdens on household finances.", "title": "Hotel Fees Transparency Act of 2025", "date": "2025-04-28"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Or consider his former White House adviser who has called on the  President to deploy ICE to intimidate U.S.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Aariv built an interactive app called WayBuddy, a community safety  app that allows students to report roadway hazards for fellow  pedestrians and bicyclists on a shared map.", "title": "Recognizing Aariv Arora", "date": "2026-01-08"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "When such things have been  done in other countries they are called pogroms and ethnic cleansing.", "title": "In Opposition to Ice Facility in Hudson Valley", "date": "2026-01-21"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "2189, the so-called Law- Enforcement Innovate to De-Escalate Act.", "title": "Law-Enforcement Innovate to De-Escalate Act", "date": "2026-02-12"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Although President Trump and the National  Fraternal Order of Police called for the House to immediately pass the  District of Columbia Local Funds Act, the District of Columbia Local  Funds Act has been sitting in this House for 3 months.", "title": "Protecting Our Nation's Capital Emergency Act", "date": "2025-06-10"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "You should not be able to skip a  background check by going to a private gun show or engaging in a so- called private sale or transfer.", "title": "Leosa Reform Act", "date": "2025-05-14"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "I  don't think we have a right to know--all 535 of us--but there is a  thing called the Gang of 8.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "When Trump ignored Court rulings, we called it out.", "title": "The Truth Still Matters", "date": "2025-05-13"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Speaker, in California, we have just  learned that CARB, the California Air Resources Board, is plowing ahead  with the imposition of its new so-called low-carbon fuel standard to  take effect in July.", "title": "Public Lands Management", "date": "2025-05-21"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "The Select Committee had what Derek called  ``squeaky wheel authority'' to call attention to longstanding problems  and challenges for the House, and he used that authority to  relentlessly pursue solutions.", "title": "Thanking Derek Harley for His Service to the House", "date": "2025-11-18"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "The people who live in Alaska's Far North, the people whose  ancestors have called the region home for 10,000 years, are asking us  to restore the balanced, lawful management framework that they helped  shape.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''", "date": "2025-11-18"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Rather than supporting domestic energy production, the Biden  administration and my friends on the other side of the aisle used the  so-called Inflation Reduction Act to levy an unnecessary tax on natural  gas, which ultimately fell on American people to pay, simply to try and  kill the domestic natural gas industry.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I would remind my colleagues on the other side of the aisle that our  energy prices wouldn't be skyrocketing and off the charts had we not  gone down the foolish road of massive subsidies for the so-called Green  New Deal, which is more rightly called the green new scam, in which  foreign companies, Chinese companies, have been enriched because my  colleagues on the other side of the aisle wanted to pursue their  radical agenda.", "title": "Highlighting Flawed Policies", "date": null}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "These so-called little red classrooms were sold as  opportunities to teach Chinese language and culture.", "title": "Transparency in Reporting of Adversarial Contributions to Education Act", "date": "2025-12-03"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "That means that the  pool of policyholders shrinks, and the program enters into what is  called an actuarial death spiral, which is to say the risk, instead of  being spread out over many, is concentrated in increasingly fewer  people, driving up their premiums even that much more; therefore, more  people drop.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2025-03-13"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Now, we are having a big debate, America, on what we should do in  this so-called reconciliation process.", "title": "Fiscal Responsibility", "date": "2025-05-01"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "They didn't base their 2022 plan on any new  scientific analysis or new environmental review process; they based it  on a political agenda and their preference to what they called ``keep  it in the ground.'' They issued a ``determination of NEPA adequacy''  and then went into the 2020 plan and selected a far more restrictive  alternative from it.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "That is why I am promoting a new framework that is called MAHA, Make  America Healthy Again, a patient-centered alternative that restores  choice, transparency, and affordability without expanding government  control or forcing anyone to give up their current coverage.", "title": "Bringing America Back to its Roots", "date": "2025-12-12"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "In a column published in the Wall Street Journal on Monday, October  13, Jamie Dimon, CEO of JPMorganChase, called out the need for  investment in national security.", "title": "National Security", "date": "2025-10-21"}, {"senator": "Todd Young", "party": "Republican", "sentence": "Let's inspire this generation and the generations that follow by  recognizing these standout citizens--some of them citizen warriors who  helped us win World War II--so that when future Americans are called to  greatness, they, too, in Clyde Milligan's words, will do anything for  their country.", "title": "Cloture Motion", "date": null}, {"senator": "John Kennedy", "party": "Republican", "sentence": "It is called inflation.", "title": "The Economy", "date": "2025-12-03"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "He knew that on the top the Capitol rotunda was a  statue called the Statue of Freedom.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "This is from something called Moody's Analytics.", "title": "Economic Anxiety", "date": "2025-05-01"}]