[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…delegation that stood here  with me that has supported me throughout this process.\n\nI rise today, the proud granddaughter of a bracero, a hardworking  Mexican immigrant who came to this country for a better life, and I  stand as the proud daughter of a U.S. Congressman, a man who spent his  entire life fighting for justice, equity, and dignity for the most…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…because so many of  us lost our homes, our livelihoods, and our country.\n\nMy own parents escaped brutal oppression at the hands of the  Vietnamese Communist Government and came to this country seeking the  freedom and democracy that had been ripped away from them in the  country of their birth.\n\nThis year, we recognize the 50th anniversary of the Fall of Saigon…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…his Secretary of Education laid out plans to slash and dismantle the  Department even further.\n\nEducation is foundational. It certainly was for me. As an immigrant,  I came to this country not knowing any English. I didn't read or write  English. It is the education system that this country afforded me that  provided me the opportunities that resulted…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…pursuit of happiness.\n\nAll of these people have in common the fact that they were innocent  and the fact that they have lost their lives, some to terrorism,  persons who came to this country to impose and inflict terrorism upon  people, and some from terrorists within the country, some from people  who were just crazed, some from people who were persons…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Charlie Zhang for  his philanthropy and his induction into the Orange County Hall of Fame.\n\nCharlie comes from humble beginnings. He came to this country  penniless and unable to speak English but with a dream. With hard work,  he started a number of businesses, and he achieved the American Dream.\n\nNow, Charlie is known…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689745/recognizing-jessie-echaury"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Madam Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has given me so much. I love America, and I  will do anything to protect our Constitution and our democratic values.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…involved here. ICE has  claimed that there were a number of undocumented immigrants. President  Trump has claimed that the people who were apprehended and detained all  came into this country illegally. At the same time, the Korean  Government has maintained that of the 300-some-odd Korean nationals who  were arrested and detained, all of them were here…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Mr. Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has given me so much. I love America, and I  will do anything to protect our Constitution and our democratic values.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691026/protecting-our-constitution"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…with joy,  love, and comfort. It was impossible to partake without feeling kinship  and community with those around you. The Members who attended the  pilgrimages came from across the country and the political spectrum.  Mrs. Freida helped bring them closer together, not only with her food  but with her warm, generous spirit. So too did the rest of the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693379/mourning-the-loss-of-mrs-freida-b-dority"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Venezuela. They went  through the Darien Gap. They dealt with the forest. They dealt with the  snakes. They dealt with the predators. They dealt with the drug  dealers.\n\nThey came into our country at great personal risk. They are going to  see a 30-second ad praising Donald Trump and decide to walk back or  even fly back? What a stupid excuse that is for the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Trump is blatantly pushing  aside the Constitution and the rule of law to deport anybody at will. I  am here because I am fighting for my mother and many like her who came  to this country in search of a better life. I am fighting so our  immigrant communities can, once and for all, live without fear that  their livelihoods would be taken away at a moment's…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the grant funding  just because a President doesn't like immigrants and is doing  everything in his power to vilify them.\n\nThe United States was built by people who came to this country to  seek a better life for themselves and their families. This thoughtless  decision is an abuse of power and just one more example of how the  Trump administration…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…it doesn't happen by accident, and it isn't maintained by  sheer inertia. We have to fight each and every day to maintain it.\n\nI am the child of refugees. My parents came to this country from  Communist Vietnam in search of the very freedoms that had been ripped  away from them in the country of their birth. I joined the Army when I  was 18 years old…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689123/a-republic-if-we-can-keep-it"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…men who have been sent to a  foreign prison with conditions so inhumane that El Salvador's Justice  Minister has said that the only way out is in a coffin.\n\nThese men came to our country, in many cases through approved legal  pathways, seeking a better life for themselves and their families. In  response, we sent them to another country without any due…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690512/trump-immigration-policies"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…unwavering  commitment that has brought Oslene Ducady to this moment becoming a  citizen of the United States of America.\n\nBorn in Haiti, the fifth of nine children, Oslene came to this  country chasing a dream, not for herself, but for her future children.  She moved to Green Cove Springs in the great state of Florida, where  she met her husband, Alix.\n\nFor…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691362/congratulating-oslene-ducady-on-becoming-an-american-citizen"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Democrats are pushing back on this  because they don't want the citizens of America to know what special  interest aliens, who participated in suspicious travel patterns, came  into our country illegally in 2021, '22, '23, and '24. Because you know  how many are coming in in 2025? Zero are coming in. That is how many.  That is because we have an executive…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…best. It is less government, more  opportunity, and more relief for American families.\n\nLet us also remember that home prices also went up because 10 million  people came into this country in a 4-year time period. The simple law  of supply and demand tells me that causes prices to rise radically,  much like radical policies from 2021 through 2024.\n\nMr.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698636/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…previous to this, Joe Biden's term, Joe Biden  let in 15 million--million--people. One million is a lot of people.  Five million is a lot of people. Fifteen million people came into this  country illegally. We don't know who most of them are. We don't even  know where they are. What we do know is that literally tens of  thousands of them are murderers; hundreds…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…attack  from happening. But the fact that the perpetrator is here in the United  States in the first place underscores yet again the failure to vet the  individuals who came into this country via the Biden administration's  parole.\n\nThe repeated incidents--and there are many more--committed or  attempted by Afghan nationals demonstrate that something has…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…killed, those who were beaten, or those who were  hurt who were in law enforcement.\n\nIllegal immigration is not a good thing. Yes, there are a few illegal  immigrants who came to this country who are illegal but just trying to  make their way but doing it the wrong way, but there are also real bad  folks who got in.\n\nThe simple truth is--let's get back to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…to debate today are these important rollbacks of the Green New  Deal agenda.\n\nWe sat idly by and watched our country get invaded by at least 10  million people that came across our country's borders with the direct  will of the President to do it. President Trump has proven in just less  than 2 short months the ability for a President to roll this all…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}]