[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…employment, and preserving the  health of our economy, independent from political pressure, insulated  from partisanship, and rooted in data and discipline.\n\nWhen I first came to Congress, Mr. Speaker, I was a member of what  was then called the Banking, Housing, and Urban Affairs Committee, now  the Financial Services Committee. At that committee, as it…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…administration has spread.\n\nParents of students with disabilities fight hard every single day for  their children, and there is no reason that they should have to fight  harder. I came to Congress to be a voice for those families and to  ensure that our country lives up to its promises and our values.\n\nThat is why my very first bill was the Protecting Students With…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698941/protecting-education-for-children-with-disabilities"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…coverage act.\n\nI did not spend 20 years as an ICU doctor saving lives to come to  Congress and sit back while Republicans strip healthcare coverage from  millions. No. I came to Congress to fight for affordable, accessible  healthcare for all.\n\nThis bill does nothing to accomplish that goal. Worse than that, it  pushes people toward less coverage at a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698396/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…drawn from the Treasury, but in consequence of  appropriations made by law.'' That clause also requires publication of  all publicly expended money, funds.\n\nNone of that came to Congress, even in some of the most sequestered  private meetings--nothing, no information, no support.\n\nThis military operation expended billions upon billions of U.S.  taxpayer…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…slap in the face to  New Yorkers. We need to hold the line and push for a full repeal that  will bring tax bills down and give Long Islanders much-needed tax  relief.\n\nI came to Congress to cut taxes and make life more affordable for my  residents. I will continue to explore every possible avenue to do just  that.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691111/bring-back-full-salt-deductibility"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "Mr. AGUILAR. Mr. Chair, I thank the gentleman for yielding. I rise in  opposition to this Republican budget.\n\nHouse Democrats came to Congress ready to work with our Republican  colleagues to lower the cost of eggs, take on price gouging, expand the  child tax credit, build more housing, and put the pocketbooks…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688052/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN. Mr. Speaker, when I came to Congress in 2019, I knew it was  a time of great tension, yet I was motivated all the more to do this  work.\n\nIn the almost 7 years since, our empathy and our common humanity has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…really want to make tonight.\n\nI attended public and private schools in South Carolina, grade  schools, before going off to South Carolina State, now University. When  I came to Congress, South Carolina State had given or produced more  African-American general officers than all the military service  academies combined. It was that one little school in…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, almost 7 years ago, I came to Congress to  serve my community, my State, my fellow veterans, and the country that  I deeply love in a different way than I served it on the battlefield.  When I put the uniform…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Congress and the Trump administration should be doing more to lower  costs and improve outcomes for our hardworking families.\n\nAs I have continued to do since I first came to Congress, I have been  committed to addressing the concerns of the families who I am very  honored to represent. No family in this country should ever be forced  to choose between…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…is to give a sense of how  this bill is an attack on the separations of power that we all here in  the Senate have taken a constitutional oath to defend.\n\nWhen I first came to Congress as an intern for Senator Hatfield, we  were celebrating our 200th anniversary. That is so long ago, 49 years  ago. And Senator Hatfield had a saying about appropriators,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, I will start by thanking Chairman Rogers  and Ranking Member Smith for their leadership.\n\nI came to Congress wanting to join the Armed Services Committee in  particular because it is one of the few committees that still works  together to collaborate and legislate.\n\nWe don't…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697801/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…at the White House, we are playing with other  people's chips, that we don't feel it ourselves.\n\nI have to say, I found it disgusting when I learned in 2018, when I  came into Congress, that the President and Members of Congress get paid  during the shutdown; that they continue to get their salary while  servicemembers in our military and other public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…approved and it is the  law. He then goes through the rescinding of his decision to spend the  money. It is called a rescissions bill. In this case, the Trump  administration came to Congress and said: The $9 billion that you  appropriated and directed me to spend, I don't want to spend. I want  your permission not to spend it--$9 billion.\n\nThat is what we…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…may be gone, I will never  stop being his mother. I will never stop fighting for every child who  isn't getting what they truly deserve from our great country.\n\nWhen I came to Congress in 2019, I promised I would never stop  fighting to ensure that every kid who grows up here in the United  States receives the skills necessary and stays alive long enough…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…join our Armed Services.\n\nMr. McCORMICK. Madam Chair, I love the fact the other side just said  that it is factual that COVID is the reason we couldn't recruit.\n\nWhen I came into Congress, we had the President of the United States  say we can take off masks, that the pandemic is over. For the first 2  years of my service here in Congress, the pandemic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…these folks, and I know the  prosecutors were very frustrated at the time with what they were seeing  with these open borders. I appreciate, one, what he did before he came  to Congress; two, what he is doing now; and, three, hosting this  opportunity today to bring attention of this to the American people.\n\nMr. Speaker, today, I rise on behalf of the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…They are practical, meaningful  improvements that directly serve Iowans.\n\nI am deeply grateful to the city and county officials who partnered  with me on these efforts. I came to Congress to deliver for Iowa, and I  will continue fighting to make sure our communities get the support  they have earned.           Washington Community Theater Celebrates 50th…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…on a valid constitutional basis. It has exercised that authority before  and must do so again here, this time in defense of Americans' Second  Amendment rights.\n\nWhen I came to Congress, I promised my constituents that one of my  top priorities would be to not only fight to protect our Second  Amendment rights but to restore what we have lost. The National…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…They take pride in  serving their neighbors and leaving their communities better than they  found them. Our Federal policies ought to help them do just that.\n\nSince I came to Congress, I have worked nonstop to make this a  reality. Every year, I have introduced legislation to preserve stepped- up basis and to stop far-left Democrats' farm killer tax.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…gentleman: When I  graduated from law school at the University of Texas in 2003, the  national debt was somewhere in the $6 trillion range, $6.5 trillion  dollars. When I came to Congress, when I was campaigning to come to  Congress, it was just over $20 trillion. That was 2018. Today, we are  pushing $37 trillion. Is that roughly correct?\n\nMr. ROY. Correct.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "John Rose", "party": "Republican", "sentence": "…that grows from the bottom up.\n\nMr. Speaker, it would be hard for me to count the number of job  creators I have met in Tennessee's Sixth Congressional District since I  came to Congress in 2019, but I can tell you that nearly all of them  emphasized to me the need for tax certainty and for tax and regulatory  relief.\n\nThe One Big Beautiful Bill Act includes…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…again.\n\nWe tend to overstate the impact of what we do in this town.  Everything is historic, even when it is not. However, this is  different. This is huge.\n\nBefore I came to Congress, I was in the broadband industry, and the  Telecommunications Act of 1996 provided the regulatory certainty needed  to launch the internet era. That was a watershed victory…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…belongs. That means smoother trips for  everyone just in time for peak summer travel season.\n\nThis bill is exactly the kind of commonsense, America First  legislation that I came to Congress to support. It is proof that when  we put American small businesses, our families, and our travelers  first, we can make real progress.\n\nWhether you are headed out to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}]