[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…reform, reforms that  have been in the public view now for a very long time. How about we  don't detain and deport American citizens? How about we unmask? How  about we use body cameras? How about we obtain a warrant before you  knock on somebody's door? How about we train officers, serious  training, not 47 days of training?\n\nThese are absolutely bedrock…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700220/homeowner-energy-freedom-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…been  flying into Los Angeles over the past few weeks attending fundraisers.  Nobody is showing up in a hazmat suit or combat gear.\n\nIf it is such a hellscape, pull back the cameras and release the  drone footage so we can see what is happening across the entire city.\n\nThis resolution ignores the fact that the violence didn't start in a  vacuum. It was…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…of roving patrols and  racial profiling. We must improve the transparency and accountability  of DHS operations by requiring that ICE and CBP agents wear functioning  body cameras capturing archival footage. Proper uniforms must be worn  displaying agency affiliation so that the public knows they are  interacting with federal officers. Clear identification…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Representative Donald S. Beyer  Jr., introduce the Federal Police Camera and Accountability Act of  2025. This bill would require federal law enforcement officers to wear  body cameras and marked federal law enforcement vehicles to have  dashboard cameras. It would also require the Government Accountability  Office to conduct a study on federal law enforcement…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to investigate  and uncover wrongdoing.\n\nBut we will also propose and demand reform. There need to be real  changes at DHS, and those kinds of changes have to include body cameras  and identification on every officer, masks off at all times, rigorous  use-of-force training and policy, independent investigations into acts  of violence and ongoing monitoring…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…all Americans are protected from this administration's horrible  actions.\n\nIf a U.S. Senator is treated this way on camera, imagine how they are  treating immigrants when the cameras are off.\n\nMr. Speaker, I stand today as a proud daughter of immigrants. I stand  with Senator Padilla. I stand for all the residents of California's  29th Congressional District.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692509/standing-with-senator-alex-padilla"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…either voluntarily or  not.\n\nICE and DHS have no credibility, and neither do their stories. They  have lost it.\n\nReports indicate that officers involved were not wearing body  cameras. This is not law enforcement. This is becoming an American  gestapo.\n\nSilverio's tragedy is not alone. It affects families every day now.  That same day, in Little Village,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…chosen them--the  billionaires, the elite, the people who think children are theirs to  exploit--over us, the American people.\n\nTime and time again, they have looked into the cameras and promised  the American people: We will release the Epstein files.\n\nWe heard it over and over again: We will tell you the truth.\n\nWhen the moment of truth comes, they slam…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693547/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…First, they refused to ensure ICE abides by the same laws and  procedures as our local and State police: that they are unmasked when  on duty, that they actually wear the body cameras, that they wear a  name plate identifying who they are, and that they are held responsible  for excessive force.\n\nSecond, the GOP refused to join us in upholding the Constitution.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…ensuring DHS officers wear clear  identification so people know who they are dealing with in law  enforcement and can hold them accountable; requiring DHS personnel to  wear body cameras so we have proper recordings of their conduct in  immigration enforcement; and requiring proper investigations after  tragedies occur like the recent shootings of both Renee…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…difficult to end. The choice you make on this  vote will carry a long, a very long, a very long part in this history.\n\nMr. Speaker, I will end with this. Let me just tell you, the cameras  of history are rolling. What will be the downstream effects of  destabilizing the country, an entire region? Anyone who tells you they  know, they are lying.\n\nWhat we do…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…gun on that individual.\n\nThese tactics are grossly illegal and not tactics that local law  enforcement engage in. Our local law enforcement follows the law. They  wear body cameras. They are subject to disciplinary actions if they  violate due process rights.\n\nICE is completely unaccountable and totally out of control. We have  seen them assault citizens.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Trump's fake emergencies  and tariffs continue unchecked.\n\nLet me propose a solution: Do your job. The American people elected  us to take those tough votes. It is our time. The cameras of history  are rolling and what they are going to see is the Republican majority  shying away from the spotlight. Vote ``no'' on this rule.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695525/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…after       shootings and other serious events. Jurisdictions that       release such footage consistently see improved community       trust and enhanced transparency. Body cameras provide an       impartial record, encourage better policing practices, and       allow communities to participate meaningfully in oversight.       These policies do not endanger…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…provide  oversight of the Department for the funds that they got under  reconciliation.\n\nIt also provides, as the gentleman said a few minutes ago, $20  million for body-worn cameras, specifically for CBP and ICE, which are  conducting immigration enforcement. It also provides funding to  increase training for CBP and ICE agents for deescalation tactics.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…brought integrity and professionalism.\n\nNotably, Lieutenant Moffett played a major role in implementing a new  record management system, obtaining body-worn and in-car dash cameras,  and acquiring taser devices for the department. His efforts helped to  modernize the force and enhance public safety.\n\nBeyond these contributions, he has shared his vast…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…the immediate one right  now. Let's actually get the government back open, and let's actually  get people paid.\n\nMy Democratic colleagues have demanded that we have body-worn cameras  on ICE agents. We as Republicans have said: We agree.\n\nIn fact, the bill that you are blocking literally has $20 million and  a requirement to have body-worn cameras for…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Demil Facility (ANCDF) was being built, and Charlie  was hired there in July 1999. While working at ANCDF, he had an  interest in making a scale model of the plant. Because cameras weren't  allowed on site, he observed and documented, from memory, the layout of  the facilities. He worked on a model at home for over four years. The  model is one of a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, I want to compliment Erika Kirk, wife of  the assassinated conservative leader Charlie Kirk. She has made the  emotional appeal to have cameras in the courtroom at the trial of her  husband's murderer. I commend her for this brave plea because it fits  in with a stand I have been taking for the last couple of decades.…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696518/cameras-in-the-courtroom"}, {"senator": "John Thune", "party": "Republican", "sentence": "…objecting to a lack of transparency when we approved packages of Biden  nominees, some of which probably did happen in the dark of night,  albeit in the full light of the C-SPAN cameras.\n\nOf course, I should also mention that, before any floor  consideration, all of these nominees will have gone through the  committee process, which will have provided still…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…They are designed to capture voice commands from  around the vicinity, recording information to adapt to the way  individuals give commands. They are also often equipped with cameras to  capture QR codes or other specific information particular to that  appliance.\n\nWhile the intention may strictly be for convenience, consumers need  to be aware that private…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…such as the Bellevue  food Pantry. Habitat for Humanity, and a local shelter for survivors of  human trafficking. The club has also funded the installation of police  dash cameras, contributed to holiday food programs, and invested in  public amenities such as the gazebo at the Eastern Nebraska Veterans  Home and benches at Papillion Landing.\n\nIn moments…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692687/recognizing-the-50th-anniversary-of-the-bellevue-papillion-rotary-club"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…have various demands that they have with regard to this,  and again, some of these demands are already addressed in the Homeland  Security bill. For example, they want body cameras. There is actually  funding for body cameras in the Homeland Security bill if the Democrats  would join us in passing it.\n\nThere is also funding for deescalation procedures.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Biden's LNG pause, an important  step in reclaiming global energy dominance and lowering costs across  the board.\n\nIt is shocking to me that House Democrats will run to the news  cameras and clamor about the cost of living while they also offered  their full support for reckless anti-domestic energy policies from the  Biden administration that caused prices…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…will. I would be  surprised if we don't. But I know if we work hard, we can work through  them and get to a successful conclusion.\n\nMy friend, for instance, mentioned body cameras. I couldn't agree  more. It is something we added in the bill but something she advocated  for and championed. We agree on the need for additional training. There  is lots…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…engagement and transparency, I  applaud C-SPAN's commitment to chronicling democracy in action here in  the Congress.\n\nIn fact, for more than 20 years, I have pushed to allow cameras into  the Federal courthouses, including the Supreme Court, to foster a  better understanding of the Federal judiciary and its role in our  system of checks and balances and…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…about my friends on the Democratic  side: They are never going to agree to deport anybody because all their  proposals make it pretty much impossible to deport anybody.\n\nBody cameras, that makes sense. If you want to find out how to make  ICE more professional, count me in.\n\nBut your proposal is to require a judicial warrant to deport  somebody. Can you…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…disgruntled employees hung  a giant American flag upside-down on El Capitan the other day, ruining  the view for tourists who came to enjoy Yosemite's famous firefall.  Remote cameras at the park are now blocked by protest signs. A Yosemite  biologist told gullible reporters that the staff cuts would doom the  Sierra Nevada red fox to extinction. Others…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…groups funded by George Soros who also funded  the Congressional Integrity Project who spent at least $2 million  harassing me over past 2 years with banners and all the TV cameras, the  mobile TV units that drove through rural Kentucky trying to intimidate  me from the Biden investigation, which, by the way, ended with Joe  Biden's last act as President…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the highest price  are the ones furthest from Washington.\n\nFor more than 40 days, families were used as political pawns and  props while those responsible stood in front of cameras pretending to  solve the crisis that they created. I actually saw a Member from my  home State stand at a food bank, decry the fact that nutritional  assistance was in question,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]