[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…sustainable local economy. Generations of Midwesterners and       Americans from across the country have formed deep       connections to nature through hunting, fishing, camping,       canoeing, and hiking in the Boundary Waters.\n\nAllowing copper mining to proceed by overturning the       mineral withdrawal puts at risk not only the environment but…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…You think about the good times we had, at the right moment in  life, with a lot of friends, learning the basics of swimming, archery,  target shooting, and other things, like camping out--memories you carry  for a lifetime, wonderful memories, a rite of passage for many  individuals and families, a family tradition passed on to younger  siblings and, ultimately,…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693273/central-texas-floods"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Washington families.\n\nWhen you gut the Forest Service's fire response operation, that means  you are taking away public safety. You are taking away safety from the  people who are camping in the Lake Wenatchee area.\n\nMitigating risk in our forest has become ever more important with the  increasing intensity of wildfires and the longer and longer wildfire  season…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…enforcement in DC and undo       the no-right-on-red traffic safety law. Calendar No. 293.\n\nOPPOSE H.R. 5163, the Clean and Managed Public Spaces Act,       that would prohibit camping on public property in DC and       effectively criminalize homelessness, introduced by Rep.       Timmons. Calendar No. 294.\n\nThese six bills are only the most imminent threats…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…tucked away in the Republican's budget proposal that will open up the  Boundary Waters Canoe Area Wilderness to toxic sulfide-ore copper  mining.\n\nMy husband and I take our kids camping and paddling in the Boundary  Waters every year, and we are not alone. The Boundary Waters is the  most visited wilderness area in the country. There is literally no  other…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691611/boundary-waters-canoe-area-wilderness"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…their world around them. If we do  not act today, we could lose all the good that comes from this program.\n\nI am fortunate to come from an outdoorsy household, where we are a  camping, hiking, hunting, and fishing family. These experiences have  been critical to my own sons, James and Wesley, in their upbringing.  The extension of this program will ensure…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698167/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…community. He was a mentor, a coach, a storyteller, and a steady hand.  He was always present, always giving, always leading with heart.\n\nFor over 30 years, Papa Rex made Halloween camping trips legendary.  From silly costumes to spooky decorations, he poured his heart into  making those weekends memorable. They became traditions that his kids,  grandkids, and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…proud Navy mother, as her oldest  child currently serves on active duty, carrying forward the family's  strong tradition of military service. Together, their family enjoys  camping, kayaking, bonfires, and sharing meals with one another.\n\nMr. Speaker, Petty Officer Second Class Katrina Gramer's commitment  to service extends far beyond her time in uniform.…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…from the Ninth Circuit Court  of Appeals that said that local communities weren't able to do anything  about homelessness. The decision said you are not allowed to regulate  camping, you are not allowed to regulate homeless encampments in public  spaces, even in front of schools or in parks.\n\nWell, last year, we had a significant victory before the U.S.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Service, it is a true multiple-use forest,  supporting timber harvesting, wildlife conservation, and a wide range  of outdoor recreation opportunities, such as hiking, hunting, camping,  and fishing.\n\nArkansans take great pride in this forest, which draws more than  670,000 visitors each year. Currently, only 3.6 percent of the Ouachita  National Forest,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…achievements, Mr. Lewerenz was known for  his generosity, energy, and love of life. A devoted husband, father,  and grandfather, he found joy in hosting family gatherings, camping  trips, and community events. After retiring to Rainbow Springs, he  cherished time spent golfing, playing pool, and attending Meadowbrook  Church with his beloved wife Marilyn.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…critical for supporting rural  school districts through county payments derived from timber sales.\n\nOur forests also provide countless recreational opportunities, such  as camping, hiking, fishing, and many other activities available in the  great outdoors.\n\nHowever, many of our Federal forestlands remain unhealthy and  continue to be at risk of catastrophic…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Capital. This  unique showcase will feature Scouts demonstrating outdoor and  leadership skills right here on the Capitol grounds in the Rayburn  foyer. Displays will include camping equipment, a canoe, a rocket,  robotics, knot tying, and Pinewood Derby car racing, alongside  educational tables sharing the story and scope of modern Scouting.\n\nThere will…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…showcasing the skills he learned as a Scout and his commitment to the  community. Thanks to the invaluable lessons taught to Scouts, Carter  has become an expert in first aid, camping, fitness, communication, and  citizenship.\n\nThroughout our Nation's history, the Boy Scouts have played an  invaluable role in teaching young people hands-on skills that make…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690320/recognizing-carter-bisig"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…Hoosiers where they  live and work.\n\nI heard from Chuck at Allie's Cafe, who shared about how limiting tax  on tips puts more money directly into workers' pockets.\n\nI spoke with Camping World and other companies about how the Made in  America provision and immediate expensing strengthened American  manufacturing jobs.\n\nI joined law enforcement officers at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694794/promises-made-promises-kept"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…often referred to as  ``God's country.'' The scenic countryside and nearby Allegheny River  create an outdoor paradise with recreation opportunities like fishing,  hunting, camping, kayaking, hiking, skiing, snowmobiling, and more.\n\nCoudersport's historical downtown and charming shops make it a small- town community that has it all. Thank you to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695113/coudersport-2025-heritage-community-of-the-year"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…young people engaged in Citrus County  4-H programs. Marlene's support and advocacy for youth development  provides vital resources for school enrichment programs, residential  camping programs, adult volunteer training, teen workforce development,  civic engagement, and graduating senior and 4-H alumni scholarships.\n\nIt is clear that Marlene Law has made…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…innovation, curiosity, and for  participants to enjoy the outdoors. It gives Scouts the opportunity to  try new recreational activities like mountain biking, kayaking, and  camping. All of these activities are an ode to the beautiful landscapes  across our Nation and experiences that a Scout will never forget.\n\nScouts explore their interests and improve…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outdoor  program Chair for the Greater Tampa Bay Area Council. He volunteers for  scouts at least 40 weekends a year. During those weekends, he could be  leading his troop camping, helping with a training event, running a  target range, cooking in the kitchen or helping with camp maintenance.  He oversees all of the outdoor program committees such as…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}]