[{"senator": "Al Green", "party": "Democrat", "sentence": "…President is hurting the image of the United States of America.  We are now seen as a country that doesn't honor its word. The President  negotiated a trade deal with Canada and Mexico; he breaks the trade  deal. The President says that he wants Canada to be the 51st State;  Canada is not about to become the 51st State.\n\nI will be quite candid with…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, President Trump changes his tariff policy  more than most people change their socks. One day he is picking fights  with Canada and Mexico, our friends, and the next day he is launching a  global trade war. Today, he is pausing tariffs on some countries while  also increasing them on China. What our farmers,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…that. In fact,  he just moved forward with the tariffs that he put in place. He did so  not just against China, not just against our adversaries, but against  allies like Canada, Mexico, France, Germany, and other countries. It  has been devastating to the American economy and businesses across the  country.\n\nHe ran for election telling the American people…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…enough enough?\n\nWhen will the Republican majority stand up and tell him for once:  ``Mr. President, you are wrong. Your policy is misguided.''\n\nHe has imposed tariffs on Canada, Mexico, Japan, and the EU, our  friends. He has not imposed tariffs on Russia, arguing they are  negotiating with Ukraine, but he imposes tariffs on Ukraine.\n\nWe are now looking…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689696/worldwide-tariffs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Manatt served as a professional staff member on the House  Committee on Foreign Affairs, where her portfolio included oversight of  the United States' relationships with Canada and Mexico and countries  throughout Central and South America. She went on to serve as Senior  Policy Advisor to three consecutive Assistant Secretaries of State for  Western Hemisphere…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…high-paying  industries we want to be growing here in the United States.\n\nThese companies chose San Antonio because we are highly integrated  into trade networks with Canada and Mexico. When tariffs go up, local  businesses pay the price. When Canada retaliates, it becomes harder for  our workers to sell their products abroad.\n\nThis trade war is making…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699976/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…made  sure--with Senator Brown, in particular, leading the fight--to have a  bill with tough enforcement--enforcement teeth--to make sure the United  States could hold Canada and Mexico to their commitments.\n\nThis is the only way to ensure that farmers, workers, and businesses  get the full benefit.\n\nBut Trump's trade taxes aren't addressing enforcement…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…11.2 percent of total U.S. manufacturing output, supporting `9.7  million direct and indirect jobs.' In 2022, the U.S. exported $75.4  billion in vehicles and parts to Canada and Mexico. That number jumped  14 percent in 2023 to $86.2 billion, according to the American  Automotive Policy Council.\n\n``American carmakers would be much less competitive without…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…promise to the  American people to lower costs and to focus on making life more  affordable?\n\nInstead, he has gone the opposite direction, imposing tariffs on our  allies in Canada and Mexico, in Europe and across the world, without  any clear strategy, having an adverse effect on the pocketbook of  everyday Americans.\n\nThis Congress is charged constitutionally…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…here, starting with tariffs.  Last night, for the first time in decades, the President of the United  States imposed 25 percent tariffs on nearly all goods coming from  Canada and Mexico.\n\nWhat does this mean for the American people? What do Donald Trump's  tariffs mean for the American people? They are going to pay more.  Everyday  costs are about to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…on it. Let it go to the floor. Let's  review the tape from the past year.\n\nPresident Trump has declared bogus international emergencies as a  pretext to tax imports from Canada, Mexico, and then the whole world,  passing these costs right to the hardworking American people. He wanted  to protect his friend, as Mr. McGovern said, former President  Bolsonaro,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695525/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…fentanyl is an emergency. I am not standing here on the floor of  the Senate to deny that it is so. The President has used the fentanyl  emergency to impose tariffs on Canada and Mexico, and I haven't  challenged those uses of emergency power. I have questions about  whether tariffs are the right solution to the declared emergency. But I  would not stand…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…nations thanks to Trump's tariffs, yet this bill would gut the Federal  Government's ability to review the environmental impact of oil and gas  pipelines that cross into Canada and Mexico.\n\nCurrently, the Federal Government reviews the entirety of a cross- border oil pipeline, but under this bill, the review would be limited  to only 1,000 feet crossing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Madam President, I come to the floor today because I am  concerned about President Trump's actions to, I believe, start a trade  war with our top two trading partners, Canada and Mexico.\n\nAll goods coming from Canada and Mexico, as of midnight last night--I  guess midnight today--face a 25-percent tax; that is, all except  Canadian energy, which is taxed…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…insurrection; unethical efforts to end investigations on  allies and donors; firing talented, career-committed professionals and  replacing them with blind loyalists; insulting Canada, Mexico, Denmark,  and the European Union; disruption of programs; threats to  universities, law firms, State and local governments, the Federal  workforce, and the media; and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…big believer that we have to continue to have economic  development and growth, and work in a fair way to make sure our  products are being traded fairly as well with Canada and Mexico. This  is an opportunity to do so.\n\nIn America, the one thing we have is ample natural gas. As a matter  of fact, the price of gas is historically low now because of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…appliances, diesel  fuel, dog toys, car parts, Christmas tree lights, tomatoes, and  tequila. I could go on.\n\nOur economies are so closely integrated--the United States, Canada,  and Mexico--that it will increase the cost of a GM pickup truck about  $10,000.\n\nEven if these tariffs, at the last minute, are delayed, businesses  are hurt by the uncertainty,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…voted for and supported President  Trump, but I don't support the rule of one person. We are set--the  President is set--to have a 25-percent tax on goods coming from Canada  and Mexico. This is a tax--plain and simple--on the American people.\n\nBut one person can't do that. Our Founding Fathers said: No, that  would be illegal for one person to raise…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…USMCA to the U.S. economy.\n\nSince 2019, U.S. agriculture exports have increased by almost $35  billion, and nearly half of that $35 billion was from just two  countries--Canada and Mexico.\n\nAfter 10 years of relative stagnation before the agreement, U.S.  agriculture exports to Mexico shot up by $11 billion between 2019 and  2024 to over a total of $30…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699771/9999"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…recently elected, he did what nobody  thought we could do. He revamped and restructured our biggest trade  relationship and trade agreement with our two biggest partners, Canada  and Mexico, which was known as NAFTA. Then, we had USMCA, and our trade  activity and our jobs and wages in agriculture and manufacturing have  gone up since, and we had overwhelming…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}]