[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to recognize February as  National Cancer Prevention Month and to reaffirm our unwavering  commitment to reducing the burden of cancer in communities across our  Nation.\n\nCancer is a devastating disease that has touched…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…mean even  worse maternal health outcomes, States rescinding policies that improve  access to reproductive care, and decimating access to prenatal care,  contraception, and cancer screenings.\n\nThis big, shameful, unconscionable bill is unacceptable, but it is  not inevitable.\n\nI need just four Republicans, four people of conscience, to listen to  their…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691443/gop-tax-scam-hurts-women-and-families"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "Mr. Speaker, I also thank the majority for their courtesy in moving  this bill expeditiously to the floor.\n\nThe Esophageal Cancer Awareness Act was introduced by our dear  friend, the late Ranking Member Gerry Connolly and by a bipartisan and  unanimous vote of our committee, the bill was renamed in his…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…assault on our public health.\n\nThis resolution put forward by congressional Republicans would rip  away protections that keep Americans safe from some of the most  dangerous and cancer-causing air toxins in the world, such as arsenic  and lead.\n\nAs an OB/GYN, I am extremely concerned because these toxins are known  to cause reproductive harm and birth defects.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688527/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…this country.\n\nMr. Speaker, God forbid that we have a Member of the Republican  caucus who stands up and actually wants to extend the Affordable Care  Act so that people with cancer, need insulin, and all sorts of  healthcare issues across this country have their health insurance  protected and extended throughout 2026.\n\nIt is unconscionable that what…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696688/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…express my support for H.R. 1912, the Veteran  Fraud Reimbursement Act of 2025, authored by my colleague,  Representative Connolly. He cannot be here today as he bravely battles  cancer, and our thoughts and our prayers are with him.\n\nI echo the comments of Representative Bergman. Veterans in the  fiduciary program are some of the most vulnerable in the VA's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…research  enterprise. This research can lead cutting edge preventative strategies  and research for treatments and additional cures for longstanding  medical challenges such as cancer, Alzheimer's, heart disease, sickle  cell, and obesity. I have met with Hoosier families that are struggling  with these rare diseases, and I have been moved by the impact…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…along with subcommittee ranking member and the  co-lead of this bill, Ms. Brownley, and Chairman Bost.\n\nMr. Speaker, today I rise in support of my bill, the Women Veterans  Cancer Care Coordinator Act of 2025. Women veterans are the fastest  growing group using VA healthcare services today, and I am proud to say  more of them call Texas home than any…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695418/women-veterans-cancer-care-coordination-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "Mr. CASTRO of Texas. Three years ago today, I was diagnosed with  neuroendocrine cancer. That day, my youngest child, my daughter, turned  2 months old.\n\nThere is a drug that I have to take every month, every 28 days, and  the first time I saw the bill for that,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693230/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…goods and products that we  then sell to other countries. This is all about hurting all of us.\n\nThey are cutting funding to the National Institutes of Health. They  are cutting cancer research.\n\nIn my State of California, we were on the cusp of clinical trials  because a cure had been found for breast cancer. We were on the cusp of  clinical trials for a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Vermonters, from folks in the Carolinas, that is really  appalling. We should not do it.\n\nI am here with my colleagues to defend our commitment to good  scientific research, to good cancer research, to good healthcare access  for poor kids and seniors, and to sound the alert that that is what is  at stake despite what the President may say about his ``love''…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…They can't do that if they can't go to work. They can't do that  if they can't pay their bills, such as their hospital bills or other  medical bills.\n\nI am a two-time breast cancer survivor myself, and not a day goes by  that I don't think about how egregious not extending these ACA tax  subsidies is to the American people. I am a lucky person.\n\nI am…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Instead, Republicans want to send people $80  a month and pretend that it is going to fix everything. It is a ``you  are on your own'' bill. If you have a sick kid, if you have cancer, if  you need a complete top-to-bottom checkup because something is ailing  you, Republicans are telling you: Americans, you are on your own; we  are not helping you. That…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…everything from groceries to  gasoline, to housing; the harm done in healthcare already, our  federally qualified health centers deprived of funding, NIH research  grants for curing cancer, for diabetes or hypertension canceled or  frozen; in education, the uncertainty and loss of funding for special  education and other programs that benefit children and the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…this. The Senate is now going to take up this bill.\n\nThe external pressure is going to rise up with the American Hospital  Association and with patient groups like the American Cancer Society,  the American Lung Association, Autism Speaks, and people who represent  disability groups. They are rising up now to stop this bill because of  the harm it is going…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Early in his career, he served as chief of  staff for a previous member of the same district.\n\nLast month, Ben announced that he had been diagnosed with stage IV  pancreatic cancer. This news stunned me, and, quite frankly, it stunned  the world.\n\nEver since Ben has stepped back from public life following his time  in the Senate and at the University…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…Today, Vietnam veterans across my district and across the country are  still fighting. This time, the enemy isn't on a battlefield overseas.  It is a silent killer, bile duct cancer, caused by a parasite known as  the liver fluke.\n\nMultiple studies have confirmed what these veterans have suspected  for decades. Those who served in Vietnam face a much higher…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…and in  strong support of S. 201, the Aviator Cancers Examination Study Act, or  the ACES Act.\n\nFar too many of our military aviators and aircrew are being diagnosed  with cancer at troubling rates. A 2021 Air Force study supported by  additional Department of Defense research found that aviators face a 29  percent higher likelihood of testicular cancer,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…D-Patrick.\n\nD-Patrick has invested hundreds of thousands of dollars annually in  an array of local Indiana organizations, such as Ark Crisis Children's  Center, Boone County Cancer Society, Boys & Girls Club of Evansville,  Evansville Philharmonic Orchestra, Mesker Park Zoo & Botanic Garden,  Ronald McDonald House Charities of Ohio Valley, Special Olympics…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…has done  incredible work in elevating Hepatitis B as a national priority. His  lifetime commitment to eliminating health disparities related to  Hepatitis B as well as liver cancer and his broader efforts to  improving the lives of Asian Americans and Pacific Islanders have been  recognized by the Hepatitis B Foundation through his receiving the 2025…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…championship game.            Increasing Innovative Therapies for Pediatric Patients\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, more than 15,000 children are  diagnosed with pediatric cancer each year in the United States. Despite  this, most cancer research is focused on adult cancer patients, leaving  our kids behind.\n\nI am proud to be a cosponsor of the Give…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the entire  Committee on Rules irrespective of party affiliation, how much Jim, his  wife, and his son are in our prayers after losing their daughter and  sister, Molly, to cancer.\n\nAs a cancer survivor, I have seen firsthand the horrors of the  disease. I told my Committee on Rules colleagues last night in  committee, in my time in treatment at MD Anderson,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I would note just an observation: One of our  colleagues on the other side of the aisle who is a cancer survivor--and  God bless him for it--was raising issues about government funding and  about what funding should or shouldn't exist and what this  administration may or may…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Throughout my district, there are many great volunteers.\n\nFrom Penn State THON raising a record-breaking $17 million this year  alone to aid families affected by childhood cancer to the Wellsboro  Rotary Club, which just celebrated its centennial year of service, our  communities are filled with neighbors helping neighbors.\n\nThese few examples remind…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…disposition, and his  simple decency made him an exemplary figure in our community.\n\nHe was always the picture of fitness and health until he was  diagnosed last year with cancer. He never let that slow him down, and  until the very end he continued to attend to his duties.\n\nHe was an exemplary father, husband, grandfather, citizen, and human  being,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…With the  advancements of technology that we are seeing today, they will reach  out and touch every single person they possibly can because it makes  them money.\n\nThis is like cancer, unfortunately. If cancer does not touch you or  your family, you don't want to recognize it. You will not address it  until it lands on the house. Mr. Speaker, this issue…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…come here, but we are doing it because we want to save  this country for our kids and our grandkids. That is why I am in public  service.\n\nI know when I had a diagnosis of cancer about 14 years ago, Hodgkin's  lymphoma, I didn't know if I would be around days or weeks, and 14  years later, I am sure some of my colleagues, maybe they are happy to  see…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…and  the Chief of Police in 2016. A staple of Chief Nye's leadership was his  geniality and his visibility in the community. He planned emergency  services events, such as cancer treatment fundraisers, and was a  central figure in special occasions throughout Lititz Borough.\n\nHis dedication to serving the community extends beyond the Lititz  Borough…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689982/congratulating-chief-kerry-nye-on-his-retirement"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that you only have a  handful of doctors and that you have a massive copay or some other kind  of limitation on your ability to choose a doctor. For example, in my  case, as a cancer survivor, on ObamaCare, I can't go back to M.D.  Anderson, which saved my life, because ObamaCare doesn't have M.D.  Anderson as an option.\n\nThat is not coverage. That is fake.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…chronic disease.  This is not surprising when you realize that 60 percent of Americans  suffer from some form of chronic disease, whether it be heart disease,  diabetes, or cancer.\n\nSo many Americans would benefit from having healthcare coverage that  is not only more affordable but more responsive to their needs so that  they can better manage their…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}]