[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Medicaid, or  Medicare. I would hope that no one here would want to be complicit in  having young children with cancer at a children's hospital die because  we have cut cancer research funding.\n\nAs I say this, I think about my mother, a breast cancer survivor who  wonders every day if it will come back. Boy, how do you think it gets  me right in the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…through the ACA  and Medicaid, veterans healthcare, nursing home coverage, food  assistance, student loan repayment options, energy tax credits,  national security, and cancer research.\n\nYou all contend that 78 million people voted for this. No, they did  not.\n\nMs. MOORE of Wisconsin. Madam Chair, no, 78 million people did not  vote for this. Who do…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688030/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, this week, there are advocates here in  Congress with the American Cancer Society to advocate for cancer  research and prevention. This is lifesaving work, and no one does it  better than our researchers.\n\nIn my home State of Washington, we have a lot of incredibly smart  people who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…request,  congressional Republicans cut Medicaid, cut SNAP benefits, put lifetime  caps on student loans, Federal student loans, cut funding that Congress  appropriated for cancer research, for the National Institutes of  Health, a whole host of things. People at home are scratching their  heads saying: How does this help me? How does this solve my problem?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the last campaign at all.\n\nPresident Trump has frozen funding to university labs and hospitals  across the board. For example, Northwestern University in Evanston, IL,  a cancer research powerhouse that earns hundreds of millions of dollars  of NIH grants annually has had its accounts frozen by the NIH for the  past 6 weeks.\n\nThis chart gives you an indication…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…make the things  Americans buy every day more expensive. It will slash critical  investments in the things that make us healthier, safer, and more  productive, things like cancer research, aviation security, and our  National Park System. It will decimate critical programs that support  the people we represent, stripping healthcare for millions and making…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…and products that we  then sell to other countries. This is all about hurting all of us.\n\nThey are cutting funding to the National Institutes of Health. They  are cutting cancer research.\n\nIn my State of California, we were on the cusp of clinical trials  because a cure had been found for breast cancer. We were on the cusp of  clinical trials for a cure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…researcher to Russia where she fears  retaliation for protesting the war in Ukraine. Sending her away would  both put her in danger and completely upend groundbreaking cancer  research. Her colleagues say her role is irreplaceable.\n\nBut it is not just cancer research. Trump also deported a little  girl--a U.S. citizen--who was on her way to get cancer…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bipartisan legislation to advance both drug discovery and  drug affordability, the Trump administration continues its devastating  attacks on public health, including in cancer research.\n\nThe Trump administration's substantial cuts to research funding for  the biomedical community is chilling the innovation that we are trying  to promote through this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…major medical breakthrough that has happened  in the treatment of cancer has been linked to our Federal investments.  Americans are not demanding that we cut money to fund cancer research,  Mr. Speaker, I promise you that. They are not calling for these cuts.\n\nOf course, as the irrepressibly cheerful Joni Ernst reminded  Americans last week, that is okay…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691727/republican-budget-will-make-us-sicker"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…country, with a threat of recession  on the horizon, with tariffs driving costs up, and Elon Musk taking a  meat cleaver to Social Security, to veterans' care, and to cancer  research, what are Republicans in Congress spending their time on? They  want to cut taxes for billionaires and make working people pay for it.  They want to add over $52 trillion--trillion…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…story as mine. He worked as a       contractor for nearly twenty years at NIH, helping to run a       lab at the National Cancer Institute. He devoted himself to       cancer research after watching my father die from lung and       brain cancer. While not a scientist himself, he was popular,       well-respected and beloved for his hard work and dedication.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…right on the dais at his inauguration and sit in his  Cabinet meetings at the White House.\n\nDid you speak up when he gutted public education, slashed funds for  pediatric cancer research, fired thousands of veterans who risked their  lives for their country; when he abandoned our allies and our  international commitments at a time when floods, fires, hurricanes,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Commander in Chief?\n\nMr. Speaker, surely, we can still tell the difference between right  and wrong. Certainly, we can do that right here in this Chamber.  Surely, when we see cancer research funding eliminated, when 2-year-old  citizens are deported, when the budget resolution calls for the largest  proposed cut to Medicaid ever, surely, we can say these things…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…significant Medicaid cuts that you  made, the ending of a bunch of subsidies for the marketplace, or  Obamacare, and talk to me about putting money back into things like  cancer research that you slashed, because there are few things as  fundamental as providing healthcare to your family, and yet there are  few systems in America that are as broken as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Pennsylvania State  University, and received her Ph.D. in animal science from Cornell  University. She held a fellowship at the National Cancer Institute at  NIH and led breast cancer research at the University of Vermont.\n\nDr. Plaut then joined NASA and served as the lead scientist for the  International Space Station Biological Research Project, working with…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…community through  his charitable giving of time, talent and treasure as seen in his  involvement with Boy Scouts of America, Leadership Council, St.  Baldrick's Children's Cancer Research, Hope for Vision, and Serving HIM  (Healthcare International Ministries). A devoted man of faith, Tom  attends Holy Cross Catholic Church The Colony with his wife, Karen,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…He was correct because if you bring a billion-dollar program to  the floor, we vote for it because the headline will say: Chip Roy  opposes puppies or Chip Roy opposes cancer research or Chip Roy opposes  something for veterans or for the elderly. Who can vote against that?\n\nIf the bill was billion-dollar program and needed a tax increase on  every…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pediatric Patients\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, more than 15,000 children are  diagnosed with pediatric cancer each year in the United States. Despite  this, most cancer research is focused on adult cancer patients, leaving  our kids behind.\n\nI am proud to be a cosponsor of the Give Kids a Chance Act of 2025,  legislation directing drug companies…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}]