[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…VA's Breast and Gynecological Oncology System of Excellence,  the VA oncology, surgical, and nursing specialists are already  providing world-class care for these types of cancers directly through  VA. The System of Excellence also helps connect veterans with care in  the community when necessary.\n\nA cancer diagnosis is always a difficult and complicated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695419/women-veterans-cancer-care-coordination-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…communities have been poisoned by these weapons right here  in the United States. Entire generations have seen their families,  their friends, and their classmates die of rare cancers caused by  radiation exposure. They have been forced to drink poisoned water and  breathe poisoned air.\n\nThe effects on the communities known as the downwinders have been…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…nuclear option with more of their  paychecks on hospital bills. They will pay for it with fewer jobs, less  success in their communities, fewer years with their loved ones, more  cancers, less time to enjoy the quality of life, and less quality of  life.\n\nThat is not a future I want to see. I want to see a future  envisioned, I think, as we heard by Democratic…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…heroes were prohibited from wearing respiratory  protection, even as the science made clear that wildfire smoke causes  lasting lung damage and is linked to more than a dozen cancers.\n\nFirefighters' life expectancy is now nearly 10 years shorter than the  average American. That is unacceptable.\n\nThe Healthy Lungs for Heroes Act changes that. It directs…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698661/firefighter-protections"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…threat, it truly is.\n\nWe know the other statistics: Black Alabamians are more likely to  suffer from diabetes and amputations that result from them or to die  from untreated cancers or undiagnosed cancers or late-diagnosed cancers  and experience preventable complications from just general chronic  illnesses.\n\nWhen it comes to kidney disease and dialysis…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…including over two hundred atmospheric  detonations. The radioactive fallout from these tests condemned  thousands of so-called ``downwinders'' to illness and premature death  from cancers and other grave diseases. Their suffering is a stark  reminder that even a world without nuclear war is not without victims  of nuclear weapons.\n\nIn 1990, Congress enacted…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…And that is that it is not just California. It is the fact that so many  other States have followed our lead. So many other States have decided  they would rather have fewer cancers than more cars with combustion  engines.\n\nThat was their choice. That was their right. They weren't coerced  into joining California. They made the decision about what was…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…enforcement officers,  firefighters, and emergency personnel who bravely answered the call on  the darkest day in our Nation's history continue to suffer from life- threatening cancers, respiratory diseases, and other debilitating  conditions from the toxins at Ground Zero.\n\nThat is why I was proud to help reintroduce the bipartisan 9/11  Responder and Survivor…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…to toxic burn pits during their time serving abroad. Exposure  to burn pits and other toxic airborne substances has been linked to  serious health effects, including certain cancers.\n\nTim worked closely with federal lawmakers to help get the PACT Act  signed into law. This landmark law expands VA health care and benefits  for veterans exposed to burn…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…research grants.\n\nDid you know that there is a National Firefighter Registry that was  set up to study the link between the hazards of the job and  firefighters developing cancers? Well, that registry has now been taken  down at Secretary Kennedy's bidding.\n\nThis is part of a heartless trend. They are destroying what decades  of research has built.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…prescribed for decades because the FDA waited years to alert  doctors that something was wrong.\n\nSince then, we have learned DES is an endocrine disrupter that leads  to rare cancers and birth defects across generations of families,  including among men and women who call themselves DES sons and  daughters and who are leading the charge for more awareness…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693582/no-apology-from-food-and-drug-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Detection Screening Coverage Act, would create a pathway for Medicare  to cover emerging blood tests, once FDA approved, which holds the  promise of screening for up to 40 types of cancers with a single blood  draw.\n\nWhen it comes to cancer, we know that early detection is our best  protection, and that is exactly what this bill will do. It is about  ensuring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…will drive researchers  to do their research in other countries and undermine the efforts to  cure diseases, to find solutions to conditions from obesity, to  Alzheimer's, to cancers. One of the best taxpayer dollars we can invest  is in NIH because it returns more than 5 taxpayer dollars back in the  breakthroughs that they make.\n\nWe have put the future…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…most expensive drugs under  Medicare will finally fall.\n\nStarting this year, 2026, seniors who rely on medications to treat  blood clots, diabetes, heart disease, and certain cancers will see  discounts of up to 79 percent for these essential drugs. There are 9  million American seniors who will save a total of $1.5 billion in  annual out-of-pocket costs,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…more of them call Texas home than any other State in the Nation.\n\nAs this population ages--keep in mind the average woman veteran is  54--they become more likely to develop cancers. The average age of  women veterans diagnosed with breast cancer is 58, and the average age  for reproductive cancers is 55.\n\nFor many of these veterans, the road ahead is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695418/women-veterans-cancer-care-coordination-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Medicine (in this       section referred to as the ``National Academies''), under       which the National Academies shall conduct a study on the       prevalence and mortality of cancers among covered       individuals.\n\n(2) Deadline.--\n\n(A) Date.--The Secretary shall finalize the agreement under       paragraph (1) by not later than 60 days after the date…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…last couple of days that talked  about the miracle of how much the statistical benefits were having on  the number of cures for cancer, particularly lung cancer and blood  cancers, and their model that we are on the cusp of having major  breakthroughs.\n\nWe saw this article a couple of days ago about a Microsoft platform.  I didn't even know they were…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…research at the National Institutes of Health  and increased public awareness. The cure rate for most brain tumors is  significantly lower than it is for many other types of cancers, a  statistic VABC is driven to change. The organization champions specific  patient-centered programs such as Survivor Reboot Groups, which  supports brain cancer survivors,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Mr. Speaker, I rise today not just as a Member of Congress but as a  wingman, a servicemember, and a friend to those in uniform and in  strong support of S. 201, the Aviator Cancers Examination Study Act, or  the ACES Act.\n\nFar too many of our military aviators and aircrew are being diagnosed  with cancer at troubling rates. A 2021 Air Force study supported…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…coordinators within each of the Veterans  Integrated Service Networks to help veterans navigate cancer care.  Specifically, this bill aims to improve care coordination for common  cancers in women.\n\nNo person wants to hear that they have or that their loved one has  cancer. Having the resources to navigate such a difficult time can make  all the difference…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…disease sounded like a dream that was  too far out of reach. Today, we are curing sickle cell disease. We are  curing spinal muscular atrophy. We are curing hemophilia and blood  cancers. These cures are just a few of the success stories attributable  to the FDA's Rare Pediatric Disease Priority Review Voucher Program.\n\nThe PRV program is a powerful incentive…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…increasing more than 700       percent in recent decades;\n\n(3) esophageal cancer kills 1 American every 36 minutes       every day;\n\n(4) esophageal cancer is among the deadliest of cancers,       with only about 1 in 5 patients surviving 5 years;\n\n(5) esophageal cancer has tripled in incidence among       younger Americans in recent decades;\n\n(6) esophageal…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Medicine (in this       section referred to as the ``National Academies''), under       which the National Academies shall conduct a study on the       prevalence and mortality of cancers among covered       individuals.\n\n(2) Deadline.--\n\n(A) Date.--The Secretary shall finalize the agreement under       paragraph (1) by not later than 60 days after the date…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…importance of  saving lives from Prostate Cancer through awareness, education, and  effective treatment for men's health in our Nation. Prostate Cancer is  one of the most common cancers among men. As such, efforts that  increase awareness of early detection, treatment, survival, and long- term health are vital.\n\nAs the second leading cause of cancer death…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695861/recognizing-september-as-national-prostate-cancer-awareness-month"}]