[{"senator": "Lou Correa", "party": "Democrat", "sentence": "My bill requires the Secretary of Homeland Security to create a plan  to address capability gaps and integrating innovative technologies into  our border security operations."}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "No nation--at least today--matches the combat capability, the  professionalism, the effectiveness of the U.S."}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Yet with the kind of military force being brought to the region,  there is a danger to our sailors, our marines, and our soldiers, as  Senator Kaine outlined, because if Venezuela believes we are on the  precipice of war, they have the capability to take action against our  ships."}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "Additionally, Congress could  require that the architecture of a central bank digital currency not  have surveillance capability."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "But military capability is not the same as strategic wisdom."}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Furthermore, the bill requires the Homeland Security Secretary to  submit to Congress a strategy for regular external evaluations to  identify capability gaps and propose contingency plans if biodetection  technologies fall short."}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Speaker, this bill strengthens FSOC's capability to  execute its mission by improving consistency, accountability, and  outcomes for our financial system."}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "When we assist in filling in these capability gaps with our partners,  we help contain the crises and limit threats to regional stability by  providing relief aid within hours or even within days of a disaster."}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Instead, it requires Homeland Security's  Office of Countering Weapons of Mass Destruction to decide which cities  to partner with for the program based on the jurisdiction's capability  and capacity to prepare and respond to terrorist attacks and other  high-consequence events."}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "They want to take away the decisionmaking  capability of all Ohioans."}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "His mastery of military       logistics proved that excellence and leadership flow from       capability, not ancestry."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "If they use the internet and if they have internet capability,  then send them a note."}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "These significant investments in the service signal our confidence in  the capability of the Coast Guard to conduct each of their diverse  missions to better serve the American people."}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "IBAS is working to  provide secure, credible, and reliable domestic advanced packaged  semiconductor manufacturing capability."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "[The WHO] directly       provides that capability for the United States to guide the       determination of our own fall flu vaccine."}, {"senator": "James Risch", "party": "Republican", "sentence": "The proposed sale will improve the Kingdom of Saudi       Arabia's capability to meet current and future threats and       give it the ability to precisely engage targets with much       less risk of collateral damage than other guided missile       systems."}, {"senator": "Andy Barr", "party": "Republican", "sentence": "He destroyed Iran's nuclear weapons capability."}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "It is the future of our  long-range strike capability, designed to evade modern air defenses and  deliver both nuclear and conventional payloads across the globe."}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "LC-130s are polar ski planes that possess the unique capability of  being able to land on snow instead of solely on a paved runway."}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Just this past weekend, the world saw, once again, what American  resolve looks like when we are paired with unmatched precision and  capability."}, {"senator": "James Risch", "party": "Republican", "sentence": "national interest to assist this ally in developing       and maintaining a strong and ready self-defense capability."}, {"senator": "French Hill", "party": "Republican", "sentence": "They drive innovation and job creation  in our districts, but they are often limited from reaching their full  capacity or capability because of overregulation."}, {"senator": "James Risch", "party": "Republican", "sentence": "This       notification relates to enhancements or upgrades from the       level of sensitivity of technology or capability described in       the Section 36(b)(1)AECA certifIcation 24-62 of July 25,       2024."}, {"senator": "James Risch", "party": "Republican", "sentence": "The proposed sale will improve Poland's capability to meet       current and future threats by providing air-to-air defense to       protect Polish and allied forces in transition or combat and       significantly improve the Polish contribution to NATO       requirements."}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "859) to require the disclosure of a camera or recording  capability in certain internet-connected devices."}, {"senator": "James Risch", "party": "Republican", "sentence": "This       notification relates to enhancements or upgrades from the       level of sensitivity of technology or capability described in       the Section 36(b)(1) AECA certification 22-71 of December 6,       2022."}, {"senator": "French Hill", "party": "Republican", "sentence": "The capability for the government then to follow on and directly  freeze or delete Americans' funds on a whim is not compatible with our  values, our cherished freedoms, our way of life, or even the past  approach to the evolution of payments in our country."}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Within the Committee staff shall be an element with       the capability to perform audits of programs and activities       undertaken by departments and agencies with intelligence       functions."}, {"senator": "Dale Strong", "party": "Republican", "sentence": "He earned his third and final star in 2022, becoming the director of  the Army's Rapid Capability and Critical Technologies Office, more  affectionately known as RCCTO."}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "This mission clearly showed  America's full force and capability to instigate good in the world and  battle the forces of evil."}]