[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…United States Congress. We may be the  youngest, but his ideas are very old.\n\nUndermining democracy in D.C. isn't new. It is just wrong. The people  who live in the Capital of the world's greatest democracy deserve that  democracy themselves.\n\nMr. Speaker, I think it is very interesting, as we sit here, I keep  hearing my colleagues bring up the ``working…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…support of my proposed  amendments to the National Defense Authorization Act for fiscal year  2026.\n\nOhio's 13th Congressional District has long been known as the Rubber  Capital of the World, and both of my amendments uphold that legacy by  investing in American manufacturing to ensure this vital industry  remains globally competitive in the United States.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…at the  other end of life. He is a senior. He is a constituent who is dependent  on Medicaid. He is actually a 76-year-old widower who lives in  Wenatchee, the apple capital of the world.\n\nNow, after Miguel's wife passed away, he relied solely on his Social  Security check to cover his living expenses. He is a retired orchard  worker, and he worked hard…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…headquartered in Akron, Ohio, my  hometown, in Ohio's 13th Congressional District.\n\nFor many years, the city of Akron, which I proudly represent, has  been nicknamed the Rubber Capital of the World due to its long history  of rubber and tire manufacturing. This industry has provided decades  of local jobs, economic development, and financial stability to  countless…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of recreational boating and sports fishing, along with a boating  industry second to none. We share it with Canada. Cedar Fair, with  Cedar Point, the roller coaster capital of the world, draws millions,  including from Canada, and they are boycotting our facilities right  now. Tourism generates billions.\n\nI ask the President, please, while he is in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Effective  Execution and Delivery and National Defense Authorization Act for  Fiscal Year 2026.\n\nOhio's 13th Congressional District has long been known as the Rubber  Capital of the World, and my First Amendment upholds that legacy by  investing in American manufacturing to ensure that this vital industry  remains globally competitive.\n\nTaking from the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…lost: 60  passengers, 4 flight crew, and 3 Army soldiers.\n\nThere is no one in my home State who hasn't been deeply affected by  this tragedy. Kansas is known as the Air Capital of the World, a place  where aviation is not just an industry, but a way of life. The  passengers on Flight 5342 were our neighbors, our coworkers, and our  loved ones.\n\nWe are forever…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…coach.\n\nJohn Wooden, the legendary coach, never got 12 national titles during  his time. I congratulate Coach Auriemma and the team.\n\nWe have here the college basketball capital of the world. If we add  on the six national titles that the men's program has actually  accumulated since 1999, its total is 18. I was there for the first one.  It was like a religious…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…advancing critical infrastructure  priorities such as the Cross Harbor Rail Project and the Gateway  Tunnel, helping ensure that New York City remains the public transit  capital of the world. He led our efforts to establish congestion  pricing in Manhattan and fend off attacks by President Trump and  Secretary Duffy.\n\nDuring his tenure, Andrew held hundreds…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…regulate stablecoins,  recognizing their global role in the global economy. Both  administrations have recognized that for the United States to remain  the financial capital of the world, Congress needs to pass clear  regulatory rules that protect consumers and foster innovation here at  home.\n\nI started working on this legislation 3 years ago with Cynthia…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…career victory on his first-ever  non-superspeedway track.\n\nAt just 20 years old, Love is no stranger to winning and bringing  back hardware to the stock car racing capital of the world. At age 15,  he set a record as the youngest winner of the ARCA Menards Series West  and the youngest winner in any NASCAR-sanctioned race.\n\nNorth Carolina is proud…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696515/recognizing-jesse-love-jr"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…us to include our two bills in the  CLARITY Act.\n\nThe United States has the opportunity to lead and deliver on  President Trump's promise to make America the crypto capital of the  world. We cannot and will not fail.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…boasts 23 commercial seaports, 7 of America's largest petroleum  refineries, 3 LNG plants, and 60 percent of the Nation's strategic  petroleum reserve.\n\nAs the energy capital of the world, we understand the critical  importance of this very important, very good bill. Our hardworking  families on the Texas Gulf Coast depend on a robust energy sector, as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…the land of the free  because together with the CLARITY Act and the GENIUS Act, we will  protect Americans' financial liberty and make the United States the  crypto capital of the world.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693727/anti-cbdc-surveillance-state-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…money that buys our debt.\n\nRay Dalio, the Bridgewater founder, has written these articles that  say we have a problem. The basis of the problem is there is not enough  capital in the world to deal with the bingeing of debt coming from the  United States and coming from China. Now it is starting to come from  Europe. In Germany, it looks like they are going…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…innovation possible and clear up many opaque and sometimes  contradictory laws.\n\nThis bill delivers on President Trump's commitment to make the United  States the crypto capital of the world, and I am proud that we are  paving the path toward American dominance in the digital future.\n\nToday, I again would like to give my support for the CLARITY Act, as…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693789/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Representative Baumgartner, said about the One Big Beautiful Bill Act  and its positive impact on rural America, the heartbeat of this  country.\n\nThe food, fuel, and fiber capital of the world, west Texas, I can  tell you, appreciates what is in this big and beautiful bill. It is  more than just stopping a 22 percent increase in taxes for hardworking  Americans…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…colleagues to vote in support of the  GENIUS Act. It is a vital step in keeping America at the pinnacle of  financial innovation.\n\nMr. Speaker, let's make the U.S. the crypto capital of the world.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693843/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Columbia, on January 29, 2025;\n\nWhereas many of the victims of the crash were residents of,       or connected to, Wichita, Kansas, colloquially known as the       ``Air Capital of the World'' for the city's historic role in       aviation; and\n\nWhereas many Federal, State, and local officials have       cooperated to respond to the emergency, investigate…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…that  is a date that will be forever etched in the minds and hearts of the  American people.\n\nAs their Representatives in Congress and the Representative of the  Air Capital of the World, we come together today to offer our sincerest  condolences to each person who is grieving the loss of a loved one and  to honor the victims of Flight 5342 and PAT 25.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…congratulate the Youngstown  State women's bowling team on winning the 2025 NCAA bowling  championship over Jacksonville State on April 12, 2025.\n\nIn the ``Entertainment Capital of the World'', Las Vegas, the  Youngstown State women's bowling team certainly put on a show. The path  to the championship was vigorous, playing against very tough  competition…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690138/congratulating-the-youngstown-state-womens-bowling-team-on-winning-the-2025-ncaa-bowling-championship"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Corning plant in  Harrodsburg, Kentucky. That is a $2.5 billion investment specifically  because of this bill in my district.\n\nIn addition, we are known as the horse capital of the world in  Lexington, Kentucky, and at Keeneland Sales, a world-famous, world- class horse sale, yearling sale, every September, it has a $6.5 billion  economic impact to the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…warning. The entire world's capital markets--because  China is borrowing, Japan is borrowing, and now Germany is going back  into the debt markets--there is not enough capital in the world.\n\nWhen the United States is consuming 30 to 40 percent of all the money  that goes to sovereigns, to governments--what happens when there is a  shortage of savings in…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…that was created out of a vast network of partnership on both  sides of the aisle.\n\nMr. Speaker, as you know, this Congress cemented the United States as  the crypto capital of the world. The leadership of Members of this  Chamber on both sides took meaningful steps to lay a foundation for a  robust digital asset framework, one that fosters innovation,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…contribution to the region's agricultural production of cotton,  peanuts, and oddly enough watermelon.\n\nSouthern Living magazine just named Cordele, Georgia as the  Watermelon Capital of the World, yes you heard that correctly.\n\nThis town produces a plethora of summertime fruit, supplying much of  the state and the Southeast region with a sweet, refreshing treat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694766/cordele-watermelon"}]