[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of  thousands of marauding rioters and insurrectionists, Proud Boys, Oath  Keepers, Three Percenters, who came to try to overthrow a Presidential  election. They stormed the Capitol. They injured, wounded,  hospitalized, brutalized more than 140 officers, many of whom are still  suffering from the physical and mental wounds today.\n\nWe voted back on March…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…retaliation for  their legitimate investigatory and prosecutorial  work under prior administrations, including in relation to the January  6, 2021, attack on the United States Capitol and in retaliation for  attorneys upholding their ethical and legal obligations, including  candor and honesty to the courts.\n\nB. Directed and permitted the evasion and defiance…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…FIELDS. Mr. Speaker, I rise tonight to talk about something that  happened on January 20.\n\nOn January 20, the President of the United States took the oath of  office at this Capitol. Shortly thereafter, he signed several executive  orders.\n\nOne executive order was Executive Order No. 14151. That executive  order ended all DEI programs. The argument that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…will introduce later today.\n\nI will have more to say later this morning. But for now, I simply  want to thank all the survivors and family members who are here today  at the Capitol. Their courage is inspiring. They have come a long way  from across the country, taking red eyes and flying overnight so they  can be here for this important moment. Their…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…trapped up  in that gallery for hours and hours against my will on January 6, 2021,  I rise this evening to say that the rioters who created the chaos that  day here at the Capitol were un-American. They were violent. They were  unlawful.\n\nI rise to pay tribute to the seven officers who died, the 150 that  were injured, many of whom were hospitalized…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…called John  Adams the Colossus of Independence, and his thoughts on government  frame the very Constitution we swear to uphold every day we report to  work here in our Nation's Capitol.\n\nAbigail Adams was an early beacon for women's rights, and John Quincy  Adams fought the gag rule and slavery right here in the House. The  contributions of the Adams family…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697632/adams-memorial-great-american-heroes-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…backgrounds.\n\nNot all positions on the Hill are equal, and Daniel has had perhaps  the toughest assignment. He routinely handles the most challenges  questions put to lawmakers by the Capitol Hill press corps. They are  trained to find vulnerabilities in any argument and expose them to the  public. They are tenacious and intelligent, and Daniel does an  excellent…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…to buy computers and cars and  deporting Americans and allowing January 6ers to be hired to work for  the Federal Government, people who came in here trying to bludgeon the  Capitol Police and the people who work in this very institution.\n\nIn that committee, Republicans voted to allow them to work for the  Federal Government and have the authority to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…truly was a turning point that helped invigorate the fight for  our independence.\n\nAs a testament to the importance of this monument, Congress has on  permanent display in the Capitol rotunda, just steps away from here and  to the left of the monument of three great suffragists, a famous oil  painting by John Trumbull of the surrender of the British General…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "I rise in support of H. Con. Res. 9, which authorizes the use of the  Capitol Grounds for the 44th Annual National Peace Officers' Memorial  Service on May 15, 2025. I thank the gentleman  from Pennsylvania (Mr. Perry) for his leadership as the subcommittee…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…person to hear President Washington's  final words. ``Tis well.''\n\nThe current structure was completed in 1825 by Tench Ringgold, U.S.  Marshal and Keeper of the Keys to the Capitol, using enslaved labor.  Ringgold helped lead President James Madison and several members of his  Cabinet to safety during the British burning of the White House years  earlier…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…attacked police officers, many of whom sustained  serious injuries and five of whom have passed away since the attack,  including Brian Sicknick, a New Jersey native and a proud Capitol  Police officer.\n\nInstead of remembering and healing from the events of that day,  President Trump pardoned close to 1,600 seditious and violent  insurrectionists who were…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698775/holding-ice-accountable"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Government.\n\nNeither of my colleagues who is on the floor has said a word  explaining why they won't put the plaque up to honor hundreds and  hundreds of police officers on the Capitol Police force, the  Metropolitan Police Department, and the Montgomery County Police  throughout the region who came to defend us. Why won't they put the  plaque up if they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…these bills,  with due respect, know very little about the District of Columbia, know  very little outside of perhaps their walk from their apartment in Navy  Yard to this Capitol complex. They don't know the history,  neighborhoods, communities, and challenges that folks in the District  are facing.\n\nWhile my colleagues espouse the virtues of self-governance,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696978/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…McConnell, and I all share the same  goal. I think all 100 Senators share that goal.\n\nWe continue to see an unprecedented rise in threats targeting Members  of Congress, with the Capitol Police on track to investigate over  14,000 threat cases in 2025. That represents a 50-percent increase over  the nearly 9,500 threats Capitol Police reported in 2024.\n\nWe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…2025, which supersede and  replace the current ``Guidelines for Senate Tennis Courts,''  ``Regulations for the Senate Health Facility in the Office of the  Architect of the Capitol,'' and ``Regulations Governing Use of the  Senate Health and Fitness Facility.''\n\nThe updated regulations consolidate rules for the use of the fitness  facilities, including…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690978/us-senate-health-and-fitness-facilities-regulations"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…on Energy and Commerce.\n\nA graduate of the University of Maryland for both a bachelor's degree  in Political Science and a Juris Doctorate degree, Molly began her  career on Capitol Hill as a Legislative Assistant for Rep. Andy Harris  (MD-01) in 2019, before becoming Senior Advisor on Health Policy and  later Legislative Director for Rep. Richard Hudson…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…interference.\n\nNow, we stand here, closest to the shore. We absolutely should make  certain that these windmills are not going to affect our safety  standing right here in the Capitol.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695162/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…availability and commitment have directly improved customer  experience for countless constituents.\n\nI have requested the United States flag to be flown over our Nation's  Capitol in recognition of Mrs. Maddalena's extraordinary achievements  and contributions. I thank her for all she has done.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…to me now.\n\nIn July of 2020, Mikaela was diagnosed with a rare pediatric cancer.  She spent nearly 6 years traveling across the country for treatments  while also coming to Capitol Hill to advocate for children with cancer.  But unfortunately, she tragically passed away October 29 of this year-- advocating literally almost every day of her life.\n\nMikaela…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…bankers, veterinarians, public servants, biologists, and so much more.\n\nEvery year, thousands of the iconic blue FFA jackets from across the  country visit our offices on Capitol Hill. In my home State of  Minnesota, FFA has 15,000 members and 220 chapters, as well as 97  alumni chapters. This year, Minnesota FFA chapters will participate in  local…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700169/congratulating-chris-tungseth"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…for key provisions in the Farm Bill and  prioritizing broadband connectivity for precision agriculture.\n\nThroughout his career, John has been known in Washington and around  Capitol Hill for his effective advocacy, dedication, and leadership.  He's been a trusted colleague and friend--well respected by Members of  Congress on both sides of the aisle and…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…along the way to allow him  to serve for so long, and I will say I am blessed to call them family  as well.\n\nMark is not going far, and even though he won't be here in the  Capitol with us, I have no doubt he will continue to leave a lasting  impact on all of us after he leaves. His incredible tenure of service  has strengthened my team and this institution…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699705/historic-tax-relief-for-families"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Michael's inspiring creativity  and work ethic have been a major contribution not only to my team but  to the entire Republican Conference as a whole.\n\nAs every Republican on Capitol Hill knows, Mr. Speaker, if you have a  question on how to use digital media equipment or just create something  that stands out, then you ask Michael Comer.\n\nMany Members…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691928/good-bye-michael-comer"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…out of, the FAA people going to work at the  airport. I was embarrassed coming here and seeing the people sitting in  front of us here, the people guarding the doors of the Capitol  building, with no respect, having them come to work without respect and  paying them. That was extremely frustrating to me. It is just beyond  pale that that happened.\n\nOn…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…served in  key leadership positions in the Navy and became a passionate  motivational speaker and author.\n\nI have requested the United States flag be flown over our Nation's  Capitol to commemorate and honor our Vietnam Veterans to ensure their  heroism and sacrifices will never be forgotten.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…moms and babies and new dads, there are already  discussions underway for expanding that. Now that this has started to  be discussed, there are all kinds of discussions around Capitol Hill  about other things that should be granted the ability to vote by proxy.\n\nMr. Speaker, I believe that if Members agree with me that  Representatives shouldn't vote by…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…decisions.\n\nWere the far-left activists and Democrats here in this body the ones  not getting paychecks? No, Mr. Speaker. That was the air traffic  controllers, our troops, and our Capitol Police officers.\n\nWhen these same people passed ObamaCare, were they the ones impacted  by the law, or was it the middle-class teacher in North Carolina who  could no longer…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696677/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…well-earned distinction. As Chairman, Jerry has led  winning campaigns, mentored future leaders, and built coalitions that  have delivered victory at every level--from Town Hall to Capitol Hill.  His political instincts are unmatched, and his advice has shaped the  success of candidates and party leaders across New York.\n\nWhat defines Jerry most, however, is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692272/recognizing-jerry-sanok-for-forty-years-of-committed-service-and-leadership"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass the  bill (H.R. 250) to direct the Joint Committee on the Library to procure  a statue of Benjamin Franklin for placement in the Capitol.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 250\n\nBe it enacted by the Senate and House of Representatives…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}]