[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…wants to congratulate him  on his incredible victory, and we wish him the best of luck at The Open  Championship in Northern Ireland.               Honoring the Retirement of Captain Daniel Regan\n\nMr. CISNEROS. Mr. Speaker, I rise to honor the retirement of Captain  Daniel Regan of the Covina Police Department.\n\nHe was promoted to captain in 2022 and managed…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692888/congratulating-jj-spaun"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…his pilot's license in college before enrolling as the only Black  student in Purdue University's aviation program. At a time when Black  pilots were still rare, he became a captain for Delta Air Lines.\n\nThrough it all, he never forgot to pay homage to those who made his  career in aviation possible. He volunteered with a Commemorative Air  Force Red…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…Station  26 took first place in the inaugural HERO Act Chili Cookoff that my  office hosted at the California State Fair. I was proud to visit the  station to present ribbons to Captain Adam Huckaby and Firefighter  Taylor Edwards.\n\nAs we celebrate this milestone, we also have a responsibility to  support the men and women who support all of us, especially…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700044/recognizing-sacramento-metropolitan-fire-district"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Afghanistan under Taliban control where they will likely be suffering  or even die.\n\nMany of these families live in our community here in Virginia.\n\nTake the story of a former captain in the Afghan National Army. He  worked with the U.S. military, and his brother was shot by the Taliban.  His entire family now fears for their lives. Abandoning Afghans now…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…joined the Union Army, 19,000  joined the Union Navy, and 40,000 died in that war. Robert Smalls, who  convinced Abraham Lincoln to allow these freedmen to serve, became a  captain in that Navy, participated in 18 battles, and was the only  genuine hero of the Civil War. In my not-so-humble opinion, Robert  Smalls is the most consequential South Carolinian…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Congresswoman Gabrielle  Giffords. She survived a gunshot wound to her head through the sheer  force of her will, exceptional medical care, and the unwavering support  of her husband, Captain Mark Kelly.\n\nI worked closely with Gabby when she was in the State legislature,  and I served on the Phoenix City Council. She was a singularly talented  leader, brilliant…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Carlson began his law enforcement career in 1998 and later  joined the San Ramon Police Department during its founding in 2007.  Quickly rising through the ranks, he became captain in 2017 and chief  in 2022.\n\nChief Carlson additionally served as the director of the city's  Office of Emergency Management from 2015 to 2022. His leadership was  instrumental…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697972/recognizing-police-chief-denton-carlson"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…want to especially thank the staff director of the Rules Committee  Elizabeth Farrar, who also served as staff director for JCCIC.\n\nOur committee's U.S. Capitol Police Liaison Captain Sean Patton  worked tirelessly to synchronize the work of the JCCIC and the  department's inaugural task force, commanded by Inspector Mike  Spochart. I want to thank Captain…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…freshman at Indiana University's Kelley School of  Business. He was known for his joyful smile and ability to inspire a  sense of community wherever he went.\n\nAs a volleyball team captain and a STEM competition coach, Nihaal was  always attuned to the needs of those he led. Whether mentoring a  teammate  through a difficult challenge or calmly navigating high-stakes…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691338/in-memory-of-nihaal-grandhi"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…all-Black units or the  training of Black recruits. One would go on to make his career in the  Navy after World War II, with the rest returning to civilian life. In  the 1970s, Captain Edward Secrest, a former instructor, gave the group  the name the ``Golden Thirteen.''\n\nI urge my colleagues to support this bill to honor the first African  American officers…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699496/introduction-of-the-golden-thirteen-congressional-gold-medal-act"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "Ms. PINGREE. Mr. Speaker, it is my distinct honor to recognize  Patrick Keliher as the 2025 recipient of the Atlantic States Marine  Fisheries Commission's Captain David H. Hart Award. This recognition  honors Pat's remarkable leadership and contributions toward improving  Atlantic Coast marine fisheries.\n\nAs former Commissioner of the…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…the  highest leadership levels, although 40 percent of the total Active-Duty  Force consists of people of color.\n\nYou have heard about Robert Smalls becoming the first Black captain  in the United States Navy during the Civil War. You have heard about  Colin Powell, the first Black Chairman of the Joint Chiefs of Staff,  and the list goes on and on.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…about their son's sacrifice to keep America  safe.\n\nContrary to the rhetoric of our President and his administration, our  country is safer because of Muslim Americans like Captain Khan and the  thousands of Muslim American police and  Muslim American soldiers, sailors, marines, airmen, and guardians. I am  grateful for their service every day.\n\nThe…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…retired.\n\nJonathan Elkind, Former Assistant Secretary of Energy;       Nancy Ely-Raphel, US Ambassador, retired; Gregory Engle, US       Ambassador, retired; Joseph Fallone, Captain, US Navy,       retired; John Feeley, US Ambassador, retired, Former       Principal Deputy Assistant Secretary of State; Gerald       Feierstein, US Ambassador, retired,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Kahiki-- today's Tahiti and Marquesas--hundreds of years before the arrival of  other recognized Pacific peoples in their homelands. By the time of  first Western contact with Captain Cook in 1778, Native Hawaiians had  developed a complete and vibrant culture with their own language,  religion, values and sophisticated systems of governance, agriculture…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Christine Bullington, and entered the  United States Army. Vern served as a helicopter pilot in Vietnam. He  received many accolades for his service and was later discharged as a  captain in 1970.\n\nFor over 50 years, Vern called Bettendorf home.\n\nVern managed two businesses, Harvey Homes and Kirkwood Investors  Realty, where he contributed greatly to the community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Kehrli, Brooke Alred, and Andrew Smith.\n\nIn my office, I thank my lead Military Legislative Assistant, Andrew  Maloney; in the Department of War, United States Marine Corps Captain  Alex Feldman.\n\nMr. Speaker, with that, I urge my colleagues to support this year's  NDAA.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…way to the Class 2A PIAA  Championship game.\n\nThough they trailed with four minutes to go in the fourth quarter,  late game heroism cut the deficit to a single point. Senior captain and  Linville Hill's all-time leading scorer, Stephen Smucker, then sank the  go-ahead basket with under thirty seconds to go. A spectacular defense  from Linville Hill Christian…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689659/congratulating-the-linville-hill-christian-school-boys-basketball-state-champions"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I rise today to celebrate my incredible  Marine Corps fellow, Captain Simona Elvin, for her tremendous work this  past year in my office.\n\nSimona has been instrumental in helping prepare for legislation,  meetings, and defense events. Her expertise…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698207/recognizing-simona-elvin"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize the  distinguished service of Captain Mike Retzlaff, a proud veteran of the  United States Army whose dedication, leadership, and commitment to duty  reflect the highest traditions of military service.\n\nBorn and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Congressional Gold Medal Act.\n\nThe night before, those players spoke to our conference. I had the  privilege of going out to dinner with them. I was sitting right next to  Captain Mike Eruzione. I remember he said: You know something, Pete.  This game changed my life.\n\nHe was either going be a member of the military, a police officer, or  a firefighter.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and for Oasis. Carol  is an inspiration to the staff and the team she serves with.  Additionally, Carol has served for years as a Sunday School teacher  each week and Poll Captain of elections in her area. She truly is a  Hero in the community.\n\nIt is clear Carol Berti has made a profoundly positive impact on our  community, and I am grateful for her…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690132/recognizing-carol-berti"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…completing his high school studies. He completed his basic  training in San Diego, California and his first duty station was Naval  Air Station Pensacola where he worked as a plane captain for A-4s and  T-2s. While there he qualified for the A-4 back seat rider before  transferring in 1980 to the USS Coral Sea CV-43 which was stationed in  Alameda, California.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…veterans that stands as the most  profound expression of her dedication. Recognizing the crisis of  veteran suicide, Diane took action. She joined forces with Vietnam war  hero Captain David A. Christian to establish Victor Six Health and  Fitness, an innovative program designed to combat the mental and  emotional struggles afflicting so many of our returning…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…the Lancaster County Special Emergency Response Team, and platoon  leader. Demonstrating an unparalleled work ethic, he rose through the  ranks, and in 2021, was appointed Captain of Patrol, the largest  division of the Lancaster City Bureau of Police.\n\nIn July 2022, Chief Mendez was sworn in as Chief of Police, becoming  the first Hispanic police chief…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…but out of  duty and honor.\n\nMr. Speaker, I know this personally. My father was a police officer  and a detective, while my grandfather also was a firefighter. He was  the captain of his house.\n\nI remember clearly the risks that my father took every day he walked  out the door. I remember well what it meant to be a police family, and  I know the courage…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Williams began his journey as a volunteer with the Strasburg  Volunteer Fire Department in 1975. He went on to serve 25 years with  Fairfax County, ultimately retiring as a captain, and then brought his  leadership to Shenandoah County, where he has served since 2005,  including the past 9 years as chief.\n\nChief Williams has been a unifying force, skillfully…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…learning courses through  LinkedIn Learning.\n\nKaren is a member of Women in Trucking and She Trucking. Her  employer, McKee Foods, recently recognized Karen as a Road Team Captain  with the Tennessee Trucking Association. As a Road Team Captain, Karen  visits local schools to teach students how to share the road safely  with big trucks and promote the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689097/recognizing-ms-karen-partin"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…They are angry, in large part, because they realize one simple  truth: The Somali pirates are not in the Horn of Africa anymore. They  are right here in our country, and their captain is Tim Walz.\n\nWhile my constituents suffer today, 81 percent of Somali families are  on welfare. Nine billion dollars was stolen from child nutrition,  housing, and autism…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698688/fraud-in-minnesota"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to congratulate Captain Nathan  L. Hammond for his recent promotion and recognize his distinguished  service to our nation in the United States Air Force.\n\nCapt. Hammond began his military career…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690077/recognizing-the-military-service-of-nathan-l-hammond"}]