[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Massachusetts.\n\nRhode Island's effort a year and a half before was to trick the  military vessel into grounding herself, come down the bay in longboats  at night, shoot the captain, capture the crew, and blow the boat up.\n\nWhat more did we need to do to be in the history books? Well, we are  getting there. I give this speech every year.\n\nRory Raven wrote ``Burning…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…remain in their homes and communities.\n\nFor some, it is the care they receive from these aides that actually  helps them enter or remain in the workforce. It is difficult to capture  the profound impact they have on not only families but our economy.\n\nWhile they wait for that proposal to go through, the administration  has already announced that they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…State will see  their premiums skyrocket. Premiums will rise for small businesses as  well as individuals.\n\nThese numbers are staggering. They are stunning. But they fail to  capture  the human costs, the impact on everyday people who look out the window  in the morning as they have their first cup of coffee or see their  children at night for dinner as…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…count going  north up into Detroit and, on the north side of Lake Erie, the cities  in Canada.\n\nThere is a whole lot of energy wasted, being dumped into the lake. We  have to capture it.\n\nBy investing in geothermal technology, communities across our country  and the world can strengthen energy security; reduce reliance on dirty  fuels; create good-paying…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…1,000 from the National Park Service, crippling decades of conservation  efforts and degrading public land management.\n\nThese numbers alone are shocking, but they don't fully capture the  impact. I want to share what my constituents have told me about these  firings because behind every statistic is a real American.\n\nJason, a former National Park Service…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Indeed,  we warned that these actions were always directed at the government and  economy of Venezuela.\n\nThat campaign has now culminated in a military raid on Caracas, the  capture of Nicolas Maduro and his wife, and President Trump's  extraordinary declaration that the United States will ``run'' Venezuela  and seize control of its oil reserves.\n\nLet…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…government. We currently have a Republican Governor. This is an  allocation of grant funds to the Youngkin administration's Virginia  Department of Energy so they can do carbon capture and storage.\n\nThis is a way to take current coal technologies and make them cleaner  and more useful--canceled; enhancing energy resilience--canceled;  hydrogen deployment--canceled;…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Actually, it is a tax only on larger emitters because it is  only applied for 25,000 metric tons annually, so it is on the larger  ones.\n\nIt is designed to encourage companies to capture more methane rather  than venting or leaking it. The methane fee provides proof to consumers  and competitors that we are serious about producing the cleanest, most  efficient…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…impact that she made on their lives.  Alison's skills from her time as a teacher can be seen during the many  meetings that she has with student groups, where she is able to capture  the attention of students and skillfully answer their questions in a  thoughtful and accessible way.\n\nAlison's experience working in public education in Louisiana inspired…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…than 20 million people? Will U.S. forces be  used to protect oil infrastructure in Venezuela? Will our President  continue to stand by the illegitimate regime that Maduro's capture has  left in place or will we support the outcome of the last election in  which Maduro's opposition was triumphant? Are we better off spending  our Nation's time and taxes…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Videos show otherwise.  Then, they said that he dragged an officer. We have yet to see the  evidence. They said that the officer feared for his life, but  neighbors' videos capture gunshots and then a car coasting. Silverio  was already incapacitated before crashing into a semitrailer.\n\nThose same videos show officers, including the one supposedly  seriously…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…accounts or from executive accounts or from other Federal agencies to  conduct these costly Venezuelan operations. From where? So now the  simple question: How much did it cost to capture the dictator of  Venezuela, Maduro, and his wife?\n\nI ask, Mr. President, how much money and exactly from which accounts?  Give me the specific numbers and accounting titles…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…the Year all in one season.\n\nA'ja's impact was pivotal as the Las Vegas Aces won a record 16  straight games at the end of the regular season and then swept the  finals to capture their third championship in 4 years.\n\nBeyond those statistics, A'ja continues to elevate the sport. She  inspires young girls, and she uses her platform to advance equity…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698087/aja-wilson-named-times-2025-athlete-of-the-year"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "Mr. CASTRO of Texas. Mr. Speaker, the President of the United States  is now running Venezuela from Washington.\n\nOn January 3, the President ordered a military operation to capture  Nicolas Maduro and install the President's hand-picked successor, Delcy  Rodriguez, as the interim president.\n\nPresident Trump went to war, removed a leader, and established…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the       Justice Department considered nominating a special counsel to       investigate Clinton. Despite its purges and threats, however,       the administration could not capture the referees. Trump did       not replace Comey with a loyalist, largely because such a       move was vetoed by key Senate Republicans. Likewise, Senate       Republicans…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…the challenges of managing growing volumes of  natural gas associated with oil production.\n\nNorth Dakota producers have endeavored to dramatically increase the  targeted gas capture rate from 74 percent to 95 percent over the past  10 years, again, through innovation, through technology--the latest and  greatest methods that we have implemented.\n\nProducers…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…deciphered Japanese naval codes and intercepted messages detailing an  attack, which was later confirmed to be targeting Midway. Richard's  group also contributed to the Buckner Bay capture of a German Enigma  Code Machine. Being involved in such critical turning points in United  States history is a testament to Richard's intelligence, bravery, and  impact.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Championships in  Oaxtepec, Morelos, Mexico.\n\nRepresenting our Nation with pride and determination, the team  demonstrated remarkable resilience by winning four consecutive games to  capture the championship title. I am especially proud to note that Izzy  is from Myrtle Beach and was the only member of the Women's Junior Team  from South Carolina, making her achievement…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…Manufacturers today produce appliances that connect to software  applications that can be set, managed, and monitored through one's  computing device. They are designed to capture voice commands from  around the vicinity, recording information to adapt to the way  individuals give commands. They are also often equipped with cameras to  capture QR codes…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…resolution  that says that we condemn the horrors of socialism not just the  atrocities associated with mass murder in Ukraine or Cuba or Venezuela  or imprisonment but the capture of the spirit that ends individual  freedom and ends individual opportunity.\n\nMr. Speaker, I will say that I have been shocked at some of the  debate today that we hear from…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…technological advantages and help find better ways to use coal and  natural gas more cleanly. We should use our expertise in finding ways  to control emissions with carbon capture and other pollution control  technologies.\n\nThat is why DOE funding for fossil and renewable research is vital.  We need to produce and then export the best, cleanest, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…capabilities, mining production, water resources,  and more.\n\nSpecifically, this bill repurposes wasteful Biden administration  spending on things like unproductive carbon capture toward real  infrastructure and energy production capabilities. This includes $1.785  billion in total resources for nuclear energy technology, $720 million  in investments…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698759/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…exploitation of the software.\n\n2. The AIM-260 Guided Test Vehicle (GTV) is an instrumented       version of the missile where the warhead is replaced with a       telemetry unit to capture missile data parameters during       live-fire flight testing.\n\n3. The AIM-260 Integration Test Vehicle (ITV) is a modified       AIM-260 missile used for captive test purposes.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…permitting coming out of Washington has  made it only harder.\n\nThis is a voluntary opportunity to create a pilot program that can  create a new idea, make a good recommendation, capture a best practice,  and help to instill it in a way that improves water quality not only at  source, but downstream for every State, as well.\n\nWhile I support what the EPA is…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…diplomatic ties with the Maduro regime.\n\nIn 2020, the Department of Justice charged Maduro with  narcoterrorism, and the United States offered a $15 million reward for  his capture.\n\nIn 2024, in my view, Mr. Speaker, was the last straw when Maduro lost  the national election and annulled the results.\n\nHe simply is a cheap, drug-dealing, election fraudster.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…integrity, justice, and duty. Their legacy lives on in  the hearts of those they touched.\n\nTo the families of our fallen heroes, we offer our deepest gratitude.  No words can truly capture the weight of your loss or the sacrifice,  but please know that your loved ones will forever be honored and  remembered.\n\nMr. Speaker, let us reaffirm our commitment to those…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…community meal program with Advocates for  Homeless and Those in Need, and the Change for Life Baby Bottle  Project, which supports families in crisis. And yet, these examples  capture only a fraction of Assumption BVM's deep commitment to serving  those in need.\n\nThe parish's Knights of Columbus chapter provides even more  opportunities for parishioners…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "John Thune", "party": "Republican", "sentence": "…information  leading to the arrest or conviction of Maduro to $25 million. But then  President Trump directs an isolated Special Forces raid in support of a  valid warrant to capture Maduro so that he can be tried for drug  crimes, and Democrats are falling all over themselves to criticize the  seizure and arrest of this international criminal. Talk about…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…cubic feet of water per second to be cascading out of  Folsom Dam, we at the same time had a drought emergency still in effect  because we don't have adequate water storage to capture the water when  it comes. We don't have the ability to level out these cycles of  wetness and dryness that are utterly predictable in California. On top  of that, we have…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…to higher standards of  service and compassion. Throughout their years helping the community,  the UASC Tryzub embodies this spirit of honor in ways that words can  scarcely capture.\n\nFounded in Philadelphia by displaced World War II Ukrainian  immigrants, the UASC Tryzub became an important part of the community.  The UASC Tryzub organized teams of all…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}]