[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…``partisan.'' He has called for the  prosecution of political opponents without evidence. He has treated the  justice system not as a neutral arbiter but as a weapon to be captured  and wielded. And, increasingly, he is succeeding.\n\nWe have seen this partisan and dangerous Supreme Court grant  Presidents sweeping immunity from prosecution. We have seen…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…is a  story of a father whose dreams were denied and a son who honored his  legacy by breaking barriers of his own. It is a story of persistence,  pride, and progress. Brad captured it best when he said: ``No matter  what the circumstances that you are up against, it is possible to rise  against adversity, just like the airmen did, and succeed in life.''…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…action that they have led, but Maduro is now in jail in New  York City and 15,000 U.S. troops and an American armada are still  hovering off Venezuela's coast.\n\nWe already captured Maduro. He is in jail. So what are our troops  doing down there? Clearly, this is not about law enforcement. This is  not about democracy. No, as my colleague from Maryland…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…building, or conducting regime change  operations.\n\nThis operation was not about narcotics, nor was it about democracy,  nor was it about oil. The military occupation in Venezuela captured the  country's corrupt dictator but has left the corrupt drug-running regime  in place instead of turning over the reins of governance to that  country's legitimately elected…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…System--that is the Department of Defense and Department of Veterans  Affairs. This means that while Medicare and commercial-plan  beneficiaries will be able to access  the drugs captured by the BIOSECURE Act, veterans and service members  could be alienated from treatments and cures that are available to  other Americans. This bifurcation is not only unfair,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698004/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…reason we were talking about these strikes.\n\nJanuary 3 comes along. U.S. forces entered Venezuela, from what I can  tell, in a truly amazing and heroic military operation, captured  President Maduro and his wife, and brought them to New York City. Why?  Why do we find ourselves doing this?\n\nI think there are really two reasons, one unspoken, one spoken.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…challenge to rebuild Anaheim High School's aquatic  program after 20 years with no swimming pool and no swimming program.  Under her leadership, the girls' water polo team captured the first- ever CIF division title in women's sports in the school's history.\n\nBeyond that, Denise is a devoted mother of three, Nicholas,  Rosemarie, and Emma. I am honored…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…evicted, and I was later on censured, censured but not  silenced. Yes, I stand today where I stood then. Censured but not  silent I stand today where I stood then. It is best captured in this  photo that depicts what occurred: censured not silenced.\n\nSo I stand today where I stood then, and I stand today where I stood  then because there is a CR that has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Bay of the wretched and detested Gaspee, so  they ended up shooting the captain of the vessel, Lieutenant  Duddingston. He survived his wounds. They took the vessel. They  captured the crew. They took everybody ashore. They saw that medical  care was given to Lieutenant Duddingston. They came back out, and they  set fire to the Gaspee.\n\nThis painting,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…technology and through American  leadership and American ingenuity and American exports; that we took a  strategic approach; that we had a plan that made sense; and that we  captured, along the way, every--every--molecule that we could find of  fugitive methane from oil and gas and from agriculture and from  landfills; that we said yes to wind and solar;…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…around his neck. He  was a great teacher, and he managed community colleges after his  service.\n\nDuring one of his many missions, his plane was shot down in battle,  and he was captured as a prisoner of war. Even in captivity, Harold  never wavered in his duty to his country.\n\nAfter the war, he continued to serve, answering the call again during  the brutal…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…should not have been exposed to the public. In the opinion of many  experts, they should not have been exposed to the public.\n\nI will read some of the information that was captured by Mr.  Goldberg.\n\nMr. Goldberg captured this, and this comes from The Atlantic  magazine. They published this information. It has been made public. My  belief is that the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…grandson, Sam Iacobellis. Her granddaughter Nina Bloom provided  the prayers of her passing and was followed by Sam, whose eloquence,  tone, humor, with compassionate care captured a truly remarkable woman  and the family she raised. I have had the privilege of knowing the  Christiana family for over sixty years. The farm on 1215 Silver Lane  was a magical…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…speak, and we need your help to end  it. America needs your help. The Nation has been appalled by what we  have seen happening in our State of Minnesota, the stories that have  captured everyone's attention.\n\nTwo innocent U.S. citizens, Alex Pretti and Renee Good, shot and  killed on the street in broad daylight by Federal agents just as they  were trying…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…testament to their dedication,  discipline, and work ethic.\n\nLike so many baseball fans across the country, I was inspired by  their determination and spirit. They have certainly captured our  hearts. While they may have fallen short of the ultimate prize, their  accomplishments are something to be celebrated.\n\nCongratulations to the Clarendon Hills Little…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695094/recognizing-clarendon-hills-little-league-team"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…proud of them.                Congratulating Fowler Eagles Girls Basketball\n\nMr. BARRETT. Mr. Speaker, I rise today to recognize the Fowler Eagles  girls' basketball team, who captured the State championship this past  weekend with a commanding 53-29 victory.\n\nI was at the Breslin Center to watch the game with two of my  daughters: Eleanora, who just finished…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689005/congratulating-east-lansing-trojans"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…The Jewish High Holy Days of Rosh Hashanah and Yom Kippur,       an ancient people's peak spiritual drama of courageous       contemplation and heartfelt contrition, are captured in the       life and work of Rabbi Irving Greenberg, acclaimed modern       Orthodox rabbi and author. His latest book, The Triumph of       Life (A Narrative Theology of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…the Bureau fails to identify which firms       comprise that number, or to provide specific criteria that       would enable market participants to determine the firms       captured by the rule. It is essential that businesses and       consumers understand the implications of this proposal to       enable them to provide comprehensive feedback on its…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…lowest scores of the season, Ethan  Thompson, Chriss Bassett, and Ainsley Asbury.\n\nCompeting among seven strong teams at Dogwood Trace Golf Course in  Petersburg, the Tigers captured the championship by narrowly edging  York High School by just three shots for the victory. This hard-fought  win secured Tabb a well-earned berth in the Virginia High School…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696433/congratulating-the-tabb-high-school-tigers-golf-team"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…they were detected--either through satellite images  or different mechanisms of looking for people: heat detection of people  moving across the desert--but not able to be captured.\n\nHow many of them were Iranian agents as well? How many of them are,  today, in sleeper cells? Well, the truth is, no one knows. What we do  know is this: President Trump…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…victory is just around  the corner. That is his dream, but it is a lie. The facts show that  Putin is nowhere close to winning. Here are the facts: During the year  2024, Russia captured 0.6 percent of Ukrainian territory. Last year, it  captured 0.8 percent. So 2 years of massive, tragic bloodshed caused by  Vladimir Putin has resulted in 1.4 percent of enemy…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…hospital before rejoining his ship, where he  continued his duties, including cutting mine cables and neutralizing  deadly sea mines.\n\nIn one remarkable mission, the USS Moreno captured a German one-man  submarine armed with a torpedo. The vessel was brought aboard for  inspection, drawing the attention of senior military leadership eager  to study its design.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Colorado with grit and  determination.\n\nThe team brings together players from across our district, including  Grand Junction, Clifton, Palisade, Parachute, and Rifle. They first  captured the district championship and then fought their way through  the state finals, defeating two tough Denver-area teams to claim back- to-back state titles--their third in just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695294/recognizing-colorado-state-champions-the-grand-mesa-little-league-senior-all-stars"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…even temper, his humor, and his  presence in this body. I will miss hearing him call me Francis Gary  Powers after the U.S. spy plane pilot who was shot down over Russia and  captured in the 1960s.\n\nMy wife, Ann, and I are praying for God to comfort Doug's wife, Jill;  his children; his family; his staff; and all who, like those who have  gathered in this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698735/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…glove with our allies to ensure that these technologies are not  acquired by the PRC, and we know the stakes if we don't accomplish that  job.\n\nIn the same way that China has captured the supply chain for the  production of processing critical minerals, they have designs to  capture the manufacturing capacity for advanced semiconductors. Then  they will…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…precedent where Presidents  have undertaken limited military action without a declaration of war.\n\nClinton acted in Kosovo. Obama acted in Libya. Most similarly, George  H.W. Bush captured drug-trafficker Manuel Noriega back in 1990. No one  screamed constitutional crisis then. In fact, those acts were  celebrated by both sides, and they were upheld by Federal…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…million bounty for his arrest and  extradition to the United States. He was indicted twice in Federal  court and should stand trial in the United States.\n\nWith Maduro rightfully captured, the circumstances have now changed.  While I support the operation to seize Nicolas Maduro, which was  extraordinary in its precision and complexity, I do not support  committing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…victory marks the  20th State title for legendary Head Coach Mark Ingerson, 18 in speech  and forensics and now 2 in debate.\n\nSalem's dominance was on full display as the team captured individual  State championships in three of four events. Senior captain Claire  Rawlins led the way with a perfect 6-0 record in Lincoln-Douglas  debate, tackling the timely…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Julian Lathrop, Robert Shaw, and Arthur ``Doc''  Washburn, who shared a dream of creating a new kind of educational  environment. As the school's first headmaster, Doc Washburn captured  that vision best when he wrote, ``Our goal is to start a small school  with an informal atmosphere, where the needs of each boy would be  attended to, where friendship between…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…and paperwork. It is about whether we  will defend women or whether we will erase them. It is about whether  the strongest military on Earth will be grounded in reality or captured  by ideology.\n\nMr. Speaker, I urge my colleagues to stand with the truth, stand with  women, and stand with our military, and vote in favor of this  amendment.\n\nMs. MACE.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]