[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…I heard from another constituent--a working mom of  two--whose parents rely on Medicaid for healthcare. She told me she  doesn't think it is fair to shift the cost of care to families like  hers to pay for tax cuts to the wealthy.\n\nYou know, that is the incredible thing about democracies: People  write  in, they send emails, they call our offices, they…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Commonwealth in countless       ways.\n\nIn addition, it's important to consider the impacts that       ending TPS for Haiti will have on population health, health       care workforce, and impacted families and communities in       Massachusetts, as I have discussed above. At the very least,       if TPS is ultimately revoked this February 3rd, we must think…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…than one-half million dollars owed to them by the Federal  Government through our casework services.\n\nThat is one-half million dollars returned to veterans waiting on  care, to families caught in bureaucratic limbo, and to seniors who  depend on their Social Security checks to live with dignity.\n\nIf my constituents need help navigating a Federal agency,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697289/oregons-third-district-constituent-services"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…are not trimming fat. We are cutting  hope.\n\nLet's be clear about the false choice we are being asked to make. Do  we feed the greed of billionaires, or do we feed and care for families  like Atalina's? We know who Republicans are choosing.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691491/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…hospitality workers, tips aren't extra; it is  part of their income that they use to make ends meet. Tips are how  Nevadans pay their rent, cover their groceries, take care of their  families, their kids.\n\nAnd Nevada has more tipped workers per capita than any other State.  So this bill would mean immediate financial relief for countless hard- working families.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…of Inkster and throughout western Wayne and Oakland County, have  created powerful legacies through food, beauty businesses, fresh  markets, and nonprofits working to care for our families and new  immigrants.\n\nCaribbean Community Services in my district, a nonprofit  organization, has done an outstanding job in uplifting Caribbean  history. Through their…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…from their responsibilities caring for aging or disabled loved ones.\n\nAcross the country, there are over 53 million Americans who currently  provide uncompensated care for their families, which provides an  estimated $600 billion in uncompensated care each year. Let that sink  in.\n\nBy protecting the health of caregivers, respite care decreases the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…These are spouses still waiting  to reunite, engaged couples who have had to pause or cancel their  wedding plans, children waiting for parents, and parents waiting to  care for their families.\n\nWe even had a couple reach out who were in the final stages of  adopting a child from Thailand, which is on the list. Because of the  pause on what is going on,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…are our neighbors.\n\nMany people in this Chamber know that a union may have helped them  achieve the dream that they have of serving, as well as being able to  take care of their families. Many of us are recipients indirectly or  directly because of unions.\n\nCollective bargaining isn't a privilege, Mr. Speaker, that can just  be signed away. It is a…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697997/protect-americas-workforce-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…power as my Senator and a key member of our government to       stand up for what is important to the people of your       district. We want to go to work, take care of our families,       and ensure all citizens have the health services they       deserve. These latest orders are inappropriate, untenable,       and illegal. As a Senator, please…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…businesses.\n\nSo instead of actually doing anything to lower costs for our hard- working families, the Republicans have shut down the government because  they really don't care that families have to pay so much more for  healthcare. Many of them--millions of them--are going to drop  healthcare because they will not be able to afford these increases.\n\nUnder…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…sick and to say: I need to see a doctor. Little boys who grow up  understanding that, grow up to be healthier men, and to be more  productive citizens who are able to care for their families, care for  our communities, and be the leaders that they are destined to be.\n\nIf you are ill, if you are sick, you won't be able to fulfill your  full potential. Preventative…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Ms. ROSEN. Mr. President, here is a fact that Donald Trump seems to  not understand or care about: families in Nevada and all across this  country being squeezed--being squeezed--by high costs. Nevadans are  struggling to afford even the most basic things from groceries to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Medicaid cuts.\n\nThe budget proposal, that overwhelmingly on party lines Republicans  supported, cuts the very health coverage for those that only use it for  long-term care. Families and parents that have a child with  disabilities and special needs rely heavily on this.\n\nI remind you all, the Trump administration continues to really attack  the values…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688625/michigan-has-million-people-on-medicaid"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…and well.\n\nThere are people all over this country who, if they ever get sick,  that is the absolute demise of their ability to be able to live in this  country and care for their families, and that is un-American.\n\nI am so grateful to Chairwoman Clarke and my fellow CBC member,  Representative McClellan, for convening us again tonight as we look  ahead…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…country, to be able  to go and get insurance products that work for them, doctors that are  best for them, care that is best for them, and to be able to provide  and take care of their families. Democrats would rather you be beholden  to insurance companies, government bureaucrats, and their political  priorities.\n\nThey want to scare you into believing they…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…will say it--right to access healthcare of our  choice without government interfering, without government regulating,  and without government stealing our ability to care for our own  families and loved ones in our community.\n\nI know the gentleman from Missouri (Mr. Burlison) feels the same way.  He has done incredible work on this subject. We are aligned,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…they can  thrive much like I did.\n\nNational Adoption Month serves as a reminder of the importance of  raising awareness about the needs of children in the foster care system  and the families who open their hearts and homes to them.\n\nMr. Speaker, please join me in celebrating the gift of adoption.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697055/national-adoption-month"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…experience the loneliness, the uncertainty, the depression that can  come along with moving to an unfamiliar place.\n\nMy bill advocates for these seniors, for their care, and for their  families. It fights for our rural communities and for our nursing homes  in my State of Nebraska and across this country. I will keep pushing  for this legislation until…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…fraud, and abuse in  the program.\n\nOften, veterans may need to attend school or training online or  hybrid, not due to performance but due to the necessity of taking care  of their families or loved ones. This bill would respond to those  realities, and I look forward to working with my colleagues in the  Senate to get the bill signed into law.\n\nMadam…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Representatives  Randy Feenstra and Brendan Boyle. This bill would make a relatively  straightforward but needed update to current law to promote State-level  recruitment of foster care families.\n\nThousands of loving parents open their homes every year to offer care  and support for children in need. By doing so, they provide shelter for  children who would otherwise…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…this legislation, not  only because it is good policy but because it reflects the lived  reality of millions of Americans who are doing their very best every  day to care for their families and contribute to our economy.\n\nMr. WALBERG. Mr. Speaker, I would make mention that for gym  memberships offered by an employer and other benefits, health insurance…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}]