[{"senator": "Kim Schrier", "party": "Democrat", "sentence": "…system. We have worked in crowded emergency  departments, seeing people who, if they had health insurance, wouldn't  need to be  in the emergency department. We have taken care of patients who didn't  have insurance like Medicaid, so they delayed care or they didn't pick  up a medication because it was too expensive and they didn't have  coverage.\n\nWe have…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…``The latest Federal proposal to gut Medicaid is reckless. Physicians  and hospitals will be pushed to the brink, forced to close their doors  and unable to continue care for their patients.''\n\nMr. Speaker, that is because when this funding leaves those rural  hospitals, then not only do the Medicaid patients lose, but all the  patients in that rural…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…As soon as I was able,       I enrolled in school to learn English and began working to       support my family.\n\nI am a Certified Nursing Assistant (CNA), and I care for my       patients with great joy, pride, and dedication. My patients       love me deeply, and every day they look forward to seeing me       and receiving my care. This work is not…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Neal Dunn. I am a proud cosponsor, and I thank him for  his leadership on this issue.\n\nWe need this so we can better understand and improve how we track and  understand care for patients like Dakota and so we can better identify  where resources and support are most needed.\n\nMr. Speaker, this month and every month, we must stand with those  living with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695786/sickle-cell-awareness-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Give  Kids a Chance Act, sponsored by Representatives Dingell and McCaul.\n\nThis bill includes several strong, bipartisan pieces of legislation  to help expand access to care for patients with rare diseases and  complex medical needs. It increases research and development into rare  pediatric diseases, improves regulatory certainty, strengthens the  medical…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…prevailing causes of death among  veterans.\n\nAs a physician myself, I can tell you firsthand that thorough and  accurate data is critical to delivering the best possible care for  patients. I believe it is incumbent upon us as lawmakers to take the  same approach with policymaking, especially when it comes to crafting  legislation to help care for our veterans.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans are proposing, that Trump and Musk are proposing. Workers  worried they might lose their jobs--and they have worked so hard in  these facilities because they care about the patients they are caring  for--are told ``No, no more funding'' for no reason. They are doing a  great job.\n\nIt is the same on Long Island as on Staten Island, and it is the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…from getting abortion care.\n\nWith that robotic precision, this institution has rubber-stamped this  amendment in budget after budget.\n\nThe Hyde Amendment denies abortion care to patients who receive their  care through Medicaid, CHIP, and other government programs.\n\nOnce in my lifetime, we defeated this amendment in the House, a  testament to activists,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693925/access-to-abortion-care"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…cancer. More than  1,600 will die from it every day.\n\nNow more than ever, we must support our dedicated scientists and  doctors across the country who work to treat and care for patients.\n\nI urge everyone to support robust funding for medical research for  cancer so we can find a cure and stop the cuts to cancer research.\n\nMr. Speaker, I wish a happy…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690995/recognizing-aanhpi-month"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…knew they are pregnant.\n\nThat law put the lives of millions of women in danger overnight. It  forced healthcare providers to choose between following their sworn  oath to care for patients or facing criminal charges. It caused trauma  and suffering that cannot be undone.\n\nIn fact, Mr. Speaker, a 10-year-old rape victim was denied the care  she needed and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…vulnerable.\n\nThe fact is that these cuts will mean life-altering changes for  families across America and will lead to nursing homes being closed,  doctors refusing to care for patients, healthcare claims being denied,  and more debt and increased costs on the backs of families who are  already struggling to make ends meet.\n\nI will ask this question…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…care and one to provide parents with  protection when supporting their children's health. Republicans refused  a vote on both.\n\nWe should be empowering doctors to take care of their patients, not  locking them up. I will be relentless to keep politicians out of the  exam room.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698347/protect-childrens-innocence-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…healthcare services where they want, supports family  caregivers, and increases hospitals' capacity.\n\nThrough the Hospital at Home Program, hospitals are able to provide  acute care to patients in their own living rooms through a combination  of telehealth and in-person care along with home-delivered meals,  nutrition, and medication. Hospitals are able to set…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…throughout New Jersey. Without the support of Medicare and Medicaid  coverage for their patients, the free clinic would not be able to  provide the extent of services and care their patients desperately  need; they would not be able to be the source of light to so many  people that are facing scary darkness.\n\nThey think: That is not going to happen to me.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…guidance to  expand the safe harbor for high deductible health plans offering  predeductible care for chronic conditions. It lets employers offer  first-dollar access to care for patients with diabetes, asthma, high  blood pressure, and many more, as the chairman mentioned.\n\nWhen this IRS guidance was originally issued in 2019, a survey found  that 76…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…that an emergency room never  closes and that every person who comes to an ER receives care. Day or  night, emergency nurses answer the call of duty--providing quality care  to patients in critical condition while operating in demanding, high- stakes environments where every second counts. Emergency nurses work  around the clock, caring for patients…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696115/recognizing-emergency-nurses-week"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…allow hospitals to treat  Medicare patients safely at home.\n\nDuring the pandemic, CMS established the hospital at home waiver to  provide hospitals with the flexibility to care for patients from the  comfort and convenience of their homes.\n\nThe hospital at home program has been very successful, being treated  in many homes across the country. It has also…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697172/hospital-inpatient-services-modernization-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in our State for their longtime service in healthcare.\n\nMr. Barth serves as director of rehabilitation services, where his  team is committed to delivering quality care  to their patients and clients in Blairsville and Union County, Georgia.\n\nMr. Barth has provided extensive care for disorders that affect  speech, function, movement, and swallowing.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…saving  approximately $1.1 million.\n\nThis is exactly the kind of program that we should be encouraging. It  allows medical providers to innovate and provide better care for their  patients. Patients like being at home, as well. It decreases costs over  the long run. By extending the hospital at home waiver for 5 years,  this bill that we are considering today…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697170/hospital-inpatient-services-modernization-act"}]