[{"senator": "John Larson", "party": "Democrat", "sentence": "…Republicans have the courage to vote, or are they going to run and  hide? Four Republicans have stood up and said: You know what, in a  democracy, this deserves a vote.\n\nListen carefully, American people, how they decry this bill, yet they  won't even have a vote.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698380/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…help complete the  story of World War II in our Nation's front yard.\n\nMr. Speaker, I urge my colleagues to support the World War II Women's  Memorial Location Act, which was carefully crafted to respect the  Commemorative Works Act process, honoring the legacies of our Rosies  and ensuring that the memorial may be located at a site near the  current World…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…problem, it also authorizes the imposition of sanctions on  individuals who are involved in forced organ harvesting or trafficking.\n\nThe legislation will make sure the U.S. is carefully gathering all  the facts  to make an informed assessment on the magnitude and prevalence of this  problem and developing appropriate responses.\n\nThe trafficking of persons…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…law's procedural protections for defendants.\n\nChief Justice Rehnquist said:\n\nIn our society liberty is the norm, and detention prior to       trial or without trial is the carefully limited exception. We       hold that the provisions for pretrial detention in the Bail       Reform Act of 1984 fall within that carefully limited       exception. The act…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…they will be.\n\n``No longer will older Americans be denied the healing miracle of  modern medicine. No longer will illness crush and destroy the savings  that they have so carefully put away over a lifetime so that they may  enjoy dignity in their later years. No longer will young families see  their own incomes, and their own hopes, eaten way . . .…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…shrapnel piece by piece; he didn't cut off  his arm. That is the approach that we need, as he said, in eliminating  waste--not cutting off arms or legs but removing the waste carefully,  deliberately, cautiously.\n\nAmong the illegally terminated--and I should stress ``illegally  terminated''--are 2,400 VA employees, many of them veterans themselves,  members…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…question did not come out of nowhere; it came from lived  experience. Hard-working Americans are doing everything right. They are  working longer hours. They are budgeting carefully. They are raising  their families. And they are just trying to stay afloat, but they are  still falling behind. That is why we are here today.\n\nIn 2010, the Supreme Court…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Other                               Funds to SNAP\n\n7. In addition to routing the remaining SNAP contingency       funds to partial November 2025 SNAP benefits, USDA has       carefully considered tapping Section 32 funds that, pursuant       to statute, were transferred to FNS to be used for Child       Nutrition Programs. USDA would need at least $4 billion…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…transparent.\n\nRolling back these reforms is dangerous, especially at a time when  DOGE is firing staff at the OCC and the other bank agencies, making it  harder for them to carefully review these mergers.\n\nI guess Elon Musk didn't stop with all of the other agencies that  they were undermining and firing and laying off. They decided that they  would fire…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…rigorous evaluation of legal experience,       integrity, intellectual capacity, and community standing, the       Commission has consistently provided the President with a       carefully vetted pool of highly qualified nominees.\n\nDespite having numerous vacancies in recent years, our       local courts constantly handle demanding caseloads comprising…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…It is not hard to figure out what a rule is because rulemakings have  a very distinct procedural set of steps that they go through, and the  Congressional Review Act was carefully crafted to deal just with those  rules, including a provision that if the executive branch tried to hide  a rule by not submitting it, that our Government Accountability…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…to submit a  confidential draft of the registration statement for review by the SEC  staff. In doing so, it allows companies seeking to access public  markets more time to carefully draft their registration statements  under SEC's guidance without needing to worry about the contents of  their registration statement being made public before they have…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692736/encouraging-public-offerings-act-of-2025"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…carry out a  study in rulemaking on its definitions of small entities under the  Regulatory Flexibility Act. This study in rulemaking would ensure that  the commission more carefully accounts for impacts on small businesses  when engaging in rulemaking.\n\nThe Regulatory Flexibility Act provides small entities with a greater  opportunity to participate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693959/small-entity-update-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Clarke, who stands on her mother's shoulders, a pioneer and  someone who understood what we need to do to preserve our Black  history.\n\nMr. Speaker, I ask everyone to listen carefully as this powerful  Black woman comes to us and presents why we are here, because she leads  us as we honor Black legacy, Black founders, and we honor the legacy  that she…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…their people: record  malnutrition, shortages of basic medicine, horrible repression of women  and girls, and instability that threatens the entire region.\n\nListen to this carefully. The State Department--our State  Department--has put out a notice that Americans should not travel to  Afghanistan because it is too dangerous. So why, why are we facing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…to have a  mechanism of accountability and reporting so that we know who is doing  what and where.\n\nIt is that simple. It will require universities to pick their  partners carefully and make sure they are safeguarding the very  technologies that they are being entrusted to house on behalf of the  U.S. Government and the U.S. people.\n\nWe don't need to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…on the  failings of the Biden-Harris administration to secure our borders and  protect our citizens. In March, the committee heard from sanctuary city  mayors, who offered carefully crafted, lawyerly statements defending  their decisions not to work with the Trump administration as it works  to remove criminal aliens as quickly as possible.\n\nAt the end…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…people. The  public integrity division is uniquely qualified to root out any  corruption, recover stolen funds, and restore confidence that our tax  dollars are being stewarded carefully.\n\n``On behalf of my constituents and the people of California, thank  you for your consideration of this request.''\n\nI am hopeful that through this investigation we will…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Operation Absolute Resolve, U.S. forces and law enforcement  partners successfully captured Nicolas Maduro and his wife, Cilia  Flores, both tied to narcotics trafficking, in a carefully planned,  coordinated operation, carried out with precision and without a single  U.S. casualty.\n\nThis is what peace through strength looks like. This was a lawful  action.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…colleague Senator Hawley from Missouri,  entitled ``Biden's Afghan Parole Program--A Trojan Horse with Flawed  Vetting and Deadly Consequences.''\n\nAt this hearing, we will carefully examine the policies implemented  or those failed to be implemented by the Biden administration that led  to these tragic events, particularly the flaws in President Biden's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…leader Hollie Nadel, and so many  more.\n\nLast Congress, a bipartisan group of attorneys general wrote a letter  in strong support of the Trafficking Survivors Relief Act. This  carefully crafted legislation strikes the right balance in protecting  victims' rights and public safety.\n\nLet's work together to fight back against this evil, to help victims  and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…commissions.\n\nThe creation of new decentralized finance protocols is also an  important development that the CLARITY Act seeks to protect. Both the  CFTC and the SEC must carefully examine and understand DeFi, which is  why we are requiring both Commissions to undertake a robust study on  the unique benefits and risks of DeFi.\n\nThrough the CLARITY Act,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…process payments. The       rulemaking could have serious implications for small       businesses and sole proprietors across the country, and we       believe the CFPB should carefully assess the rule in this       context.\n\nFurthermore, we are concerned the CFPB neglected to fully       consider the impact of increased compliance costs. The       proposed…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…day, because the       Laborers International was right. It did and will cost us       jobs in the process,'' Trumka told Jonathan Swan.\n\n``I wish he had paired that more carefully with the thing       that he did second by saying, `Here's where we're creating       jobs,' '' he went on, saying he believed Biden knows his       announcement was a ``mistake.''…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…most recently  at the Wings Over Dallas midair collision that occurred in 2022.\n\nThroughout my congressional career, I have always believed in  fostering sound policy with a carefully deliberative and consensus- driven approach. That approach is critical to getting the safety  outcomes that we all desire.\n\nAviation policy is enormously complex and deserves…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…collaborated on an  appropriation measure that directed the Forest Service to complete a  study on which the surrounding lands that were eligible to be added to  Flatside would be carefully studied.\n\nMr. Speaker, it is the results of that 2019 legislatively directed  study that was published in 2021 that are the basis for the law  proposal before us today.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…people in charge  of the NDAA from the Senate sat down with the people in charge of the  NDAA in the House and started negotiating the final product.\n\nI will use my words carefully here. There were a couple of folks on  the House side who for whatever reason decided to take our Build Now  Act out, and they did, despite the fact that every Member of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…medical advice or dictate what  specific resources colleges and universities may list. For that reason,  I would encourage those who oppose this legislation on those grounds to  carefully re-read the bill's plain language. We all know that when  individuals know their rights, they are able to make informed decisions  that are best for them, their families,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…year that is primarily  benefiting some well-connected and wealthy property developers and use  it somewhere else. I think that is one of the things that we have to  look at carefully.\n\nThere was another topic I wanted to take up. I have been talking to  some people who wonder why we have demonstrations in this country  hostile to Israel, and even more…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…has been signed into law and will soon begin making  a real difference on the ground.\n\nThis didn't happen overnight. It came after months of meetings with  local leaders, carefully reviewing community priorities, submitting  formal requests, and tirelessly advocating for these projects in  Washington.\n\nThanks to that work, we are delivering $6 million…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}]