[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…pretty sure these firings and cuts  to science and research aren't about waste, fraud, and abuse or  government efficiency. If they were and if this administration actually  cared about efficiency, they would know that funding to science,  technology, and innovation doubles or triples the investment back in  economic activity, not to mention all the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…access to healthcare, access to learning  and early education for all of our children, ensuring that people could  retire with dignity--as I thought about the things that I cared about,  I wanted to serve in a place where I might have an impact on our  Nation's budget.\n\nAnd that is because, for me, a budget is not just a fiscal document,  it is a moral…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…for people. He went on to become a nurse,  serving veterans at the VA Hospital in Minneapolis. His coworkers,  friends, and patients described him as a good man--someone who cared  about others in his community. We all saw Alex's last act was an act of  service, putting himself between a group of masked agents and a woman  who had been shoved into a…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…history in our  public lands, and working to turn our public lands into prisons and  detention centers.\n\nAmericans deserve better. They deserve public lands that are open,  well cared for, and honest about our history, not just a few symbolic  gestures and a free entrance day every now and then.\n\nIt is our responsibility to care for our public lands, to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Christiana. Carman  ran the iconic family farm in East Hartford, thus carrying on a  tradition and farming skill he acquired throughout his life, along with  the woman who loved and cared for him deeply.\n\nThe story of Dorothy and her family, her husband Carman, her  daughters, Linda, Patty, and Karen, is a story of love for the ages  captured with eloquence…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…was able to get by. I was able to go  to school and raise a wonderful daughter and put her through college  and law school because I had access to care and institutions that cared  about my life.\n\nIf we want people to be healthy in this country and to participate in  their communities and work, we need to open up choices, and we need to  provide more…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…my Republican colleagues only care about efficiency  improvements, if we can even call it that, when it means  indiscriminately slashing our Federal workforce. If Republicans cared  about government efficiency, then they wouldn't be rescinding rules  that provide clear and consistent guidance for American companies. They  wouldn't look the other way when…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…the title ``Coach of the Year'' and a place in the  California Coaches Hall of Fame.\n\nOnly Coach Glabb could see that all that these kids needed was a  break and somebody who cared for them.\n\nI thank Scott for the positive role model that he has presented to  our kids. We love him and wish him success in his retirement.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691910/recognizing-scott-glabb"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Women's reproductive rights are protected. All Minnesota  individuals and families are supported and protected--with no  exceptions.\n\nMelissa was the best of Minnesota. She cared about others, treated  everyone with dignity and respect, and she knew how to listen and lead,  As a public servant and as Speaker of the House, she left Minnesota  better…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…these standards with investments in domestic EV  production and manufacturing that created over 200,000 new jobs and  nearly $200 billion in private investment.\n\nIf they really cared about reducing costs for American families,  Republicans would focus on reversing Trump's reckless tariffs that are  increasing car prices by up to $15,000.\n\nThis is a hyperpartisan,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690436/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…one  of the most iconic examples of climate resilience and ecological  recovery anywhere in the country. This bill recognizes that the Lower  Elwha people have lived on and cared for this land since time  immemorial.\n\nTransferring land into trust is one of the most impactful actions the  United States can take to deliver on trust and treaty obligations.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…families with children who are ill or  injured, the nearly hundreds of Ronald McDonald House programs across  the world keep families traveling for their child's medical needs cared  for and together. And McDonald's helps make this effort a reality.\n\nThe story of McDonald's is one of three sons of immigrants using  their drive, ingenuity, and ambition…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…refugee population, legal immigrants to the United  States who have been settled through the Catholic Relief Services, and  they have come to a place where they feel loved and cared for and safe  and welcomed. The color of their skin, the accent they use, and the  fact that they are unfamiliar with American culture might make them  feel not so welcomed…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that were full of vulgar accusations  against the President. And when they got caught, they put the documents  back up without redacting the information of the victims.\n\nIf DOJ cared half as much about protecting Epstein's victims as they  cared about shielding Donald Trump, then maybe the public would trust  them more. But right now, there is zero trust…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699465/epstein-files"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…executing their core mission of keeping  Americans safe from the real adversaries who wish us harm.\n\nWe know that Trump's actions are not about law and order--because if  he cared about law and order, he wouldn't gleefully refuse to  coordinate with State and local officials. He wouldn't have literally  defunded our police by freezing and slashing Federal…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…There is no sum, there is no medal, there are no words that can measure  up to their sacrifice. But there are ways that we can continue to honor  them, by ensuring that they are cared for, respected, and supported.\n\nIn January of this year, I introduced the Medals Act, my legislation  to raise the monthly pension for Medal of Honor recipients. This  legislation…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…stability, self-sufficiency, and hope.\n\nThe Temporary Assistance for Needy Families program was created to  strengthen families, reduce dependency, and ensure children can be  cared for in their own homes.\n\nPregnancy resource centers, especially in rural communities, clearly  advance those goals. However, under the Biden administration, a  proposed rule…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699225/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…just like they didn't care what the Governor of Montana  thought, what the Governor of Alaska thought, and what the people who  lived in Montana and Alaska thought.\n\nAll they cared about was what their NGO and environmentalist friends  in Washington, D.C., New York, and Los Angeles thought about lands in  faraway rural places and how they wanted to impose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…from families in which you don't have both a mom and  dad there.\n\nAgain, I know a lot of families like that who do a fantastic job, but  I am pointing out that if you really cared about education, you would  look at these programs that have caused the children who are born into  a family with only one parent there to have skyrocketed from 4 percent…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…reduction. It was scored  by the CBO to lower premiums for families by over 12 percent. What  happened? By the way, every Democrat voted against that, too, because  they have never cared about lowering premiums.\n\nThat bill goes to the Senate. Senate Democrats worked overtime to get  that provision removed. If we look at the Senate Committee on the  Budget website,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…am absolutely devastated by this terrifying act of violence. While  I didn't know Melissa Hortman personally, her reputation was that of a  very dedicated public servant who cared deeply about our shared State  and its peaceful people. I heard equally wonderful things about Mark  Hortman, especially his deep devotion to his family.\n\nMy heart aches for…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Mr. Speaker, refuges are places dedicated to  conservation, public enjoyment, and environmental education.\n\nJocelyn was a kind, compassionate young girl who loved animals and  cared deeply for the natural world. Renaming this refuge is a fitting  honor to Jocelyn's life that ensures that her memory lives on.\n\nAgain, I thank Congressman Babin and the Texas…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…showing why this effort in Congress is so vital.  Without voices like theirs bringing us the true feelings of Venezuelan  Americans, we would only have heard from those who cared more about  opposing the President than bringing an oppressor to justice.\n\nI also thank the many nameless, faceless Americans who planned and  executed this daring and successful…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…while He suffered and died for all  mankind, offered that widow, his mother, to His most beloved apostle to  take care of for the rest of her life and make sure that she was cared  for.\n\nFor Erika and her children, I will say that God has a special place  in his heart for the widows and for the orphans. They also have a  special place not only in my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695808/what-i-learned-from-charlie-kirk"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Center. All of these women maintain a loving demeanor  and greet each client with a warm smile and conversation (and sometimes  a hug). The Center's clients feel welcomed and cared for because of the  lived values of love, respect, compassion, and family centeredness that  is regularly displayed by these dedicated volunteers. The benefit to  the community…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Center. All of these women maintain a loving demeanor and greet  each client with a warm smile and conversation (and sometimes a hug).  The Center's clients feel welcomed and cared for because of the lived  values of love, respect, compassion, and family centeredness that is  regularly displayed by these dedicated volunteers. The benefit to the  community…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…marine  present, signifying the passing of heritage and culture and tradition  from one generation to the other.\n\nLast night, there were two special Marine Corps balls that I cared a  lot about. One--the one I really care about--was in Anchorage, AK,  hosted by Delta Company, 4th Law Enforcement Battalion. I was very  honored and set to be there as a…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…not just food, but also kindness, dignity, and a sense  of belonging. For many, this meal is the highlight of their week--a  safe and welcoming space where they feel seen and cared for. In  addition to their weekly meal program, the Center runs a robust food  distribution service to combat food insecurity. Volunteers deliver bags  of groceries directly…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  essential legislation that supports our Nation's veterans. We must  ensure that our veterans are cared for and have the resources they need  to thrive so no veteran is left behind.\n\nCurrently, too many of our veterans struggle with the difficulties of  transitioning back into…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688686/recognizing-essential-legislation-that-supports-our-nations-veterans"}, {"senator": "James Risch", "party": "Republican", "sentence": "…August 2, 2024.\n\nThe same Senator says, after Maduro was removed:\n\nIt is an illegal act of war to replace Maduro.\n\nAnother Senator said--and this was back in 2019:\n\nIf Trump cared about consistency, he would make the realist       case for intervention in Venezuela (getting rid of Maduro is       good for the United States).\n\nThis Senator called for…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}]