[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the victims and survivors who he has been sworn to protect and serve.\n\nHe has been to countless basketball games, baby showers and more, to  celebrate the survivors who he cares so deeply for. He even walked one  of the people he supported down the aisle at her wedding. In fact, my  husband and I met Jerry when we hired him to secure our wedding when…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…from three VA medical centers: Lebanon in Berks  County, Coatesville in West Norriton, and Philadelphia for Montgomery  County.\n\nYet, because of President Trump, the VA, which cares for more than 9  million veterans nationwide, has been gravely weakened. Already in  Coatesville and Philadelphia, they were forced to rescind job offers to  physicians and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688623/fighting-for-our-veterans"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…self-interests or  on behalf of any foreign government that the emoluments clause was  adopted. But President Trump seemingly doesn't care about working for  the American people; he cares about his own pocketbook. Not once has he  come to Congress for consent on any of these deals. He hasn't even  hinted at it. And he will continue pursuing these corrupt foreign…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…civil       litigation authority in the President, divesting the District       and its residents of any local control over these essential       functions.\n\nNo one knows or cares more about keeping DC safe than DC       residents who work, live and raise their families here. Our       democratically elected officials work closely with local law…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…two  neighbors facing serious health challenges.\n\nHis service not only maintains their yards, he has given them peace  of mind, dignity, and the knowledge that their community cares.\n\nSteve's contributions exemplify the very best of the northwest Ohio  spirit, neighbors helping neighbors and lifting each other up in times  of need. His work reminds us…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, finally, on Epstein, the only real  conclusion we can make about the latest release of the Epstein files is  this: The DOJ cares more about protecting Donald Trump than it cares  about protecting Epstein's victims.\n\nThese new releases expose the identity of nearly 100 victims in over  1,000 instances.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699465/epstein-files"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…civil litigation       authority in the President, divesting the District and its       residents of any local control over these essential       functions.\n\nNo one knows or cares more about keeping DC safe than DC       residents who work, live and raise their families here. Our       democratically elected officials work closely with local law…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…employees are supporting this investigative mission,  including employees from the FAA, FBI, and Department of  Transportation.\n\nAs a Member of Congress and as a citizen who cares deeply for U.S.  aviation, I am proud of those public servants and grateful for their  sense of duty and sacrifice.\n\nEven though we all want answers, we must resist the urge…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…payments. It raises  the price of almost anything.\n\nSo if Donald Trump is serious about bringing costs down, about  fighting inflation, about showing the American people he cares about  them, the last thing he needs to be doing is launching criminal  investigations against members of the Federal Reserve Board. Congress  should not--cannot--be silent…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Madam President, I know that my colleague from Oregon  wants to speak to this issue, but I just want to respond in a couple of  ways.\n\nI know my colleague from South Carolina cares about the issues that I  am going to address, but he mentioned fentanyl, and that is what the  President has used to justify the tariffs. He  says this is a way to stop the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…criminal and civil litigation authority       in the President, divesting the District and its residents of       any local control over these essential functions.\n\nNo one knows or cares more about keeping DC safe than DC       residents who work, live and raise their families here. Our       democratically elected officials work closely with local law…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Additionally, after being dispatched to one of these serious calls,  the Joliet Fire Department pays a follow-up visit within 48 hours.  These visits help to show residents that someone cares and is looking  out for them; it helps calm them down and can help provide referrals to  additional services the residents may need.\n\nIn less than 3 years, the Joliet Fire…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…experts in  programs that he doesn't like, and he is replacing them with people  whose only qualifications are that they are loyal to the President--the  only qualification he cares about.\n\nAnd in a classic authoritarian playbook, he is covering all this up  by removing independent watchdogs that conduct oversight of Executive  functions. One of the most…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mrs. DINGELL. Mr. Speaker, as a staunch defender of Michigan's auto  industry, which is still the backbone of the American economy, and  someone who cares deeply about the environment, I do not take this vote  lightly.\n\nI have spoken multiple times to all of the stakeholders involved. I  believe in preserving consumer choice,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Representative Massie, Trump had to  pat himself on the back for winning elections in Kentucky. He also  posted multiple times about the Nobel Peace Prize. That is what he  cares about, getting an award. It is all about him, not saving  healthcare, not ending hunger, but getting an award.\n\nWe need serious people working to solve real problems, and what…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…$22 billion  above the President's defense request. This, by the way, is the bill  that almost every Democrat voted against considering 2 weeks ago.\n\nI know the ranking member cares about the promises we made to the  all-volunteer force and the challenges we expect them to make. I know  he is concerned about the erosion of Congress's authority to set and…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696491/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Tribes from California calling me, saying that we have got this great  guy running for the House of Representatives who we know from the State  legislature in California. He cares about who we are, represents our  interests, and understands the trust responsibility. American Indians,  Native Americans, had no better friend in the House of Representatives…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698731/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Understand the scale of what the Senate--you know, the 2017 tax reform,  in its full score of debt, it turns out to have come in at less than  half that. Take a look at the CARES Act, the American Rescue Plan, and  all these things that we as Republicans railed against because of the  data produced. This is the Senate reconciliation budget.\n\nDo you…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in a property, that       has a federally backed mortgage loan or federally backed       multifamily mortgage loan, as such terms are defined in       section 4024(a) of the CARES Act (15 U.S.C. 9058(a)).       SEC. 407. TEMPERATURE SENSOR PILOT PROGRAM.\n\n(a) In General.--The Secretary of Housing and Urban       Development shall establish a temperature…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…challenge of the  communists.\n\nToday, the big, beautiful bill puts much-needed funding into missile  defense through the Golden Dome system.\n\nI encourage every American that cares about making our country  wealthier and safer to support the big, beautiful bill.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the other country that you are  talking about. So I am not going to engage in debate on that issue.\n\nMr. RISCH. Well, the last one wasn't very direct, but if the good  Senator cares to have a direct question, I will be happy to do that.\n\nMr. RISCH. Mr. President, Senator, first of all, that has been done  over a number of years, and it has proven to be…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone see a math problem?\n\nWe are going to get behind the microphones and have honest  discussions of how we are going to save the country. If it is about  programs the left cares about, help us figure out how to pay for it.  Yet, when you actually look at some of the spending and debt--I think I  have the chart. We actually did some of the math.\n\nThe…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…don't know him well. They have met him, but the  reason he is a friend to my children and to your children and  grandchildren is because he is fighting for their future.\n\nHe cares about this Nation. He believes that we are on an  unsustainable fiscal path and he believes that if we don't intervene,  we will not only jeopardize our economic strength but…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…goodwill among diverse  groups of residents.\n\nAbove all, Casey Thieryung exemplifies what it means to be a Local  Hero--not for accolades or recognition, but because he truly cares  about his hometown and its people. His selfless dedication, unwavering  passion, and boundless generosity have made an enduring difference in  Brooksville. For these reasons,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…take care of the kids that have no one else looking  out for them. They teach kids structure, respect, understanding and so  much more in a loving environment. The team really cares, and each  member is deeply invested in the kids' long-term success.\n\nIt is clear Carol Smith has made a profoundly positive impact on our  community, and I am grateful for…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690147/recognizing-carol-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…leadership team within RSVP Pasco has also  been a driving force behind its success. Ambassadors have taken on  vital roles in recruitment, outreach, and event planning. When the  CARES Senior Center closure displaced 25 volunteers, RSVP Pasco worked  diligently to connect them with new opportunities, ensuring their  passion for service was not lost. Similarly,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…other over things that are absolutely tiny.\n\nWe have been told this piece of legislation actually is the biggest  savings bill in U.S. history. I beg of anyone that actually cares about  these subjects of taking on debt and deficits, help us. Help us explain  it to our brothers and sisters. Help us take on what will be, let's be  honest, a barrage of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to Volunteering with the SHINE program he is a Lay Pastor  in his church and has spent time assisting with Metropolitan  Ministries, the Shepard Center in Tarpon Springs, Cares Senior Center,  and other non-profit organizations. He also volunteers with the  Supervisor of Elections and as an election worker during the voting  season. In addition to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "French Hill", "party": "Republican", "sentence": "…peace will flow into you as sunshine flows into trees.             The winds will blow their own freshness into you and             the storms their energy, while cares will drop off like             autumn leaves.\n\nMr. Speaker, I hope future generations of Arkansans and a lot of  Texas visitors will enjoy those glad tidings from Flatside.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Kristin Amato has made through her work with the  CARES Senior Clinic. Kristin has over 24 years in nursing experience.  She has worked in ER department's, home health, orthopedics and will be  a nurse practitioner in June 2026.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690989/recognizing-kristin-amato"}]