[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…traditional higher education--providing  the support, flexibility, and access they need to pursue a brighter  future. Over the last 125 years, they've helped students prepare for  careers that truly matter in health care, business, public service and  beyond.\n\nI am proud to represent Rasmussen's Eagan campus, recognized as a  national leader in nursing education.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694738/recognizing-rasmussen-university-for-their-125th-anniversary"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…also funds many educational  programs supporting the next generation of scientists. Perhaps in the  fullness of time that is its most crucial mission because it enables  the careers to move forward in science of these young people who have  shared my fascination with science.\n\nOver the past 75 years, the NSF has stayed true to its mission to  promote…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…contribute countless internship hours to institutions  across Georgia. And alumni of its Athens and Gwinnett campuses, as well  as its online program, are engaged in meaningful careers in service to  the well-being of our society.\n\nOn the 60th anniversary of the University of Georgia School of Social  Work, I would like to congratulate and thank its faculty,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…from nearly       eight hundred to just over sixty, eliminating key experts--      doctors, epidemiologists, and public health specialists.\n\nThose of us who have dedicated our careers to helping the       most vulnerable are all too aware of the damage the       dismantling of USAID has caused. However, this damage will       not only affect people in need,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the United States do about it?\n\nI thank the Senator from Vermont for offering these resolutions this  evening. It is painful for many of us who devoted our congressional  careers to supporting Israel, standing by them through difficult times.  It is impossible to explain or defend what is going on today. Gaza is  starving and dying because of the policies…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…The center would provide childcare       for up to 200 children, create an on-site learning       laboratory, and provide vocational scholarships for students       to pursue careers in fields such as engineering or       agriculture. That is fantastic.\n\nBut the same party that claims to be the party of families       wants to shut down a grant that would…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…unacceptable conduct.\n\nTomorrow when we take up this bill, those brave women who came  forward to testify and report their experience--and sometimes watched  their dreams and their careers end because of the fact that they were  subjected to unacceptable pressure and retaliation for reporting--will  see that by law that is now going to be a thing of the past.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…that will be before us for the district court: Josh Divine,  Maria Lanahan, Jordan Pratt--all nominated to serve as district court  judges on the Federal bench. They have made careers of crusading  against reproductive rights.\n\nJudge Pratt wrote an amicus brief supporting Florida's 15-week  abortion ban. He called the procedure ``barbaric'' and ``one of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…thousands of lives, ending discrimination against  people with preexisting conditions, letting parents keep their kids on  their insurance policies while the kids start their careers, and  guaranteeing that every plan covers basic essential care.\n\nThe majority, since that time in the last 15 years, has tried to  destroy it. They have voted more than 70…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…that are all around us.\n\nAs the only Latino Member with a STEM background in Congress, I know  how important it is to encourage our students and young professionals  to pursue careers in STEM.\n\nFiring our future STEM workforce just as they are getting started in  their careers is shortsighted and irresponsible. These firings will  decimate the future Federal…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688132/fired-by-president-trump"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…duties, Andrew has remained deeply involved  with the California State University, Northridge Semester in Washington  Program, where he teaches and mentors students pursuing careers in  public service. His commitment to these students reflects dedication to  helping others.\n\nI am glad that Andrew is remaining on the Hill and I am sure that I  will see…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…access to quality care. To solve this crisis, underserved communities  like ours need to expand the resources we offer so that medical  providers can learn and grow their careers in southern Nevada.\n\nAHECs are a part of that solution. These centers connect students to  local populations, which helps facilitate future engagement and boosts  care in…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689206/recognizing-national-area-health-education-centers-week"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Navy commissioned only  12 of the men, and a 13th was made a chief warrant officer. Three  returned to the enlisted ranks, with no reason given by the Navy.\n\nDuring the men's careers, they oversaw all-Black units or the  training of Black recruits. One would go on to make his career in the  Navy after World War II, with the rest returning to civilian life.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699496/introduction-of-the-golden-thirteen-congressional-gold-medal-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…justified TPS have not disappeared, they have intensified.       Meanwhile, the lives of Haitian TPS holders have become       inseparable from our own. They have built families, careers,       and communities here. This is their home. Ending TPS for       Haiti would tear 330,000 people--our neighbors, coworkers,       parents, and caregivers--from the communities…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…There was no problem until the Trump administration created a problem  by removing thousands of loyal patriots from service, squandering  investments made in their training and careers, and disrupting lives  and units.\n\nThat is why I introduced an amendment to repeal this ban because this  ban doesn't strengthen our military. It weakens it. It doesn't uphold…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…eligible       for preseparation counseling under section 1142 of title 10,       United States Code, and veterans from pursuing, attaining,       and remaining in supply chain careers;\n\n(2) highlight--\n\n(A) the specific knowledge, skills, and abilities members       of the Armed Forces eligible for preseparation counseling       under section 1142 of title…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…that opportunity, it created new  jobs. In the 4 years after that change, EGCs made up 90 percent of our  initial public offerings. Moreover, it created 82,000 new jobs, new  careers, right here in the U.S.\n\nI believe we can't stop there. Across Iowa's Third District, my home  district, I hear from small business owners who want to reinvest in new  equipment,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Veterans' Employment  and Training Service, otherwise known as VETS, a program that serves  America's veterans and separating servicemembers by preparing them for  meaningful careers, providing employment resources and expertise, and  protecting their employment rights.\n\nA ``yes'' vote on House Resolution 1032 enables us to consider  legislation that funds…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…will graduate  from high school with an associate degree from Beaufort County  Community College. This incredible program helps students who wish to  accelerate their academic careers get a jump start at the college  level.\n\nAs a surgeon, I am elated to hear that Angela plans on hitting the  books hard to become a nurse anesthetist. I love our nurse  anesthetists.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699463/recognizing-angela-flores"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…shooters consider the places that they are going to  go, one of the things they think about is what might be the response.  When we tell people who have spent their entire careers and who are  trained--not just anyone but someone who for their entire career gave  themselves selflessly to protect us all, when we tell that person  because they are off-duty,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…faced with delays,  confusion, and broad regulations to return to work. This often means  that relatively minor mental health concerns result in long wait times  and derailed careers for safe and well-trained pilots and air traffic  controllers.\n\nIf we don't change how we handle mental health in aviation, then we  will exacerbate a culture of silence.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…SCHWEIKERT.--because, between Social Security and interest, that  is probably 54 or 55 percent of all mandatory. Sorry. It is a weird way  I remember numbers. Well, let's risk our political careers. How many of  you have read--\n\nMr. SCHWEIKERT.--The Wall Street Journal articles from the last year?  I think they have done five or six major, major exposes on something…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…needed by our nation to combat climate change and protect our       national security. For more than 130 years, mining in       Minnesota has created family-supporting careers for       generations of laborers.\n\nNorthern Minnesota is home to the world's largest known       undeveloped copper-nickel deposit. The importance of mining       these minerals…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…aviation professionals reveal that many are  hesitant to seek mental health treatment due to fears of professional  consequences. For example, pilots often speak about their careers with  deep passion, and the prospect of losing their wings is seen as one of  the worst possible outcomes. As a result, many choose not to self- report mental health concerns,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692308/recognizing-aviation-professionals"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…and the Humanitarian  Service Medal.\n\nMajor Jennie Marie Fregoso's service has strengthened the operational  readiness of the Army Reserve medical community and shaped the careers  of countless soldiers. Her legacy is one of dedication, leadership, and  unwavering professionalism. I ask my colleagues to join me in honoring  her exceptional career and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…be restricted.\n\nOur law enforcement officers are committed to protecting their  communities and their fellow citizens, and they receive rigorous  training throughout their careers. By allowing these brave men and  women the opportunity to conceal carry where it is normally restricted,  these local heroes will have the ability to respond to emergencies…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…and Ellie as they compete in the next few weeks.\n\nMr. Speaker, with the opening ceremonies taking place this Friday, I  ask you to join me in wishing them success in their careers and to  bring the gold home for Team USA.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699727/recognizing-olympians-from-colorado"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…vocational flight training outside  of degree-granting programs.\n\nMr. Speaker, that will not only incentivize our servicemen and -women  to become pilots and to embark on new careers, but it will also help to  solve the nationwide pilot shortage in our country. Most importantly,  it puts our veterans first.\n\nMr. Speaker, I urge all of my colleagues to…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699488/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…foreign direct investment. Of these workers, 31  percent work in manufacturing roles. These jobs, like other good, blue- collar jobs in my district, provide stable, good-paying careers to  constituents to help provide for their families. Oftentimes, these jobs  are obtainable to folks with a high school degree after a quick and  affordable career technical…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…directly to good-paying jobs in high- demand fields.\n\nNot every veteran wants or needs a traditional 4-year degree. Many  want fast, skills-based training that connects them to careers in the  trades, healthcare, technology, and other critical fields. This bill  recognizes reality, and it gives veterans the flexibility to choose the  path that works best…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699510/veterans-education-and-technical-skills-opportunity-act-of-2025"}]