[{"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…in the Caribbean. Over the past decade, that approach led  to a steady decline in Venezuela's role as a major drug transit route.  It relied on stopping vessels, inspecting cargo, and arresting suspects  where evidence existed. This Administration has shamefully abandoned  that lawful and effective approach in favor of bombing boats and  committing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…and his manufactured  chaos bring global trade to a halt. The Port of Long Beach is expecting  similar declines.\n\nTake a minute to think about the magnitude of that drop in cargo  volume. That decline, at the end of the day, will mean empty shelves  and higher prices.\n\nThe over $300 billion in cargo coming through what we know as the San  Pedro Bay…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…and a forge for making anchors. The       navy had not the slightest idea who they were or why it might       not be wise to upset them. But one of the men who owned the       cargo was Nathanael Greene, who would soon shed his Quaker       beliefs to become the youngest general in George Washington's       army and his closest aid from Bunker Hill to…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the world, in fact, was Frederick W.  Smith, Jr.\n\nFred Smith died suddenly this past weekend. He was 80 years old.\n\nFred Smith started a business called FedEx, the largest air cargo  system in the world. He started it with an idea that he came up with at  Yale University and made it a paper. The paper didn't get a very good  grade, but the people of the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…research into additional civilian cases for  airships, often referred to as ``blimps,'' that could contribute to  national defense; provide economic, sustainable, and clean air cargo  transportation; support disaster response efforts; and provide  humanitarian aid to people in areas of need.\n\nEspecially in the face of challenges such as global pandemics…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…me pick up where the Republican leader  left off on air traffic controllers.\n\nThe biggest, busiest airport in the United States is O'Hare, when you  count both passengers and cargo traffic. After the government reopened,  I went to O'Hare, and I met with the air traffic controllers. I have  known them for years, dating back to the first government shutdown…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…a resilient supply chain.\n\nH.R. 252, the Secure Our Ports Act, works to minimize interference in  U.S. ports from foreign adversaries. In order to ensure the free flow  of cargo into and out of our country, we must ensure full control over  and investment in our ports.\n\nI am proud to have voted in support of the bipartisan infrastructure  law, which…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692208/secure-our-ports-act-of-2025"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…city, Nuevo Laredo, form the Dos  Laredos--creating the largest inland port in both the United States and  Mexico. This dynamic economic engine is a hub for land, rail, and air  cargo, driving billions in trade annually and supporting families  across both nations.\n\nBut Laredo is more than just a commercial gateway--it is a cultural  cornerstone. From the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. Speaker, I am pleased to rise in support of my bill, the American  Cargo for American Ships Act, and to express my thanks for the  bipartisan leadership of Chair Sam Graves, Ranking Member Larsen, and  also Coast Guard and Maritime Transportation…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…the Gary/Chicago International Airport is an  investment in jobs and economic growth for our region. The airport is a  vital economic hub for northwest Indiana. By expanding cargo  operations, attracting private investment, and supporting initiatives  pursued by the city of Gary and the State of Indiana, this funding will  help bring new businesses,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Okolona Fire  Protection District for their bravery and heroism in response to the  tragic crash of UPS Airlines Flight 2976 in Louisville, Kentucky.\n\nOn Tuesday, November 4th, a cargo jet bound for Hawaii crashed  moments after takeoff. Unable to gain altitude, the jet went down just  beyond the airfield, erupting into flames as hundreds of thousands of…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…programs.\n\nOn Guam, the military must deploy snake-proof fencing, trap-and-bait  programs, and train detection dogs to prevent brown tree snake  incursions on military equipment and cargo, significantly complicating  logistics, readiness, and training activities.\n\nThis forces the Department of War to divert funds to wildlife  management, while mission-critical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of  natural gas, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. GUTHRIE.  1949.\n\nMr. Speaker, in February 2016, the first cargo of U.S. LNG set sail  from the lower 48, making the United States a natural gas exporter for  the first time since the 1960s.\n\nSince then, exports have increased from 5 billion…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…spent  time in the tower. I spent time in INDY Center, the regional air  traffic control center. I met with the team running traffic in and out  of the second largest FedEx air cargo hub in our district.\n\nWhen the good people who keep our skies moving tell you what is at  stake, you pay attention. Their work is why I pushed to secure funding  to modernize…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697078/commending-air-traffic-controllers-and-faa-employees"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…include--\n\n(A) an occurrence involving only boarding and alighting       from a stationary motor vehicle; or\n\n(B) an occurrence involving only the loading or unloading       of cargo.\n\nMr. Speaker, I rise in support of H.R. 758, which requires U.S.  Postal Service employees and contractors to report to the Postal  Service traffic crashes that result in…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…economic growth  across the region while employing tens of thousands of Tennesseans.\n\nToday, the FedEx World Hub at Memphis International Airport is one of  the busiest and largest cargo airports in the world. FedEx is the  largest Fortune 500 company in the State of Tennessee.\n\nFred Smith's commitment to Memphis went far beyond business. In fact,  upon Fred's…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…infrastructure that  keeps our Nation running.\n\nThe energy produced in southeast Texas, Mr. Speaker, moves across  America and to our allies through pipelines, trains, trucks, and even  cargo ships. Federal provisions in this bill ensure that energy  continues to flow reliably and securely.\n\nFunding for the coastal Texas protection and restoration project,  more…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698638/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…oppression of the mullahs has been simmering in Iran  for many years. It is time to provide material support to help these  groups liberate their country.\n\nPast administrations sent cargo pallets of cash on cargo planes to  these bloodthirsty mullahs in hopes of currying their favor and  cooperation. However good the intentions, the result was to help fund…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…by the flag       state of the vessel;\n\n``(v) owner and operator history;\n\n``(vi) historical classification society data, which may       include relevant surveys;\n\n``(vii) cargo-specific documentation;\n\n``(viii) data from port state control safety exams; and\n\n``(ix) relevant repair and maintenance history; and\n\n``(B) the Secretary may consider--\n\n``(i)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…of  Homeland Security.\n\nThese entities have produced technology that serves as a force  multiplier to our Border Patrol agents and include technology that  assists agents in cargo and vehicle screening that can detect illegal  substances attempting to be smuggled into the United States.\n\nThe applicability and usefulness of this authority has been  demonstrated…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Russia and China are taking disruptive action against undersea  cables on a more frequent basis around the world. Here is an article  just from yesterday talking about a Chinese cargo ship captain who has  been charged with severing a natural gas pipeline and a communication  cable in the Baltic Sea.\n\nIf we stick to the status quo, we are leaving ourselves…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…despite all of these criminal convictions and removal for  illegal entry in the United States, he was once again found reentering  illegally last August, hiding in a commercial cargo trailer. He was  sentenced to jail earlier this year for his crimes.\n\nOn top of the revolving door of removals because of how different  States treat DUI and DWI offenses,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…development.\n\nIn cold weather States like Wisconsin and many others across the  country, safe and efficient deicing operations are essential to keeping  passengers, crews, and cargo moving during winter months.\n\nAircraft are uniquely sensitive to any amount of ice and snow that  accumulates on the airframe, causing irregularities that add weight,  interrupt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695009/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Chinese-owned software. Reports indicate the software used in these  cranes can be exploited for espionage, potentially transmitting  sensitive data such as the location and movement of cargo back to  Communist China. This information could easily be used to disrupt  trade, track shipments of military equipment, or gain intelligence on  U.S. supply chains, among…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``American Cargo for American       Ships Act''.       SEC. 2. CARGOES PROCURED, FURNISHED, OR FINANCED BY UNITED                     STATES GOVERNMENT.\n\nSection 55305 of title 46, United States…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…parts. This case supports the Royal Saudi Land Forces       Aviation Corps' UH-60A/L/M Black Hawk utility helicopters;       AH-64A/D/E Apache attack helicopters; CH-47F Chinook cargo       helicopters; Schweizer 333 helicopters; and Aerial Scout       helicopters; and other related elements of logistics and       program support.\n\n(iv) Military Department:…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}]