[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…investigations, leading to  the imprisonment of hundreds of child predators, solidifying his  reputation as a champion for the community's most vulnerable.\n\nJerry is one of the most caring and compassionate people I know. In  fact, throughout his career, he has taken the care to truly get to know  the victims and survivors who he has been sworn to protect and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of humankind's place and purpose in  the world'' and that ``Bartholomew has also deepened Christians' ideas  of what it means to be faithful in the world today. It involves caring  for all aspects of God's creation including the people around us and  the natural world in which we live.''\n\nI join American Orthodox Christians, environmentalists, and  peacemakers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…opposition to these  resolutions that strip away a State's right to protect its residents  from dangerous air pollution.\n\nAs a pulmonologist, a lung doctor, I have spent my career caring for  people struggling to breathe--patients with asthma, COPD, and lung  cancer. However, I am also a mother, deeply concerned about the world  we are leaving our children.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Medicaid. But this  partisan budget would force rural hospitals to shut their doors, and it  would be particularly dangerous for people with chronic conditions and  families caring for a child with a rare disease--all to pay for more  than $2 trillion in tax cuts for the wealthiest people in our country.\n\nSlashing Medicare and Medicaid would devastate…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…while many parents must take time off leading up to  and following the birth of a newborn. Without universal childcare,  parents are often forced to choose between healing, caring for their  newborn, and keeping their job.\n\nAs a founder of the Congressional Mamas' Caucus, it is time we  listened to mothers who are urging our government to focus on families.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…me: I  don't want to pick between my dream, mental health, and food.\n\nWhat does this bill do for her? Nothing. I know Republicans are  getting similar calls. Yet, instead of caring about the millions of  Americans who are being forced to make impossible choices, they are  putting up this sham of a bill. They should be ashamed.\n\nMr. Speaker, we came here…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698364/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…a fair shot, a better life for their kids, and  we owe them that.\n\nThis bill that cuts Medicaid is a statement of values. It shows  exactly what and who the Republicans are caring about. It is not you  and your family. It is not me and mine. It is about propping up  billionaires and kicking the rest of us in the teeth while they do it.\n\nWhat kind of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…that is what we are faced with.\n\nThis is a gut check moment for this country in terms of where are  your values? Where are your priorities? Are you going to listen to the  caring professionals, the people who are the nurses and the people that  take care of us in times of healthcare crisis? Are we going to listen  to that top 1 percent who are clamoring…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…workers from  attacks that threaten their livelihoods and their families.\n\nFederal workers are the backbone of our Nation. From FEMA teams  helping wildfire survivors to VA staff caring for our veterans to  Social Security workers making sure seniors can live with dignity,  these are the people who serve us every day. They are not faceless  government employees.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…demand changes that will protect our democracy. It will be a vote to  uphold the values I brought with me to Congress, which are the values  of Minnesota: honesty, respect, and caring for our neighbors.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…propaganda. It made me sick.\n\nHe offered zero ideas to fix the egg shortage, zero solutions for  inflation, zero plans to lower rent, zero about prescription drugs, and  zero about caring for our veterans--he didn't even mention them--and  zero about the wildfires devastating South Carolina.\n\nMr. Speaker, do you know what Donald Trump did mention 13 times? Joe…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…assistance such as food stamps or public benefits. I pay       taxes on my earnings and contribute fully through all       required payroll deductions.\n\nMy work is centered on caring for American citizens who       need support with daily living activities. I help individuals       with tasks such as bathing, personal hygiene, dressing, meal       preparation,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…Health Services.\n\nHer excellence earned her Nurse of the Year and distinguished service  awards from the American Psychiatric Nurses Association, among many  other honors. While caring for thousands of veterans, she also inspired  and guided younger professionals pursuing careers in the practice of  psychiatric nursing.\n\nMary Ann's dedication to the community…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699748/recognizing-mary-ann-nihart"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…officer who  shot her were, ``I am not mad at you.''\n\nAlex Pretti was a VA intensive care nurse and guardian angel who did  one of the most selfless jobs one could think of, caring for our  veterans, often in their final hours.\n\nLast Saturday, I met with the workers who were on the shift that,  only 2 weeks before, was that same shift of workers that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…children and  our seniors, disabled children, disabled adults--we want to make sure  those healthcare needs are met. We have to do that. It is the mark of a  functioning and caring society.\n\nThere is not anybody on either side of the aisle that doesn't want to  do the best we can, not just for our kids but for the kids that live in  our community; that…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…what this first fiscal year 2026  appropriations bill does.\n\nThe Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act, 2026, is a testament to caring for those who have  selflessly worn America's uniform, their families, and the defenders  who follow their path of service. We meet this mission not only in  words of gratitude…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…improve their abilities in the field.\n\nEvery attendee, including EMS clinicians, medical experts, first  responders, agency administrators, and educators, is truly selfless and  caring. They are drawn to making a tangible difference and have an  incredible passion for saving lives. I applaud each and every one of  them for their hard work and commitment.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Merit and the Humanitarian Service Medal.\n\nAfter retiring, LTC MacMillan continued her commitment to service,  joining the Fort Cavazos Retiree Council and working with  The Caring Place, speaking to schools about selfless service and  visiting veterans at homes and local events. LTC MacMillan works  tirelessly for youth in her community, both as a Scout…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…student so that  she was able to cough up the quarter and was no longer under duress.\n\nI thank Bryce for his quick actions and calm demeanor, as well as his  commitment to caring for the students on his bus every day. His  dedication and passion for his job is evidenced through his daily  actions.\n\nBryce is a hero, and his many contributions to our…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691360/recognizing-bryce-michael-for-heroic-actions"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…who to us             such warmth provide.      All in their thoughts and deeds realized.      Filling our hearts up so deep inside.      Darin was such a man of warmth and caring.       Imbuing The Sprit of 76 in all his sharing.      Born in Michigan in 1976, later to cross the heartland for a             career to pursue.      To work in one of our…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…was the fourth anniversary of my dear wife Lori's  death, and how he knew that, remembered it, and offered such warm  comfort on such a cold morning tells you what a truly caring and  wonderful man he was. And now he is gone, for time is fleeting.\n\nYet, death can't take the kindnesses and memories that he gave us  all, or the wisdom, common sense, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698711/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…reducing pain, rehabilitating injuries,  and increasing movement and overall health. Mr. Barth's allegiance to  his patients highlights the importance of leaders stepping up and  caring for patients across Georgia.\n\nMr. Speaker, I thank Mr. Barth for all his hard work and for being a  trusted and compassionate professional in his field.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…loyal supporter of Metropolitan Ministries in Holiday, where he donates  food and other needed supplies to their program. Pasco County is a  better place because of dedicated, caring volunteers like, Tom Prior.\n\nIt is clear Tom Prior has made a profoundly positive impact on our  community, and I am grateful for his service. May we all strive to  serve our…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692163/recognizing-tom-prior"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…expand the current mandatory filing  extension following a Federal declaration from 60 days to 120 days.\n\nDisaster victims should be focused on rebuilding, recovering, and  caring for their loved ones. What they should not have to be focused on  is complying with bureaucratic red tape at the IRS.\n\nFor these reasons, Mr. Speaker, I urge all of my colleagues…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…irreparable damage to Jocelyn's family,  friends, and community.\n\nIn May, Jocelyn's mother, Alexis, testified on this legislation, but  more importantly, she highlighted Jocelyn's caring personality, deep  love for animals, and passion for finding animals homes, sharing  stories of Jocelyn's life, such as Jocelyn's efforts to nurse injured  animals back to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…video I just saw--gets handled this way, gets  thrown to the ground and handcuffed, what is happening to those who  have no such title or voice? If this gentle and decent and caring man  is treated this way, what is happening along the margins in the dark  spaces in the places we cannot see?\n\nSo I call on my Republican friends and colleagues to look hard…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…addition, beyond giving the student this novel, immersive  experience that is uniquely tailored to them, it also liberates  teachers to focus on those sorts of things that only a caring human  instructor can do. So we are still in the very early stages, and the  capabilities of AI systems are growing by the day.\n\nI think this is going to be a very important…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…for doing just that.\n\nThat is why I introduced the Empowering Employer Child and Elder Care  Solutions Act. Hoosiers and all Americans must not be forced to choose  between caring for a loved one and working outside of the home.\n\nBusinesses deserve to be profitable but are also entitled to have the  most qualified workers to support their company's growth.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…public service, Debra has advocated  tirelessly for the Victorville community and its citizens' most  pressing concerns. Debra is renowned in our community as a selfless and  caring servant and is a true friend to all who have the privilege of  knowing her.\n\nElected to the City Council in November 2018 and sworn into office  the following month, she went…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…declaration  from 60 to 120 days.\n\nFor most people recovering from a disaster, taxes fall lower on their  to-do list than more immediate needs like finding shelter, food, and  caring for loved ones. By extending this deadline, we are providing  families the breathing room and additional time to get their lives back  together.\n\nPresident Trump was elected…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}]