[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…be supportive of.\n\nMr. SMITH of Washington.  Houlahan), the ranking member of the  House Armed Services Committee Subcommittee on Military Personnel.\n\nMr. DAVIS of North Carolina. Mr. Speaker, to the chair and the  ranking member, I thank them for their work and their leadership that  has gotten us here today. I also thank the ranking member for yielding…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…place.\n\nIs this bill perfect? No. Can it be improved upon? Absolutely, and I  encourage my Senate colleagues to keep working on those outstanding  issues.\n\nMr. DAVIS of North Carolina. Mr. Speaker, I rise in support of H.R.  3633, known as the CLARITY Act.\n\nI am honored to serve as a co-lead on this legislation, alongside  Chairman Thompson, Chairman Hill,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…bill  designed to make sure that the United States remains committed to  Georgia's Euro-Atlantic and democratic aspirations.\n\nI thank my friend, the gentleman from South Carolina (Mr. Wilson),  for his tireless efforts on this topic, in addition to his fervent work  to support Ukraine.\n\nFor years following the fall of Communism and particularly after…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…McCLELLAN. Mr. Speaker, it is with great honor that I rise today  to co-anchor this CBC Special Order hour along with my distinguished  colleague, the gentleman from South Carolina (Mr. Clyburn).\n\nFor the next 60 minutes, members of the CBC have an opportunity to  speak directly to the American people on education, an issue of great  importance to the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…else who would be subject  to the most serious punishment.\n\nMadam Speaker, I am happy to yield if he can just clarify that.\n\nMr. RASKIN. I yield to the gentleman from North Carolina.\n\nMr. RASKIN. Madam Speaker, reclaiming my time. I thank my colleague  for that clarification.\n\nMadam Speaker, I am satisfied to believe, again, that there are  people who could…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…proud of his work  to open doors at the VA for more veterans so they may access the  benefits they have earned through their service.\n\nMr. TAKANO.  2625.\n\nMr. DAVIS of North Carolina. Mr. Speaker, I thank Chairman Bost and  Representative Takano for yielding time.\n\nMr. Speaker, I rise in support of H.R. 2625, the Veterans Employment  Readiness Yield Act…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693934/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…appreciate the support of my colleagues, and I reserve  the balance of my time.\n\nMr. PETERS. Mr. Chairman, I appreciate the support of my colleague,  the gentleman from North Carolina (Mr. Rouzer), and the committee. I  urge support of the amendment, and I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Ms. DeLAURO. Madam Speaker, I yield an additional 1 minute to the  gentleman from Maryland.\n\nMs. DeLAURO. Madam Speaker, I yield 4 minutes to the gentleman from  South Carolina (Mr. Clyburn), the distinguished ranking member of the  Transportation, Housing and Urban Development, and Related Agencies  Subcommittee.\n\nMs. DeLAURO. Madam Speaker, I yield…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…finally taken a vote that recognizes the  need for the survivors and victims of Jeffrey Epstein to have justice  and transparency. Not minutes later, the gentleman from South Carolina  (Mr. Norman) is filing yet another partisan resolution.\n\nI ask all of my colleagues to support this motion to refer this to  the Ethics Committee.\n\nThe previous question was…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696895/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…today. Had I been present, I would have voted NAY on Roll Call No. 308  and NO on Roll Call No. 309.                             PERSONAL EXPLANATION\n\nMr. WILSON of South Carolina. Mr. Speaker, I was otherwise detained  off the floor. Had I been present, I would have voted YEA on Roll Call  No. 308 and AYE on Roll Call No. 309.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697335/9999"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…train car as a soldier and go into the back because he was  considered a Negro, a colored man. Nazi POWs went to the first-class  train car as they headed back toward South Carolina.\n\nMr. Speaker, I rise today because the right to vote, the crown jewel  of our  democracy, is under attack again. We have seen this play out before,  and we know how it ends…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…colleagues to listen to their constituents, vote no, come  back to the table, and join us in the work to make healthcare  affordable and accessible for all.\n\nMr. MOORE of North Carolina. Mr. Speaker, as we take up the Senate- passed bill to reopen the government, I want to clarify that we should  be proceeding through regular order before taking any action…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the production of child sex abuse materials is a crime, and  it will eliminate any confusion caused by the Seventh Circuit's ruling  in Howard.\n\nMr. HARRIS of North Carolina.\n\nMr. RASKIN. Mr. Speaker, in closing, I yield myself the balance of my  time.\n\nMr. Speaker, we seem to have the bipartisan convergence that we need  to reverse the error of the interpretation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Claims Processing Act.\n\nThe bill before us includes the provisions of the Justice for  America's Veterans and Survivors Act, which I co-led with the gentleman  from North Carolina (Mr. Edwards). Our bipartisan bill will improve the  VA's data collection efforts on the prevailing causes of death among  veterans.\n\nAs a physician myself, I can tell you firsthand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "I rise in support of H.R. 1491, the Disaster Related Extension of  Deadlines Act, authored and introduced by my friend, the gentleman from  North Carolina (Mr. Murphy).\n\nI thank the chairman of the Ways and Means Committee for doing an  excellent job in summarizing not just the issue but the solution with  this bipartisan legislation,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…GRAVES. Madam Speaker, I yield 2 minutes to the gentleman from  Florida (Mr. Webster).\n\nMr. GRAVES. Madam Speaker, I yield 2 minutes to the gentleman from  North Carolina (Mr. McDowell).\n\nMr. GRAVES. Madam Speaker, I don't have any further speakers.\n\nMr. GRAVES. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, this legislation provides…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…ranking  member of the Veterans' Affairs Committee and a champion of our  Nation's veterans.\n\nMr. CARTER of Texas. Mr. Chair, I yield 2 minutes to the gentleman  from North Carolina (Mr. Murphy).\n\nMs. WASSERMAN SCHULTZ. Mr. Chair, I yield myself the balance of my  time.\n\nMr. Chair, I want to add some further information because the  Veterans Crisis Line…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…everywhere  that this conduct will not be tolerated.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. HARRIS of North Carolina. Mr. Speaker, the internet is  increasingly becoming a hostile place for children. The practice of  sextortion is becoming far too common. As many as one in five teenagers…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…County, North Carolina's  oldest active gardening club. It was formed in March 1925 and was  recognized as the third garden club to be organized within the State of  North Carolina.\n\nMr. Speaker, this club is more than just about gardening. It is about  fostering pride in the community, strengthening bonds of fellowship  between people, and upholding tradition.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688345/recognizing-leakesville-garden-clubs-centennial"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…variety of  projects, including critical infrastructure, commercial buildings, site  development, and utility construction have been critical for the  development of North Carolina.\n\nMr. Donnie Oldham embodies the mission of Sanford Contractors to  deliver the highest quality projects that exceed expectations while  ensuring the safety and professionalism…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…of the  Financial Services and General Government Subcommittee of the  Appropriations Committee.\n\nMr. COLE. Mr. Chairman, I yield 2 minutes to the gentleman from North  Carolina (Mr. Edwards), my very good friend who is the distinguished  vice chairman of the National Security, Department of State, and  Related Programs Subcommittee.\n\nMr. COLE. Mr.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…than ever to  stand with Israel and the Jewish people. I am grateful to my colleagues  for joining me this evening to discuss this solemn anniversary.\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank and very much  appreciate Republican Vice Chairman Blake Moore of Utah for holding  this Special Order hour.\n\nLast Monday, February 17 marked 500 days…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…STEIL.  Tenney), the founder and chair of the Election Integrity  Caucus.\n\nMr. STEIL. Mr. Speaker, may I inquire as to the time remaining.\n\nMr. STEIL.\n\nMr. HARRIS of North Carolina. Mr. Speaker, what do airplanes, Costco,  alcohol, tobacco, entering a nightclub, and opening a checking account  all have in common? We have to show our ID.\n\nWe require identification…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…healthcare. Every American across the country should expect more from  their government.\n\nJoining me today are a few of my colleagues. I yield first to the  gentleman from North Carolina (Mr. Moore), my fellow North Carolinian  and a fierce border security advocate. Congressman Moore has been a  leading voice in the fight to reform FEMA and to ensure its funds…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Madam Speaker, I yield 3 minutes to the  gentlewoman from Florida (Ms. Lee).\n\nMr. BIGGS of Arizona. Madam Speaker, I yield 2 minutes to the  gentleman from North Carolina (Mr. Harris).\n\nMr. HARRIS of North Carolina. Madam Speaker, bad actors often prey on  the most vulnerable: our children. It is our job to stand up for them.  That is why I rise today…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the Federal Government wants to go out there and pick  the winners and losers, this country is going to lose.\n\nH.R. 3668 is the solution. I thank the gentleman from North Carolina  (Mr. Hudson) for his leadership, and I urge all of my colleagues to  support this bill.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. The following Senators are necessarily absent: the  Senator from Tennessee (Mrs. Blackburn) and the Senator from North  Carolina (Mr. Budd).\n\nFurther, if present and voting: the Senator from North Carolina (Mr.  Budd) would have voted ``yea.''", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691664/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…not good enough for regulations that  could cause the curtailment of tire manufacturing in the United States.\n\nMadam Speaker, I yield 2 minutes to the gentleman from North Carolina  (Mr. Rouzer), my colleague.\n\nObviously, when, in 2020, the EPA found there was an ample margin of  safety, there was no reason for the Energy and Commerce Oversight  Committee,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "French Hill", "party": "Republican", "sentence": "…gentlewoman from California (Ms. Waters), unelected  bureaucrat chooses to step beyond the bounds of the statute and do  something not in keeping with process.\n\nMr. MOORE of North Carolina. Mr. Speaker, I thank the chairman for  yielding me time.\n\nMr. Speaker, I rise today in support of S.J. Res. 28, a joint  resolution to overturn the CFPB's final rule targeting…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Chair, I urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMr. ROUZER. Mr. Chair, I yield 1 minute to the gentleman from North  Carolina (Mr. Harris).\n\nMr. HARRIS of North Carolina. Mr. Chair, I thank the gentleman for  yielding me time.\n\nFor far too long, the Lumbee Tribe of North Carolina has been  wrongfully denied…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]