[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…Carolina last year,  public broadcasting was there when traditional communication failed.  Widespread power, cellular, and internet outages meant that, for  thousands of North Carolinians, public radio was how they received  their news.\n\nOur local public broadcasting stations provided lifesaving updates  for our residents, broadcasted emergency resource information…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693723/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…a full-blown  healthcare crisis in North Carolina and this country. ACA tax credits  are only weeks away from expiring. Unless Congress acts, an estimated  157,000 North Carolinians will lose their coverage.\n\nThis week, I led my North Carolina colleagues in demanding actions  from Speaker Johnson. What is his strategy? Where is the plan?\n\nI am the proud…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698079/healthcare-crisis-in-north-carolina"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…CLYBURN. Mr. Speaker, I am pleased to rise today to welcome to  these Chambers and to this well a good friend and a personal, I will  say, savior to a multitude of South Carolinians.\n\nReverend Charles B. Jackson has been serving as pastor of Brookland  Baptist Church now for 54 years, having been installed at the age of  18.\n\nI first met him about 2…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690891/welcoming-reverend-dr-charles-b-jackson-sr"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…progress to pay for tax cuts for  billionaires. Their current budget would immediately terminate Medicaid  expansion, ripping away healthcare from more than 600,000 North  Carolinians and shuttering rural hospitals that may never be able to  open their doors again.\n\nMr. Speaker, don't be fooled. The Republican budget is cruel, and it  will cost the lives…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690766/opposing-republican-budget-plan"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…unfamiliar people and places, benefit both the tourists themselves  and the communities they visit.\n\nThis Administration's divisiveness is turning people off, and South  Carolinians are suffering the consequences.\n\nThe tourism expected this year in Myrtle Beach, South Carolina, a  popular destination for Canadians subjected to the president's  demeaning…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today to condemn the Trump  administration's deployment of CBP to North Carolina.\n\nSince last weekend, North Carolinians watched in horror as masked  agents descended on our State, terrorizing communities, and abducting  people off the streets based on the color of their skin.\n\nThese immigration…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697072/condemning-deployment-of-cbp-to-north-carolina"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…is called Healthy Connections. This number  includes 105,256 children under the age of 19 and 20,000 seniors over  65, and this is just my district.\n\nOver 1 million South Carolinians are enrolled in Medicaid. In South  Carolina, Medicaid covers four out of every nine children, five of  every eight nursing home residents, three out of every 10 working-age…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "…working to recover from the devastation caused by  Hurricane Helene, dismantling this trafficking ring has brought a  renewed sense of hope and security for Western North Carolinians.\n\nOn behalf of the people of North Carolina, I extend my deepest  gratitude and congratulations to Sheriff Lowell Griffin of Henderson  County, Sheriff Quentin Miller of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693099/operation-uptown-funk"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…hundreds of homes and many communities. Over 1,300 roads were blocked  by damage and debris. There were 1.2 million citizens left without  power. Mr. Speaker, 108 North Carolinians lost their lives.\n\nOver the last year, our mountain communities have overcome  unimaginable obstacles with grit and determination. I couldn't be  prouder that, as a community,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695797/hurricane-helene"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…say I walked into the Chamber this afternoon moments ago, and I saw a  tweet or a post on X from South Carolina Attorney General Alan Wilson,  who said his protecting South Carolinians from sexual predators is a  top priority. Protecting citizens of this country has been my top  priority since the day I was ever sworn into office, particularly my  constituents…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…year. It tore through our region. It destroyed roads. It destroyed  homes. It took lives. It changed so many things.\n\nI will say the good news is the resilience of North Carolinians, not  only in government, not only in local government, but also in  volunteers and the faith community. I see my good friend, Congressman  Harris, over there. The churches…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…company  and the wider construction industry through his many years of  leadership, sacrifice, and commitment to safety.\n\nMr. Oldham has contributed immensely to support North Carolinians  through his volunteer work and career. Mr. Oldham was awarded the Man  of the Year by the Lee County Community Foundation for his volunteer  work  and philanthropy. He…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…saw thousands of homes and  businesses literally washed out and wiped out overnight. Victims are  still and will continue to process the trauma from that occurrence.\n\nNorth Carolinians are resilient. It has been heartening to see the  entire North Carolina delegation come together and provide support for  those in the western part of the State.\n\nFurthermore,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…the  ultimate sacrifice to protect our communities.\n\nEach name added to the memorial wall represents a story of courage,  selflessness, and sacrifice. Unfortunately, North Carolinians know all  too well about that kind of sacrifice. Today, I want to honor three  heroes who we lost in North Carolina since last year's Police Week in  May 2024.\n\nLast September,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Zarutska happen, murders like Iryna Zarutska happen.\n\nI want to pay special attention to a certain solicitor in South  Carolina who is not doing her job, who is lying to South Carolinians,  and that is Solicitor Scarlett Wilson of the Ninth Judicial Circuit.\n\nScarlett, I want you to know that I am watching. When you leak  evidence, when you politicize rape,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695274/warning-to-scarlett-wilson"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…ZIP Code.\n\nRepresenting my constituents has been the honor of a lifetime, and I  have learned that there is no issue too great or too small that I can't  champion for North Carolinians, whether it is casting my vote for a  once-in-a-generation tax reform bill like the One Big Beautiful Bill  Act or today's ZIP Code update, it is my mission to be a voice…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…everything. The Constitution makes it  clear those decisions rest squarely with the American people.\n\nI will continue to fight for States' rights and for the rights of  South Carolinians to govern ourselves without Federal interference.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692891/dobbs-v-jackson-anniversary"}]