[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…his work  to open doors at the VA for more veterans so they may access the  benefits they have earned through their service.\n\nMr. TAKANO.  2625.\n\nMr. DAVIS of North Carolina. Mr. Speaker, I thank Chairman Bost and  Representative Takano for yielding time.\n\nMr. Speaker, I rise in support of H.R. 2625, the Veterans Employment  Readiness Yield Act of 2025.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693934/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Is this bill perfect? No. Can it be improved upon? Absolutely, and I  encourage my Senate colleagues to keep working on those outstanding  issues.\n\nMr. DAVIS of North Carolina. Mr. Speaker, I rise in support of H.R.  3633, known as the CLARITY Act.\n\nI am honored to serve as a co-lead on this legislation, alongside  Chairman Thompson, Chairman Hill, Ranking…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…car as a soldier and go into the back because he was  considered a Negro, a colored man. Nazi POWs went to the first-class  train car as they headed back toward South Carolina.\n\nMr. Speaker, I rise today because the right to vote, the crown jewel  of our  democracy, is under attack again. We have seen this play out before,  and we know how it ends if we…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…supportive of.\n\nMr. SMITH of Washington.  Houlahan), the ranking member of the  House Armed Services Committee Subcommittee on Military Personnel.\n\nMr. DAVIS of North Carolina. Mr. Speaker, to the chair and the  ranking member, I thank them for their work and their leadership that  has gotten us here today. I also thank the ranking member for yielding…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…to listen to their constituents, vote no, come  back to the table, and join us in the work to make healthcare  affordable and accessible for all.\n\nMr. MOORE of North Carolina. Mr. Speaker, as we take up the Senate- passed bill to reopen the government, I want to clarify that we should  be proceeding through regular order before taking any action that…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…today. Had I been present, I would have voted NAY on Roll Call No. 308  and NO on Roll Call No. 309.                             PERSONAL EXPLANATION\n\nMr. WILSON of South Carolina. Mr. Speaker, I was otherwise detained  off the floor. Had I been present, I would have voted YEA on Roll Call  No. 308 and AYE on Roll Call No. 309.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697335/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to lower rent, zero about prescription drugs, and  zero about caring for our veterans--he didn't even mention them--and  zero about the wildfires devastating South Carolina.\n\nMr. Speaker, do you know what Donald Trump did mention 13 times? Joe  Biden. That is because he is obsessed with the past, and he is obsessed  with himself.\n\nRepublicans jump into…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…production of child sex abuse materials is a crime, and  it will eliminate any confusion caused by the Seventh Circuit's ruling  in Howard.\n\nMr. HARRIS of North Carolina.\n\nMr. RASKIN. Mr. Speaker, in closing, I yield myself the balance of my  time.\n\nMr. Speaker, we seem to have the bipartisan convergence that we need  to reverse the error of the interpretation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…for me to rise today to  co-anchor this Congressional Black Caucus Special Order hour alongside  my distinguished colleague, Congressman   James Clyburn of South  Carolina.\n\nYou see, Mr. Speaker--and to all those who are listening and watching  tonight--it is not only our 100th anniversary of Black History Month,  but it is just that, it is our history,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…saying is: Give the merger applicant a decision one way  or the other. That is the best way you can have worker retention in the  banking sector.\n\nMr. MOORE of North Carolina. Mr. Speaker, I rise today in support of  S.J. Res. 13 to overturn a Biden-era rule that threatens competition,  undermines community banks, and diminishes consumer choice.\n\nUnder…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…that this conduct will not be tolerated.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. HARRIS of North Carolina. Mr. Speaker, the internet is  increasingly becoming a hostile place for children. The practice of  sextortion is becoming far too common. As many as one in five teenagers  report…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…citizens vote in American elections.\n\nThat is what this is about. It is pretty simple.\n\nMr. ROY. Mr. Speaker, may I inquire as to the time remaining.\n\nMrs. BIGGS of South Carolina. Mr. Speaker, I thank the gentleman from  Texas (Mr. Roy), my friend and colleague, for yielding.\n\nMr. Speaker, I rise today in strong support of the rule. The American  people…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Mr. BARR. Mr. Speaker, had I been present, I would have voted YEA on  Roll Call No. 56.\n\nMr. WILSON of South Carolina. Mr. Speaker, I was otherwise detained  off the floor. Had I been present I would have voted YEA on Roll Call  No. 56.\n\nStated against:", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688418/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Mr. Speaker, as a member of the Foreign Arms Sales Task Force, I urge  my colleagues to support this bill, and I reserve the balance of my  time.\n\nMrs. BIGGS of South Carolina. Mr. Speaker, President Trump made it  clear: Put American jobs first, and cut the Washington red tape. I am  proud to say that my bill delivers by turning the President's executive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…that the U.S. remains the world leader  in digital asset innovation. I encourage my colleagues to support these  commonsense pieces of legislation.\n\nMr. MOORE of North Carolina. Mr. Speaker, digital assets are not some  future concept. They are already a key part of our financial system,  and Washington needs to start acting like it. Nearly one in three…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…North Carolina's  oldest active gardening club. It was formed in March 1925 and was  recognized as the third garden club to be organized within the State of  North Carolina.\n\nMr. Speaker, this club is more than just about gardening. It is about  fostering pride in the community, strengthening bonds of fellowship  between people, and upholding tradition.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688345/recognizing-leakesville-garden-clubs-centennial"}, {"senator": "French Hill", "party": "Republican", "sentence": "…from California (Ms. Waters), unelected  bureaucrat chooses to step beyond the bounds of the statute and do  something not in keeping with process.\n\nMr. MOORE of North Carolina. Mr. Speaker, I thank the chairman for  yielding me time.\n\nMr. Speaker, I rise today in support of S.J. Res. 28, a joint  resolution to overturn the CFPB's final rule targeting…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…time for the illegal immigrant criminals to know that we are  finished tolerating their presence with the illegal activity that they  engage in.\n\nMr. HARRIS of North Carolina. Mr. Speaker, I applaud my colleague,  Representative Knott, for bringing forth this important legislation.\n\nMr. Speaker, if we reward illegals for breaking our laws, we cannot…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…and to ensure its funds go  toward helping American citizens rather than to illegal immigrants,  especially those recovering from Hurricane Helene.\n\nMr. MOORE of North Carolina. Mr. Speaker, just a couple things about  Congressman Knott, for folks who don't know, before he was a Member of  Congress here, he was actually a very well-esteemed prosecutor…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, had I been present, I would have voted YEA on  Roll Call No. 51.\n\nMr. WILSON of South Carolina. Mr. Speaker, due to a subcommittee  meeting, I was delayed. Had I been present, I would have voted YEA on  Roll Call No. 51.\n\nStated against:", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699553/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Mr. Speaker, I wonder how my colleagues justified the  $800 billion tax break for multibillion dollar, multinational green  energy corporations.\n\nMr. MOORE of North Carolina. Mr. Speaker, this is an opportunity this  evening to vote for a budget resolution that extends tax relief for  working families.\n\nIf Members want to support working families in…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Congress. It is incredibly  bipartisan.\n\nLet's all work together to stand against attacks on law enforcement  and support our men and women in blue.\n\nMr. MOORE of North Carolina. Mr. Speaker, I thank the gentleman for  yielding me time.\n\nMr. Speaker, I rise today in support of H.R. 2240, the Improving Law  Enforcement Officer Safety and Wellness Through…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…on President Trump's peace through  strength agenda.\n\nMr. Speaker, I urge all Members to support the bill, and I reserve  the balance of my time.\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank Chairman Rogers  for yielding.\n\nI am grateful to support the National Defense Authorization Act. I  appreciate House Armed Services Committee Chairman   Mike…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…ever to  stand with Israel and the Jewish people. I am grateful to my colleagues  for joining me this evening to discuss this solemn anniversary.\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank and very much  appreciate Republican Vice Chairman Blake Moore of Utah for holding  this Special Order hour.\n\nLast Monday, February 17 marked 500 days since…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}]