[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…colleagues to vote ``no'' on this  legislation. Last week was National Park Week, an annual tradition  meant to honor our deep connection to national parks. President Trump  carried on the tradition by issuing a proclamation to officially  designate the week--this is one of the few noncontroversial actions in  the first 100 days of this administration--because…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the Legislature.\n\nFor the past month, Congress's power to authorize or refuse to  authorize the use of power has been usurped by the Executive. This  administration has carried out at least four military strikes against  vessels that it asserts have ties to drug trafficking organizations.  These strikes were not authorized by Congress. Congress has…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…witnessed an administration hell-bent on  dismantling the very systems designed to protect the most vulnerable  amongst us. For Black Americans, those of us who have always carried  the weight of a broken system and bad policies, the danger is real, it  is tangible, and it is urgent.\n\nLet me be clear: The last 100 days have not been an accident or a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…why does this  matter? Air Force One is not just a random luxury airplane. It is a  symbol of and a projection of American power. It has flown 15 different  Presidents. It carried President John F. Kennedy's body after his  assassination and saw President Johnson be sworn in under unprecedented  circumstances. It rushed George W. Bush back to Washington…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…suffering from a traumatic brain  injury.\n\nOn her way to a doctor's appointment, she was stopped by ICE. They  screamed conflicting orders at her, dragged her from her car, and  carried her while she screamed: I am autistic. I am disabled. She said:  Please, I am disabled.\n\nIt didn't matter. She was denied medical care. She lost consciousness  in detention.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699631/what-happened-to-aliya-rahman"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…amends existing  statute to conform with updated regulatory guidelines. This legislation  also directs reporting to Congress on commercial remote sensing  licensing, which is carried out under statutory authority granted to  the Department of Commerce. H.R. 1325 provides Congress with the  necessary transparency to carry out ongoing oversight of the  Department's…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688997/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…so. By not following a statutory requirement to submit these EXORDs to  Congress, Secretary Hegseth and the President are breaking the law.\n\nOn September 2, the U.S. military carried out its first strike,  killing 11 individuals on an alleged drug boat. Additional strikes  continued throughout the fall and winter, and to date, the U.S.  military has conducted…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…new moms.\n\nI am saying ``new parents'' now, but I am talking about moms. I think  every man has a good reason to want to do this because you ought to  respect the person who carried you for 9 months, labored with you, and  gave you the breath of life. It is time to make a change.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689706/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…early in life.  Raised in a family-owned plumbing business, he learned the values of  hard work and responsibility by going on service calls with his father  as a teenager. He carried that ethic into every aspect of his public  service career.\n\nChief Tholen has retired to Shorewood with his wife of 23 years,  Lauren. He is an active member of the Excelsior…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…generated in Ohio and other  Midwestern States that is brought by the prevailing winds.\n\nThe polluters didn't create those prevailing winds, but, nonetheless,  the pollution is carried on them toward the east coast. The funny thing  about those little pieces of soot created in fuel-burning powerplants  is they have no respect for State boundaries, none.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…role not only technical expertise but also lived experience. She  understands first-hand the challenges faced by family farmers and rural  communities across Illinois. She has carried that perspective into this  role, always keeping in mind the voices of those who are too often left  out of debates in Washington.\n\nOutside of her incredible policy contributions,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…transporting and delivering them, they are unable to  recognize the same when it comes to electricity. To do anyone any good,  electricity must not only be generated, it must be carried to its  destination on the grid.\n\nHowever, House Republicans, especially those on the Energy and  Commerce Committee, have been completely unwilling to acknowledge the  role…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Congress. Congressman Stokes  was a founding member of the Congressional Black Caucus and represented  northeast Ohio for 30 years. He also established a legacy of leadership  that carried on to Stephanie Tubbs Jones and Marcia Fudge. They are  three strong Black leaders who represented the district I now  represent.\n\nBlack History Month isn't just about trailblazers,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…career was defined by trailblazing leadership,  moral clarity, and a fierce devotion to those who too often lived in  the margins of public policy. A daughter of Cleveland, she carried the  voices of working families, seniors, women, and immigrants into the  halls of Congress at a time when few women were present to do so.\n\nAmong her enduring accomplishments,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…fourth-largest  nuclear arsenal, which was also home of the Semipalatinsk nuclear test  site. From Semipalatinsk's establishment in 1946 to its decommission in  1995, Soviet authorities carried out 468 nuclear tests at the test  site. The total impact of these tests between 1949 and 1963 was 2,500  times more powerful than the atomic bomb the U.S. dropped on Hiroshima.…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…If Washington is slower than a State government to respond, that is  not a good enough reason to deny Americans the help they need. This  legislation will lighten the load carried by families affected by a  natural disaster.\n\nMr. SMITH of Missouri. Mr. Speaker, on that I demand the yeas and  nays.\n\nThe yeas and nays were ordered.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Hoskins built  a legacy that has endured for generations, one founded on integrity,  commitment, and community care.\n\nAs the years passed, the legacy of Hoskins Drug Store was carried  forward by R.C. Hoskins' daughters, Dudley Hoskins Bostic and Molly  Hoskins Scarbrough, who continue to lead the business today with the  same dedication and vision that…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…As we commemorate this remarkable milestone, we recognize not only  the 250 years of service and sacrifice by the United States Marine  Corps but also the enduring legacy carried forward by the brave men and  women who wear, or have worn, the Eagle, Globe, and Anchor. Their  commitment to God, Country, and Corps remains a model of selfless  devotion…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696572/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today in recognition of the 20th  anniversary of Operation Red Wings, a mission carried out by United  States Navy SEALs and the Army 160th SOAR in June 2005 in the mountains  of Afghanistan.\n\nOperation Red Wings was intended to disrupt anticoalition militia…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…enduring and evolving threat to public       safety in the United States and around the world, targeting       innocent civilians and first responders.\n\n(3) These attacks, carried out by both organized terrorist       groups and individual actors, often aim to exploit high-      density public gatherings, critical infrastructure, and key       transportation…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…infrastructure       compared to the 2020 Record of Decision. The ROD also       establishes performance-based required operating procedures       and lease stipulations for activities carried out by non-      agency parties, a number of which differ from those in the       2020 Record of Decision. Although the ROD also describes       various BLM practices and…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…received from any source, including the number raised by a       Senator or       staff of the Committee--181. (In addition, 5 alleged       violations from previous years were carried into 2025.)\n\n(2) The number of alleged violations that were dismissed--\n\n(A) For lack of subject matter jurisdiction or in which,       even if the allegations in the complaint…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Alabama and The National Alliance's Producer School. In 2008, he was  named Alabama's Young Agent of the Year by the Alabama Independent  Insurance Agent Association. Boyd has carried on the family tradition  and has made Talladega Insurance Agency not only successful in  business, but a community partner as he continues to invest in the City  of Talladega.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Transportation of the Senate a report       detailing the following:\n\n(1) Interagency coordination between each Federal agency       involved in the research and development activities carried       out under this section.\n\n(2) Potential opportunities to expand the technical       capabilities of the Department of Energy and the National       Science Foundation.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…States and its interests against  imminent threats. I appreciate the President's decisive action and  express gratitude and respect for the men and women of the military who  carried out his orders, and I support the President in his efforts to  find a peaceful resolution to hostilities in the region.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…crew in both aircraft.\n\nThe NTSB, along with their Federal partners and law enforcement  agencies, jumped into action that cold January night. Over the last  year, the NTSB carried out one of the most impressive and comprehensive  investigations that I have seen, and I thank the NTSB for their  dedicated work over the past year.\n\nThe NTSB officially…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…attacks against IDF troops       and the State of Israel,'' the IDF stated.\n\n``As part of the terrorists' exercises and training at       these military sites, the terrorists carried out drills for       gunfire combat and the use of various weapons,'' it added.\n\nThe Israeli military said ``the storage of weapons and the       activities of the Hezbollah…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…and funding for businesses and individuals  in need of this vital support is squandered and stolen.\n\nOver the course of the COVID pandemic, the Small Business  Administration carried out an extensive effort, channeling funding to  small businesses facing unprecedented economic challenges. In total,  SBA provided over $1.2 trillion in emergency loans and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…controlling       more than 10 percent of that FMOC, has ever been subject to a       civil monetary penalty under title 49, United States Code,       relating to any actions carried out as an approved FMOC or       during the application for approval under that section.\n\n(B) Whether the FMOC applying, or any entity controlling       more than 10 percent…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…community. We thank him  for the lives he's uplifted, the jobs he's created, and the example he  continues to set for what local leadership should look like.\n\nHe hasn't just carried forward a legacy--he's forged one of his own.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}]