[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…that won't stop them from pretending they have legal  grounds and fabricating justification where none exists. You will hear  them reference a list that designates certain cartels as ``terrorist  groups,'' but the authority to pursue groups on this list provides  absolutely no basis for the use of deadly force. Even worse, they still  have provided…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…major drug trafficking conviction against  Hernandez, who is serving 45 years in Federal prison for his crimes. He  was convicted by an American jury for working with drug cartels to move  400 tons of cocaine through Honduras to the United States. He got  millions of dollars in kickbacks and bribes.\n\nWhat the hell is the President of the United States…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697176/juan-orlando-hernandez-former-president-of-honduras"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…or the  strategic objective they are meant to accomplish.\n\nI want to be clear about something at the outset: I have spent years  advocating for stronger action against drug cartels that poison our  communities. I have consistently voted to provide law enforcement with  the resources they need to dismantle these criminal networks. I have  supported international…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…the banks and other  financial institutions have to follow so that their customers don't get  cheated; have refused to adopt changes that would make it more  difficult for cartels, terrorists, sanctions evaders, and human  traffickers to use stablecoins to finance illegal activity; have  refused to adopt changes that ensure that stablecoins do not…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…become a bastion of the global drug trade. This former  President Hernandez orchestrated a vast trafficking conspiracy that  prosecutors said raked in millions of dollars for cartels while making  Honduras one of Central America's poorest, most violent, and most  corrupt countries.\n\nSo they prosecuted him and found him guilty of being involved in  selling…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…places like Yemen, Somalia, Syria, and Iraq. Earlier this  year, he launched strikes on Iran without congressional authorization.  Right now, he is weighing military strikes on cartels in Venezuela and  hasn't sought congressional authorization.\n\nThis body should not sit idly by while the President makes a mockery  of our Constitution and our laws. We--only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…approval, the  Trump administration began carrying out airstrikes against boats in  international waters near Venezuela, claiming he was targeting fentanyl  traffickers and drug cartels. Since then, without due process, dozens  of people have been killed in these strikes.\n\nWhat he is doing is un-American, unconstitutional, and downright  dangerous--dangerous…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…slashing Federal dollars that help  hire, train, and equip law enforcement. He wouldn't be diverting  Federal resources and agents away from operations that investigate drug  cartels and drug traffickers, from missions that identify and disrupt  foreign terrorist plots, and from actions that protect our families  from cyber attacks to do it. But he is.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…That is why I support H.R. 495.\n\nTunnels are used by transnational criminal organizations looking to  make a profit at the expense of our taxpayers. Over the last 30 years,  cartels have created illegal and sophisticated tunnels under our border  walls to smuggle drugs into our country, as well as money and weapons  out of our country.\n\nThis bill creates…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688706/subterranean-border-defense-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…have died due to Big Tech's  deliberate indifference.\n\nIf we are going to stem the fentanyl crisis, we also must acknowledge  the role the United States has played in arming cartels to the teeth-- sending hundreds of thousands of firearms south in an ``iron river''-- and facilitating the cartels' use of violence to traffic fentanyl into  the U.S. That…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…on January 3, but as an  American, it left uncertainty for the day after. By replacing one  despot with another, we are uncertain as to the government, to the oil,  to the cartels, and to the future of democracy in Venezuela.\n\nThis type of military adventurism can also create instability not  just in Venezuela, but in the region, and that creates insecurity…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699363/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…a Constitution.\n\nThe resolution that my colleague Senator Schiff has filed, which I  gladly cosponsored, does not say there cannot be military action  against terrorists or cartels or drug traffickers. It just says that  the United States should not be at war without a vote of Congress, the  United States should not be at war against groups on a secret…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Pentagon  official. I did three tours in Iraq--armed--alongside the military. I  participated in the targeting of terrorist groups. I actually have no  real problem going against cartels, given what they have done in their  inserting drugs in our community and with the death of so many  Americans. But as a nation, I think we should have as a basic principle…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…companies actually use it in a way that is  essential to their business.\n\nIn practice, the main real-life-use case for crypto is money  laundering. Crypto is used by Mexican cartels to launder their proceeds  from drugs trafficked into the United States. Terrorist organizations  fund their operations with crypto, and countries like North Korea use  cryptocurrencies…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Trump began laying the foundation for this operation--all  the operations in Venezuela--the moment he was sworn in. On his first  day in office, he designated multiple drug cartels as terrorist  organizations. Shortly thereafter, he ended temporary protected status  for some 350,000 Venezuelan migrants and authorized holding some at the  naval station…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…tools we can all debate, but the  voters of this country made a decision in November. They said: We don't  want our Border Patrol agents to be at a disadvantage with the drug  cartels in Mexico, which they are.\n\nDrug cartels have better technology today than America's Border  Patrol agents. That is a disgrace. Mr. Speaker, you can see drones, and  you can…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…after. They are going  after narcoterrorist organizations such as Tren de Aragua, Cartel de  los Soles, Clan del Golfo, and MS-13, just to mention some of these  dangerous cartels that kidnap and maim and poison our youth.\n\nLet's put it in perspective, Mr. Speaker. More Americans have died  because of these narcocartels that are poisoning our youth…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698239/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…boats smuggling drugs that kill Americans.  They have seized seven oil tankers attempting to evade sanctions.\n\nIt is very simple. Let's not protect those drug dealers, those  cartels. Let's protect the American people. The way to do that is to  vote ``no'' on this resolution.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699368/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…again. We are leading on the world stage and actually establishing  peace through strength. Our border is secure again, and President Trump  is making it clear to the drug cartels and bad actors that if they  enter the United States illegally, they will be deported. During his  first full month in office, there were only 8,326 apprehensions at our…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…High Intensity  Drug Trafficking Areas program, the bill strengthens the Treasury's  counterterrorism and financial intelligence efforts, cutting off  funding streams used by cartels, traffickers, and foreign bad actors.\n\nMr. LaLOTA. Mr. Chairman, the FY26 FSGG bill reflects the values  Americans sent us here to uphold. I urge support of the bill, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699046/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Americans as  their elected Commander in Chief.\n\nThis should come as no surprise. President Trump stated very clearly  and repeatedly during the campaign that he would attack these cartels  if necessary. This is simply him keeping his word to the American  people.\n\nAlso, the President's strikes were lawfully sound and extremely  limited. Because they have been…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…organizations in the Western  Hemisphere, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the concurrent resolution.\n\nMr. Speaker, right now we have cartels operating in our backyard.  They are kidnapping Americans, extorting families, trafficking women  and children, and flooding our towns with fentanyl to maximize death  and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…the Nation on a path to  greatness while reinforcing President Trump's bold agenda on trade and  combating illicit drug trafficking.\n\nTo continue the fight against the drug cartels that are ravaging  American communities, the Drug Enforcement Administration receives an  increase of $63 million in this bill.\n\nThe bill also streamlines and enhances support…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698761/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…us to move. The President came  in and executed on those important items to get us removed from these  world bureaucrats.\n\nThe President also signed a declaration declaring cartels as foreign  terrorist organizations--again, a bill I introduced 5 years ago that  the Democrats were blocking. The President was able to deliver. We  should codify it, but…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Today, this Chamber is permanently scheduling fentanyl-related  substances as schedule I.\n\nWe owe it to our communities, our constituents, the families, and to  the victims. Cartels are quite literally killing Americans for ten  cents. Among teens, fentanyl poisoning accounted for an average of 22  deaths per week in 2022.\n\nFentanyl is the number one…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…talking about 2001--nearly 400,000  Americans have died from overdose poisoning, deaths fueled by foreign  terrorist organizations including the Venezuelan regime and violent  cartels operating in our own backyard. That 400,000 is about the size  of my native city of Miami. This is, in reality, a weapon of mass  destruction.\n\nYet here we are, debating whether…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…with international observers, and  he was going to go. Look at where he is at now.\n\nMaduro is not only the head of the Suns Cartel, one of the most  important drug trafficking cartels in the world, but he was also  indicted in 2020 by a Federal grand jury in this country for being one  of the major drug traffickers in the world. Not only that, he is now…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise in strong opposition to  this resolution.\n\nFor decades, violent drug cartels have ravaged American communities.  They have flooded our streets with deadly narcotics. They have  destabilized our hemisphere, creating openings for malign influence  from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…their naval capacity at an alarming rate.\n\nIran, and its terrorist proxy groups, are threatening our allies and  disrupting free trade in the Red Sea.\n\nFinally, South American cartels and drug smugglers are harming the  health and well-being of American citizens.\n\nTo face these growing threats, our Navy must rise to the occasion.  That means projecting…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…producer of the base  chemicals, the ingredients, that are needed to make fentanyl and that  the Chinese Communist Party is more than willing to work directly with  Mexican drug cartels to ensure that this poison continues to reach  America.\n\nUnfortunately, drug overdoses have become the leading cause of death  for Americans who are ages 18 to 45, with fentanyl…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}]