[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…works, but I will tell you what--people  around here are. Lots of people around here know very well that when  you dump $4 trillion-plus onto the national debt, it is going to  cascade into cuts to these other accounts, and those other accounts  include Medicare.\n\nSo to plead innocence about this not being the intention all along is  completely unsupportable.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…And like in all recessions, the pain will fall  hardest on working families. Many Americans will face the one-two punch  of job losses on top of overwhelming debt burdens. A cascade of  defaults and foreclosures and personal bankruptcies could follow.\n\nWith so many indications that American families are in serious  trouble, our government should be throwing…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…property? When the property is uninsurable and  unmortgageable, its value goes down.\n\nThat is why the chief economist for Freddie Mac, the mortgage  company, predicted the cascade from climate risk to uninsurability, to  no mortgages, to what he called a coastal property values crash that  could lead to a recession like in 2008.\n\nI remember 2008. It…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…(ABRA); American Bird Conservancy; American Hunters &       Anglers; Big Mountain Dreams; BlueGreen Generation; Bolder       Options; Californians for Western Wilderness; Cascade Forest       Conservancy; Center for Biological Diversity; Change the       Chamber; Clean Water Action Minnesota; Colorado Mountain       Club; Colorado Wild Public Lands;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…natural  environments that they need.\n\nThe first biggest shock will come through insurance markets as  climate risks make real estate uninsurable. This disruption kicks off a  cascade: Climate risk collapses insurance markets; insurance collapse  cascades into mortgage markets; mortgage collapse cascades into  property value losses; and the combination…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…intensity of wildfires and the longer and longer wildfire  season throughout the West.\n\nIn our State, we used to see wildfires mostly in the dry part of the  State, east of the Cascade Mountains. Now, we see it in the entire  State.\n\nWe have seen devastating fires in recent years. In fact, six of the  highest risk fire sheds in the entire country are in…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…to come.\n\nAdams, particularly, warned that Britain's determination to       pursue the Gaspee affair, and the discussion of the       deployment of troops, could lead to a cascade of events that       might spark ``a most violent political Earthquake through the       whole British Empire if not its total Destruction,'' he wrote       in January 1773…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…and they can't find a buyer because the buyer  can't get a mortgage to buy the house because the house can't get  insurance--the property is uninsurable.\n\nThat is how that cascade works. It goes from climate risk to  uninsurability, to mortgage collapse, to property values collapse, to  recession. That is what the chief economist for Freddie Mac predicted.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…in and the American people are exceedingly worried  and exhausted. They are exhausted by the uncertainty that has defined  this Presidency. They are fatigued by the endless cascade of bad news  from every corner of our Federal Government. They are bone weary by the  fear of the impact these reckless actions continue to have on our  working families.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the 2024 cycle, and that is only  the identifiable money. Then there is the dark money, and we don't know  how big that number was.\n\nWe are already seeing the climate problem cascade into a homeowners  insurance crisis, cascade into a crisis of mortgage unavailability and  ultimately home value losses. It is already happening in Florida, for  instance.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise to congratulate the Indiana High  School Athletic Association 3A football State champions, the Cascade  Cadets.\n\nThe Cascade High School football team triumphed over Fort Wayne Luers  with a 29-14 victory, securing the first football State championship in  the school's history.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697559/congratulating-cascade-high-school-cadets-football-team"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…community priorities, submitting  formal requests, and tirelessly advocating for these projects in  Washington.\n\nThanks to that work, we are delivering $6 million to replace the  Cascade Bridge in Burlington, improving traffic safety and connectivity  in the region, but most importantly, replacing this historic landmark.  It is very much a community-desired…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about 7 years ago saying the leading contributor  to income inequality in America, it turns out, isn't education. It  turns out it is health.\n\nWhen you think about it, the cascade of costs of someone with severe  diabetes, when we already know diabetes is 33 percent of U.S.  healthcare. What if things like this actually could help our brothers  and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…individual market and benefit from  these tax credits, but if you see millions of people who ultimately  choose not to get insurance and drop out of the market, that is going  to cascade to the employer-provided market, as well. People are going  to see increased costs there, as well.\n\nMr. Speaker, when we talk about affordability, which is so important  to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]