[{"senator": "John Garamendi", "party": "Democrat", "sentence": "…Paralysis is  ascending, meaning that it travels up the limbs from fingers and toes  towards the torso. Loss of reflexes, such as the knee jerk, are usually  found. Usually, a new case of GBS is admitted to ICU (Intensive Care)  to monitor breathing and other body functions until the disease is  stabilized. Plasma exchange (a blood ``cleansing'' procedure)…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Hiroshima-style gun-type  device. Our leadership speaks in apparent ignorance of that fact,  beating their chest and saying we set them back by decades, when that  is not the case.\n\nJust to give a sense of the scale, the 400 kilograms of uranium  hexafluoride that the IAEA watched them enrich to 60 percent is stored  conventionally in the United States…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…on food pantries not only for extra food but also for  toilet paper and soap.''\n\nThat is with having the benefits that they have now.\n\n``I am waiting for my Social Security case to go on appeal. I  currently have no income. I am unable to work due to spinal injuries.  With less people working at the Social Security office, it has taken  longer than…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691522/medicaid"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…appreciate that the gentleman from Montana is suddenly so  forthcoming about all of the analysis that has gone into this  particular mining project because that wasn't always the case. When he  was Secretary, we asked to see that analysis, and what we got back was  page after page of redaction. We got zero information.\n\nI appreciate the newfound candor from…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…this administration is treating  average families--working families--in so many ways, and I know he  intends to hold the floor for a long time to make sure that that is the  case in letting America know how bad this is.\n\nNow, our healthcare is the main focus right now, and it is amazing, I  would say to my colleague: Isn't it incredible that all of these…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Members of Congress, the public, the IG, or other  law enforcement officials.\n\nMy colleagues across the aisle keep claiming that the Administrator,  along with DOGE, identified a case wherein an illegal alien--we will  get to my thoughts on that term in a minute--received a nearly $1  million loan despite holding only 49 percent ownership of a business.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…point because there are many people who  are of the opinion that there must be some statutory, criminal law that  has been violated before one can be impeached. That is not the case,  not the case at all.\n\nThe constitutional law that authoritarian President Trump would have  Congress use to impeach a Federal judge for ruling against him, that  would be…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…during a  shutdown. We are not talking about--we are talking, with the shutdown,  we all know our position. We need a negotiation, but this SNAP doesn't  have to happen in any case and only because Donald Trump is doing it,  and the Republican leadership goes along with Donald Trump to let SNAP  expire.\n\nTrump did this once before. In 2019, he funded SNAP…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…unfortunately, today, too many American households find  themselves trapped in a cycle of debt and financial insecurity just to  meet their bottom line. More and more we see this is the case, even  when both parents are working and doing everything they can to give  their children a better future.\n\nThis is an entirely different reality than what Donald Trump and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…every social media  platform and every network. They probably would be making stamps and  stamping your head with all of the fraud that they have found, but that  is not the case.\n\nWhat they have been doing, however, is harassing and intimidating and  disrespecting our workers, creating a hostile environment for our  Federal workers, intimidating them…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…expenditure, even though it has been approved and it is the  law. He then goes through the rescinding of his decision to spend the  money. It is called a rescissions bill. In this case, the Trump  administration came to Congress and said: The $9 billion that you  appropriated and directed me to spend, I don't want to spend. I want  your permission not to spend…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…decades, prosecutors have  used the law to target predators who prey on children or who produce  ghastly images of child sex abuse, but the Seventh Circuit's ruling in  the Howard case in 2020 jeopardized prosecutors' ability to go after  these dangerous people until they actually abuse the child and create  an image of the abuse.\n\nThe Howard decision narrowed…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Nicole Good and Alex Pretti,  who were murdered for standing up for what is right and exercising  their constitutional First Amendment right to speech and assembly, and  in the case of Mr. Pretti, his Second Amendment right to carry arms. I  also stand in honor of the 38 people who have died in ICE custody since  Kristi Noem became the head of DHS. Although…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699660/horrific-ice-abuses"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…minimum tax with a  new policy change, a change that amounts to a $10.3 billion corporate  handout--and that is according to the Joint Committee on Taxation.\n\nNow, it has been the case for decades that these huge corporations  play financial games to conceal their profits from the IRS. That is how  they winnow down their tax rates to single digits--maybe even…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…introduce the District of Columbia  Police Home Rule Act, which would repeal section 740 of the District of  Columbia Home Rule Act (HRA). Section 740 allows the president, in the  case of an emergency, to direct the D.C. mayor to provide the president  the services of D.C.'s police department, the Metropolitan Police  Department (MPD), for federal purposes.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…adding at the end the following:\n\n``(3) Limitation.--The Secretary shall not issue       enforcement actions under section 303 for failures under this       subsection in the case of a drug or biological product that       is no longer marketed.''.\n\n(b) Due Diligence.--Section 505B(d) of the Federal Food,       Drug, and Cosmetic Act (21 U.S.C. 355c(d)),…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…who is subject to an official       finding of wrongdoing, shall not be eligible for the medal of       sacrifice established under subsection (a).\n\n(B) Investigation.--In the case of an official finding of       wrongdoing, the Commission established under subsection (c)       shall investigate the circumstances surrounding the law       enforcement officer's…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…is something called the nondelegation clause, and it says  that we are not allowed to give power away. We can't just say: Here,  Mr. President, take it.\n\nIn this particular case, it is even worse. The rule of law--IEEPA is  the acronym for it--has never been used for tariffs before and doesn't  mention the word tariff.\n\nSo this isn't something that…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…support of the Anti-CBDC Surveillance  Act. I thank Whip Emmer for his leadership on this issue. He was  actually one of the first in Congress to raise the alarm. Since then,  the case has only grown stronger about the risks posed by U.S. CBDC.\n\nMr. Speaker, the global economy is at a crossroads when it comes to  digital payments. Jurisdictions around the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…people remember,  we were kind of past the pandemic, and that particular legislation, the  Inflation Reduction Act--the so-called Inflation Reduction Act,  obviously not the case--passed in August of 2021. We were well past the  pandemic, but it gave the Democrats an excuse to put more Federal money  into a failing program that is driving up costs and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Section 12(b) of the Securities Exchange Act of 1934 (15       U.S.C. 78l(b)) is amended--\n\n(1) in paragraph (1)(K), by striking ``years,'' and       inserting ``years (or, in the case of an emerging growth       company, not more than the two preceding years),''; and\n\n(2) by adding at the end the following:      ``Any issuer may confidentially submit to the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692762/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that we are not catching. There is a very  simple and basic premise of those who have been in a prosecutorial  function, which is that you only catch so many people. In this case, we  have been going after some individuals, but we can certainly prevent  any further abuse of our voter elections. Making sure that we have  integrity in those elections is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…State.\n\nOf course, Elon's status within the Federal Government is that of  what is called a special government employee. That means it is for a  period of time--130 days, in this case. And with that date approaching  soon, Mr. Musk indicates he plans to wrap up his work. But I must  emphasize that the work of DOGE must go on. The task of improving  government…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…treachery of Russia's invasion of Ukraine and know very well they could  be next.\n\nWhy don't the political appointees in the Pentagon see this? It is  clear to most that this is the case.\n\nEvery family in the Baltics knows someone shot by the Soviets or sent  to Siberia to die. They have had this experience. The Baltic people  know the harsh reality of living…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…so often there comes  along a policy so misguided, so self-destructive, so just utterly  stupid that it has catastrophic consequences before it is even adopted.\n\nSuch is the case with the newly proposed wealth tax in the State of  California, a proposal that is the height of folly, the height of  insanity. The proposal would seize the assets, 5 percent…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Affairs       shall implement policies, processes, and technological       capabilities, including in the National Work Queue (or       successor system), to ensure that, in the case of any covered       situation, a claims processors is made aware of, and assigned       to address, such covered situation.\n\n(2) Definitions.--In this subsection:\n\n(A) The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…are necessary to       carry out operations relating to humanitarian assistance or       humanitarian purposes.\n\n(g) Waiver Authority.--\n\n(1) Waiver.--The President may, on a case by case basis,       waive the imposition of any sanction under this section if       the President determines such waiver is in the vital national       security interest of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…to deliver the  mail. There are currently over 41,000 ZIP Codes in the United States.  While ZIP Codes are usually aligned with local boundaries, this is  sometimes not the case.\n\nH.R. 3095 creates new ZIP Codes for local communities listed in the  bill and will help address concerns raised by these localities.\n\nMr. Speaker, I thank the bill's sponsor…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…here  illegally and temporarily, then no law should be necessary to deny them  citizenship in the future because no law ever extended that right in  the first place. In that case, the President's executive order is  merely declaratory of existing law.\n\nSeveral lower courts have stayed the President's executive order, and  no one is screaming that is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…mischaracterized my  and Senator Johnson's Arctic Frost disclosures by saying ``messages  showed that FBI investigators took normal bureaucratic steps and  precautions'' when opening the case.\n\nNow, was this supposed to be an opinion piece on behalf of terminated  FBI agents or a real news article?\n\nNormal steps weren't taken. As I noted in my February 3, 2025, floor…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}]