[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Improvement Act will strengthen Tax Court procedures  and practices by making four commonsense reforms. The act will  accelerate the collection of documents, expand the types of cases  assigned to special trial judges, hold Tax Court judges to the same  recusal standards as other Federal judges, and allow the deadline for  petitions to be extended in certain…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…admitting to deporting a 2-year-old  U.S. citizen with cancer. It is cruel, it is despicable, and it is  totally illegal, no matter what Stephen Miller or Tom Homan may say.\n\nThese cases are not just about these specific people or children sent  on planes to foreign prisons by the U.S. Government. Our entire system  of justice hinges on the rights afforded…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690509/trump-immigration-policies"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…be clear: I, too, was in this Chamber as the events unfolded, and what  happened on January 6, 2021, was in fact horrible, brutal, frightening,  violent, and in some terrible cases lethal.\n\nTo all members of law enforcement who responded that day and to their  families--but especially to the Capitol Police--thank you. We are  grateful to you. We cannot…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…mobster-like language: They can do it the  hard way or the easy way.\n\n``You have a nice restaurant there. It would be a shame if anything  happened to it.'' I prosecuted mob cases. That is the kind of language  we see from organized crime.\n\nAnd it was shown in the indictment of James Comey, a document signed  only by the U.S. attorney, not by any career…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…because he has  expressed support for strong antitrust enforcement that benefits  consumers and small business, lowers prices, and spurs innovation,  including continuing many cases currently ongoing at the Commission to  free markets from the stranglehold of entrenched monopolies and stop  anticompetitive mergers.\n\nBut I cannot support the confirmation…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are  begging for action to lower the cost of healthcare. What more do they  need to do to get Republicans to take action?\n\nPremiums are about to double, triple, and in some cases, quadruple.  Families could see their premiums increase as much as $1,000 a month.\n\nOpen enrollment deadlines have already passed. Parents have sat at  their kitchen tables…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…delivery of spyware to targeted devices.''\n\nCISA's multiyear coverup of the phone companies' negligent  cybersecurity enabled foreign hackers to perpetrate one of the most  serious cases of espionage--ever--against our wonderful country. Had  this report been made public when it was first written in 2022,  Congress would have had ample time to demand mandatory…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…against viruses and prevent disease from spreading to our  neighbors, communities, and loved ones.\n\nA 2024 CDC study showed that routine vaccines have prevented over 508  million cases of illness in children. The impact is immeasurable. That  is hundreds of millions of children who are saved from having to suffer  through a miserable illness. On top of that,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…We hear  that drugs are now at the bottom of the sea.\n\nIf you interdict a ship and you seize drugs, you get evidence, you  get individuals that you interrogate, and you build cases against the  higher-ups in the narcotrafficking ring. When you destroy a boat, you  don't get the evidence; you can't build the case.\n\nAnd we asked: Why not interdict? Why…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…leaders are Chinese. It is a show of       prowess that underscores just how far China has extended its       global dominance over next-generation technologies, in some       cases leaving the U.S. years behind.\n\nThe claimed leap forward on EV batteries is merely the       latest technological feat for a country that has stunned       Western governments…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…citizens or send immigrants to dangerous foreign prisons without a  court hearing and then claim the government bears no responsibility  should terrify every one of us.\n\nThese cases are the most glaring examples, but the assault on due  process runs deeper. This is not just about how we treat immigrants. It  is about whether any of us can count on being…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…workers punished, children traumatized, U.S. citizens  abducted in their sleep, and a father, Silverio Villegas-Gonzalez, shot  dead. There are hundreds, if not thousands, of cases like this.\n\nWe celebrate Hispanic heritage, but we also issue a warning. Today it  is Latinos and other immigrants under attack. Tomorrow it will be  others. Once institutions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…awarded in April 2024 and fully dispersed into private  bank accounts by August. After terrorizing grantees with false  allegations of fraud and trying to open bogus criminal cases that went  nowhere, EPA froze and then announced the termination of these fully  obligated and dispersed grants. The grantees, rightfully, sued EPA for  these arbitrary and…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…no criminal records.\n\nA report from ``60 Minutes'' just last month showed that 75 percent  of those deported to CECOT had no criminal record. These were people  who in many cases had pending asylum cases or some other sort of  immigration protection. But simply because they may have tattoos, the  Trump administration has decided to use them for a poorly…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the scales  toward fossil fuels over wind and solar energy.\n\nTaken together, Mr. Speaker, these three bills will only continue to  raise America's energy bills and, in some cases, do so while also  removing the guardrails that keep our communities safe and healthy.\n\nMr. Speaker, I strongly urge opposition to all three bills, including  the one we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…to recognize that these bills together reduce  funding. They actually reduce funding. A CR would actually cost us  more. They also update, refine, and change language in some cases that  is 2 and 3 years old and is simply out of date with the current  circumstances.\n\nIf we were to fail to pass these bills in these respective areas,  then that language…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…County CASA was created  in 1984 by concerned members of the community. These strong advocates  step into the court room on behalf of victimized children to help  ensure their cases go smoothly and they can get on track for a better  life.\n\nTo date, 15,000 children have been served by the Tulare County CASA  volunteers who have worked over 300,000 volunteer…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698218/recognizing-the-tulare-county-court-appointed-special-advocates-casa"}, {"senator": "James Risch", "party": "Republican", "sentence": "…studies and surveys;       transportation; and other related elements of logistics and       program support.\n\n(iv) Military Department: Army (KU-B-UYU).\n\n(v) Prior Related Cases, if any: KU-B-UXH, KU-B-UJO, KU-B-      UMG.\n\n(vi) Sales Commission, Fee, etc., Paid, Offered, or Agreed       to be Paid: None known at this time.\n\n(vii) Sensitivity of Technology…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699127/arms-sales-notification"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…and natural resources under the Department's  jurisdiction.''\n\nThere are, however, longstanding inefficiencies in the appeals  process. When combined with the high volume of cases, it has resulted  in a backlog of over 650 pending appeals dating all the way back to  2014.\n\nThe IBLA receives on average 290 appeals per fiscal year. Of those  cases that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691037/expedited-appeals-review-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…material unless that person complies with a demand for additional  sexual content, sexual favors, or money.\n\nIncidents of sextortion have increased dramatically in recent years.  Cases reported in the United States increased from 13,842 in the first  half of 2024 to 23,593 in the same period in 2025. This rapid growth is  disturbing, and it is unacceptable.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…and Lauren Boebert, the four of us, we are making history today over  the discharge petition and delivering justice for those who have  desperately fought for it for, in some cases, almost 30 years.\n\nI wore white today because I wanted to reflect on the innocence of  the young women who had their innocence stolen by a demon named Jeffrey  Epstein, from…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696901/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…gather documents. That same technology has not  been applied to other types of claims, such as pensions or survivor  benefits. This has led to a growing backlog and, in some cases, missed  benefits altogether.\n\nMy bill takes steps to fix this. It requires the VA to expand the use  of automation tools, ensure that documents are properly labeled in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…for transfer to adult  court from 16 to 14 for the most heinous crimes. We are talking about  murder, first-degree sexual assault, armed robbery, and burglary.\n\nIt expands the cases that can be tried by the U.S. Attorney's Office,  ensuring that woke, weird prosecutors like D.C. Attorney General Brian  Schwalb can't let violent offenders slip through the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…or active  participation does not eliminate the harm or the violation.\n\nThis is an issue that I have personally heard about from law  enforcement officers who work on these cases every day. I commend Mr.  Harris, Chairman Biggs, and Chairman Jordan for ensuring that we  address it through the Child Predators Accountability Act, and I thank  my colleagues…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698894/child-predators-accountability-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…schools and to shut them down or to stop new  charters from starting up, forcing families to return to neighborhood  schools that they had chosen not to attend and that, in many cases, are  failing to teach students the basics.\n\nWe have many examples now of high-performing charters in the State  being nonrenewed, but this bill, AB 84, makes things even worse.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…need good people in  these roles.\n\nRight now, VA pays for scholarship enrollees' education in return for  several years of service to the VA.\n\nUnfortunately, there have been cases where VA can take months before  offering them a position. Sometimes, people in the program are forced  to break the agreement because of bureaucracy delays at the VA. They…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and       logistics support services, and other related elements of       logistics and program support.\n\n(iv) Military Department: Air Force (SN-D-GFU).\n\n(v) Prior Related Cases, if any: None.\n\n(vi) Sales Commission, Fee, etc., Paid, Offered, or Agreed       to be Paid: None known at this time.\n\n(vii) Sensitivity of Technology Contained in the Defense…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696549/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and logistical support       services; and other related elements of logistics and program       support.\n\n(iv) Military Department: Air Force (IT-D-YAE).\n\n(v) Prior Related Cases, if any: IT-D-YAD.\n\n(vi) Sales Commission, Fee, etc., Paid, Offered, or Agreed       to be Paid: None known at this time.\n\n(vii) Sensitivity of Technology Contained in the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692629/arms-sales-notification"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…district judge needs to be  confined to their district and to people who are in their district.  Case after case, over decades, has shown that when they fail to do so,  the cases are thrown out.\n\nMore importantly, if they were to continue to do what is generally  called nationwide injunctions, then, in fact, there would be no need  for a 5-4 or 6-3…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…repeatedly to  testify about some of the toughest constitutional and statutory  questions. She has also filed amicus briefs on behalf of Members of the  committee in very important cases. We trusted her judgment then, and we  can surely trust that judgment now.\n\nI am confident that Professor Mascott will make an outstanding judge,  and I know that she will…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}]