[{"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to join my colleague Congressman  Jim Moylan of Guam, in highlighting the urgent need to modernize U.S.  maritime policy through our Merchant Marine Allies…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, as we commemorate Hawaiian History Month this  September, I want to again express the pride and appreciation of my  Hawaii in the unique history, culture and contributions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to urge support for my Indigenous  Diplomacy and Engagement Act to ensure that our foreign affairs fully  encompass and incorporate the independent interconnectedness…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise to today to ask for the House's support  for the Filipino Veterans Family Reunification Act, which I introduced  with my colleague Congresswoman Jen Kiggans of…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to invite my House colleagues to  join Congressman Joe Neguse of Colorado and me in recognizing the  critical importance of the native plants of our country…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to introduce legislation to build  a new national cemetery in Hawaii. I am joined by my Hawaii colleagues,  Congresswoman Jill Tokuda, and Senator Mazie…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in support of the PARTNER Act,  introduced by Congressman Castro of Texas, and cosponsored by myself  and seven of our colleagues who  are particularly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in support of my Energy  Transitions Initiative Authorization Act to expand resilient and  reliable energy for some of our nation's most vulnerable regions--…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in support of my Hawaii Native  Species Conservation and Recovery Act, a critical piece of legislation  to protect and preserve the unique and irreplaceable…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…President of the United States and the Department of Justice are going  after the Chairman of the Federal Reserve before they go after  coconspirators in the Epstein case.\n\nMr. Speaker, the American people want to know why Donald Trump is  using their taxpayer dollars to invade foreign countries and threaten  our allies, but claims to not have enough…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698893/holding-president-trump-accountable"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise to focus attention on one of our most  pressing crises: our rapidly deteriorating federal budget, crippled by  unsustainable annual deficits and accelerating…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in strong support of  Congresswoman Radewagen's South Pacific Tuna Treaty Act. I am an  original cosponsor of this bill because we urgently need this update…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in support of my Promoting  Regional Opportunities for Sustainable Prosperity and Economic  Resilience in the Pacific Act, or PROSPER in the Pacific Act,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to draw attention to a critical  and escalating threat to our environment and economy, invasive species,  and to ask for support of my proposed Invasive…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693136/introduction-of-the-invasive-species-response-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, as the Member of Congress with the most  Filipino Americans of any Congressional district nationwide (nearly  200,000), I have been honored since 2019 to co-lead an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…support in the House that President  Biden, even though he was initially opposed, signed it into law. That  is how the COVID emergency was brought to an end.\n\nIn this case, Mr. Speaker, we were being asked with this language  here to say that you are not allowed to do that, Congress will be cut  out of its statutory role in evaluating whether we still…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…colleagues do not want to  make Medicaid more effective, that they don't want to help the people  on Medicaid get better healthcare. How sad, Mr. Speaker, that that is  the case.\n\nMr. Speaker, this budget does not steal from the least of these. It  does not. What it does do is everything it can to stop fraudsters, to  stop bureaucratic waste, and to stop bad…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Perryville, Arkansas, to Perry County.\n\nThis property is no longer in use by the Forest Service, and there  are no plans for its utilization by them. That has been the case, Mr.  Speaker, for well over a decade.\n\nPerry County is a very small, rural community with a population of  around 10,000. About 16 percent of the residents there live below the  poverty…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…and fundraising and showing pictures of wonderful canoes  going across, and, oh, we are going to mine right in the middle of the  wilderness area, but that is not the case.\n\nMr. Speaker, I ask and I urge my colleagues to support this. It is a  good mine. It is a good project.\n\nBy the way, it doesn't approve anything. You still have to go through  the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]