[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and with a sizable Navy  deployment and expansive intelligence resources, U.S. personnel could  have boarded all of these vessels, detained those aboard, seized any  drugs or cash, and gathered additional information about ties to drug  trafficking organizations, just as they normally do. Secretary of State  Rubio even acknowledged publicly that this…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…ever having a digital dollar; it  prevents us from even studying a digital dollar.\n\nNow, I think Americans will always have banks, credit cards, debit  cards, Zelle, Venmo, cash, money market funds, and pursuant to the bill  that it looks like we are going to pass today, they will have  stablecoin, a privacy device specifically designed for criminals…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…our community.\n\nUnder the current law, not all small businesses are treated the same.  Owners of so-called small purpose properties are required to put up  significantly more cash up front, often 5 to 10 percent more than  standard property owners. These include places like bowling alleys, car  washes, marinas, funeral homes, and recreation centers. These…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…adds costs and uncertainty, making it more difficult to       handle the economic headwinds and growth opportunities ahead.\n\nBills like H.R. 5214, the District of Columbia Cash Bail       Reform Act, make DC less safe. Replacing our very effective       pre-trial detention regime, which focuses on charged violent       offenses and repeat violent offenders,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…healthcare from the 215,000  people on Medicaid, blow up hospital budgets, raise insurance premiums,  all to give trillions in tax cuts to the millionaires. This is another  cash giveaway to the superrich at the expense of ruining American  lives.\n\nMr. Chair, I reject it, and I intend to vote ``no'' to this cruel  Republican budget.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688033/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…Valley Bank collapsed  and the price of the USDC stablecoin, which was supposedly worth a  dollar, fell to 88 cents as the run on the bank exposed the company's  failure to keep cash deposits in insured accounts. USDC only looks  stable today because the taxpayers bailed them out with the FDIC.\n\nThe GENIUS Act makes this problem even worse by saying that,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…here because my Republican colleagues think our national budget is too  tight to ensure that our seniors and families can afford healthcare,  but it is flush enough with enough cash to fund escapades in Venezuela  and billions of new spending on ICE and giving billionaires permanent  tax cuts.\n\nWe are here because Democrats are the ones that are keeping…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698663/protecting-healthcare-for-millions-of-americans"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Force, local officers from the  Isleta Police Department seized over 37,000 fentanyl pills, which were  valued at nearly 1.5 million dollars, and nearly $38,000 dollars in  cash.\n\nThose deadly pills would have devastated countless lives in our  community, but today the Isleta Pueblo and New Mexico's communities are  safer because of our law enforcement's…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697564/commending-the-isleta-police-department-and-local-law-enforcement"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…insecurity. An  unexpected expense like medical bills should not be a threat to a  family's financial livelihood. It is important that we start looking at  new ways. Regular cash assistance would make a tremendous difference to  families literally on the edge of poverty and struggling to pay their  bills.\n\nEveryone in our country deserves human dignity.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…adds costs and uncertainty, making it more difficult to       handle the economic headwinds and growth opportunities ahead.\n\nBills like H.R. 5214, the District of Columbia Cash Bail       Reform Act, make DC less safe. Replacing our very effective       pre-trial detention regime, which focuses on charged violent       offenses and repeat violent offenders,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…protecting the criminals in the Epstein files and  demand transparency from Donald Trump. Let's talk about the bill in  front of us today.\n\nWe know the District of Columbia Cash Bail Reform Act is unfair and  bad policy. Under this bill, if someone is charged with certain crimes,  he will automatically be locked up before his trial. For other crimes,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696980/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…as California, New York, Colorado, and Minnesota.\n\nThe administration is illegally withholding payments to States for  childcare, foster care, child protective services, and cash assistance  to low-income families.\n\nMr. SCHNEIDER. They are hiding behind false claims and unauthorized  administrative barriers in order to inflict pain on States that the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…recognize  five young students who were taken too soon from the city of Santa Ana.  Recently, five students from Santa Ana Unified School District were  victims of a brutal car cash: Aurelia Robles, Arlene Robles, Natalia  Vidal Zarate, Jaqueline Torres Zarate, and Emanuel Gonzalez Martinez.  They were full of life, love, and adventure, and this tragic…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690664/in-memory-of-santa-ana-car-accident-victims"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Then we get the Supporting Pregnant and Parenting Women and Families  Act, which is another nice name but another ugly attack on women. This  bill allows red States to siphon cash assistance meant for food, rent,  and childcare into unregulated crisis pregnancy centers, places that  masquerade as medical clinics. They spread misinformation, delay care,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Bushnell, US Ambassador,       retired; John Butler, Rear Admiral, U.S. Navy, retired;       Constance Carrino, Senior Foreign Service Officer, USAID,       retired; Steven Cash, Former Senior Advisor, DHS, Former       Chief Counsel to Senator Feinstein, Former CIA Officer.\n\nAsha Castleberry-Hernandez, Senior Executive Service, DOD,       retired;…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…ranks first in the  Nation for cattle production. We proudly represent nearly 15 percent of  total cattle production in the United States, generating more than $11  billion in cash receipts, so the Texas cattle industry is obviously  very concerned about the spread of the New World screwworm.\n\nThis parasite lays its eggs in the wounds of warmblooded animals,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…your  taxpayer dollars to disappear? We want our brothers and sisters to have  the most affordable healthcare possible in America, but to do it, do  you want us to funnel your cash, your tax dollars, into this level of  fraud? We have to walk through this.\n\nWhy the fixation, particularly for my Joint Economic Committee and  myself, on changing the actual…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…2023, he was convicted of  organizing and heading a drug conspiracy to sell fentanyl, crack  cocaine, and heroin. When police raided his home, they found fentanyl,  crack, and cash. He also possessed a firearm. In addition to heading up  the drug gang, Graham was also convicted of sex trafficking by force or  coercion from 2013 to 2021.\n\nOf course, this…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of that is just interest.\n\nWhether we like it or not, the reality of it is this country, our  Federal Government, is an insurance company with an Army. We don't have  enough cash in the bank to pay for all the promises we made as part of  that insurance coverage.\n\nLet's have at it, Mr. Speaker. I keep bringing this chart because it  is a really simple…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…bill replaces the outdated definition of  tipped employees with a simpler and more realistic definition. The bill  defines a tipped worker as anyone who receives tips and other cash  wages that together add up to the Federal minimum wage, without  worrying about how much time they spend on this or that.\n\nThis change gives businesses more flexibility and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…of tips for  America's 4 million tipped workers. As a former waitress, I know how  valuable this provision would be. This applies to all tips, whether  they are tips that are cash or on credit. All tips qualify for the no  tax on tips. This is estimated to boost incomes by an average of $1,300  per year.\n\nWith these policies, we are rewarding everyday…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…has been simmering in Iran  for many years. It is time to provide material support to help these  groups liberate their country.\n\nPast administrations sent cargo pallets of cash on cargo planes to  these bloodthirsty mullahs in hopes of currying their favor and  cooperation. However good the intentions, the result was to help fund  the oppression of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Mr. Speaker, there is this big debate right now about  so-called subsidies. I want to be very clear about what we are talking  about. We are talking about COVID-era pandemic cash that was thrown out  into our economy in this case for some plus-ups for some subsidies for  the broken ObamaCare system.\n\nNow we are 5 years removed from COVID, and my Democrat…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…transacting with each  other: We buy things, or we make money from selling things. In the  natural order, there is nobody between you and the person you want to  do business with. In cash, that is still the case. When you hand a $20  bill to somebody for sweeping your driveway or a $100 bill for  shoveling your driveway in the snow or things like that, that is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Treasury every day for that $6  billion shortfall is juggling money internally and borrowing it out of  the military retirement accounts or our thrift savings accounts, the  cash accounts, and those things. We are doing internal borrowing. All  that has to be paid back, and it all has to be paid back with interest.\n\nWe are still working on the rough…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "French Hill", "party": "Republican", "sentence": "…distinguish the $2.50 coin from       existing coins;\n\n(6) a description of the ways in which the Secretary       consulted with stakeholders, including commercial banks,       cash-handling businesses, consumer groups, and vending and       transit industries;\n\n(7) an analysis that estimates the potential seigniorage       associated with a widely circulated…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…currency that is designed, issued, and monitored by the  Federal Government. It is government-controlled, programmable money  that, if designed without the privacy protections of cash, could give  the Federal Government the ability to surveil and restrict Americans'  transactions and monitor every aspect of our daily lives.\n\nIn other words, every dollar you…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…If you have somebody in the  household--it could be a woman or it could be a man--if a man is in the  household, you could penalize that family by easily $25,000 or $30,000  cash for having both parents at home.\n\nAn example of programs which fit the bill, which we penalize people  for getting married, would be formerly called food stamps, certainly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…act has never been greater. Last month,  it was reported that Iran had become the sole source of jet fuel to  Burma. These secret shipments had not only given Iran much-needed cash  and a new market, but it allowed the Burmese military leaders to  circumvent Western sanctions.\n\nThe deliveries of jet fuel have powered an expansive bombing campaign  by the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…person can open up a  cooler and pull fresh vegetables out of there based on the honor  system. The bag says how much someone is supposed to pay for them.  There is a box with cash in it.\n\nMr. Speaker, try that in one of your metropolitan areas. While I hear  my colleague talk about how much help we in the small town need for  more government, as a small-town…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]