[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of William  ``Bill'' Cass, Commissioner of the New Hampshire Department of  Transportation (NHDOT), and his retirement after 40 years of service to  our state. As Commissioner of NHDOT, Bill has fostered…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Let me recognize: New Rochelle, Joan Alexander; Larchmont-Mamaroneck,  Louise Perez and Beth Radow; Scarsdale, Beth Cukier; Rivertowns, Susan  Maggiotto; White Plains, Alan Cass; Rye-Rye Brook-Port Chester, Liz  Rotfeld and Roz Carvin; and the Countywide League of Women Voters of  Westchester for the past 5 years under the leadership of Kathy Meany.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692778/recognizing-league-of-women-voters-leadership"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Patricia Cohen on April  3 that says that the trade war that we are in risks forfeiting  America's economic primacy.\n\nNow, this is just one article. There is another one by Oren Cass. He  is the chief economist at American Compass. I guess that is a  conservative think tank. That is what the printout says.\n\nHe writes a newsletter on Understanding America.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I rise today to recognize an exceptional  young leader from my district, Jayden Coffey, a student at Cass Job  Corps in Franklin County, Arkansas, and the latest recipient of the  Westerman Award--a quarterly honor given to students who demonstrate  outstanding character, leadership,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to honor a man whose lifetime  of service and dedication to Cass City has left an indelible mark on  our community. It is with great admiration that I recognize James E.  Baker, II, as the 2025 Cass City Citizen of the Year.\n\nBorn and raised…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize an outstanding  young leader in our community, Kacee Gray, who has been named the Cass  City Junior Citizen of the Year for 2025. Kacee exemplifies the values  of hard work, dedication, and service, making a profound and lasting  impact on Cass City and beyond.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}]