[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Military Force if President Trump  wanted to put boots on the ground or conduct military strikes in  Venezuela to abide by the law.\n\nFor that, Republicans in Congress would need to cast their vote on  whether to commit U.S. Armed Forces to an open-ended conflict that  their constituents, the American people, certainly do not want.\n\nTrump ran on ending forever…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…this: We are all humans in this  place, and one of the things we try to do is minimize votes that we  might regret. It is impossible to eliminate those.\n\nWe are humans, and we cast thousands of votes even in a single term  in the Senate. There will be some we might look back on and feel like:  Oh, maybe we should have done this differently.\n\nThe most likely…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…credits were not extended when tax  cuts for the wealthiest were extended, this additional burden on this  1.8 million-person population is unacceptable, and the vote we will  cast today gives us all an opportunity to sort of shore up the  healthcare network for those nearly 2 million people.\n\nI wanted to focus, in particular, on the kind of person who…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…instruct       their respective electors. In its recent decision in Chiafalo       v. Washington, the Supreme Court held that electors do not       have discretion to decide how to cast their Electoral College       votes, but rather are legally bound to follow the       instructions given by their respective states.\n\nAs Columbia Law School Professors Jessica…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…tossed aside was unimaginable. It was firmly established law for  decades, relied on by American women and men.\n\nIn a stroke of catastrophic, misguided ruling, the Supreme Court cast  it aside, ignoring strong precedent and all the doctrines of law that  normally would apply. So the Women's Health Protection Act now is more  necessary than ever before, certainly…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…rights, civic engagement, and  youth development. Mrs. Pough is truly an example of a life lived  fully. She has been blessed to break bread with First Lady Michelle  Obama and to cast her vote for Harold Washington, Chicago's first Black  mayor and for Barack Obama, Americas first Black President-- achievements she believed she would never witness in her…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…don't matter.\n\nNow, Michiganders have been clear with me that there need to be  consequences for this kind of anti-American behavior, and that starts  with leadership. We have a cast of characters who are in charge of  policy related to immigration.\n\nLet's start with Secretary Kristi Noem. She should resign. If she  doesn't resign, the President should do…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…money organizations  that can raise and spend unlimited sums and operate with fewer rules,  less transparency, and the ability to determine election outcomes long  before voters cast a ballot. A small number of wealthy donors now wield  influence far out of proportion to the voters they seek to affect.\n\nThis concentration of power has consequences for how…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…earlier in his office, he started inviting me with him. My  first codel was with him. He told me all the time: Booker, there are  two types of Senators here. I don't mean to cast any aspersions on  others, but there are people who represent their States, and there are  statesmen. He kept challenging me to be a statesman, not a great  Democratic Senator…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…just hoping that the elections clerk accepts their  documentation, and present either a passport or a birth certificate to  register to vote, and every single time they want to cast a ballot. A  passport costs $150, and a copy of a birth certificate could cost up to  $60. Many Americans simply can't afford to purchase these documents.  Those requirements…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…instruct their respective electors. In       its recent decision in Chiafalo v. Washington, the Supreme       Court held that electors do not have discretion to decide how       to cast their Electoral College votes, but rather are legally       bound to follow the instructions given by their respective       states.\n\nAs Columbia Law School Professors Jessica…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…been called off the Senate floor to go into  a room behind and take a telephone call from Donald Trump.\n\nDonald Trump, President, in his first term, was asking John McCain to  cast the deciding vote to eliminate the Affordable Care Act, health  insurance coverage for millions of Americans.\n\nMadam President, I sat here, and I watched as John McCain came…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the weekend--because it is a big deal. It is a big  deal to go nuclear. It is a big deal to adopt a new idea that hadn't  been widely circulated until the last few days.\n\nSo I cast my heart and my vote with the idea of let's try to figure  this out.\n\nI thank the President.\n\nMr. MERKLEY. Mr. President, would my colleague yield for a question?", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…stigmas surrounding those diseases were  devastating. At the time, the sentiment in America was that addiction  was a personal failure. Those who suffered from addiction were cast out  of society, isolated from their families, and denied the treatment they  so desperately needed. Instead of being sent to hospitals, they would  be sent to jails.\n\nHowever,…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…across the country. Yet, in 2021, Texas has led the Nation in voter  suppression, rejecting nearly 13 percent of mail-in ballots. Texas  rejected nearly 13 percent of ballots cast by rightful citizens of this  country, people who are being disfranchised for exercising their right  to vote.\n\nThe Republicans are really using this patriotic chest-beating…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689407/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the town grew, Cutler played an important role in the promotion of  maritime safety and American national security. Since 1876, the Little  River Lighthouse, with a formidable cast iron tower, has guided  fishermen and has been integral to U.S. Coast Guard operations in the  area. It is now listed on the National Register of Historic Places,  ensuring…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699424/200th-anniversary-of-the-town-of-cutler"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…oath, a quorum may consist of one Senator.\n\n2.5. A vote by any member of the Committee with respect to       any measure or matter being considered by the Committee may       be cast by proxy if the proxy authorization (1) is in       writing; (2) designates the member of the Committee who is to       exercise the proxy; (3) is limited to a specific measure…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…in  these municipal elections. In Washington, D.C., a noncitizen only has  to reside in the District for 30 days in order to register to vote.\n\nMr. Speaker, 388 noncitizens cast ballots here in our Nation's  Capital in Washington, D.C., in the most recent election.\n\nBy passing the SAVE Act we can ensure that only eligible Americans  are registering…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…That is the danger that the men and women of law enforcement face  each and every day.\n\nIt is easy for us to come here to Washington, D.C., and to the  Capitol every day and cast our votes. Why? Because we have police who  protect us each and every day, back in our home communities, but also  right here at the U.S. Capitol.\n\nIn my former life, I was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, due to unforeseen circumstances, I was  unable to cast a vote on Roll Call No. 163. Had I been present, I would  have voted YEA.                                  PERSONAL EXPLANATION", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692228/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…stated in the Committee report on that measure unless       previously announced by the Committee, and such report or       announcement shall include a tabulation of the votes cast in       favor of and the votes cast in opposition to each such       measure and amendment by each Member of the Committee.       (Paragraph 7(b) and (c) of rule XXVI of the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…laws from some States that in an attempt to ban African  elephant ivory, which we all want to do that--that is not allowed in  America, by the way--States have gone too far and cast this huge net  and said you can't buy any ivory products anywhere, including Alaska  Native products from Alaska walrus harvesting.\n\nThis really has hurt my State. People coming…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the committee report on that measure unless previously       announced by the committee, and such report or announcement       shall include a tabulation of the votes cast in favor and the       votes cast in opposition to each measure and amendment by       each member of the committee. (Paragraph 7(b) and (c) of rule       XXVI of the Standing…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…will just say that God has a special  place in his heart for the widows of the world. Since ancient times,  such as the widow Zarephath with Elijah, the mite that the widow cast  into the temple treasury, as well as Jesus Christ' own mother, Mary, a  widow, whom Jesus on the cross, while He suffered and died for all  mankind, offered that widow, his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695808/what-i-learned-from-charlie-kirk"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…deserves better than to spend their hard-earned money  on people who can and should be working.\n\nThen I offered an amendment to the Big Beautiful Bill that sort of, I  think, cast the position of Democrats versus Republicans in a very  clear light. My amendment would have penalized States for giving  Medicaid benefits to illegal immigrants who were charged…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "Mr. BRECHEEN. Mr. Speaker, I was unavoidably detained due to illness  and was unable to cast my vote on Roll Call No. 175.\n\nHad I been present, I would have voted YEA on Roll Call No. 175.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692869/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…In 2022, I lost my first statewide election in Pennsylvania by  950 votes. That is 14 votes per county. I won my second election in  2024 by 15,000 votes--of over 7 million cast. These incredibly narrow  races, each of which had electoral issues of their own, show just how  important it is that our elections run smoothly, fairly, and that only  legitimate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "Mr. BRECHEEN. Mr. Speaker, I was was unavoidably detained due to  illness and was not able to cast my vote on Roll Call No. 185. Had I  been present, I would have voted YEA on Roll Call No. 185.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693140/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "James Risch", "party": "Republican", "sentence": "…of the committee on any measure, or       amendment thereto, shall be announced in the committee       report. The announcement shall include a tabulation of the       votes cast in favor and votes cast in opposition to each such       measure and amendment by each member of the committee.                               Rule 9--Treaties\n\n(a) General.--The…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…These are  the people who control our politics in California.\n\nNow, I have spoken about a culture of corruption that exists in  Sacramento, and this latest series of events has cast that culture of  corruption in stark relief. Indeed, the former chief of staff or  communications director for both Jerry Brown and, I think, Dianne  Feinstein used those very…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]