[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…troops into harm's way, our sons and  daughters, whether they are flying bombing missions or ground troops or  covert operations, we ought to have the guts in this body to cast a  vote saying that that war is necessary, not just act as cheerleaders  and hide from culpability, hide from accountability, hide from  responsibility.\n\nIf you vote against S.J.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…chest-beating moment  of voting in an attempt to make it difficult for people of color, for  seniors, for veterans, for persons with disabilities to be able to go  and cast their vote.\n\nI filed three amendments to make this bill better that were all  rejected by the Republicans, one of which would have made it possible  to provide documentation of citizenship…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689407/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I was unable to cast a vote on rollcall  vote No. 623, passage of H.J. Res. 130, disapproving the Bureau of Land  Management resource management plan that made certain land managed by  the Buffalo…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699842/vote-explanation"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Rights Convention.\n\nCommitted to voting rights, she lobbied President Theodore Roosevelt  for suffrage and remained a steadfast advocate for women. At age 95,  she cast her very first vote, proof her decades of advocacy helped  transform our Nation.\n\nShe was a minister, a reformer, a writer, and, above all, a woman of  courage and conviction. We remember…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691473/antoinette-brown-blackwell"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…other  side of the aisle--Mr. Speaker, we don't work for President Trump. We  don't work for JD Vance. We don't work for Elon Musk.\n\nMr. Speaker, as all of us prepare to cast this vote, I hope my  Republican colleagues will come to the conclusion that we work for the  American people. We work for the American people. We don't work for any  President.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, after just four short years since  I proudly cast my vote to establish Juneteenth as a federal holiday  through the Juneteenth National Independence Day Act, the very history  that this day honors is now under attack by the current…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…civic engagement, and  youth development. Mrs. Pough is truly an example of a life lived  fully. She has been blessed to break bread with First Lady Michelle  Obama and to cast her vote for Harold Washington, Chicago's first Black  mayor and for Barack Obama, Americas first Black President-- achievements she believed she would never witness in her lifetime,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the full  view of people whose spouses are in the military or whose kids are in  the military. Let's have that debate in front of them and hear what  they think before we cast a vote that would be one of the most serious  votes that you ever cast on the floor of a body like this.\n\nBut we should not allow a war of the magnitude of this to begin with…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Force if President Trump  wanted to put boots on the ground or conduct military strikes in  Venezuela to abide by the law.\n\nFor that, Republicans in Congress would need to cast their vote on  whether to commit U.S. Armed Forces to an open-ended conflict that  their constituents, the American people, certainly do not want.\n\nTrump ran on ending forever wars,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, just minutes ago, I was outside and was  running up the steps to the Senate Chamber in order to cast a vote on  the issue before the Senate, and the issue before the Senate was  whether or not we would pass a bill to release the Epstein files.\n\nAs you run up those stairs, if you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…they couldn't be part of the process. I  commend them. But, sadly, three votes on the other side of the aisle  wasn't enough. We needed one more.\n\nAnd who swooped in to cast his vote--the decisive vote? Vice  President Vance. He showed up at the last minute and cast a tie- breaking vote in the Senate to push the bill across the finish line.\n\nA few short…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…States  to the total of $75 million. If you are serious about election fraud,  then give the secretaries of state the resources to ensure that  ineligible voters do not cast their vote.\n\nDefunding them is an invitation for abuse. This isn't, nor should it  be, a partisan endeavor. Democrats and Republicans shouldn't be afraid  to face the voters, all…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "Mr. BRECHEEN. Mr. Speaker, I was was unavoidably detained due to  illness and was not able to cast my vote on Roll Call No. 185. Had I  been present, I would have voted YEA on Roll Call No. 185.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693140/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "Mr. BRECHEEN. Mr. Speaker, I was unavoidably detained due to illness  and was not able to cast my vote on Roll Call No. 183 and 184. Had I  been present, I would have voted YEA on Roll Call No. 183 and YEA on  Roll Call No. 184.                   announcement by the speaker…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693013/special-interest-alien-reporting-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, due to unforeseen travel delays, I was  unable to cast a vote on H.R. 517, Roll Call No. 84, and H.R. 997, Roll  Call No. 85. Had I been present, I would have voted YEA on both roll  call no. 84 and roll call no. 85.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689298/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "Mr. BRECHEEN. Mr. Speaker, I was unavoidably detained due to illness  and was unable to cast my vote on Roll Call No. 175.\n\nHad I been present, I would have voted YEA on Roll Call No. 175.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692869/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, due to unforeseen circumstances, I was  unable to cast a vote on Roll Call No. 163. Had I been present, I would  have voted YEA.                                  PERSONAL EXPLANATION", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692228/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Senator from Massachusetts believes that  to be true. We are all here to represent U.S. citizens, and we should  be certain that it is only U.S. citizens who are able to cast a vote  for any of us to be here.\n\nThe SAVE America Act puts these commonsense ideas into place to make  our elections more secure and fair. I invite my colleagues to support…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…to       exercise the proxy; (3) is limited to a specific measure or       matter and any amendments pertaining thereto; and (4) is       signed by the member wishing to cast a vote by proxy, either       by handwritten signature or autopen. Proxies shall not be       considered for the establishment of a quorum.\n\n2.6. Whenever the Committee by roll…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}]