[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…The Republicans' devastating budget plan would push about 14 million  Medicaid recipients off lifesaving healthcare and leave countless  vulnerable families exposed to catastrophic medical bills. This is  terrible. This is about health and financial health that is being  devastated.\n\nWorking families and children from low-income households would face…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Trump       Administration's submission to the Supreme Court of the       United States argues that terminating its sweeping national       emergency tariffs would have catastrophic consequences for       our economy.\n\nThis is backwards. The greater threat to the economy of the       United States is not that the Trump Administration's tariffs…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…families into crisis, undermining local economies, and       pushing communities into unnecessary instability.\n\nTPS for Haiti was first designated in 2010, after a       catastrophic earthquake. Extensions continued over many years       in recognition of Haiti's ongoing instability and       humanitarian needs. The designation was most recently…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…about  verifiable limits, predictability, and reducing the risk of  miscalculation between nuclear-armed states.\n\nFor decades, arms control agreements have helped prevent a  catastrophic nuclear exchange, not by eliminating deterrence but by  stabilizing it.\n\nThe New START treaty, which stands for Strategic Arms Reduction  Treaty, was signed in 2010 and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…make the  products that sustain and enrich their employees and their customers.\n\nThis trade policy reveals ignorance of history as well, particularly  the history of the catastrophic effects of the Smoot-Hawley tariffs  during the Great Depression.\n\nThe common thread of the Trump Administration's misguided approach to  these issues appears to me to be…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Arms control is neither an act of faith nor of naivety. It is an act  of cold logic and discipline, a process that reduces the risk of  miscalculation, escalation, and catastrophic error. The year will not  only keep America and the world safer, but it will also give time to  hammer out a new accord.\n\nAs the U.S. sits across the negotiation table,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…which I introduced  with Representatives Valadao, Costa, and Fitzpatrick.\n\nMy Fire Safe Electrical Corridors Act is a commonsense solution to  help us reduce the risk of catastrophic wildfires. It simply allows the  United States Forest Service or the Bureau of Land Management to  approve the removal of hazardous trees or vegetation near power lines…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…mothers, fathers, workers,       students, and community members back to circumstances where       their safety cannot be guaranteed.\n\nIn addition, TPS termination would have catastrophic       consequences for mixed-status families; households where       parents hold TPS, but their children are U.S. citizens. The       termination of their parents' protected…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Budget Committee, I had hearing after hearing that  demonstrated that.\n\nWhat we see across the country is climate change driving extreme  weather, sea level rise, heat waves, catastrophic wildfires, and toxic  pollution. That not only drives illness and death, but it is right now  as we speak undermining the insurance, mortgage, and real estate  markets in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…House Republicans spent Mother's Day scheming on how to  advance these Medicaid cuts, finally releasing a copy of their  legislation so we could see the detail. It is as catastrophic as we  feared. It is the largest cut in Medicaid in the Nation's health  history, ripping health insurance away from millions of Americans in  every single State.\n\nBut it…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Department's backbone has always been its       career workforce, and those who were part of it are best       positioned to explain why the current leaders' actions are       catastrophic for the nation.\n\nWe call on these leaders to reverse course--to remember the       oath we all took to uphold the Constitution--and adhere to       the legal guardrails…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…from getting into an unnecessary war. I happen to believe that  the United States engaging in a war against Iran--a third war in the  Middle East since 2001--would be a catastrophic blunder for this  country.\n\nI think there are some in this body who have a different point of  view than I on this point, but I think we should all be able to agree  in…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…is ``later'' now, and ``later'' is way  too late.\n\nThere are many stories about this, too awful to ignore, and there are  millions of families that are facing absolutely catastrophic price  increases. I have heard from seniors whose premiums are increasing  eightfold.\n\nSo in order to make the scope and scale of the problem that  Republicans want to ignore…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…our closest  European democratic allies and cozied up to anyone who will shower him  with gifts or praise or both.\n\nHe is enabling Russia's plans to carve up Ukraine, a catastrophic  decision that will only encourage future aggression and pain for  innocent civilians.\n\nHe has even threatened to forcibly annex Greenland from our ally  Denmark.\n\nAnd,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…has deliberately  blocked food, medicine, and fuel from entering Gaza. The entire  population of Gaza is experiencing famine, and half a million  Palestinians are facing catastrophic levels of starvation.\n\nAt least 66 Palestinian children have already been starved to death.  Maybe if my colleagues would close their eyes, or pretend that they are  not…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693848/starvation-in-gaza"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…healthcare. They  could choose among policies offered by hundreds of competing providers  for the one that best met their needs and circumstances. Most opted for  inexpensive catastrophic plans for accidents and illnesses that could  have bankrupted them, while paying for routine care out of pocket.  Competition for their business kept prices low and quality…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…any type of saltwater flooding. They create a  thermal runaway. Fortunately, they may not have experience with what a  thermal runaway is where they live, but these are catastrophic events  that ultimately affect not just that vehicle but everyone around that  vehicle. It ties up precious resources babysitting a fire that does not  need to exist in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…loss insurance from the definition of health insurance coverage. Stop- loss coverage is a type of coverage an employer can purchase to protect  themselves from unexpected catastrophic health claims if that employer  has chosen to self-insure their employees' healthcare. This allows an  employer to limit the financial risk imposed on them if an employee,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…five, the  high-speed rail disaster; number six, the sanctuary State disgrace;  number seven, failing public schools; number eight, manmade water  shortages; number nine, catastrophic wildfires; and number 10, chaotic  elections.\n\nThe good news is we have made significant progress when it comes to  each of those 10 items.\n\nWhen it comes to EV mandates,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…the Energy and Water Development bill, we had $14.6  million so that we can restore irrigation tunnels on the Gering-Fort  Laramie Canal. This need was identified after a catastrophic tunnel  collapse that left 55,000 acres of farmland without reliable  irrigation. Now this investment will protect regional economic  stability and reduce financial pressure…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…lives of  approximately 73,000 Americans per year and became the leading cause of  death among those aged 18 to 45. President Trump was elected in part to  confront this catastrophic crisis.\n\nFentanyl affects constituents of every Member of this body,  regardless of political affiliation. As someone who has met with  individuals devastated by this deadly…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699970/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…is as it concerns the issue of fire protection in my  district. Now, of course, we all saw the horror that unfolded in Los  Angeles recently, but in recent years, these catastrophic events have  become a recurring phenomenon. They have become, sadly, a fact of life  for folks in California.\n\nSeveral of the most devastating fires in State history have…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…counter.\n\nIt protects access to employer-sponsored insurance. By clarifying  access to stop-loss insurance, we safeguard small businesses from being  financially ruined by catastrophic health claims.\n\nIt stabilizes premiums responsibly. We responsibly fund cost-sharing  reduction payments, lowering ACA premium costs for all in the  marketplace by 11 percent.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698401/lower-health-care-premiums-for-all-americans-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…camping, hiking, fishing, and many other activities available in the  great outdoors.\n\nHowever, many of our Federal forestlands remain unhealthy and  continue to be at risk of catastrophic wildfire due to severe  overgrowth and decades of mismanagement. Consequently, the United  States has continued to see some of the largest and most intense  wildfires in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…with this. Continuing to use our taxpayer  dollars to give the Chinese Communist Party a seat in the front row of  our universities' classrooms and research labs would be a catastrophic  mistake.\n\nIt has been proven that the CCP does use programs like Confucius  Institutes, not to build bridges or promote culture, as they may say,  but to expand their influence…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the same tax break, employer, but  put it into a massively expanded, tax-free account, where you are able  to use it for insurance, real insurance, that you can go get, a  catastrophic coverage and/or direct primary care, all sorts of plans  out there where you have a doctor who says: Look, for $100 a month, you  can call me. I am at your call. I will…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…particularly useful in  the case of a medical emergency when an unexpected bill arrives.\n\nWe expanded eligibility for these health savings accounts to  individual bronze market and catastrophic plans starting in 2026. We  also ensured that high-deductible health plans cover telehealth and  other remote access or virtual healthcare services before the  deductible…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…physicians and other healthcare providers and also  expanding access to telehealth to reach patients in a more timely  fashion.\n\nWe also allow individuals who have purchased a catastrophic or bronze  health plan on the Federal marketplace to now contribute to and use a  health savings account.\n\nIn addition, this will improve access and competition on the Federal…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693915/health-savings-accounts"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…provide  reliable baseload power to mandating so-called beneficial  electrification which seeks to ban natural gas for residential heating  by 2050. The results have been catastrophic. A nonpartisan report from  earlier this year found the following:\n\n``Driven by State policy mandates to reduce greenhouse gas emissions,  electricity prices are projected…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…unified  pressure to convince him that, in fact, jaw-jaw is better than war-war.\n\nLet's not look back with regret that Congress did not act in the face  of Putin's corrupt, catastrophic, and contemptuous regime that laughs  in the face of his European neighbors and our American President.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}]