[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Purse seine fishing often uses fish aggregating devices, or FADs,  which are large, circular nets that drift independently through the  water for hundreds of miles until they catch fish. They have sonar and  GPS, so the fishing boat knows where they are and when the net is full.\n\nThe nature of this fishing method, combined with the proximity of  these…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691005/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…being lost, teachers who were  terminated in the schools and districts where they are the most needed.  In many of these areas, those are the schools that are still trying to  catch up from the losses that were caused during the COVID outbreak. We  shouldn't be shutting these down. We should be expanding the resources  that they have, but those title I…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Federal rulemaking with a very deceptive bureaucratic name. It  is IRS Notice 2025-28. And the topic is so bland, if you don't have a  background in tax policy, you might not even catch on to what it is all  about.\n\nThe notice rewrites the rules that govern how corporations and  private equity firms count income from the partnerships they own. They  get to…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…we discovered is that--Donny was about 6 feet 2  inches. He was a wide receiver. He would be running down the field,  looking at the goal line with nothing in front of him, catch the ball,  and then he would trip over me. I was a defensive halfback. So we got  to know each other pretty well.\n\nHe was one of the nicest gentlemen you could ever meet. He…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Senate--I am honored to represent the State of Illinois--I have cast  over 9,000 votes. The Presiding Officer from Utah is new to the Senate.  It will take him  a few years to catch me, and I am sure he will. But of the 9,000 votes  in that period of time, how many do you actually remember? A handful.  This vote last week was one of those votes.\n\nWhy will…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…announced they are investing $1 trillion in clean  energy, low-carbon technologies.\n\nSo what we are debating here is going to absolutely allow for these  other countries to catch up to us, and we will ultimately fall further  and further behind, especially in the efficiency of the vehicles which  we drive in this country. We might as well put a bow…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…country are  struggling to put food on the table for their kids. They work two jobs  to try and make ends meet. They are trying to juggle getting their kids  to school and maybe catch an occasional game. They fear they will never  find childcare they can afford. They pray nobody in the family gets  sick because they can't afford a doctor either.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700018/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…currently have. This has been the case for decades. While some claim  that this is easily done, there is no way.\n\nMr. Speaker, the Chinese are investing billions of dollars to catch  up to us in this field. We should not lose American leadership.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…a reason. I saw why firsthand when I was there last  summer.\n\nThis special place offers unmatched, truly wild fishing and hunting  opportunities for all Americans. When you catch your first Arctic char  in the Canning River on the Coastal Plain, it is a moment you will  never forget as an American. These lands have provided sustenance to  the Gwich'in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…California, such as protecting our       magnificent and unique coastline. And we took the lead in       that area as well. It took the rest of the Nation a few years       to catch on, but in 1970 the Congress followed California's       lead and enacted the Clean Air Act. Other laws to protect and       clean up the Nation's lakes and rivers were passed,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Trump's on-again, off-again tariffs. ``Taco or not taco'' is the  question they are asking.\n\nWhy are Republicans rushing to take the break when so many Americans  can't even catch a break? Simply put, Republicans are running scared of  a titanic Presidential temper tantrum over releasing the Epstein files.\n\nMy Democratic colleagues and I are here to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694074/time-to-deliver-results-for-american-people"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the Pop Warner Super Bowl, and bring the trophy home to  Brooklyn.\n\nWhat a show they put on. Running back Ron Rollock made the play of  the game with an incredible one-handed catch on fourth down to seal the  victory for the Jaguars.\n\nIt was an incredible team effort.\n\nI thank the dedicated coaches, loving parents and families, and the  entire Brooklyn…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688227/solving-problems-for-the-american-people"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…people.\n\nFolks are mad and they should be. It is justifiable anger. The  American Dream is gone for too many people, people who work hard, who  play by the rules, and yet can't catch a break, who see life as too  expensive.\n\nPeople are right. The American people understand our economy has been  rigged against so many. I say the American Dream hasn't slipped…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…places and the wildlife that depend on them.\n\nThese lands are where Americans hunt caribou, grizzly bear, and Dall  sheep, where Americans trap wolverines, and where anglers can catch  their first Arctic char.\n\nMost importantly, these lands have provided sustenance to the  Gwich'in and Inupiat peoples since time immemorial.\n\nFor the last century, bipartisan…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…this and didn't have the capacity to do it.\n\nWe have made so much progress in the United States on environmental  protection over the last 50 years. Our Nation's rivers used to catch  fire. Now, they don't. Smog used to surround our cities, particularly  Los Angeles. Now, it doesn't.\n\nPresident Trump and House Republicans want to undo all of that. They…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…we could do  now is what we have been working on for a decade. We could launch this  central bank digital currency. It will solve everything. It will keep  us safe. It will catch the tax evaders, the money launderers, and the  illicit finance.\n\nIn the hands of a good leader, it could. The reality is we know, as  our Founders recognized in Federalist…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…programs is such that there is a  feeling of: Why would I get married at all?\n\nThese programs also cause cheating or breaking the law because, of  course, they frequently don't catch it if you are getting cash off the  books. All of these programs encourage working for cash. They also  encourage, I think, earning money by doing things illegally because…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…certain special victim offenses. Sec. 517. Members asserting post-traumatic stress disorder, sexual                assault, or traumatic brain injury. Sec. 518. Participation in CATCH a Serial Offender program. Sec. 519. Accountability and transparency relating to allegations of                misconduct against senior leaders. Sec. 520. Confidential reporting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…that area and  smuggling right through that zone. The good news is things are  different now, and that person was caught because we have the manpower  in place to be able to catch them.\n\nAnd that person will be deported immediately. That is also a big  change that has actually occurred.\n\nSo things are different in what is actually happening there, and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…shift is when this  stuff usually happens.\n\nI am not talking about when someone doesn't stop right away. That is  not a high-speed pursuit. Having to drive 100 miles an hour to catch up  with somebody that you are pulling over is not a high-speed pursuit.\n\nA high-speed pursuit is when they are running. This is something  where the officer has to make very…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…really well. Our  Medicaid system called AHCCCS is actually remarkably well run, except  for some of the fraud. I am going to touch on that. We haven't built  the models to catch it faster because we are not actually incentivized.\n\nNow, we also play incredible games where we use a provider tax. We  actually make money for the general fund more than…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…waterbirds common to the Great Lakes  States and the Southeast. They are opportunistic and intelligent  predators that often feed at aquaculture facilities, where fish are  easy to catch. A variety of studies have determined that predation from  double-crested cormorants costs the aquaculture industry nearly $65  million annually in economic losses.\n\nThis legislation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…housing starts--you got 6 percent. Guess what. You are  going to get extra CDBG money. You get extra money. That is the carrot.\n\nNow, if you are thinking to yourself: ``There is a catch here  somewhere,'' OK; there is no free lunch. Anytime someone tells you  something is free, uh-uh. Anything that is free, somebody had to pay  for.\n\nHere is the catch: We…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…the darkest recesses of the internet, like the bill to reauthorize  and modernize the Internet Crimes Against Children Task Force. This  bill funds and enhances our ability to catch and convict the very worst  kinds of criminals--those who target and abuse children.\n\nIt requires building strong police departments with officers who know  the neighborhoods…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…American strength, and put  American workers first again.\n\nIn just 1 year, he has delivered. Let's just start at the southern  border. President Trump restored order by ending catch and release,  reinstating proven enforcement policies, and deploying the resources  necessary to defend our homeland. The results were immediate and  historic.\n\nIllegal crossings…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…independence. I know they have a special affinity for fish that aren't  in the Gulf and attack recreational fishermen in their endeavor to go  out and spend time with their family and catch fish. I don't know what  part of the Gulf that they think is so ignorant that they wanted to  rename the Gulf the gulf of ignorance, but you can look it up. They  filed that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…any other district in the  United States. The only singular district that has a larger big water  shoreline is Alaska, but that is all saltwater. That is the difference.  We catch different kinds of fish in those two different kinds of  waters.\n\nWhat we have in Michigan surrounding the lower peninsula and capping  the northern border of the upper peninsula…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693964/recognizing-the-achievements-of-the-alpena-community-college-remotely-operated-vehicle-team"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that we are not capturing and that we are not catching. There is a very  simple and basic premise of those who have been in a prosecutorial  function, which is that you only catch so many people. In this case, we  have been going after some individuals, but we can certainly prevent  any further abuse of our voter elections. Making sure that we have…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…nonprofit status  of organizations which incite or fund domestic violence against law  enforcement.\n\nThird, it turns illegal entry into a felony with mandatory  detention--no more catch-and-release--and it establishes a 10-year  mandatory minimum prison sentence for those who try to illegally  reenter this country after they have been deported.\n\nFinally, it…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…What happens when we raise that debt ceiling, Mr. Speaker, and we  have to come to market--Treasury has to come to market--with $500  billion to $600 billion functionally to catch up and refund all  the accounts we have been borrowing from? That is what is done in  extraordinary measures. We grab every account and use that cash, now we  have to refund…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}]