[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Confucius Institutes only, and the ban was so  successful there are only a handful of Confucius Institutes remaining  on U.S. campuses.\n\nThat is why H.R. 881 includes a new category of banned relationships:  those between U.S. institutions of higher education and so-called  Chinese entities of concern. In the bill, a Chinese entity of concern  is any…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…population at  large.\n\nAccording to a 2024 survey by the Trevor Project, 12 percent of LGBTQ  youth attempted suicide in the past year--12 percent of American youth  in this category.\n\nNow, the Trump administration is reportedly considering eliminating  these specialized support services, which would cut off the lifesaving  resources they provide.\n\nYoung…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690731/defunding-suicide-hotline-for-lgbtq-youth"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of them statutory,  some of them regulatory, oftentimes in a kind of political reaction to  a particular event that might have been criminal already under a more  general category.\n\nThis legislation will allow us to get on top of the problem. It will  direct the Department of Justice and other Federal agencies to compile  a comprehensive report describing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…agency will take based on that submission--rules       that are directed at and primarily concerned with the       behavior of non-agency parties do not fall within this       category.\n\nAs discussed above, the Barred Owl Management Strategy       adopted by the ROD provides a framework for non-agency       parties to implement barred owl management. This…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…record of success.\n\nFederal agencies award a record amount of contracting dollars to  small businesses each year. However, many other factors, complexities,  and policies, like category management and overly strict past  performance requirements, are countering the impact of these programs.  As a result, the government has over 40 percent fewer small businesses…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…important  publications, as this Ohio's 13th Congressional District Champion of  the Week.\n\nGrace Springer received second place in the Best Government/Political  Reporting category.\n\nCharita Goshay received second place in the Best Religion Reporting  category.\n\nNancy Molnar received first place in the Justice Reporting category.\n\nFinally, for the Best…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694044/recognizing-canton-repository-reporters"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…or entrepreneurs or gig workers and  work in the way and in the flexible circumstance they choose. And I  speak from experience because two of my three kids fit into this  category.\n\nThe rule that has been put in place by the Trump administration isn't  going to make it particularly hard for large group plans to just re-up  insurance, but it will make…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…1997, he was awarded the Gold Medal of the United States Congress.  The Guardian recognized him as one of the world's leaders in raising  environmental awareness. And, in its category of Leaders and  revolutionaries, Time Magazine named him as one of the world's most  influential people. Now, he is being rightfully honored with the  Templeton Prize, previously…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…of that.\n\nYou know that those people are thinking to themselves: You know what?  I am just going to go without insurance. I can't--he is raising my  bills in every single category, and so I am just going to take the  risk. I am going to go without health insurance and hope that I don't  get into a car crash or into a major accident.\n\nPresident Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Personnel\n\nSecond, the withdrawal of the Reporting Requirements is not       a rule of agency management or personnel. We have previously       held that rules that fall into this category relate to purely       internal matters, such as controlling, directing, or       supervising internal management issues. Because the       withdrawal of the Reporting Requirements…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…them because they were out of the  mainstream; they were ideologues with an ax to grind that was  potentially detrimental to rights and liberties.\n\nMr. Bove is in a different category. Yes, he is conservative. He is  out of the mainstream. But he is corrupt. He is dangerous, vindictive,  and revengeful in a way that this administration has made a pattern…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…including machine guns, destructive devices such as grenade       launchers and large-bore rifles and shotguns (greater than       .50 caliber), and firearms that fall under the category of       ``any other weapon'' such as firearms incorporated into other       common objects or disguised to be undetectable as firearms,       i.e., umbrella or flashlight…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…establishing or       rescinding those procedures substantially affected the       rights or obligations of the non-agency parties.\n\nHere, the 2025 Policy Statement falls within the category       of rules not subject to the exception. The previously       applicable Richardson Waiver, like the rule at issue in B-      281575, required notice to affected non-agency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…parts  of rubber tire manufacturing since 2002. However, a 2020 court ruling  required EPA to address all unregulated hazardous air pollutant  emissions from a major source category. When EPA carried out a required  technology review, it was obligated to propose limits for the  unregulated rubber processing subcategory of rubber tire manufacturing.\n\nI…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688528/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Americans and Alaskan Indians?\n\nFour in 10 American Indian/Alaskan Native people are       enrolled in Medicaid, the highest enrollment rate among any       race and ethnicity category. This includes about 23 percent       of nonelderly AIAN adults and 44 percent of [American Indian/      Alaskan Native] children.\n\nHow the Federal Government funds the states'…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…intake is associated with a lower risk of childhood obesity.  While it is important to limit fatty, sugary, and highly processed  foods, whole milk does not fit into this category. In fact, many  schoolchildren are at risk of dairy underconsumption, not  overconsumption.\n\nWhole milk provides critical nutrition for growing minds. We need to  follow the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698186/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…past administrations, CEQ has published reports on NEPA litigation  and environmental reviews. From 2001 to 2013, annual surveys recorded  the defendant agency, plaintiff category, and case results, showing  that special interest groups, not individual citizens or communities,  were responsible for the most NEPA cases.\n\nAlthough these CEQ studies provided…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…aerospace, defense, and advanced materials  sectors, already account for 20 percent of our annual GDP, and the  space segment is among the fastest growing within that combined  category, according to Aaron Starks, former chief revenue officer for  World Trade Center Utah and now 47G's president and CEO. He said: ``I  think and firmly believe that Utah's future…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…failure to act responsibly and enforce the law. These  good Americans died at the hands of criminal aliens who should never  have set foot in our country.\n\nBut there is another category of illegal alien criminals who perhaps  are not so widely known, largely because the mainstream media outlets  refuse to report on the many heinous crimes committed by illegal…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…by less  than that.\n\nThe votes against the SAVE Act today were nothing more than to allow  noncitizens to vote in the United States of America. I think that falls  into the category of the 80/20 position. All I know, Mr. Speaker, is a  vote against the SAVE Act today was a vote against American citizens'  voting rights.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690081/protecting-the-rights-of-american-citizens-to-vote"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…manual met CRA's third exception.\n\nIn contrast, rules that are directed at and primarily       concerned with the behavior of non-agency parties do not fall       within this category. Thus, in B-274505, Sept. 16, 1996, we       declined to apply CRA's third exception to a Forest Service       memorandum on the Emergency Salvage Timber Sale Program,…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "John Thune", "party": "Republican", "sentence": "…somehow this is  going to--we want to be for the little guy, for the guy who is trying  to make it out there, the person who is really struggling to get by,  the lower income category. But what this does is this forces hard- working taxpayers--people out there trying to get by--to subsidize the  insurance costs of affluent, wealthy people. Why? Because…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…provide cost estimates of legislation using both the budget resolution  baseline and CBO's unmodified baseline.\n\nDiscretionary Budget Authority \\1\\.     Revised Nonsecurity Category                 856.623            N.A.      Discretionary Budget Authority \\1\\.     General Purpose Outlays \\1\\.........            N.A.       1,872.320 Memo:         Subtotal........................…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is functionally an insurance company with an Army.  You laugh, but you know you are going to quote that later.\n\nLet's actually sort of take a look. This is net receipts by category,  2024 compared to 2025. Hopefully, this will make sense. I am going to  put this chart up on our website later because I know it is really hard  to see. If you actually take…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…from their qualified  business expense, a 20 percent deduction, expires at the end of this  year. That is a massive tax hike on small businesses, and this is  oftentimes a category that gets overlooked because my colleagues talk  about corporations and about high-net-worth individuals, but the small  businesses are structured in a way that their ordinary…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…markets while protecting investors.\n\nAccording to Joel Trotter, one of the authors of the JOBS Act,  ``Decades of successful experience show that the well-known seasoned  issuer category is long overdue for expansion.''\n\nI couldn't agree more, and this bill does exactly that. It lowers the  size threshold for WKSI qualification while maintaining all the  existing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Rule of Agency Management or Personnel\n\nThe Buffalo RMPA is not a rule of agency management or       personnel. We have previously held that rules that fall into       this category relate to purely internal agency matters.       Because the Buffalo RMPA is concerned with public use of the       areas it governs rather than management of BLM itself or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…for pediatric care in our State and our region.\n\nIn the 2025-2026 U.S. News and World Report, Iowa's Stead Family was  ranked No. 1 in Iowa and No. 12 in the Midwest under a category called  the Best Children's Hospitals ranking.\n\nStead Family Children's Hospital has appeared in rankings every year  since the U.S. News and World Report launched these indexes…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696467/recognizing-stead-family-childrens-hospital"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we were  all panic-stricken that we had diseases and bacterial infections that  we didn't have antibiotics for. The antibiotics weren't working. AI  discovered a whole new category of antibiotics that the literature said  it would take humans 20 years to develop.\n\nInstead of being afraid of the technology, maybe we should get our  heads straightened…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ensure these devices are evaluated consistently,       accurately, and safely. This framework ensures that only true       less-than-lethal devices fall within the updated category       while preventing unintended loopholes or misuse.\n\nH.R. 4242 harmonizes tax statutes with the classification       framework in H.R. 2189. It ensures consistent federal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}]