[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "In the past week alone, cattle producers have seen excessive price losses and corn growers have seen biofuel producers suspend purchases due to weaker fuel demand."}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "What is that  going to do to American cattle producers?"}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Sudden price declines have harmed on-farm operations of hog and cattle producers."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "Rolling out the second plank of his Rancher Relief Plan to bring critical support to Montana cattle producers who have been hit hard by the coronavirus pandemic, U.S."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "Senator Jon Tester is introducing bipartisan legislation that would provide much-needed relief to Montana cattle producers."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "Senators Jon Tester (D-Mont.) and Mike Rounds (R-S.D.) along with a bipartisan group of their colleagues today introduced a resolution to support country of origin labeling (COOL) for beef products in the United States in an effort to provide critical support to American cattle producers hurt by the COVID-19 pandemic."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Moran also took several steps to bolster the livestock industry by calling for emergency payments for ranchers and advocating for increased funding for cattle producers in the CARES Act."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Part of the funding will go to help Montana's cattle producers who have seen a drastic decline in cattle markets during the pandemic."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Department of Agriculture (USDA) Secretary Sonny Perdue requesting immediate assistance to cattle producers during the Coronavirus pandemic."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Department of Agriculture (USDA) Secretary Sonny Perdue requesting immediate assistance to cattle producers during the Coronavirus pandemic."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Additionally, Hoeven has urged Agriculture Secretary Perdue multiple times in recent weeks on the importance of providing assistance to producers impacted by low commodity prices, like cattle producers."}, {"senator": "John Thune", "party": "Republican", "sentence": "Cattle producers in South Dakota and across the country have faced significant market volatility in the wake of the COVID-19 pandemic."}, {"senator": "John Thune", "party": "Republican", "sentence": "Cattle producers, in particular, have been facing an uphill battle lately."}, {"senator": "John Thune", "party": "Republican", "sentence": "Days after the bill passed, I led a bipartisan group of Senators and  Representatives in a letter to Secretary of Agriculture Sonny Perdue  urging him to use a portion of the funds to provide support for hard- hit cattle producers."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "They needyour assistance.First, cattle producers in my state have tried in earnest to navigate the pandemic and theconcurrent collapse in prices."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"We are advancing this bipartisan legislation to help ensure cattle producers receive the money they are owed."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "\"Minnesota cattle producers, farm organizations, and family-owned businesses have shared with me how important it is for farmers, and livestock dealers, to all get a fair and competitive price during livestock auctions."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "In order to establish a fair cattle market for cattle producers, real, vigorous price discovery is needed."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Cramer took action last week to protect cattle producers affected by COVID--19."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "\"Recent pricing discrepancies between fed cattle and boxed beef are pushing cattle producers and feeders to the brink\u0085  Cattlemen across America seriously question the ability for their children to take over what are frequently multi-generational family-owned operations that serve as the engines for their communities and our country's food supply,\" the letter reads."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Cotton merchandisers and distributors are also facing additional costsfor storage, interest, and other carrying costs as worldwide demand is significantly depressed.Cottonseed, a majority of which is used as a feed ration for dairy and beef cattle, is in a tenuoussituation as its main customers -- dairy and beef cattle producers-- are also facing severeeconomic losses because of the ongoing public health crisis."}]