[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…That is until he was terminated last week--without  cause.\n\nAmericans rely on the National Weather Service for everything from  knowing when to pack an umbrella to avoid being caught in a  thunderstorm to staying safe during tornado clusters. Eric explained  that meteorologists at the National Weather Service are already  understaffed and overworked. He…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…of a person is not where he or she  stands in moments of comfort and convenience but in moments of  challenge and controversy. We are tied in a single garment of destiny,  caught up in an inescapable network of mutuality, and whatever affects  one affects all indirectly. My mind had already been arrested. My moral  imagination had been arrested. And…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…democracy.\n\nMr. McGOVERN. Mr. Speaker, I would say to the gentleman from Texas I  appreciate him reading that list, but the reason we know about that is  because those people were caught. The list I read of Republican  officials who were caught engaging in voter fraud, the reason we know  about it because they were caught. The system is working. Stop trying…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Like so many Americans, I know all too well the terrible impact of  this disease. In 2021, I lost my dear mother, Nancy Gardner Sewell, to  pancreatic cancer.\n\nBy the time we caught it, the cancer had already spread. She passed  away just 8 weeks after her diagnosis. In an effort to turn my pain  into purpose, I have committed myself to doing everything…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…periodic reviews to  examine if more savings are possible for certain products.\n\nTogether, these changes to the program will ensure that new energy  efficiency standards get caught in a confusing and arbitrary process  that delays finalization of new efficiency standards and allows for the  roll back of existing standards. Basically, this bill guts the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…counterparts.  We must put aside the foolishness of ideological divides and advance  causes that make us all stronger as Americans.\n\nWe know that many of these diseases can be cured if caught in time.  According to the American Cancer Society, men have a 1 in 726 average  lifetime risk of breast cancer. We often think about mammograms and  breast cancer being something…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…press conference  after we passed the big, ugly bill, who worked as a contractor, got  injured, and could not work anymore but also was trying to get workers'  comp and was caught in that process.\n\nI was a State legislator when we expanded Medicaid in Virginia. Part  of why we did it was because we recognized that just because you don't  have health…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…weird       that it's almost unheard of at times,'' she said. ``Diagnosis       is not easy for a lot of kids. My time with diagnosis was       easy. My mom's a doctor, so we caught it super easy, which       was very lucky. Kids that don't have that same chance--I knew       a kid who didn't know, his parents had no idea it could be a       possibility…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…will progress to wheelchair dependence. Early  recognition and treatment can avoid a significant amount of disability.  Post-treatment life depends on whether the disease was caught early  enough to benefit from treatment options. The gradual onset of CIDP can  delay diagnosis by several months or even years, resulting in  significant nerve damage that…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…seeking those phone logs. This should be just common sense.\n\nBut, unfortunately, there are those who believe a select group of  Senators have the right to profit from being caught up in a legitimate  criminal investigation, and they are OK with American taxpayers footing  the bill.\n\nThey have claimed that this provision was never meant to enrich  Senators,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Providence, RI, here in the United States, experienced its own mass  shooting.\n\nIn the aftermath of these two tragedies, I am in awe of the bravery  and sacrifice displayed by those caught up in the attacks.\n\nOne of them, Ahmed al-Ahmed, tackled one of the shooters at Bondi  Beach in Australia, saving countless lives. He is now going through  surgery. I wish…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that the judge that issued that order should be impeached, you are  now moving into authoritarianism.\n\nWhen that President then sits with others in his Cabinet and they are  caught on national TV indicating why they can defy the Federal court's  orders, after having been told that they have to appeal, after having  been told that they cannot do what they…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…lives turned upside down.\n\nLet's not forget, U.S. citizens are even being detained by this  administration. We have several instances now where American citizens  have been caught up in Trump's immigration crackdown. American citizens  have been detained and wrongly locked up, even after someone showed  them their birth certificates--even for days.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…their  names, tell their stories, and stop state-sanctioned violence.\n\nLast week in Minneapolis, a 37-year-old American mother, Renee Good,  was killed by an ICE agent. It was caught on video for the world to  see. Almost immediately, the lies began.\n\nDHS Secretary Kristi Noem said that Renee Good posed an imminent  threat, even floating the words ``domestic…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…regardless as to what they do if it is a Federal offense.\n\nYes, there was a coverup.\n\nYes, that coverup is something that they understood they could get  away with even if they were caught red-handed. They knew they could get  away with it because they knew that the President was there to back  them.\n\nBy the way, the President is also there to do what he normally…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Utah apprehended and removed an illegal  immigrant from Guatemala who was facing charges of aggravated sexual  assault of a child under the age of 14, after previously being caught  and removed twice before.\n\nIn January, a 24-year-old Mexican national was charged with the  murder of his girlfriend in Utah just one week after being deported for  the second…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…World War II veteran and American hero, who  died a few years ago between Christmas and New Year's Day.\n\nAt that time, I heard from his son, Charles Peltz, who found himself  caught in a maze of bureaucratic VA red tape. Instead of being able to  focus on honoring the life and service of his father, the Peltz family  was forced to contend with a system…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…is looking at our phone  records. That would be terrible.\n\nThe private cause of action goes away. I am never going to agree to  drop that. Why? There are a bunch of people caught up in Jack Smith who  are not Senators, who may have a cause of action, and they deserve  their day in court. As to my cause of action under the statute, I am  going to pursue…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, last week, San Francisco  announced a new grading for equity initiative. As the chair of the  Subcommittee on Early Childhood, Elementary, and Secondary Education,  this caught my eye.\n\nWhat they are proposing is truly beyond belief. This grading for  equity initiative in San Francisco was in a sense a brilliant solution  to San Francisco's problem…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…for yielding.\n\nMr. Chair, I urge strong support for this amendment to increase  penalties  for unauthorized access to DOD facilities.\n\nIn 2023, five Chinese nationals were caught in my district at Camp  Grayling, Michigan, photographing military vehicles during allied  exercises and attempting to conceal the evidence that they did take  those photographs.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…over the Fourth of July holiday weekend. Petty  Officer Scott Ruskan and the Rescue 6553 aircrew were first on the  scene at Camp Mystic, the historic girls' camp that was caught in the  catastrophic flooding, and helped save 165 lives.\n\nThe men and women who serve in the Coast Guard carry out heroic acts  each and every day, and it is our responsibility…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…rent.\n\nOf course, if the driver at fault is an illegal alien, it is more  likely to be a hit-and-run because they don't want to be detained or  deported. And even if they are caught, they are not likely to have  insurance.\n\nAs a father of two daughters, I believe the danger illegal aliens  pose to the safety of Americans is simply unacceptable. It ought…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…nothing like that. It doesn't work.\n\nHere is the CBO report. In here, it makes it absolutely clear, and I  have been telling you for 1 year, but the scorekeepers have finally  caught up with my Joint Economic Committee economists. Remember, I  chair the Joint Economic Committee. I chair Oversight Subcommittee in  the Ways and Means Committee, so I am blessed.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…this sponsor was later known to have used multiple  aliases as far back as 2015. In addition, records show this sponsor has  past convictions for fraud, which should have been caught by  fingerprinting checks. This sponsor reportedly later kidnapped his wife  for 24 hours and threatened to kill her.\n\nThankfully, the Health and Human Services Department…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…lost two paychecks during  that time period. There are a lot of Americans who can't miss one and  make it; they missed two.\n\nThe TSA agent I walked past a couple of weeks ago caught me as I came  through and said: I feel like my paycheck is bipolar--I never know  whether it is going to be there or not.\n\nAll I could say to them was: I am so sorry. We are…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…got actually a pretty good interest rate back.\n\nHere is the baseline. Remember, Mr. Speaker, why is this not $22  trillion? It is because they were using a 2034 number. We caught them  playing a game there. Then they added another $6.9 trillion on top of  that, and what do you get, Mr. Speaker?\n\nHere is what you get: Functionally when we all got elected…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…that thinks they  are entitled to take anything they want from the American people and  force Americans to bow to their will.\n\nSomali immigrants in Minnesota were recently caught stealing more  than 1 billion and counting from American taxpayers--stealing. They  pretended to use the money to feed children or help people with autism,  but really they…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…massive festival celebrating delectable crustaceans.\n\nFrom the thrill of the pirate invasion--arrgh--to the crowning of  Miss Shrimp Festival to the irresistible aroma of wild-caught shrimp  sizzling across the waterfront, every corner of this festival reminds  us of why we come together to celebrate our heritage as the birthplace  of the modern shrimping…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690464/isle-of-eight-flags-shrimp-festival"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…we  move forward on our reconciliation package and deliver substantial wins  for the American people. Like I mentioned, they were overnight, so  anybody that might have got caught snoozing for a few seconds here or  there, we don't want to be too hard on them since it was an all- nighter, and we are not in college anymore.\n\nIt is significant what we…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…able to  identify someone who was literally cutting through that area and  smuggling right through that zone. The good news is things are  different now, and that person was caught because we have the manpower  in place to be able to catch them.\n\nAnd that person will be deported immediately. That is also a big  change that has actually occurred.\n\nSo things…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]