[{"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…Minneapolis, sparking widespread  protests and intensifying scrutiny of Federal tactics.\n\nLast year was the deadliest year in over 20 years, with over 56  people dying under ICE and CBP custody in detention centers. Reports of  detainees like Luis Beltran Yanez-Cruz, who died in a hospital in my  district after complaining for days of chest pain without receiving…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699658/horrific-ice-abuses"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…Department for the funds that they got under  reconciliation.\n\nIt also provides, as the gentleman said a few minutes ago, $20  million for body-worn cameras, specifically for CBP and ICE, which are  conducting immigration enforcement. It also provides funding to  increase training for CBP and ICE agents for deescalation tactics.\n\nLet me say this: We…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I rise in vehement opposition to giving one  more red cent to ICE and CBP until we see accountability and reforms in  this DHS funding bill. Under Secretary Noem's and President Trump's  action, ICE and CBP have turned from law enforcement agencies…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699357/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…against Canada is not the way to fight fentanyl and  other drugs. This kind of legislation, like the HALT Fentanyl Act, is  something that is going to have much more of an impact. CBP statistics  show that all of the fentanyl seized along the northern border from the  beginning of 2022 until now is 71 pounds. Now, that is a lot of  fentanyl, and that could…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…independent investigations into the killings of Renee Good and Alex  Pretti, and of other abuse and misconduct by DHS agents. We must  institute changes for the conduct of ICE and CBP agents, including  restrictions on their use of force, mandating the use of judicial  warrants for searches, and an end to the use of roving patrols and  racial profiling. We…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…overreach on immigration that is tearing  families apart in my district and around the country.\n\nSince taking office, Trump has declared war on our communities.  Masked ICE and CBP thugs--I call them thugs because they don't identify  themselves. In our State, police officers, law enforcement, always  identify themselves. They have detained parents on…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…suffered at  the hands of their own government--everyday Americans just like all of  us coming here to tell us how they were stopped, assaulted, detained,  and brutalized by ICE and CBP agents. It was one of the most moving  experiences of my time in the U.S. Senate, not only because of the  words and the facts that they conveyed but because of their raw  courage,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…long called for  it to be shut down.\n\nYet, we must look for ways to press our case even more forcefully.  Just yesterday, I voted against more blank-check funding for ICE and  CBP. No accountability and no reform equals no taxpayer money.\n\nI call on every Member of this body to hear the cries of communities  from coast to coast: Impeach Kristi Noem, end…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699661/horrific-ice-abuses"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…to public safety. DHS agents used  chemical weapons on protesters and bystanders at least 49 times across  18 incidents in Chicago and the suburbs since October 1. Bovino and CBP  agents are violating court injunctions and agency rules. They are lying  in court about incidents where civilians have been put in danger.\n\nThe government alleges that Marimar…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Clarke).\n\nMs. CLARKE of New York. Mr. Speaker, I thank the gentleman from New  York, Mr. Adriano Espaillat, for yielding.\n\nMr. Speaker, I rise on this day in opposition to ICE, CBP, and any  others that are added to this Federal militia that is supposed to be  part of the administration of immigration in the United States of  America. I also rise in remembrance…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…the other  Americans in this Nation.\n\nThere are things that this administration can do today to restore  that sense of safety and security. For instance, they can pull ICE and  CBP agents out of their operations in Minnesota and in Maine and  deescalate the fear that American communities are facing. The  provocations are dangerous right now and the concern…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…used to justify the tariffs. He  says this is a way to stop the flow of fentanyl into our country, but  he has forgotten a few inconvenient facts.\n\nFirst, it is that, in 2024, CBP, or Customs and Border Protection,  seized about 43 pounds of fentanyl along our northern border--about 1  percent of the fentanyl coming into this country. Now, it has long…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…return  home.\n\nWilmer Chavarria is a community leader. He is a school superintendent  in my State. He was held and interrogated for hours yesterday in the  Houston airport by CBP agents and given no reason for his detainment.  Wilmer called this experience psychological terror.\n\nAgain, we are talking about a U.S. citizen here. When we say this can  happen…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694000/cbp-turns-houston-airport-into-trap"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…the  largest new border bridges in the world, the Gordie Howe Bridge to  Canada. We need her. We needed her to staff that new bridge, to pay  attention when we had issues with CBP or Border Patrol, when we needed  more resources. She sat in my office. I invited her in. And she told me  how she was a former Governor. She had received Federal support through…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today to condemn the Trump  administration's deployment of CBP to North Carolina.\n\nSince last weekend, North Carolinians watched in horror as masked  agents descended on our State, terrorizing communities, and abducting  people off the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697072/condemning-deployment-of-cbp-to-north-carolina"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…increased the number of interdiction  of drugs that are moving through that area. That literally benefits the  entire country.\n\nWhat I found when I visited with the folks from CBP was that morale  was up and the chaos is down. I found folks who are there that are law  enforcement professionals actually doing law enforcement. When I  visited with some…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Customs and Border Protection saw the lowest number of encounters ever  on our borders nationwide. Apprehensions along the border reached a new  historic low on June 28, when CBP had the lowest number of  apprehensions in a single day in agency history.\n\nUnder the previous administration, 27,766 illegal migrants were  paroled and released into the country…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Providing Emotional       Assistance with Relief and Love Act'' or the ``PEARL Act''.       SEC. 2. CBP SUPPORT DOG PILOT PROGRAM.\n\n(a) In General.--Not later than 60 days after the date of       the enactment of this Act, the Secretary of Homeland       Security, acting through…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…1990, officials have discovered more than 140 tunnels that have  breached the U.S. border, with an 80 percent increase in tunnel  activity occurring since 2008.\n\nOver the years, CBP has worked to combat these tunnels as part of  their overall strategy. In fact, the United States conducts research,  development, and test activities with Israel, which must…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…trafficking, narcotics trafficking, and to stop other  dangerous and illicit contraband before it reaches our shore.\n\nThe impact of the incredible work of the men and women of CBP's Air  and Marine Operations is undeniable.\n\nIn fiscal year 2025 alone, AMO enforcement actions resulted in the  seizure of more than 500,000 pounds of illegal narcotics. I…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}]