[{"senator": "Richard Neal", "party": "Democrat", "sentence": "…guidance of seasoned  professionals. Many of these students have gone on to successful  careers in media, working at major outlets including the NFL Network,  NBC Boston, WBZ-TV, CBS News Texas, the Dan Patrick Show, and WGGB-TV.\n\nAt the heart of ASMW's longevity is a core group of dedicated  professionals who have shepherded the program for nearly two decades.…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…lifetime, but  indeed she did. Defying age, at 94 years old, Mrs. Pough wrote and  recorded her debut song entitled ``Jesus Reigns Forever,'' earning  national spotlight on NBC, CBS and Fox News in 2020.\n\nTill this day, Mrs. Pough remains a vibrant and active member of her  community, enjoying gardening, bowling, reading her bible and  worshipping at the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…administration is conducting the sweeps on the  streets and that they are doing it to prioritize public safety and  national security. Yet, the facts tell a different story.\n\nAccording to CBS, only 8 percent of those detained have been  convicted of violent crimes. The conservative Cato Institute found that  only 7 percent of detainees were violent criminals.\n\nIn…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Suppression of free speech,  something not just in any amendment but in our First Amendment. When an  administration uses its power to force ABC to pay him personally or to  force CBS to pay him personally for the right to continue its broadcast  license or for the opportunity of its parent to have a merger, these  are overt efforts to censor the press.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…ruled unlawful in  Federal court.\n\nThe American people now see that the Trump administration has  continually lied about what they are going to do on immigration.  According to a CBS poll, a majority of Americans believe that the Trump  administration is not prioritizing the removal of dangerous criminals  and public safety threats, and nearly 60 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…children in  immigration proceedings.\n\nNo. 68, cut funding to fight the opioid epidemic in our country. It  is still an epidemic.\n\nNo. 69, threatened to block a media merger if CBS didn't change its  reporting.\n\nNo. 70, gave DOGE access to sensitive Small Business Administration  data.\n\nNo. 71, Signalgate.\n\nNo. 72, abducted Rumeysa Ozturk off the streets…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…be punished and using the power of the government to  suppress free speech.\n\nThe President then followed up and said that NBC should get rid of  two of its late-night shows. CBS has canceled their late-night show.\n\nI don't know what Johnny Carson or Jack Paar would think about all of  this. I am sure Alec Baldwin wouldn't like it, and President Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, today, a CBS News poll came out. It showed  65 percent of Americans think that the President's policies are making  us pay more for goods, such as groceries.\n\nI have learned in my career…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695047/buckling-under-the-weight-of-rising-costs"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Paramount settles a lawsuit with President Trump over a  dispute that could have been easily dismissed, which is defended as  freedom of the press, or not.\n\nMeanwhile, Paramount CBS is seeking a multimillion-dollar merger with  Skydance Media that requires the approval of the very same Trump  administration. Coincidence? Surely not.\n\nMeanwhile, the Trump…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694145/meanwhile"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…You see how the  strategies were being explored that have been so fiercely pursued this  year. You see that here he was threatening a merger, which is something  he did with CBS. You see that here he was threatening libel law  changes. And while he didn't do that, apparently, what he did in the  most recent year was to do a lawsuit, a $10 billion lawsuit…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Faiza: AL JAZEERA ENGLISH; Ahrimou, Sr.,       Mohamed: ALARABY TV; Aiello, Nicholas: NBC NEWS; Ainsley,       Julia: NBC NEWS; Akan, Emel: The Epoch Times; Ake, Gabrielle:       CBS NEWS; Akhtar, Monica: POLITICO.COM; Aksoy, Ibrahim: CBS       NEWS; Alabed, Omar: NBC NEWS; Alabsy, Ehab: AL JAZEERA       INTERNATIONAL; AL AKEIDY, Qays: DESERT MAN       TELECOMMUNICATIONS;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…administration recently warned, ``mass migration poses  an existential threat to Western civilization.''\n\nSo what do the Democrats think? Well, on Sunday, on ``Face the  Nation,'' CBS asked the junior Senator from Virginia if the vetting  process should be strengthened after the shooting. Now, that is exactly  what President Trump is doing. The Senator refused…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}]