[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…starvation in Gaza must end. The  forced displacement of 2 million Palestinians in Gaza must end. We all  condemn Hamas. We support a Jewish independent democratic state. We  want a cease-fire, and we want the hostages home. But a colleague in  the other body stated what needs to be said. It is the most truthful  and easiest thing to say that October 7 in Israel…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…and extortion.\n\nHe has restricted the access of the Associated Press after they  refused to use the name ``Gulf of America'' in their reporting and has  defied court orders to cease this unconstitutional action.\n\nHe has also threatened current and former Members of Congress for the  exercise of their legislative and oversight functions, an attack on the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…rained down on civilians. Children  have been murdered by sniper fire and starvation. Every one of those  more than 20,000 children murdered was someone's whole world.\n\nSince the cease-fire was declared, the media and the world have  shifted their gaze, but families in Gaza still live under constant  threat: of violence, of the elements, of starvation.\n\nEarlier…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…announcement also slashes how much funding may be used  for permanent housing.\n\nSuch drastic changes could result in a significant reduction in  services, forcing local partners to cease operations and reexpose  hundreds of my constituents to homelessness.\n\nAs this majority continues to pursue drastic cuts to affordable food  and healthcare, it is critical…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…negotiations  between Ukraine and Russia, we must all keep in mind exactly who we are  dealing with. Putin has refused to negotiate in good faith, reportedly  violating the very same cease-fire he unilaterally declared last week.  So far, he has refused to even direct negotiations with President  Zelenskyy in Turkiye.\n\nThis is the same man who has welcomed China's,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…exist alone on the globe when  he wrote the words: ``Our laws, language, religion, politics, and  manners are so deeply laid in [European] foundations, that we shall  never cease to consider their history as a part of ours.''\n\nMore recently, on January 20, 1961, President John F. Kennedy, in his  inaugural address, recognized America's fierce dedication…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…is  not to force any and all fabrication, repair and operation exclusively  into our country since that just compounds a problem we can't  effectively fix. It is instead to cease rewarding our adversaries and  start incentivizing our international friends and allies to assist us  with our domestic merchant marine and related defense sealift needs.…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…people were distracted around the world and later turned  that into a full-scale invasion in 2022. To his surprise, Ukraine has  held them off.\n\nRecently, Putin even violated the cease-fire on targeting energy and  civilian infrastructure just negotiated by the Trump administration a  few weeks ago. Putin cannot keep a deal.\n\nThis should make it crystal clear…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…denying injured Palestinian children passage to the United States for  care.\n\nThis massive suffering is man made, thus it must be stopped by man.\n\nMr. Speaker, Mr. Netanyahu must cease-fire now, bring all hostages  home now living and dead, and surge humanitarian aid now. ``We must  repair the world''; ``Tikkun Olam.''", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694981/gaza-is-starving"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…concentration of child amputees. More than 80 percent of  buildings in Gaza have been damaged or destroyed in the violence.\n\nThe world breathed a sigh of relief that a tenuous cease-fire was  finally reached and that all the living hostages were returned home.  Alas, the cease-fire continues to be breached. Violence and suffering  continue to afflict the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…sanctioned the leader of the Rapid Support Forces and the  leader of the Sudanese Armed Forces for their armies' lethal attack on  civilians in Sudan. But more needs to be done.\n\nCease-fire after cease-fire has failed. Peace negotiations have  stalled, and outside countries--the UAE, Turkey, Iran, as well as  Russia and China--continue to send weapons to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…5107), and The D.C. Cash Bail Reform       Act (H.R. 5214). These bills will make the District of       Columbia (D.C. or the District) less safe and just.       Congresses must cease these repeated attempts--against the       will of D.C. residents and locally elected leadership--to       override D.C. laws that were enacted by and for the District.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…enough into the estuary that the whole system that tens of millions of  Californians depend on and that all the farmers in my friend's district  depend on doesn't salt up and cease to function.\n\nThe Speaker doesn't have to believe me about it or choose between two  parallel universes. Ask any California water manager how this works.  This is basic stuff,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…contracting policies violate  administration policies on diversity, equity, and inclusion.\n\nLast week, the Gateway Development Commission announced that  construction will have to cease if President Trump does not swiftly  restore the project's funding. If construction is delayed, thousands of  union construction workers will lose their jobs, and timely completion…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699542/unfreeze-funds-for-gateway-tunnel"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…sides of the border can sleep peacefully without the constant fear  of rockets and bombs falling from the sky. It will resume when there is  a lasting, durable, and negotiated cease-fire.\n\nMr. Speaker, that day need not be far away. Israel achieved its goal  of destroying the military capabilities and existential threat of Hamas  months ago. Now, Prime…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…casualties appears  without limit.\n\nIn fact, Putin has done nothing to justify the hope that he might be  persuaded to end this war. To the contrary, despite Putin's declared  cease-fire over the Easter holiday, Russia then proceeded to launch  attacks into Ukraine that killed innocent civilians. More recently,  Russia launched two ballistic missiles and…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…exercise. Worse, it could be  construed to constrain his inherent powers in the event of an attack by  Venezuela that requires an immediate response.\n\nH. Con. Res. 61 orders him to cease attacks on terrorist groups,  presumably the drug runners, but these are unflagged vessels carrying  contraband in international waters. An attack on them is not an  attack…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…(A) Deputy Ralph ``Butch'' Waller (Badge #8434);\n\n(B) Deputy Ignacio ``Dan'' Diaz (Badge #7637); and\n\n(C) Deputy Luis Paez (Badge #3882).\n\n(7) Sunset.--The Commission shall cease to exist on the       date on which the President determines that the Commission       has completed each responsibility under paragraph (5).\n\n(d) Description.--The medal of…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…regional situation remains precarious, and American servicemembers  remain in danger. Many advocates for war, giving voice to their real  feelings, have loudly opposed the current cease-fire. Those arguing  against a cease-fire give a callous testimony, insensitive to the  cruelties of war.\n\nSome 40,000 U.S. troops are scattered throughout the Middle East…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…shown significant and       sustained progress towards reinvigorating its democracy and       advancing its Euro-Atlantic integration.       SEC. 8. SUNSET.\n\nThis Act shall cease to have any force or effect beginning       on the date that is 5 years after the date of the enactment       of this Act.\n\nMr. MAST. Madam Speaker, I yield myself such time…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…team in  place.\n\nSo I guess Democrats have some decisions to make. I hope--I really  hope--that they will come back to the table on the GENIUS Act, and I  hope that they will cease their pointless obstruction of bipartisan  nominees, but I guess we will have to see.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…officials and their high-level       staff, political party leaders, and political committee       leaders.       SEC. 5. SUNSET.\n\nThe authorities provided by this Act shall cease to have       effect on the date that is 5 years after the date of the       enactment of this Act.\n\nI support H.R. 2643, the Haiti Criminal Collusion Transparency Act,  introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, my bill, the Capping Excessive Awarding  of SBLC Entrants Act, or the CEASE Act, restores a vital piece of  integrity to the flagship SBA 7(a) loan program.\n\nThe Small Business Administration is authorized to issue government- backed 7(a) loans through…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692066/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…deadliest assault on  Israel and the Jewish community since the Holocaust.\n\nI commend President Trump and Israeli Prime Minister Netanyahu for  their efforts to secure the recent cease-fire agreement. Because of  their collaboration, we are seeing some of the 240 hostages being  released, including Americans.\n\nI urge my colleagues to keep the events of that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688087/500-days-since-october-7-attack"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Senate commend him for those efforts.\n\nNow the ball is in Putin's court. It is time for him to come to the  table in good faith and make a serious proposal for an immediate cease- fire that can lead to a just and lasting peace in Ukraine. I hope he  realizes it is time to do so. If not, the Senate stands ready to act.  Thanks to the dogged work of Senator…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691644/ukraine"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…series of reporting requirements  when military force is used, crescendoing with an approval process by  the Congress, and if that approval is not given, the operations must  cease.\n\nIn my view, it is patently unconstitutional. You are creating,  through the War Powers Act, 535 Commanders in Chief. The Members of  Congress sit in judgment over the Commander…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…this very, very important matter.\n\nMr. Speaker, we must maintain a standard in the House of  Representatives, and any Member's refusal to adhere to the Speaker's  direction to cease such behavior, regardless of their political party  and regardless of who is at the lectern giving a speech, has to and  must continue to be reprimanded. We cannot afford to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Risch", "party": "Republican", "sentence": "…says. They argue we still have ships in  the Caribbean. Clearly, the President is ready to invade again, they  say. But, again, that is not what the resolution says. It says cease  the hostilities that are going on. No language in this resolution  addresses future action, and, indeed, the War Powers Act doesn't allow  that unless there are ongoing hostilities.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…world to see this  terrorist group destroyed.\n\nI couldn't agree more with my colleagues who want an end to this war.  We all want to see an end to this war and an immediate cease-fire and  for the hunger crisis in Gaza to end. The solution to all of this isn't  to deprive Israel of the weapons it needs; the solution is in the hands  of Hamas. This could…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694433/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…East,'' the statement read.\n\nThe State Department noted that the Lebanese Armed Forces       (LAF) were deployed to southern Lebanon to help implement the       November 2024 cease-fire, which followed 13 months of       conflict between Hezbollah and Israel.\n\n``Sustainment of the A-29 fleet will support the LAF's role       in maintaining the cessation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}]