[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…rise today to recognize and  congratulate the Fauquier High School class of 2025.\n\nLast month, the 301 graduates and their families gathered at the  packed Jiffy Lube Live to celebrate this milestone.\n\nThis senior class has a lot to be proud of, including beating their  teachers in the students versus faculty basketball game.\n\nThe graduates excelled not…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…deal with  affordability. It is difficult to deal with the housing crisis. It is  difficult to deal with what is happening not only in the stock market,  which he seems to celebrate and appreciate, but also what is happening  in the supermarket.\n\nMost of my constituents are more concerned about the prices in the  supermarket than the prices in the stock…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. Speaker, I rise today on behalf of New Mexico's Second  Congressional District to celebrate a long-awaited victory for rural  America, the imminent passage of the bipartisan Secure Rural Schools  Reauthorization Act.\n\nI preface my remarks by thanking Representatives…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…rise today to recognize and honor Al  Hutchins of Blakely, Georgia, who is retiring after more than 20 years  of dedicated service on the Blakely City Council. An event to celebrate  his extraordinary career in public service will be held on Tuesday,  December 16, 2025, at the Al Hutchins Community Center in Blakely,  Georgia.\n\nCouncilman Hutchins has…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise today to honor Anita Altman, a  distinguished New Yorker and cherished member of our community, who  will celebrate her 80th birthday on June 2, 2025.\n\nAnita has devoted her life to building a more inclusive,  compassionate, and just society. A proud daughter of the Bronx, Anita  was raised…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…were created, the  vast majority of which were created by women, including women of color.  These acts of hope for the future make our economy stronger and give us  reason to celebrate.\n\nUnfortunately, the past few months have caused extreme uncertainty in  the small business community. With so many new businesses starting,  there is much more we could…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691730/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, as we celebrate Mother's Day this  weekend, I am reminded of a visit that Donald Trump had with Howard  Stern. They were talking about marriage and having children, and Howard  Stern said…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690873/being-a-mom-in-trumps-america"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, last week I visited Perkins High School in  Sandusky, Ohio. My role: to celebrate excellence in STEM education.\n\nThis year, Kia Preston won the Ninth Congressional District App  Challenge for a project titled ``Light Teachings.''\n\nKia's interactive app…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699254/perkins-high-school-stem-achievement"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…Cookoff that my  office hosted at the California State Fair. I was proud to visit the  station to present ribbons to Captain Adam Huckaby and Firefighter  Taylor Edwards.\n\nAs we celebrate this milestone, we also have a responsibility to  support the men and women who support all of us, especially when it  comes to their mental health. That is why I am continuing…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700044/recognizing-sacramento-metropolitan-fire-district"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…figures. Mr. Franklin's signature  is the only one that appears on all three documents, however. That is  not only something worthy of note, but something, of course, to  celebrate.\n\nThis is why I was shocked when I learned on my very first official  tour of the Capitol Building--which was given to me by my own team  member, Emma Consoli, who is the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…attended. They are the  schools that your children attend. Their Federal funding will be cut if  they teach history, if they teach language, if they teach culture, and  if they celebrate the multiple cultures and diversity of this country.\n\nThe administration is trying to dismantle Tribal schools, which were  created because of our trust and treaty responsibilities,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…impacted by our nation's  opioid epidemic. Thankfully, there is hope. Overdose deaths dropped by  24 percent from September 2023 to September 2024, and while that's  something to celebrate, we have a long way to go.\n\nThe 33 regional HIDTAs across the country are comprised of federal,  state, and local partners, resulting in robust interagency coordination…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…regular Sunday classes.\n\nThe temple also puts out programs for seniors and does incredible  philanthropic work to provide food and resources to our community.\n\nI am honored to celebrate this milestone with the temple this  weekend. I congratulate the Rajdhani Mandir temple on a successful 25  years, and I am looking forward to the next 25 years of work.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…over the finish line.                            Betraying Our Veterans\n\nMs. McBRIDE. Mr. Speaker, earlier this month, I joined veterans,  families, and care providers to celebrate 75 years of service at the  Wilmington VA Medical Center, a facility that provided 338,000  appointments last year alone. That is visits to a primary care doctor,  a dentist,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…support groups, or charitable initiatives,  the church continues to be a source of hope and healing for the broader  community.\n\nIn marking 160 years of ministry and service, we celebrate not just a  building or a date, but a living legacy of faith in action. The First  Congregational Church of Stockton remains a guiding light, grounded in  its values and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Mr. PFLUGER. Mr. Speaker, I rise today to recognize and celebrate the  150th anniversary of St. Mary's Episcopal Church in Lampasas, Texas.\n\nFounded in 1873 during the turbulent years of Reconstruction, St.  Mary's has stood as a steadfast…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…small business owners, and yes,  even Members of Congress.\n\nWe are also hosting Eagles on the Hill, a reception that will bring  together Eagle Scouts and Scouting alumni to celebrate our shared  background in Scouting. Eagles on the Hill serves as a reminder that  even when Eagle Scouts in Washington disagree on the issues before us,  we are united in…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…on talent but also on the dedication  of their coaches, the support of their families, and the spirit of  their communities. I am proud of these young men and honored to  celebrate the Grand Mesa Senior All Stars for the way they represented  the Western Slope and the State of Colorado.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695294/recognizing-colorado-state-champions-the-grand-mesa-little-league-senior-all-stars"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…despite spending $17 million over 17  years. There has been no track laid.\n\nNevertheless, the Governor recently, with quite a bit of hoopla, held  an event in Kern County to celebrate the fact that a single railhead  has now been completed. The Governor that crowed they are now entering  the track-laying phase, whatever that might mean.\n\nMr. Speaker, it…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…number one issue in our  Federal Government. We need to stay focused and complete the task at  hand.\n\nAgain, we should be focused on the issue at hand. Mr. Speaker, we  never celebrate the loss of life on our side. We don't celebrate the  loss of life in the recent shooting, but we cannot absolve people of  the actions they are taking to disrupt ICE's operations.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to recognize and celebrate the  25th anniversary of the extraordinary impact that Parents Challenge has  made in Colorado Springs, Colorado.\n\nParents Challenge empowers low-income families to access…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694905/recognizing-parents-challenge"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…funds for the  memorial.\n\nIndeed, that movie ended up being good for FedEx and, in turn, good  for the World War II Memorial and our Nation.\n\nWith his passing, we honor and celebrate a lifetime of inspiring  service and leadership. We celebrate a marine, a Memphian, and a really  good man.\n\nRoberta and I mourn with Diane and the entire Smith family. Our…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize the life and service of Mr. Henry ``Floyd'' Wells who will  celebrate his 105th birthday this month--a milestone few ever reach. I  join his family, friends, and this grateful nation in celebrating not  only the years he has lived, but the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize and celebrate  a proud rural fire department in my district, the Kennedy Fire  Department, which is proudly marking its 100th year of service to its  community and surrounding areas.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…justify the means, bigger even than the  depredations and evils that multiple socialist autocrats have  perpetrated upon the once great country of Venezuela.\n\nEven those who celebrate the demise of the socialist, authoritarian  regime in Venezuela, as I do, should give pause to granting the power  to initiate war to one man. The power to initiate war is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…L. DeWitt's service to the Fort Worth Fire  Department and his impact on keeping our community safe for the past 37  years. I wish him and his family the very best as they celebrate his  retirement.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…just was walking through the Capitol rotunda, and I saw a few  police officers here taking a tour of this special place. It is such a  great opportunity for us to be able to celebrate the work that they do.  They put their lives on the line to keep our communities safe. They  support local programs, mentor our youth, and respond to crisis.\n\nThey are our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Alex Caruso, Chet, Jalen, and the entire Thunder team. They truly have  inspired us all, and we are all proud of them.\n\nAlthough I can't be there tomorrow, it is time to celebrate. Mr.  Speaker, Thunder Up.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692772/congratulating-the-oklahoma-city-thunder"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…in charitable outreach,  sponsoring events such as spring pancake breakfasts and baseball  outings that bring people together in fellowship and service.\n\nIt is my honor to celebrate 75 years of faith, generosity, and  service at Assumption BVM. Bucks County is a stronger, more  compassionate place because of the enduring presence of this  extraordinary…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an  outstanding constituent from my district, Mrs. Susan Harkins. It is my  distinct honor to celebrate her remarkable 45 years of service with the  Lower Bucks County Chamber of Commerce.\n\nSince joining the Chamber in 1980, Susan has been instrumental in  supporting business…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}]