[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…research led to the creation of the Immune Epitope  Database, which is a vital source of experimental data on antibody and  T cell responses. Dr. Sette's research revealed how T cells can fight  pathogens like tuberculosis, dengue, SARS-CoV-2, pertussis, and the  virus that causes Mpox.\n\nDr. Sette and the La Jolla Institute team were the first in the world…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690713/recognizing-scripps-vice-chancellor-margaret-leinen"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to dominance.\n\nTo preserve our lead, we must take swift action to commercialize and  scale biomanufacturing here at home. These new technologies use the  power of biological cells and systems to perform complete chemistry-- complex issues.\n\nThey will enable us to onshore the production of critical chemicals,  including those used in munitions and high-performance…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…organization       that supports those with Type 1 diabetes. Type 1 diabetes is       a chronic autoimmune disease in which the body's immune       system attacks the insulin-producing cells in the pancreas,       so people with the disease must take insulin by injection or       insulin pump to survive Abby, 15, will be a sophomore at       Summit High in the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…their families separated, who have had their humanity erased and their  dignity denied, the men, women, and children who have been ripped from  our communities, thrown into cold cells, and shipped off to countries  many have never known.\n\nThe Trump administration would have you believe that they are  pursuing hardened criminals. Yet, according to ICE's own…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…manufacture batteries       using CATL technology.\n\nChinese battery makers are leading producers of lithium-      iron-phosphate, or LFP batteries. These iron-based battery       cells cost less than the nickel-and-cobalt combination used       widely in North America and Europe.\n\nCATL's newest fast-charging battery, the second generation       of its Shenxing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…recognize the  month of April as Sarcoidosis Awareness Month.\n\nSarcoidosis is a rare inflammatory disease characterized by the  formation of granulomas--tiny clumps of inflammatory cells--in one or  more organs of the body. When the immune system goes into overdrive and  too many of these clumps form, they can interfere with an organ's  structure and function.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…pretty simple philosophy that says the work  done at our universities should make an impact far beyond the classroom  itself, and it does. From vitamin D, to human embryonic stem cells, to  blood thinners and new treatments for Alzheimer's disease, Wisconsin  universities and dedicated scientists like my grandfather have  discovered breakthroughs that revolutionize…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…into the body through  inhalation and skin contact. It moves quickly across the placenta and  into a human fetus and can also cross the blood-brain barrier and  remain in blood cells for decades.\n\nThis is why it is linked to developmental deficits in children. It  can impact the heart, lungs, central nervous system, reproduction,  kidneys, and GI tract.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…present unique       safety risks and create major hazards like flames, exploding       projectiles, and thermal runaway. This causes an explosive,       domino effect within the cells of a battery making it       especially challenging for first responders to mitigate using       traditional fire suppression methods. In addition to the       explosion and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…beating us. It is time to invest. We need more energy. Without that  energy, we are going to continue to fall behind.\n\nWhat jobs were lost in that project for hydrogen fuel cells not even  in my district? In Massena, New York, jobs like the International Union  of Painters and Allied Trades, IUPAT, and others do not have those jobs  that were promised.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…consequence in the form of lost lives. It has a  consequence in the form of hospitals that are overflowing with  individuals, particularly in Texas, but around the country, jail cells  that are overflowing, and schools that are overflowing. All of that is  a consequence in terms of costs and continued problems.\n\nJust last week, two illegal aliens suspected…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…behind this mic over and over and  said we are on the cusp of miracles. A couple of weeks ago, I went to  New Hampshire to a lab where they were growing undifferentiated islet  cells. Apparently, islet cells don't need antirejection drugs to get  bodies to be able to start making their own insulin again. There are  crazy ideas.\n\nMr. Speaker, can we do a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…against President  Trump. Other top officials in the United States have also been targets  of Iranian terrorists.\n\nRecently, Iran threatened to activate its so-called sleeper cells  right here inside the United States. Let that sink in. This is an  urgent reminder that national security starts with border security.\n\nUnder Joe Biden and the Democrats,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Statistics show that every two seconds, someone in this country needs  blood.\n\nOn average, one in seven hospital patients need blood, and  approximately 29,000 units of red blood cells are needed every day in  the United States.\n\nOver the last 50 years, public awareness for blood donation has  increased. Now approximately 13.6 million volunteers donate blood…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698826/national-blood-donor-month"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…child's life begins at  conception, that that is the moment the DNA is different than the mom's  DNA. Every single cell in the mom's body has the same DNA except for  those cells. Those cells are different. They have a unique DNA in the  world because that is a different person that is there. The cells are  dividing and growing. There is no difference…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Act:\n\n(1) Human cell and tissue product.--The terms ``human cell       and tissue product'' and ``human cell and tissue products''       have the meaning given the term ``human cells, tissues, or       cellular or tissue-based products'' in section 1271.3(d) of       title 21, Code of Federal Regulations (or successor       regulations).\n\n(2) Secretary.--The…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…for our economy, infrastructure,  and national defense. It enables modern life, from powering GPS  communications to weather forecasting, artificial limb technology,  solar cells, fire-resistant fabrics, and even medical imaging and  biotechnology.\n\nSpace is research and development, and space is a return on  investment. The latest estimates have a…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}]