[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…ensuring we are accurately  capturing the history and dignity of those who served overseas in some  of our most trying conflicts.\n\nFar too often, we think of Arlington National Cemetery or maybe your  local veterans cemetery and don't even realize that we have  servicemembers buried overseas in plots around the world.\n\nThe work of the American Battle Monuments…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to introduce legislation to build  a new national cemetery in Hawaii. I am joined by my Hawaii colleagues,  Congresswoman Jill Tokuda, and Senator Mazie Hirono, who is introducing  the companion bill in the Senate.\n\nOur Nation has…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…and  Jackie Robinson.\n\nJust last month, we learned that memorials honoring the contributions  of Black American soldiers during World War II were stripped from a  military cemetery in the Netherlands.\n\nThis is not a coincidence. This is an all-out attack on our past, our  present, and our future.\n\nMr. Speaker, let me be clear. Black Americans will not…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…running out of space. Without this bill, local  families face serious barriers in accessing burial services close to  home.\n\nThis bill would ensure the land remains dedicated to cemetery use. It  also protects Federal interests through a reversion clause and places  the costs of surveys and environmental review on the counties.\n\nThis is a respectful, efficient…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691142/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…for predators.\n\nI offered an amendment to disinter Dr. Robert McCormick Browne, a man  accused of sexually abusing dozens of students in Hawaii, from the  National Memorial Cemetery of the Pacific. A predator like that does  not deserve to rest amongst heroes. The Republicans said no. By  refusing to act, they are, once again, protecting a pedophile,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…January 11, 1968, killing him and his crew.\n\nHis remains were not identified until 2002 after being recovered the  year before. He was finally laid to rest in Arlington National Cemetery  in 2003 and received the Purple Heart and Navy Commendation Medal with  Valor.\n\nThe Senate unanimously passed a similar version of this bill during  the last Congress. I…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697597/commander-delbert-austin-olson-post-office"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, the chairman and I share a bipartisan  commitment to putting our veterans first, including providing them with  the kind of memorial and cemetery recognition that they have well  earned. There is no difference between us on that point.\n\nAnd I think we also share a belief that Members of the U.S. Senate  have a duty--it…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…necessary funding for the American Battle  Monuments Commission, the U.S. Court of Veterans Appeals, and the Armed  Forces Retirement Homes, as well as Arlington National Cemetery.\n\nAs ranking member of the subcommittee, I was pleased to work closely  with Chairman Boozman to build a strong bipartisan bill that reflects  input from colleagues on both…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Europe. But what stuck with me  was what I heard from the veterans.\n\nOne of them said to me, ``This was our moment.''\n\n``This was our moment.''\n\nWe walked through the American cemetery, those silent rows of white  grave markers, down to the beach, Omaha Beach, where I thought of those  18- and 20-year-old boys jumping out of landing craft with 80 pounds…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…They were  all called commanders.\n\nSo why was he called woke and fired?\n\nWell, Mr. Speaker, I think you know why.\n\nIn March 2025, part of Project 2025, Arlington National Cemetery  erased from its website educational materials about the history of  Black servicemembers, including the Tuskegee Airmen and General Colin  Powell, the first Black Joint Chiefs…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the front line. With total  disregard for his own well-being, he fought German soldiers day and  night.\n\nHe was killed in action. He lies in rest at Zachary Taylor National  Cemetery in Louisville, and a bronze statue of Squires sits atop the  Kentucky Medal of Honor Memorial.\n\nSquires is one of just 3,538 Medal of Honor recipients in our  history. From…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…Senate (S. 1071) entitled       ``An Act to require the Secretary of Veterans Affairs to       disinter the remains of Fernando V. Cota from Fort Sam       Houston National Cemetery, Texas, and for other purposes,''       do pass with an amendment.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697948/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…crashed,  killing Commander Olson.\n\nCommander Olson's remains were not recovered until 2001, and he has  been memorialized on the Courts of the Missing at the National Memorial  Cemetery of the Pacific.\n\nCommander Olson was married to his wife, Patricia, and had two  children, Dana and Eric.\n\nMr. Speaker, I encourage my colleagues to support this bill, and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697598/commander-delbert-austin-olson-post-office"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…bill includes robust funding for related  Agencies, which include the American Battle Monuments Commission, the  U.S. Court of Appeals for Veterans Claims, Arlington National Cemetery,  and the Armed Forces Retirement Home.\n\nFunding at these priorities at these levels represents solid  bipartisan work to provide the resources necessary for our veterans,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Today, the town attracts outdoor  enthusiasts from throughout Maine and beyond to Rocky Mountain Terrain  Park and nearby Mt. Blue State Park.\n\nCarthage is also home to Newman Cemetery, a reminder of the  townspeople's service to the State and country. In this historic  cemetery, lie the remains of founding families, as well as veterans of  the Revolutionary…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Young Fire Equipment Corporation in 1944, and by  the time Dick completed his military service, he was destined to lead  the company. As President, he relocated it to 204 Cemetery Road in  Lancaster, where his Navy-honed skills and forward-thinking mindset  revolutionized the fire apparatus industry. He designed firetrucks that  were decades ahead of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…whose position is at the Central Office of the       Department, including the Veterans Health Administration, the       Veterans Benefits Administration, and the National Cemetery       Administration, regardless of the actual location where the       employee performs the functions of the position.\n\n``(B)(i) A critical skill incentive provided under…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…prior, all at First Lutheran       Church, Fargo. Lunch will be served in the dining hall       following the service. Burial will be at Ellsborough Lutheran       Church Cemetery near Lake Wilson, Minnesota.\n\nTo send flowers to the family in memory of James Bjorge,       please visit our flower store.\n\nMr. CRAMER. Mr. President, Pastor James Bjorge…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…prosthetic  research, and from reducing the backlog at the Board of Veterans'  Appeals to providing burial services and benefits for veterans in rural  areas lacking a VA national cemetery, my amendments will directly  improve the quality of life for veterans throughout Colorado and  America.\n\nThis bill makes good on President Trump's promises that he made to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692951/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(a) Definitions.--In this section:\n\n(1) County.--The term ``County'' means Navajo County,       Arizona.\n\n(2) Map.--The term ``map'' means the map entitled       ``Pinedale Cemetery Expansion'' and dated May 23, 2022.\n\n(3) Secretary.--The term ``Secretary'' means the Secretary       of Agriculture, acting through the Chief of the Forest       Service.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…of crops and livestock, and  pristine lakes, ponds, and streams supported abundant wildlife. When  the general died in 1805, he was laid to rest with honors in the  village cemetery.\n\nOriginally called Orangetown, after the river that powered the  sawmills, the town was renamed Whiting upon its incorporation in 1825  after Timothy Whiting, an early settler…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…the  purview of the U.S. Forest Service to Navajo and Apache Counties.\n\nFor more than a decade, the communities of Pinedale and Alpine have  struggled to find appropriate cemetery space to meet the needs of  family members wishing to enter and pay respects to their loved ones.\n\nMy bill would expand the land adjacent to the Alpine Community  Cemetery,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691143/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…battle.\n\nBeyond his work in advancing preventive care, Captain Petty has also  been instrumental in ensuring that every Marion County veteran interred  at the Bushnell National Cemetery receives full military honors--a  solemn and sacred recognition of their service to our Nation. Captain  Petty's dedication exemplifies the very best of the veteran community:…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697107/recognizing-captain-steve-petty"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…mental health. The  legislation maintains all the funding for medical and prosthetic  research. It increases funding for VA infrastructure and supports  Arlington National Cemetery. It invests in the improvement, operations,  and maintenance of burial grounds for those who have sacrificed.\n\nI thank Ranking Member Wasserman Schultz. I am glad we are at…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…House Resolution 936,  I call up the bill (S. 1071) to require the Secretary of Veterans  Affairs to disinter the remains of Fernando V. Cota from Fort Sam  Houston National Cemetery, Texas, and for other purposes, and ask for  its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. ROGERS of Alabama.  1071.\n\nMr. Speaker,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…about what it meant that  50,000 Americans were the casualties of that pivotal conflict on the  fields at Gettysburg.\n\nPresident Lincoln, months after, spoke in dedicating the cemetery at  Gettysburg. At that point, it was ``four score and seven years ago.''  Today, it would be 12 score and 10 years ago because we, this year,  celebrate 250 years since the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}]