[{"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…will strengthen the  competitiveness of American manufacturing through innovation and  development of technologies to decarbonize and improve the efficiency  of cement, concrete, and asphalt production.\n\nU.S. producers are leading the way in the innovation of critical  building materials production, and we have a real opportunity in front  of us to…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…practical bill to maximize our production  capabilities while minimizing any negative impacts, and we have  research and development and demonstration of novel cement, concrete,  and asphalt processes.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on a bill I am very  excited about, H.R.\n\nMs. STEVENS.  1534.\n\nMs. STEVENS. Mr. Speaker, I also have…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…IMPACT Act, which is a  lot easier to say.\n\nI introduced this bill with my Science Committee colleague Mrs.  Foushee because we understand that the production of cement, concrete,  and asphalt play a fundamental role in supporting United States  infrastructure, national defense, and economic security.\n\nThe cement and concrete industry contributes over…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688937/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…1534) to strengthen and enhance the competitiveness of American  industry through the research and development of advanced technologies  to improve the efficiency of cement, concrete, and asphalt production,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1534\n\nBe it…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}]