[{"senator": "Norma Torres", "party": "Democrat", "sentence": "…for my community.\n\nI was raised to believe that the United States of America was built  on the principles of liberty, democracy, and equal opportunity. For  more than two centuries, those ideals have guided us, creating a Nation  where everyone has the right to pursue their dreams, serve their  communities, and have a voice in their government without…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690202/standing-for-america"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…a more perfect Union and  to look out for every single American as best we can.\n\nWe have seen that kind of leadership across the years, across the  decades, and across the centuries, particularly as it relates to the  social safety net that is under extreme assault right now. Donald  Trump's one big, ugly bill represents an unprecedented assault on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…because it lacks provisions under the Banking       Holding Company Act that otherwise prohibit non-financial       firms from entering the banking business. The nation's       centuries old policy separating banking and commerce stems       from concerns about concentration in power. Creditors should       not face the moral hazard of competing with the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…their conduct will do to  the administration of justice in the United States of America and to  the rule of law that has been sacrosanct for the better part of two- and-a-half centuries.\n\nMr. Speaker, I suppose I should, but I cannot believe that my  colleagues would waste time on a dangerous bill like this instead of  addressing the consequential challenges…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689720/no-rogue-rulings-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…representatives before  initiating hostilities. That is not weakness. That is constitutional  strength. It is the principle that has guided our Republic for nearly  2\\1/2\\ centuries.\n\nFinally, I will say this: Even setting aside the constitutional  questions, this campaign is deeply unwise. The notion that we can bomb  our way out of a drug trafficking…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Springfield Armory was officially established by George  Washington in 1794 and played an essential role in shaping America's  military and industrial strength. For nearly two centuries, the Armory  provided the tools necessary to defend our Nation and served as a hub  of innovation and craftsmanship. In 1974, the site was officially  designated a National…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…debate, or I might point out--and I welcome the Republican majority in  finally catching on--the fact that we are living in the most socialist  administration in two and a half centuries.\n\nWhat is the definition of socialism? Again, if you crack a book, you  will see that it is state control over the means of production. This  President has taken a 10 percent…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…those who one day  may count themselves among former holders of high office. Americans  also now risk being subject to retaliatory treatment in other  countries. Given the centuries-old protections granted by our  Constitution, I urge the administration to rethink its actions in order  to preserve the letter and the spirit of our American laws.''", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Court considers the Trump Administration's       argument that the trade deficit represents an extraordinary       threat, we respectfully encourage it to consider the       centuries of economic theory and I evidence and the       overwhelming consensus among economists that suggest       otherwise.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…devoted their careers to America and America's role in  the world.\n\nYet, Secretary, Archivist, National Security Advisor, USAID  Administrator Rubio has robbed America of centuries of their expertise  for no apparent reason at all. This destruction of the American role in  the world comes as China is bolstering its soft power everywhere.\n\nThis is a…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693533/mass-state-department-layoffs"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…nowhere else in the world.\n\nBeyond their ecological value, native plants in Hawaii hold profound  cultural and historical significance for Native Hawaiian communities.  For centuries, Hawaiians have relied on these plants for a variety of  essential purposes, including as staple foods like taro (kalo) and  breadfruit (`ulu), which were central to their…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…attack things like equity and inclusion, because we know that we  come from a culture and from a people who had to deal with adversity,  inequity, and purposeful exclusion for centuries; when all we wanted  was a level playing field; when all we wanted was the same  opportunities as others.\n\nWe never asked for special treatment. We never wanted to be  recognized…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Coast Guard.  Instead, the U.S. military used lethal force on four separate  occasions, killing everyone on board.\n\nDespite this breathtaking departure from more than two centuries of  law and practice, we still know almost nothing about these strikes,  some taking place as far as 2,700 miles away. It may be that there were  narcotics traffickers on…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Independence.\n\nDinah Whipple conducted the Ladies African Charitable School for  several decades, providing education for formerly enslaved people and  their children.\n\nOver two centuries later, her legacy still lives on in New Hampshire  with the Dinah Whipple STEAM Academy at the University of New  Hampshire. This program offers underrepresented young teens…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…evidence completely convincing, but he  said that he didn't think the Senate has jurisdiction to try to convict  a former President, despite the fact that that contradicted two  centuries of precedent, and the Senate ruled on the very first day  against that motion to dismiss the charges. He said there was nothing  that could be done, even though Donald Trump…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…positive impacts on the utility bills of Americans. When combined with  what this majority did for energy development in the One Big Beautiful  Bill Act, we are shoring up centuries of energy production.\n\nWe cannot survive in this country without Wyoming coal, the majority  of which is produced in the Powder River Basin. Demand for Wyoming coal  is only…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…war'' with ``declare war.''\n\nMadison explained this distinction as ``leaving to the executive the  power to repel sudden attacks.'' That distinction has been widened over  the centuries, and perhaps it is time to take a fresh look at this  question of what distinguishes declaring war from making war.\n\nIn 1847, Congressman Abraham Lincoln addressed this very…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, Saturday is the National  Guard's 389th birthday. Nearly four centuries ago, the National Guard  was founded in the Massachusetts Bay Colony. Since then, the National  Guard has exemplified the spirit of citizen soldiers. These are  ordinary…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698094/9999"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Legislature.\n\nToday, Whiting is a nature lover's paradise of gorgeous scenery and  year-round outdoor recreation. The beautifully maintained Union Meeting  House, built nearly two centuries ago, is a wonderful example of  traditional New England church architecture and a worthy addition to  the National Register of Historic Places.\n\nAnother major landmark is…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Committee on Rules--who mentioned abolishing tradition or what have  you--I think it is helpful to note that under his leadership of the  Committee on Rules, they abolished the centuries-old tradition of the  motion to recommit with instructions. I think we would all benefit from  an explanation of abolishing that centuries-old tradition and the right  of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…very geostrategic. It is a resource-rich area just  like my State of Alaska. We have cultural connections thanks to the  Inuit people, who migrated from Alaska to Greenland centuries ago. We  see that. We see that in the art, and we hear that in the language,  where there are shared and common words.\n\nBut, unlike Alaska, Greenland is not part of America,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…has stood as a pillar of  strength and community. What began as a frontier settlement has grown  into a thriving region rich in culture, industry, and opportunity. Over  the centuries, this county has been home to hardworking farmers,  entrepreneurs, educators, and service members--all of whom have played  a role in shaping its legacy.\n\nWe remember the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…strength of community. We honor the people of Leeds who stood together  in times of war, worked together to build a thriving town, and created  a legacy that spans more than two centuries. Their effort and  dedication ensure that Leeds has a bright future.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…sharia that are illegal in America:  murder of family members who dishonor the family, child marriage,  spouse abuse, to name only a few.\n\nOur legal processes developed through centuries of Western  civilization are not sufficient to confront the sharia influence  spreading across America. Even legislation may not stop the encroaching  danger. It will take…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…to celebrate the 250th  birthday of the United States Army.\n\nAs a 24-year Army veteran who is married to a 30-year Army veteran,  this moment hits close to home. For 2\\1/2\\ centuries, the Army has  answered the call--not for glory but for country.\n\nIt is not just the history books or the battlefields that define the  Army. It is the people. It is the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Speaker, I rise today to say happy birthday to  the U.S. Army.\n\nOn June 14, we will celebrate a remarkable milestone: the 250th  birthday of the United States Army. For 2\\1/2\\ centuries, the Army has  stood as a pillar of strength, sacrifice, and service. From the  earliest days of our Nation's founding to today's complex challenges,  Army soldiers have…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…milestone, we can  awaken a fresh reverence and respect for our founding documents, our  collective national blessings, and the ideas that changed the world  two-and-a-half centuries ago.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…and we do not  cower to bullies.\n\nRussia invaded Ukraine because it wants what they call Little Russia  to be their vassal state. Ukrainians have suffered for decades and  centuries under Russia. Four million Ukrainians were killed alone in  the 1930s purposefully.\n\nA Ukrainian victory is in our national security interests. A thriving  Ukraine that is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…those  who gave the last measure of devotion to protecting their fellow  Americans. These heroes' adaptability and bravery have safeguarded our  Nation for two and a half centuries, and we all owe them our most  sincere gratitude.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698198/recognizing-veterans-day"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Lexington and Concord to the fields of  Gettysburg and Vicksburg, to the beaches of Normandy and Iwo Jima, to  the sands of Southwest Asia and Afghanistan and Iraq, across the  centuries, Americans have fought and served in defense not of an  ethnicity, not of a religion, not of a language but of an idea--an idea  that out of many, we could be one; that out…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}]