[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…today in strong opposition to  President Trump's unlawful and unjust deportations to El Salvador.\n\nEarlier this year, the administration invoked the Alien Enemies Act,  an 18th century wartime statute, to deport 137 Venezuelan men to a  notorious prison abroad. This archaic law is being exploited to bypass  our immigration system and deny individuals their…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690504/trump-immigration-policies"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…others.\n\nThis is why the only way to deal with Putin is by sending a clear  message--a message of strength and of unity. As the United States has  for the better part of a century, we must continue to stand up to  tyrants and defend freedom. We have learned that isolationism and  appeasing autocrats is a losing strategy. As President Trump and his…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Framers of this country set us on a course  of action, a journey, a march toward a more perfect Union in part  anchored in the pursuit of happiness, which decade after decade,  century after century, those leaders who sat at 1600 Pennsylvania  Avenue, leaders in this Congress on both sides of the aisle, tried to  bring about for the greatest number of Americans.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "Mr. CLEAVER. Mr. Speaker, I thank Mrs. Beatty for yielding me time.\n\nMr. Speaker, I rise in support of H.R. 6644, also known as the  Housing for the 21st Century Act. This legislation, introduced by  Chairman Hill, Ranking Member Waters, Chairman Flood, and me, advanced  out of the Financial Services Committee by an impressive 50-1…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699796/housing-for-the-21st-century-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…legislative process to somehow deliver  what we want.\n\nAnd my colleagues obliged.\n\nThe damage is done. It is going to be extremely difficult to fix it.  It has eviscerated half a century of California's clean air  protections.\n\nIt was the wrong thing to do to blow up the good work of a State  seeking to solve its air pollution problem. It was absolutely the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…and deep commitment to her students.           Celebrating Centennial Anniversary of Leyden High School\n\nMr. GARCIA of Illinois. Mr. Speaker, I rise today to celebrate a  century of excellence in public education, the 100-year anniversary of  Leyden High School District No. 212, proudly serving the western  suburbs of Chicago.\n\nWhat began as a 2-year…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…projects that are already underway.\n\nNine, it blocks State AI regulations in a giveaway to Big Tech,  completely trampling over State legislatures.\n\nTen, it scraps nearly a century-long tax on gun silencers. Who does  that? Who does that? It is truly horrendous. We have a gun violence  epidemic, and the Republicans want to make it easier for dangerous…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…on a few occasions but not necessarily  publicly. I have shared it back in my district and with friends and in  memory of both Johns, both legends, both titans of the 20th century. I  have shared it with our Democratic Leader Hakeem Jeffries in  recognition of the moments of passing the torch that we find ourselves  in, in American Government and as…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Hebrew  University, AFHU, is helping to celebrate 100 years of accomplishment  and toast the next generation of visionaries who will carry forward  this tradition to the next century and beyond.\n\nHebrew University is home to over 23,000 students and 1,400  researchers across six campuses. Faculty and alumni have received 9  Nobel Prizes and registered…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697239/100th-anniversary-of-hebrew-university-of-jerusalem"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…behind the scenes. We are blessed to have a vibrant and ever- growing artistic community in Rochester. The Rochester Community  Players have been at the helm for an entire century, a remarkable  accomplishment.\n\nI congratulate President Michael Krickmire and Vice President Elaine  Sauer on this momentous occasion and look forward to their continued…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689016/congratulating-rochester-community-players"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise in support of H.R. 6644, the Housing  for the 21st Century Act, which makes improvements to Federal programs  that will support housing development and affordability.\n\nThis bipartisan bill will broaden access to homeownership, expedite…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…don't think about those who can't make it.\n\nI have heard all of the excuses. We used to regularly have increases  on a bipartisan basis since minimum wage started almost a half century  ago. Both Democrat and Republican Presidents, Congress, we all  understood it. Well, amnesia is something that has hit us. Please, Mr.  Speaker, we need to raise the minimum…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…recognize and celebrate  the 100th anniversary of Delta Air Lines, a remarkable milestone for  one of the world's most innovative and enduring airlines.\n\nAs Delta commemorates a century of service in 2025, we in Minnesota  are especially proud to reflect on the deep roots this company has in  our state through the history and legacy of Northwest Airlines.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…labor train  workers and expand market share.\n\nThere is no doubt that his work saved lives, prevented accidents, and  helped union labor gain new opportunities in the 21st century.\n\nArthur was not only a labor leader, he was also a dedicated father,  grandfather, husband, and friend. My thoughts are with his family at  this incredibly difficult time.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…to  worship according to one's beliefs.\n\nPennsylvania's Sikh community, whose roots trace back to the State of  Punjab in India, began immigrating to our Nation more than a century  ago. These remarkable Americans have played a vital role in the growth  and vitality of the Keystone State and have enriched their communities  through their commitment to…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…1980 Summer Olympics.\n\n(8) The Miracle on Ice was a turning point for ice hockey       in the United States. The game was named the greatest sports       moment of the 20th century by Sports Illustrated.\n\n(9) The historic win brought ice hockey to the front-page       of newspapers everywhere, and forever opened the door to the       National Hockey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to honor the 100th  anniversary of Indian River County, Florida, founded on June 29, 1925.\n\nFor a century, this community has stood as a jewel on the Treasure  Coast, a place where history, culture, and natural beauty come together  in extraordinary ways.\n\nIt has grown from humble…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694133/9999"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…strict design parameters around the  new $2.50 coin  to continue that tradition. The only changes that will be made are to  update the dates to reflect and celebrate another century that has  passed since this coin was put into circulation 100 years ago.\n\nAs America marks its 250th anniversary this year, the coin will honor  the same ideas and values…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…College Kiwanis has done just that.\n\nThrough initiatives like its annual blueberry sale, the club provides  over $30,000 in scholarships and grants each year. Over the past  century, they have raised more than $1 million to support organizations  such as Centre Volunteers in Medicine, the Tides Program, the Jana  Marie Foundation, and Centre Safe.\n\nTheir…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691117/recognizing-state-college-kiwanis-club"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…he has redefined  the role of faith-based universities in the United States. He gave the  benediction at President Trump's inauguration.\n\nYeshiva University, for more than a century, has been contributing to  the common good and advancing the goals of faith with purpose. It is  one of the flagship universities in the entire world for the Jewish  faith,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695300/dr-rabbi-ari-berman"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…city of Leesburg, Florida.\n\nSince its founding in 1875, the Leesburg Fire Department has been a  steadfast symbol of courage, dedication, and selfess public service.  For a century and a half, the department has served the people of  Leesburg with the same commitment and bravery that defined its earliest  days.\n\nAs we commemorate this remarkable milestone,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694140/recognizing-the-150th-anniversary-of-the-leesburg-fire-department"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…colleague, the  gentleman from Florida (Mr. Haridopolos) for arranging this Special  Order hour.\n\nMr. Speaker, I rise today in strong support of H.R. 6644, the Housing  for the 21st Century Act.\n\nAmericans across the country are feeling the squeeze of a very real  housing crisis. The National Association of Realtors estimates that the  average first-time home…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…opportunity to speak in support of H.R. 4550. This legislation  reauthorizes the United States Grain Standards Act, a cornerstone of  American agriculture and trade for nearly a century.\n\nMr. Speaker, I don't want to go any further without first thanking  Chairman Thompson for his work, Ranking Member Craig for her work, and  the gentlewoman from Kansas (Ms.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Horn. Our office, district,  and Commonwealth are better because of her service, and we are deeply  grateful as she begins this next chapter.                 Celebrating a Century of Root's Country Market\n\nMr. SMUCKER. Mr. Speaker, I am pleased to congratulate and recognize  Root's Country Market on their 100th anniversary.\n\nRoot's Country Market is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…throughout New England came together in Poland Springs, ME, to  develop a strategy to reverse the decline in our traditional industries  and our communities. Today, we celebrate a century of accomplishments  by the New England Council to foster prosperity and opportunity.\n\nWhen Captain John Smith explored our rugged coast more than 400 years  ago, he wrote…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696025/100th-anniversary-of-the-new-england-council"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…resources that we have.\n\nMr. Speaker, I have no further requests for speakers.\n\nMr. Speaker, in closing, I will reiterate the fundamental fact of  this debate. In the 21st century, America's economy, military,  healthcare, communications systems, and transportation infrastructure  depend on hardrock minerals.\n\nThere is no scenario where the United States…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and reduced choices for small businesses.\n\nOne standard had a payback period--if you can get this--of 90 years;  meaning, a small business would start saving money almost a century  after purchasing an appliance. That is absurd, and it is just one  example of the regulatory burdens Congress is working to lift off the  backs of small business owners.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…provides  for next-generation systems and emerging technologies, strengthens our  nuclear deterrent, and supports investments in cyber capabilities to  defend against 21st century threats.\n\nImportantly, this legislation continues bipartisan efforts to improve  military quality of life, including robust funding for servicemember  pay increases, housing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…Pentagon.\n\nToday, patriotic companies across the country are putting their own  skin in the game to help our country deter, if possible, and defeat, if  necessary, our 21st century adversaries, and we must help them succeed.\n\nVote for this bill.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699327/consolidated-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are touching 2002 and 1991. Come on. Mr.  Chair, we don't need to have Congress effectively, modern day,  declaring war and leaving it in place for one-quarter of a freakin'  century or, in this case, 34 years since 1991.\n\nWe can do better. If we want to actually authorize force, we should  deliberate, vote, and authorize force, but Article I has to mean…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695255/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]