[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…current law, a  person carrying a firearm must meet State training requirements every  year, but this bill would allow individuals to do concealed carry with  training certifications obtained every 3 years. This is troubling given  that the bill extends nationwide concealed carry to retired officers  who are no longer receiving the training that accompanies…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Regent       University, Logos University, and Boston University Graduate       School of Theology, along with four master's degrees, as well       as several executive certifications. He is the founder and       chancellor of the Kingdom Bible University and Kingdom       Theological Seminary; and\n\nWhereas, Apostle Dr. Dana Carson is a globally renowned…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…heard from one manufacturer that they have already redone  their certification reports to comply with the rule. If this resolution  is enacted, they will have to redo their certifications to the old,  out-of-date rules, and that will cost them more money.\n\nThe details of these certification rules are obscure, but they are  important for establishing a level…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…footprint, adding new  classrooms, research labs, housing, student wellness facilities,  recreation and more. Eleven UC Merced 2020 project buildings earned  LEED platinum certifications.\n\nThe first-ever comprehensive campaign ``Boldly Forward'' in 2022  raised funds to support UC Merced's first medical education building to  support the new Bachelor of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Trump issued an Executive order--another  Executive order--that attempted to mandate that the independent,  bipartisan Election Assistance Commission rescind all previous  certifications of voting equipment and recertify systems under amended  guidelines. That order is currently being challenged in court. It is  plainly unlawful, it is reckless, it is unfair…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…cover around 40 percent of my district.\n\nU.S. grain standards are a key component of foreign trade and the  promotion of American agricultural exports. The inspections and  certifications done by the Federal Grain Inspection Service, states and  private agencies provide foreign importers with certainty regarding the  quality of the grain bought from U.S.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the last 3 years,  100% of students enrolled in Joseph's automotive technology classes  have graduated, and 85% of them have done so after earning one or more  industry certifications. Thank you Joseph for doing this work to  inspire the next generation of skilled mechanics.\n\nWith this award, and all the hard work that came before it, Joseph is  a shining…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…may not have defined  those with the requisite knowledge, but at least defined those who were  high-income, high-net worth individuals. Of course, certain  professional certifications or designations such as being an investment  adviser could also qualify a person under the existing rules.\n\nThe wealth and income thresholds, as I have said several times,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…entrepreneurs to access the resources they need.\n\nAfter repeated unsuccessful attempts to develop and deploy a platform  that would be a one-stop-shop for contracting certifications, the  committee requested the GAO review the SBA's efforts to figure out why  they failed. The report identified the critical gaps in the SBA's  modernization efforts from…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697272/sba-it-modernization-reporting-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…graduation so that they are aware of all the  opportunities before them.\n\nCTE has established itself as a path that many high-achieving  students choose in pursuit of industry certifications and hands-on  skills that they can use right out of high school in skills-based  education programs or college.\n\nFor adult learners, we introduced the Creating Opportunities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695635/career-and-technical-education-caucus"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…experiences to make informed investment decisions.\n\nH.R. 3394 modernizes that definition. It directs the SEC to expand  eligibility to individuals who hold certain professional  certifications, relevant degrees, or job experience, criteria that  actually reflect financial sophistication.\n\nThis change is long overdue. It will unlock capital for small  businesses,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…operate. On any  given day, her functional activities could be as diverse as FAA  Temporary Flight Restrictions, novel electric vertical takeoff and  landing aircraft (eVTOL) certifications, promoting new sustainable  fuels, right down to real-time advice to a pilot at a distant Signature  Aviation base on how to unsnag a challenge clearing customs.\n\nFor so…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…actions taken by the President to enable qualified       United States shipyards to meet national security       requirements prior to the issuance of such an exception.\n\n(e) Certifications and Classification.--Notwithstanding       Public Law 119-21, the Commandant shall ensure any cutters or       aircraft procured with appropriations made available by such…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…appreciate the inclusion of three bills that I authored: The  Nationwide Permitting Improvement Act, the Reducing Regulatory Burdens  Act, and the Improving Water Quality Certifications and American Energy  Infrastructure Act.\n\nEach addresses well-documented breakdowns in our Nation's permitting  process which delay critical projects, drive up costs, and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…legislation will finally bring clarity and consistency to  the Clean Water Act permitting process by requiring the EPA to publish  clear, accessible guidance on water quality certifications.\n\nFor Utah and other Western States, where water is scarce and  infrastructure projects are critical to our growth, this reform is a  game changer. Too often, confusing,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698029/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…1992.\n\nFollowing his military retirement, Lt. Col. Matthews settled in  Mexia, Texas, where he launched a second career in education. He earned  teaching and principal certifications from Tarleton State University.  Beginning in 1994, he taught 7th grade science in Mexia ISD and went on  to become principal at Mexia Intermediate and later R.Q. Sims…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…courses and to see the positive  impact these students have within their communities.\n\nMadam Speaker, when these students graduate, they graduate with a  diploma and multiple certifications in one hand and a tremendous number  of job offers in the other. It is a pathway to opportunity and  prosperity.\n\nMadam Speaker, CTE students are the backbone of our workforce…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700190/recognizing-career-and-technical-education-month"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…security expenditures.\n\n5.1 Personal security device vouchers. Personal security       device vouchers shall be reimbursed to the Member and shall       include the following certifications:\n\n5.1.1 The personal security device was purchased by the       Member, or procured by the SAA on the Member's behalf;\n\n5.1.2 The personal security device is intended for…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…manufactured home that is distinguishable       from the invoice for a manufactured home constructed with a       permanent chassis.''.\n\n(c) Manufactured Home Standards and Certifications.--      Section 604 of the National Manufactured Housing Construction       and Safety Standards Act of 1974 (42 U.S.C. 5403) is amended       by adding at the end the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…excellence in preparing the next generation of  emergency responders.\n\nChief Ferguson has more than 30 years of experience as a paramedic.  He holds multiple instructor certifications, including basic life  support, pediatric advanced life support, advanced cardiac life  support, Stop the Bleed, and first aid.\n\nThroughout his career, Chief Ferguson has…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}]