[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…consumers.  Again, the uncertainty--the back and forth, put the tariffs on, take  the tariffs off--is the reason that the stock market has been so  volatile. People don't know with certainty what is going on with this  administration.\n\nWe are facing policies from the Trump administration that will  increase everyday costs for households and businesses. Instead…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…believe we need secure and reliable  telecommunications infrastructure. I understand that the 5-year time  limits on permits cause concern for companies looking for long-term  certainty. However, I firmly believe that we can find a solution that  protects these sanctuary resources and treats all stakeholders fairly.\n\nWe can find a win-win solution that supports…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…safety while preserving a viable path forward for an emerging  American industry. Once the government is reopened, I look forward to  working with my colleagues to restore certainty and stability for  farmers in North Carolina and throughout the U.S.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…So far, 381 hospitals across 37 States  are approved to participate in the Hospital at Home Program, and a  long-term extension of the program will give more hospitals the  certainty they need to take advantage of this opportunity to help  patients receive healthcare in their homes. It will also help  researchers evaluate whether the program is lowering…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…that  public schools could keep teachers in the classroom, that buses could  run safe routes on rural roads, and that county governments could plan  long-term budgets with certainty.\n\nIt ensures that children growing up in frontier communities receive  the same shot at a quality education as anyone in major cities in my  district, like Albuquerque or…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…critical rural health programs. Taken together, these  investments will grow the workforce, expand access to care, and improve  health outcomes.\n\nProviders and patients need certainty now. Rural health systems are  fragile, and delays have real consequences. Passing this bill will  change lives and save lives, and we cannot afford to wait.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699329/consolidated-appropriations-act-2026"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…to secure all remaining dislocated worker  funds available--$8 million--to ensure the program continues through  September 2025. We can and must give our local workers this certainty  during an uncertain time. Without these funds, we risk losing momentum  in the recovery and leaving workers without crucial support.\n\nMaui's recovery is not just a priority.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689959/maui-dislocated-workers-program"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…court has already found: that IEEPA, the International  Emergency Economic Powers Act, does not authorize tariffs.\n\nPassing my bill would give businesses and families more certainty to  plan for the future and to keep more of their hard-earned dollars in  their pockets.\n\nVirtually every business in New Hampshire that I visited since the  President announced…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…outlines the proper  process for updating a resource management plan. That is a process that  centers on the voices and needs of local land users, while preserving  regulatory certainty.\n\nBy contrast, the CRA strips the public out of the process, and it  throws public lands into chaos. What do I mean by that, Mr. Speaker?  Here is what I mean. If Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…upset you?      Why are you beset with gloom?      Because I walk like I've got oil wells      Pumping in my living room.      Just like moons and like suns      With the certainty of tides,      Just like folks springing high,      Still I rise.      Did you want to see me broken,      Bowed head and lowered eyes,      Shoulders falling down like tear…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…management of the Arctic Refuge through the  Congressional Review Act process will sow chaos, create legal  uncertainty, and put the refuge into limbo. But we do have some  certainty. Republicans know this will put our last most wild place at  risk. It will put the rare caribou, polar bears, and wildlife that call  the refuge home at risk. The Gwich'in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…the fortified mountain location  exactly where intended.\n\nThe Fordow Fuel Enrichment Plant is buried 300 feet below ground. We  can't see inside the mountain to know with certainty whether the GBU- 57s ``obliterated'' the FFEP or not.\n\nThat is what makes the leaked report so concerning and why it is so  important for the administration to give Members…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…procedural deliberation in the enactment       of taxes on trade, benefitting the millions of Americans       whose livelihoods depend on international commerce and the       certainty that supports investment in our economy.\n\nMembers of Congress continue to hear from farmers, workers,       and business owners about the harm inflicted by broad-based…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…processing of  their permanent resident applications, which may still take years if  not decades. However, as these veterans near the end of their lives,  they deserve the certainty of a non-revocable permanent solution.\n\nThe Filipino Veterans Family Reunification Act would address this by  exempting from existing visa caps the visa applications of the…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…consumers and equips assigned agencies with the  appropriate authority to provide efficient and thorough oversight over  digital asset markets. It also provides desperately needed certainty so  that businesses can grow and evolve.\n\nI will be clear: If the CLARITY Act had been in place, the FTX market  crash that caused their customers to lose $8 billion would…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…fully reauthorize the National  Flood Insurance Program for this year and for next year. There are 4.7  million homeowners across the country who deserve that little bit of  certainty, and it does not seem like it is asking too much.\n\nImagine if your homeowners or life insurance was subject to lapsing  every year if Congress couldn't get their act together.…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…just talking points. These are real results for the  American people. When you give money back to the people, it is a return  on investment. I will always fight to provide certainty for the future  and to put more money back into your pockets as we step into the golden  age in America. In God we trust.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…inspired colleagues and endeared him to the residents he  served. Regardless of inclement weather or personal hardship, Joseph's  dedication never faltered--his presence was a certainty, ensuring that  his community received their mail with the efficiency and reliability  that only a true public servant could provide.\n\nIn recognition of his outstanding service…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…environment.\n\nMr. Chair, that is why the Bean amendment seeks to codify the  permitting program administered by the States of Florida, Michigan, and  New Jersey, and to provide certainty to the other States lined up to do  the same.\n\nThese States have been examples of cooperation between the State and  Federal Government, and now Congress must provide clarity…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…clear, longstanding, bipartisan commitment  like this, then what message does that send to communities in every  State and every district relying on similar commitments? What certainty  do they have that our word means anything?\n\nYesterday, the administration issued a statement opposing this  override, claiming it continues failed policies of the past and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…change as a backdoor veto.\n\nSome of you have seen that even the Microsoft founder, Bill Gates, is  now backing up on his climate claims. This is ridiculous.\n\nThis bill restores certainty for developers who have already  committed more than $70 billion--with a b--in new investments since  President Trump took office.\n\nIt strengthens our hand abroad by ensuring…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…implications.\n\nFirst, it would overturn this harmful plan and revert to the 2015  RMP, thereby protecting access to 481,000 acres for coal leasing.\n\nSecond, it would provide certainty to countless Wyomingites who rely  on our good, clean coal for jobs and for revenue that funds the schools  that our children attend.\n\nThird, it is a vote for the millions…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…economic policy. It will help preserve the United States' leadership in  financial innovation, support the growth of compliant digital asset  markets, and provide much-needed certainty to investors, developers,  and regulators alike.\n\nIn an increasingly competitive global financial landscape, this  legislation positions the United States to lead with clarity,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…produce a serious and responsible bill.\n\nH.R. 7147 is focused on outcomes, not partisan rhetoric. It equips  frontline personnel, strengthens enforcement, and provides the  certainty DHS needs to carry out its mission effectively.\n\nI thank our Members and staff for their work, and I urge support for  this bipartisan legislation.\n\nMr. COLE.\n\nMr. COLE.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…the CFPB's rule and protect consumers'  access to financial products.\n\nI urge my colleagues to support this CRA resolution, defend consumer  choice, and restore regulatory certainty to our financial system.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…together a  bill that cuts red tape, reduces duplicative reviews, and gives  farmers, ranchers, utilities, and communities in Colorado and across  the country the regulatory certainty that they need to build.\n\nI look forward to advancing this important legislation.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698019/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…face a $600 billion tax hike in 2026. Republicans do  not intend to let that happen, but we don't just want to extend the  TCJA's provisions. We want to give small businesses certainty by making  these pro-growth tax policies permanent because permanence will  encourage long-term investment, it will encourage growth, and it will  maximize our economy's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…the franchising sector an estimated $33 billion annually. By  codifying that an employer must exercise direct, actual, and immediate  control over workers, we restore the certainty that small business  owners, contractors, and franchisees need to grow and hire more.\n\nFinally, we must protect the hard-earned savings of the American  people.\n\nH.R. 2988,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…on the importance  of early detection.\n\nMy wife Barbara is a 38-year breast cancer survivor. We are fortunate  that her breast cancer was detected very early. We know with certainty  that early detection can dramatically increase a woman's chance of  defeating breast cancer.\n\nA regular mammogram is the best way to find breast cancer early. As  screening…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…prices. This is a lose-lose situation for small business owners and  clearly violates the letter of the law.\n\nWe must pass H.J. Res. 75 to repeal this midnight rule and provide  certainty to American manufacturers and small retailers.\n\nMr. Speaker, I thank the gentleman from Texas (Mr. Goldman) for his  leadership on this issue. I urge my colleagues to join…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}]