[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…interests and doesn't reward them.\n\nWe believe in passing big, bold, consequential bills that make life  better for everyday people, not creating hotlines that already exist  and certainly not going on a taxpayer-funded vacation for 8 weeks like  Republicans did in October and November.\n\nThe American people deserve so much better. They deserve leaders who…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…the closing here. First of  all, I want to really recognize the efforts of all of the staff that  were involved in bringing us to this point to get the bill to the  floor: certainly the House Armed Services Committee staff, and the  bipartisan staff, ably led on both sides of the aisle.\n\nThis is a long process. Thousands of amendments are generated,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…that, Republicans in Congress would need to cast their vote on  whether to commit U.S. Armed Forces to an open-ended conflict that  their constituents, the American people, certainly do not want.\n\nTrump ran on ending forever wars, but now he has forgotten what they  are, what his own Secretary of Defense, Pete Hegseth, characterized as  ``interventionism,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…insurance  company so that she could get care.\n\nShe fought hard for 18 months, but she passed away in 2011. And that  experience drives the work that I did in the House and, certainly, why  I am here on this floor today.\n\nSadly, we are nearly a decade after that original attempt by  President Trump to repeal the ACA, and we are in a similar place.  President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…is insisting  upon legal accountability for people who do wrong. The other part of it  is due process, which may be the two most beautiful words in the  English language, certainly the two most beautiful words in the  Constitution of the United States. It is due process that protects all  of our freedoms and our rights against the arbitrary power of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…I would get a sense for what that was. It never happened. And  unless you are a military policeman, it doesn't happen for infantrymen,  for special ops or submariners, and certainly not for Active-Duty  infantry.\n\nSo at this time in our history, I am really worried about legal  jeopardy that our young servicemembers have been put in. But I am also  worried…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…I was sort of hoping that Mr. Pallone would be the  chairman this year. But if the chairman of the Energy and Commerce  Committee can't sit on this side of the House, I am certainly glad it  is a gentleman from Kentucky.\n\nMr. Speaker, I rise in opposition to this bill not just because it is  a waste of our time. It is also a wasted opportunity to, for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…considering, and my amendment would simply allow Congress to express  its will with respect to the release of the Epstein files. This is  something our Republican colleagues and certainly key members of the  Trump administration have been talking about for years until their  recent about-face.\n\nCongress can express its will. We would like to have it put up…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…leaders in California didn't just wake up one  day to find some special privileges to establish our own climate policy  and impose it upon the rest of the country. And we certainly didn't  cheat the system to jam States represented by Republicans in the Senate  or in their Governors' mansions. No. California was explicitly granted  waivers because of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…President should have sought our authorization.\n\nInstead, he is using a fake emergency authority that hopefully the  Supreme Court will make clear he does not have, and we certainly await  that decision. However, we don't need to wait for that decision. We  don't work for the Supreme Court either.\n\nThe House is the Article I branch of government, the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Republicans will work with us now to consider critical amendments to  improve the bill and make sure the administration actually delivers for  veterans, something I think it has certainly failed to do on many  fronts over the last few months.\n\nThere is also some discussion of adding two other funding bills that  we have negotiated and reported out of committee…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…decisionmaking away from the people  and the judges of D.C., and instead handing the power of judges over to  politicians in this room who don't live here, who don't vote here, and  certainly don't answer to D.C. residents.\n\nThis bill amends D.C.'s Youth Rehabilitation Act, or the YRA as it is  known.\n\nNow, the YRA is not radical. It has been in place since 1985,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the next pandemic. We have learned  that science became very much focused upon during the whole COVID  crisis. They don't care about making STEM more inclusive, and they  certainly don't care if Americans suffer as a result.\n\nThis isn't just wrong, it is a blatant attack on scientific  integrity. Integrity in research is essential, essential to scientific…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…have a child is a deeply personal--\n\nMs. BONAMICI. Deciding whether and when to have a child is a deeply  personal decision. It should not be made by politicians, and it  certainly should not be made by anti-choice extremists.\n\nThe biased, anti-choice efforts underpinning these two bills will  make it harder for students to make informed decisions about…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…recognition with immense pride and I dedicate it to everyone  who has the dream to fly.''\n\nMr. Speaker, I, again, congratulate Paul Tazewell on this amazing  accomplishment. He has certainly made our community proud, and he is a  shining example of why Ohio's 13th Congressional District is the  birthplace of champions.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688615/recognizing-paul-tazewell"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…and American hero, Horace  ``Jim'' Sharp.\n\nMr. Sharp was born in Morris County, KS, and he spent his early years  tending to the family farm--not an unusual thing in Kansas, certainly  not in his generation.\n\nAt age 19, Jim surrendered his farm deferment, courageously  volunteering to serve his nation in the U.S. Army during World War II.\n\nThrough his…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…about what would be required, what blood and treasure would be  spilled halfway across the world.\n\nNow, we are seeing it all play out again. History doesn't repeat, but  it certainly rhymes. We in this room had the Secretary of Defense and  the Secretary of State come to Congress before the end of this calendar  year and blatantly lie to our faces and,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699360/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…tour.\n\nI saw nothing there. I saw a few things--frustration. You know, you  have got the historic commission and everybody else controlling the  state of the project. But I certainly didn't see any criminal activity.  I certainly didn't see any of these alleged rooftop garden terraces,  water features, VIP elevators, special marble. They had to take it…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…$30,000  cash for having both parents at home.\n\nAn example of programs which fit the bill, which we penalize people  for getting married, would be formerly called food stamps, certainly  low-income housing, which by itself can be a benefit of over $12,000 a  year; something called the earned income tax credit, which can easily  be $6,000 or $7,000 a year,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…selfless age. He celebrates his 100th birthday this week, and on this  momentous occasion, we owe him thanks for his service.\n\nThere he is. His story is powerful. His example is certainly worth  following.\n\nAt the end of 1941, a teenage attendant was knocked down when an air  compressor knocked him off his feet. He was working at Hoosier Pete  filling station…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…life on our side. We don't celebrate the  loss of life in the recent shooting, but we cannot absolve people of  the actions they are taking to disrupt ICE's operations.\n\nWe certainly shouldn't be looking at ICE agents, condemning ICE  agents who are showing up to do their jobs. Democrats have been  questioning the authority and jurisdiction of ICE's actions…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…grateful to Elon Musk, who has volunteered  his time, as well as recruiting others to help the U.S. Government deal  with its spending addiction and to try to help it get clean--certainly,  much worse than a drunken sailor.\n\nThis morning, I had a chance to meet with a gentleman, Joe Gebbia,  who is the former CEO of Airbnb and who is volunteering his time…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…in  the best interest of the United States to care about it. We live in a  world that, unfortunately, is on fire, whether it is in China, whether  we see it in Russia, or certainly in Iran.\n\nIran has chosen to not only take their horrific, genocidal, lunatic  policies to kill their own people, to hurt women, and to hurt people  who won't abide by their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…late. The  administration is already bombing boats in the Caribbean that they  claim to be Tren de Aragua. I hope they have already done an assessment  and have a plan. They certainly have not shared anything with Congress  to that effect.\n\nMr. Speaker, it is very important for Congress to understand the  threat that is leading to this administration's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…have to start spending money on the must-haves, not on  the nice-to-haves. These stations are not only nice-to-have to some,  they are not-nice-to-have to most, and they are certainly not must- haves.\n\nMr. Speaker, let's pass this rescissions package. Let's get on our  way to having some accountability for the American people and codify  President Trump's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…admirably throughout the entire season, even giving Corner  Canyon their only loss of the season back in September.\n\nI congratulate the teams, the coaches, and the schools. They  certainly make Utah proud.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697704/congratulating-corner-canyon-and-lone-peak-high-school-football-teams"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, with all of this upheaval in Minnesota  and certainly with some other States, Tennesseans are learning a whole  lot more about what is happening in this country with fraud and how  people are defrauding not only the Federal…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…prosecuted, if the law were tough  enough, that none of that would have happened, but I can sure say the  odds are much better that those five people might still be alive. I can  certainly say that justice would have been done.\n\nThis bill is a good first step. We need to do it. It is the right  thing.\n\nMadam Speaker, I encourage all of my colleagues to support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695358/stop-illegal-entry-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…find it.  When I say my prayers, I do, every single time--I ask God: Don't let me  hate because it is hard sometimes. It is hard. But I do. I say: God,  don't let me hate.\n\nI certainly don't hate Congresswoman Ocasio-Cortez. I want to make  that very clear. She has the right to her opinion. She has the right to  try to have the socialists take over the…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…heard from a number of our Republican colleagues. We heard from  the Senator from Michigan. Obviously, passions are running high. But  there is a great deal of frustration, certainly, on our side when the  other side simply won't take yes for an answer.\n\nI came down here 2 weeks ago in as nonpartisan a stance as I possibly  could be because, as the Senator…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}]