[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Madam President, Donald Trump and Elon Musk are taking a  chain saw to Social Security.", "title": "Nomination of Frank Bisignano", "date": "2025-05-05"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "If Republicans go forward with this vote today while staying  silent as this administration takes the chain saw to SAMHSA, then it is  clear that my Republican colleagues are willing to let SAMHSA lose all  of its capacity to serve its mission to save lives.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "McMahon and Republicans  can so callously plan to take a chain saw to the American dreams of so  many current and future students.", "title": "Nomination of Linda McMahon", "date": "2025-02-27"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "It is about  the fact that Congress had approved this funding before Elon Musk took  a literal chain saw, an illegal chain saw, to foreign aid and public  broadcasting and a whole bunch of other things that Americans care  about.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "As Elon Musk and his  lackeys really take a hammer--a chain saw, I guess--to what really  matters in this country, it is very difficult to try to work together  to say we are going to solve problems for the American people when one  side has no spine and no answer and instead brings these ridiculous  resolutions to the floor rather than working on really helping the  American people.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Taking a sledgehammer and a chain saw to entire institutions that  allow us to stay safe and also remain competitive on the global scale  is not only unwise, it is dangerous.", "title": "Stop Trump's Chaos--Stand Up for Science", "date": "2025-05-15"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "We have now seen weeks of taking a chain saw to our Federal programs  and damage to our grid, national forests, national security, and,  frankly, personal security.", "title": "Senseless Bonneville Power Administration Workforce Cuts", "date": "2025-02-27"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "They are just doing  it and getting on TV with a chain saw.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Musk, who took out a chain saw from the President of  Argentina and waved it around, a chain saw.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Again, use that chain saw; cut, cut, cut--whether it is waste or  whether it is sinew and bone--and then later, say: Oh, maybe we  shouldn't have done that.", "title": "Rescissions", "date": "2025-07-14"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "The American people do not support this kind of chaos, this chain-saw  approach to FEMA, to the National Weather Service, and to government at  large.", "title": "Central Texas Floods", "date": "2025-07-14"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "I hope that Republicans are going to stand up to Elon  Musk as he takes a chain saw to Social Security, but no.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator- Freezers''", "date": "2025-03-26"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "Already, chain saw-wielding Elon Musk--it is really hard to get rid of  that image because he takes such delight in wielding that chain saw and  willy-nilly cutting all kinds of government programs that we rely on.", "title": "Nomination of Linda McMahon", "date": "2025-02-27"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Americans did not sign up for DOGE to take its chain saw, for  instance, to aviation safety.", "title": "Department of Government Efficiency", "date": "2025-02-26"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "They  use just a meat-ax or a chain saw, as Elon Musk perversely but proudly  said he is going to carry one.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Is that a  chain saw?", "title": "Tell the Truth About Math", "date": "2025-03-25"}]