[{"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Chair, I rise today in strong opposition to this  amendment.\n\nIf passed, this amendment would immediately prohibit TRICARE coverage  of mental health counseling for transgender young people.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Mr. SHERMAN. Mr. Chair, I rise today in support of the Access to  Small Business Investor Capital Act, Section 302 of H.R. 3383 the  Increasing Investor Opportunities Act or the INVEST Act. Section 302…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Pennsylvania. Mr. Chair, I thank Ranking Member DeLauro  and Chairman Cole, and my sincere sympathies to Chair Womack and his  family on the passing of his beautiful wife.\n\nMr. Chair, I rise today in support of the negotiated fiscal year 2026  appropriations package for Labor-Health and Human Services-Education,  for Defense, and for Transportation-Housing and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Chair, I rise today to speak in opposition to H.R.  3898.\n\nClean water used to be something we all agreed upon. The Clean Water  Act was originally passed by an overwhelmingly bipartisan…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698023/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Chair, I rise as the designee of Ms. Houlahan, and I  have an amendment at the desk.\n\nMr. MIN. Mr. Chair, I yield myself such time as I may consume.\n\nMr. Chair, I rise today in support of this straightforward amendment  to the Electric Supply Chain Act, an amendment that strengthens our  workforce, supports veterans, and helps ensure the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Madam Chair, I rise today as the ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party, the CCP, to express serious…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Mr. HORSFORD. Madam Chair, I thank the gentleman for yielding.\n\nMadam Chair, I rise today not in favor or opposition. I rise in  defense, defense of 811,000 Nevadans and countless people across the  country whose lives are in danger. I rise in defense of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688077/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Chair, I rise today to express my continued and  resolute opposition to the fiscal year 2026 Military Construction,  Veterans Affairs, and Related Agencies Appropriations Act in its  current…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Chair, I rise today not just as a Member of this body  but as a physician who has spent nearly two decades caring for patients  in the intensive care unit, many of them fighting for their…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691873/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Madam Chair, I rise today in opposition to the disastrous  GOP budget resolution.\n\nThis bill seeks to cut $3 trillion in spending, supposedly by  targeting waste and fraud, but the entire domestic…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688058/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "Ms. GOODLANDER. Mr. Chair, I thank Congresswoman Wasserman Schultz  for her leadership.\n\nMr. Chair, I rise today on behalf of the 88,000 brave American  heroes, veterans, who call the State of New Hampshire home.\n\nWe owe a sacred obligation to the women and men who served our…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692944/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Chair, I thank Representative Stansbury for  yielding.\n\nMr. Chair, I rise today in opposition to this amendment, which would  ban transgender women from participating in women's sports but also  lead to challenges on all women's bodies, making the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695232/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Chair, I yield myself such time as I may consume.\n\nMr. Chair, I rise today in opposition to this budget resolution.\n\nThis budget is disastrous for the American economy. It will balloon  our deficits, lead to higher interest rates, and make…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Ms. VELAZQUEZ. Madam Chair, I thank the gentleman for yielding.\n\nMadam Chair, I rise today in strong opposition to this Republican  rip-off. This budget slashes $880 billion from Medicaid, putting  286,000 people in my district, including nearly 100,000 children,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688073/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Mr. Chair, for the folks who are watching, for the  transgender  community, you are loved and respected for your resilience and for your  breadth. Keep pushing.\n\nMr. Chair, I rise today in opposition to this amendment that would  prohibit the Department of Defense from collecting data on gender  identity.\n\nData is not just numbers. Data is a story and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695230/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "Mr. DUNN of Florida. Mr. Chair, I rise today in support of H.R. 2483,  the SUPPORT for Patients and Communities Reauthorization Act.\n\nThis bill is a critical piece of legislation that will help bolster  prevention,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691878/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "Mr. BURLISON. Mr. Chair, I thank the gentleman for yielding.\n\nMr. Chair, I rise today in support of the PERMIT Act introduced by my  good friend and chairman of the Water Resources and Environment  Subcommittee, Congressman  Mike Collins.\n\nThis bold legislation…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "Mr. CLYDE. Mr. Chair, I rise today in strong support of the House  Budget Committee's FY25 budget resolution which advances President  Trump's America First agenda by unlocking the budget reconciliation…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Madam Chair, I thank the chairman and the ranking member  of the committee for their thoughtful leadership in navigating us  toward passing this bill.\n\nMadam Chair, I rise today in strong support of H.R. 3838, our  National Defense Authorization Act for fiscal year 2026. The 2026 NDAA  emphasizes ensuring the lethality of the U.S. Armed Forces…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695141/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "Mr. WITTMAN. Madam Chair, I yield myself such time as I may consume.\n\nMadam Chair, I rise today in support of my amendment. In 2018, the  Substance Use-Disorder Prevention that Promotes Opioid Recovery and  Treatment for Patients and Communities, otherwise known…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691875/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Ms. BOEBERT. Mr. Chair, I rise today in strong support of two of my  amendments that are included in H.R. 4016. It will address the fentanyl  crisis devastating our Nation, which has claimed hundreds of…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "Mr. CLYDE. Mr. Chair, I rise today in support of Representative  Norman's amendment, which would prevent my constituents' hard-earned  taxpayer dollars from funding woke earmarks and handouts to leftist…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699288/amendment-no-1-offered-by-mr-massie"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Ms. BOEBERT. Mr. Chair, I rise today with deep respect and unwavering  gratitude for the brave men and women who have worn the uniform of the  United States of America. My support for the members of our…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692951/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Committee chairman has done to bring us to this point  today. It has taken him hundreds of hours and tested his blood pressure  quite seriously to get us to this point.\n\nMr. Chair, I rise today in firm support of this resolution.\n\nIn November last year, 77 million Americans demanded changes in how  our Federal Government is working for them, particularly changes…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688081/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE.   2483.\n\nMr. GUTHRIE. Mr. Chair, I yield myself such time as I may consume.\n\nMr. Chair, I rise today in support of H.R. 2483, the SUPPORT for  Patients and Communities Reauthorization Act.\n\nWhen the Committee on Energy and Commerce led the way on the original  SUPPORT…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Madam Chair, I rise today to speak in  support of amendment No. 159, to provide funding for the purchase of  heavy dump trucks, or HDTs, for the Active Army, the Army National  Guard, and the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "Mr. COLE. Mr. Chair, I thank my good friend, Judge Carter, for  yielding me time.\n\nMr. Chair, I rise today in support of this important piece of  legislation. Prioritizing veterans and troops says everything about our  values, and that is exactly what this first fiscal year…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Mr. Chair, I rise today in support of my amendment to the  Fiscal Year 2026 Defense Appropriations Act, which provides $7.5  million to support continued research of conductive pigments and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693897/department-of-defense-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Chair, I thank the gentleman for yielding.\n\nMr. Chair, I rise today in strong support of Chairman Guthrie's  SUPPORT for Patients and Communities Reauthorization Act of 2025.\n\nThis critical legislation reflects House Republicans' ongoing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691872/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "Mr. DesJARLAIS. Madam Chair, I thank Chairman Rogers for the time.\n\nMadam Chair, I rise today in favor of the fiscal year 2025 National  Defense Authorization Act. This bill fundamentally reforms defense  acquisition to support a fighting force that will stand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]