[{"senator": "Ed Case", "party": "Democrat", "sentence": "…species to higher altitudes, leaving  them with increasingly limited habitats. These environmental changes  further stress the islands' delicate  ecosystems and compound the challenges posed by invasive species and  diseases. The combination of habitat loss and climate change has  created an urgent need for coordinated conservation efforts to ensure  the survival…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…he earned when his death occurred  shortly after the benefits were awarded. This resulted in his family  having to navigate grief, the cost of his care, and additional  challenges posed by the bureaucracy simply because of the timing of his  passing.\n\nWe have already asked so much of our veterans and their families. It  is entirely unconscionable that…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…summer, nearly half of the country's population was under an extreme  heat warning. From coast to coast, we are struggling to keep people  safe and to fully understand the challenges posed by extreme heat.\n\nExtreme heat is a danger to public health, but it also threatens our  very way of life. As heat waves get worse, roadways will crack, energy  grids will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…conditions across the National Wildlife Refuge System. With 21  teams strategically positioned in various FWS regions, they are on the  front lines, addressing the unique challenges posed by invasive  species.\n\nThe Invasive Species Response Act signifies a transformative shift  within the FWS, moving us from a reactive, species-by-species approach  to a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693136/introduction-of-the-invasive-species-response-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Speaker, I rise in support of H.R. 1316. Over the past 6 years,  export controls have become a crucial tool for our national security  and foreign policy to respond to the challenges posed by Russia, China,  Iran, and others.\n\nOur use of export controls have become more and more frequent and  more complicated, as we have started to apply novel controls in…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…School, has represented her school ably on her way  to achieving the Division III State Title for the 100 Meter Dash at the  State Track and Field Meet. Anna overcame the challenges posed by  intense competition in her effort to win the title.\n\nIn pursuing the State Championship, Anna defeated her opponents with  an impressive time of 11.75 seconds. Her…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693404/special-recognition-of-anna-roessner-for-winning-the-division-iii-state-track-and-field-title-for-the-100-meter-dash"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…her way to  achieving three Division III State Titles for the 200 Meter Dash, 400  Meter Dash, and Girls Long Jump at the State Track and Field Meet. Anna  overcame the challenges posed by intense competition in her effort to  win the title.\n\nIn pursuing the State Championship, Anna defeated her opponents with  an impressive time of 23.04 seconds in the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693373/special-recognition-of-isabella-zahn-for-winning-the-division-iii-state-track-and-field-title-for-the-200-meter-dash-400-meter-dash-and-long-jump"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Division IV State Girls  Basketball Title. In their effort to surpass all other teams in the  Division IV State Basketball Playoffs, the Bellevue Redmen overcame the  challenges posed by intense competition.\n\nIn pursuing the State Championship, the Bellevue Lady Redmen defeated  the Kettering Archbishop Alter Knights to win their first state  basketball…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689987/recognizing-bellevue-high-school-winning-the-division-iv-state-girls-basketball"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…investment that takes the form of       greenfield investment as compared to foreign direct       investment relating to merger and acquisition activity.\n\n(6) The unique challenges posed by foreign direct       investment, particularly acquisitions, in the United States       by State-owned or State-backed enterprises, especially from       State-directed…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…achieving the Division II State Girls Volleyball Title. In  their effort to surpass all other teams in the Division II State  Volleyball Playoffs, the Avon Eagles overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Anthony Wayne Generals to win the state volleyball championship. The  members…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…School's Girls 4x400 Meter Relay team have  represented their school ably on their way to achieving the Division  III State Track and Field Title. The team overcame the challenges posed  by intense competition in their effort to surpass all other relay teams  in their event.\n\nIn pursuing the State Championship, Audrey Alig, Lana Kaiser,  Kiersten Keller,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693429/special-recognition-of-coldwater-high-schools-girls-4x400-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…High School Girls Track and Field Team have represented  their school ably on their way to achieving the Division III State  Track and Field Title. The team overcame the challenges posed by  intense competition in their effort to surpass all other teams at the  2025 OHSAA Division III State Track and Field Championships.\n\nIn pursuing the State Championship,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693344/special-recognition-of-coldwater-high-schools-girls-track-and-field-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…School's Girls 4x200 Meter Relay team have  represented their school ably on their way to achieving the Division  III State Track and Field Title. The team overcame the challenges posed  by intense competition in their effort to surpass all other relay teams  in their event.\n\nIn pursuing the State Championship, Alyssa Webb, Aubrey Abeyta,  Jasmine McDearmon,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693428/special-recognition-of-oberlin-high-schools-girls-4x200-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…School Cheerleading and Dance  Coaches Association Division III Best in the State title.\n\nIn their effort to surpass all other teams in the division, Norwalk  overcame the challenges posed by intense competition. The members of  this very special team have shown that their sport requires an  individual effort for a team result. Their hard work and dedication,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698000/recognizing-the-norwalk-high-school-cheer-team-on-winning-the-division-iii-ohscca-best-in-the-state-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…achieving the Division II State Boys Soccer Title. In their effort  to surpass all other teams in the Division II State Soccer Playoffs,  the Avon Eagles overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Kings Mills Knights to win their first state soccer championship. The  members…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697971/recognizing-avon-high-school-on-winning-the-division-ii-state-boys-soccer-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…High School, has represented his school ably on his  way to achieving the Division I State Title for High Jump at the State  Track and Field Meet. Nathan overcame the challenges posed by intense  competition in his effort to win the title.\n\nIn pursuing the State Championship, Nathan defeated his opponents  with an impressive jump of 6 feet 9 inches.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693333/special-recognition-of-nathan-bright-for-winning-the-division-i-state-track-and-field-title-for-high-jump"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…achieving the Division VII State Football Title. In their  effort to surpass all other teams in the Division VII State Football  Playoffs, the St. Henry Redskins overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the St. Henry Redskins defeated  the Hillsdale Falcons to win the state football championship. The  members…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697924/recognizing-st-henry-high-school-on-winning-the-division-vii-state-football-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…achieving the Division V State Football Title. In their  effort to surpass all other teams in the Division V State Football  Playoffs, the Liberty Center Tigers overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the Liberty Center Tigers  defeated the Wheelersburg Pirates to win the state football  championship. The…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697967/recognizing-liberty-center-high-school-on-winning-the-division-v-state-football-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…represented their school ably on their way to achieving the JV  State Girls Water Polo Title. In their effort to surpass all other  teams, the Lady Wildcats overcame the challenges posed by intense  competition.\n\nIn pursuing the State Championship, the Lady Wildcats defeated Upper  Arlington to win the state championship. The members of this very  special…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697932/recognizing-the-napoleon-high-school-on-winning-the-junior-varsity-state-girls-water-polo-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…has represented her school ably on her way to  achieving the Division II State Title for the 300 Meter Hurdles at the  State Track and Field Meet. Ariannah overcame the challenges posed by  intense competition in her effort to win the title.\n\nIn pursuing the State Championship, Ariannah defeated her opponents  with an impressive time of 42.76 seconds.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693403/special-recognition-of-ariannah-floyd-for-winning-the-division-ii-state-track-and-field-title-for-the-300-meter-hurdles"}]