[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…truth is time and time again what  this administration has been doing has not been legal.\n\nIn fact, in Trump's first 100 days, more than 220 lawsuits were filed  directly challenging his agenda. Federal judges have issued over 130  court orders blocking or pausing those actions. If we do the math,  Trump is being sued more than twice a day, and he is…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…more leeway to deny or reduce  services. Families will be left without recourse, and the promise of a  free and appropriate public education will be broken.''\n\nThese are challenging enough times for students, families, and  schools. In Portland, the public school district recently redirected an  additional $25 million from their general fund to fill…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…county departments and a half-billion-dollar budget.\n\nCOVID hit almost as soon as he was hired, and Mr. Varney found  himself navigating Madera County through one of the most challenging  times in recent history. He played a vital role in helping Madera  County survive and thrive through COVID. Thanks to his hard work,  Madera County played an important…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…children--our children--stand to lose out on the public education and  opportunity to learn that they deserve, regardless of their ZIP code.\n\nLook, we know we are facing a challenging time in the American  education system. We know that, as a nation, we must turn the tide and  ensure that America is a global leader in educating our children, and I  am…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…scams and deceptive business practices; it blocked  a merger of two large grocery chains that would have raised food  prices; it worked to cap the cost of inhalers to $35 by challenging  anticompetitive patent practices; it took on hidden fees in the  ticketing and lodging markets; it unveiled rules to make it as easy to  stop a subscription as it was to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…would say to my colleague, I very much wish that I was not in this  position. This morning, I was--like Chairman Lee, I was chairman of the  committee, and I know this is a challenging process to put these  measures together.\n\nChairman Lee and I have worked very closely for years on these issues  and a host of others, and I look forward to having plenty…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691667/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…censored; when  international students were being disappeared from American streets  without due process; when American universities were being intimidated  into silence, challenging that fundamental idea of freedom of thought,  freedom of expression; when the law firms that represent clients that  may not be favored are attacked and attacked and attacked?…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Joint Task Force Panama, and the  Hungarian Stabilization Force. As a senior commander in the Colorado  National Guard, Major General Clellan led during some of the most  challenging times in our state's history. Whether responding to natural  disasters, public health crises, or civil unrest, she ensured that the  Guard remained a trusted force for stability…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…the Interior has already done just that.\n\nGiven that the administration has already taken action to overturn  responsible management plans, these bills only make it more challenging  to manage these special lands. It will also expose any future decisions  related to oil and gas in the refuge to significant legal uncertainty.\n\nThis is a losing proposal.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…caregivers in Wisconsin and across our country tend  to the needs of their loved ones. Although this work can be very, very  rewarding, it can also be emotionally and physically challenging.\n\nAfter serving as my grandmother's primary caregiver as she got older,  I know firsthand the time, the dedication, and the sacrifice involved  to keep our aging, disabled,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…They are the backbone of American democracy. They are our final  safeguard against the unchecked power of the executive.\n\nWhen a President ignores the courts, he is not challenging policy. He  is declaring war on the Constitution itself. Despite this laundry list  of attacks on trying to undermine our democracy and our rule of law, my  Republican colleagues…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…common than  in conflict.\n\nMr. Speaker, I ask my colleagues to join me in honoring Mission  Mississippi of Leflore County for their vital work in uplifting their  community, challenging stereotypes, and leading with grace and love.  Their efforts remind us that reconciliation is possible--one  conversation, one relationship, and one act of compassion at…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…from Jesuit run slave  plantation in Southern Maryland. The students also identified five  enslaved persons who worked at the school. Reckoning with this history  has been challenging and continues to this day.\n\nAs a teacher for over forty years, including U.S. History, I  understand the complex issue of teaching ``difficult histories.'' It is  vital…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691693/recognizing-edward-l-donnellan-jr-as-the-winner-of-the-2025-mary-k-bonstell-teacher-of-the-year-award"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…rise to support the consolidated  appropriations act.\n\nFirst, I thank Ranking Member DeLauro for yielding me the time, but  also for her leadership and perseverance in this challenging time.\n\nI thank Mr. Simpson for his collaboration and partnership in this  committee, and I also thank Chairman Cole for the work he has done on  this committee.\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…any  extra money from a tax cut will be swallowed up by these higher  healthcare costs. And every time a new report or analysis is done on  this bill, the outlook gets more challenging for people at home.\n\nIf we really had this serious of a waste, fraud, and abuse problem in  Medicaid, why haven't we had hearings on it? Why haven't we had  legislation…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…awareness, and even planetary defense  from near-Earth objects.\n\nIn short, this bill enables two of our chief scientific agencies to  do better work by tackling some of our most challenging scientific  problems together.\n\nMr. Speaker, I thank my colleague, Representative Begich, for  introducing this legislation. I also thank Representative Whitesides  for…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…other side of  the aisle, who were encouraging it. They were undermining our law  enforcement officers, making it more difficult for them to carry out  their jobs, who were challenging them. It was important that we stood  by them, and it is important now that the President and Republicans are  standing by our law enforcement officers.\n\nAmericans suffered…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…served with distinction in Iraq, embedding  with the 5th Iraqi Brigade near Baqubah, and returned to Afghanistan to  advance stability operations in some of the nation's most challenging  provinces. For his valor and meritorious service, he was awarded two  Bronze Stars, a Meritorious Service Medal, a NATO Medal, and a  Presidential Unit Citation.\n\nFollowing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "French Hill", "party": "Republican", "sentence": "…terrain, and the most  treasured views in the Ouachita region are in Flatside Wilderness. For  those visitors that Congressman Westerman referenced, the area also  includes the challenging and very popular Ouachita National Recreation  Trail, which bisects Flatside Wilderness.\n\nBack in 1984, under the leadership of former Arkansas Senator Dale  Bumpers and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…growing rapidly, and they have done it the old fashion way: They  have stolen every good idea that we have and used it to their own  devices, which has brought them to the challenging position they are in  for the United States. And they are a very different country than the  United States is.\n\nThe world, I think, is very quickly developing into a bipolar…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…and he said: She was beautiful; she was beautiful-- which I believe him. And he said she was complaining about the burden  and the paperwork of paying taxes on tips and how challenging it was.\n\nAnd he said he pulled out a pad of paper, and he just wrote on the  pad of paper: No tax on tips.\n\nHe said: What do you think of this?\n\nAnd she said: Great.\n\nAnd…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "Mrs. MILLER of Illinois. Mr. Speaker, I rise in strong support of  H.R. 6359, the Pregnant Students' Rights Act.\n\nMr. Speaker, college can be a challenging environment, especially for  pregnant women. Many feel forced to choose between motherhood and their  education. Nearly 30 percent of all abortions in the United States…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699318/pregnant-students-rights-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…team began with a  Google search relating to which Olympic-style sport a novice could  train for later in life. After what he describes as the singular most  incredible and challenging journey of his life, Dan has reached the  pinnacle of his sport.\n\nPennsylvania's 13th Congressional District is incredibly proud to  support Dan as he represents our community…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699851/us-elections-are-for-us-citizens"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…local communities. Danny served three years in the  United States Army, including 18 months in Vietnam during the Tet  Offensive of 1968, one of the most significant and challenging periods  in United States military history. His bravery and dedication were  recognized with numerous commendations, including the National Defense  Service Medal, Good…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…exiles, let her  tell you how cushy life was under Castro's Communist socialist  dictatorship.\n\nSalazar).\n\nMr. HILL of Arkansas.  She knows  the truth of postwar Korea and how challenging it was.  She compared the Korea of her childhood to the Korea of today:  Democracy, freedom, vigorous democracy, amazingly vigorous democracy in  Korea today. Mrs. Kim is…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…House Education and Workforce Committee marked up last week.\n\nCongress should also roll back burdensome regulations that further  handcuff our small businesses in an already challenging environment.  For the last 4 years, our small business owners navigated regulation  after regulation imposed by the Biden administration. President Biden  attempted to regulate…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…steadfast defense of democracy, and  unwavering commitment to the safety and prosperity of the Colombian  people.\n\nPresident Uribe assumed office in 2002 during one of the most  challenging periods in Colombia's modern history, a time marked by  violence, narco-terrorism, and instability. Through his bold and  visionary ``Democratic Security'' policy, President…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Regiment Headquarters Battalion,  expanding his technical and operational expertise in unmanned aerial  systems.\n\nMr. Moceri's service included multiple overseas assignments in  challenging environments. Early in his career, he joined a Special  Purpose Marine Air-Ground Task Force for operations in Norway, where he  participated in NATO exercises under Operation…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…economy. If we want to stay a global  leader, we must build the pipelines and power lines that move energy  from where it is produced to where it is needed. That is much more  challenging than it needs to be under current law in our country. I  know many of my colleagues across the aisle want to change that through  permitting reform. My legislation begins…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…the county and  state levels, where he successfully coordinated emergency procedures  and supported critical public safety decisions during one of Woodford  County's most challenging periods.\n\nThroughout his service, Mr. Oltman has dedicated himself to  strengthening emergency response capabilities and supporting those  around him. As a driver and Emergency…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697208/congratulating-mike-oltman-on-his-retirement-with-the-woodford-county-emergency-management-agency"}]