[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Minnesota legislator to chair the Tax  Committee in both chambers.\n\nHer career is marked by legislative achievements that strengthened  Minnesota's economy and communities. She championed fairer tax policy,  supported investments in public education, and worked to make  government more transparent and accountable. Most notably, she played a  central role in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697262/recognizing-state-senator-ann-rest-for-her-service-to-minnesota"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…labor in addressing  housing, healthcare, and education challenges. Additionally, he led  efforts to remove systemic barriers to union jobs for communities of  color and championed a public education campaign on the economic and  social benefits of organized labor.\n\nNow, as Secretary-Treasurer of the Greater Kansas City AFL-CIO, Mr.  Thomas continues…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…years at Anaheim Police, will be  retiring from law enforcement.\n\nIn 2019, Chief Armendariz joined the Anaheim Police Department.  During his time as chief, Chief Armendariz championed community  engagement, worked with local schools, and pushed to improve conditions  and resources for Anaheim's homeless population.\n\nMr. Speaker, I thank Chief Armendariz…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…she helped pass  over two dozen landmark laws that reshaped education, healthcare,  housing, and criminal justice to better serve people living with mental  illness.\n\nSue championed legislation to require mental health training for  teachers and expanded crisis and early intervention services. Thanks to  Sue's unwavering commitment to expanding culturally…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691125/recognizing-sue-abderholden"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the Orthodox  tradition's rich history and enduring presence in America. Their  commitment to faith, service, and fellowship reflects the very values  His All-Holiness has championed throughout his ministry.\n\nOn behalf of the 4th Congressional District of Virginia, I welcome  His All-Holiness Ecumenical Patriarch Bartholomew to Washington and  extend…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696208/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…plenty of  opportunities in the future to continue our good work.\n\nOne of those bills was S. 356, the Secure Rural Schools  Reauthorization Act of 2025, that for years I have championed with my  friend and colleague from Idaho Senator Crapo.\n\nAcross the West, this legislation has had bipartisan support because  it would reauthorize a crucial lifeline--particularly…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691667/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…during the period. State officials acknowledged in  court that over 99 percent of affected voters were U.S. citizens.\n\nNow, even Kansas's Republican secretary of state, who championed the  bill when he was a State legislator, has warned against it, saying:\n\nIt didn't work out so well.\n\nI would say so. About 12 percent of the people who tried to register…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…Mortensen, whose visionary leadership  has transformed public transportation across the Central Valley and  Northern California.\n\nFor more than three decades, Stacey has championed investments in  passenger rail that have connected communities, expanded opportunity,  and laid the groundwork for a more sustainable future. As Executive  Director of the…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Ontario-Montclair School District  board. She served on the board for 16 years before joining the Chaffey  College Governing Board in 1993. Under her leadership, Chaffey College  championed the expansion of the college from one to three campuses, the  opening of the Industrial Technical Learning Center, and the  development of critical support services.\n\nWhen…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…As  president of the Michigan Equal Suffrage Association, she worked  tirelessly to advocate for women's voting rights. Her activism extended  beyond the ballot box. She championed education, labor reforms, and  public spaces for children, ensuring that progress didn't just mean  progress for some. It meant progress for all.\n\nLucia Voorhees Grimes was…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…relaunch the bipartisan Agritourism Caucus with  Congressman David Rouzer to highlight the progress of this industry and  how we can continue to promote it. This was first championed by my  predecessor, Congresswoman Jennifer Wexton.\n\nMr. Speaker, I urge my colleagues to sign on to this bill and join  the caucus when we relaunch it so that we can champion…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…State of Illinois.\n\nI am proud to have worked alongside Amisha during her 15 years as the  executive director of Grassroots Collaborative, where we opposed school  closures, championed affordable housing, and fought for critical  investments to our social safety net.\n\nAmisha is a fighter for peace, justice, and community. As a three- time cancer survivor…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…way for generations of  women to follow in her footsteps, serving as a beacon of progress and  possibility.\n\nMrs. Benton's leadership extended beyond the classroom. She  championed innovation in education, built meaningful partnerships with  families and communities, and instilled in her students a lasting sense  of discipline, perseverance, and hope.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695981/recognizing-mrs-shirley-knox-benton"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…President of the Dallas Taekwondo Association, for his steadfast  dedication to Taekwondo as a vehicle for cultural diplomacy and  community empowerment.\n\nMr. Ko has long championed Taekwondo not only as an athletic  discipline but as a cultural bridge that fosters mutual understanding  and global citizenship. His work has nurtured countless students…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692626/recognizing-sangho-ko"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…programs. It reins in the Trump administration  and reasserts congressional oversight on the uses of funds by  increasing transparency requirements. It includes provisions I  championed to make sure lifesaving commodities and supplies purchased  with U.S. taxpayer dollars can't simply be destroyed.\n\nMs. MENG. Mr. Chair, while this bill won't right every…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…successful conclusion.\n\nMy friend, for instance, mentioned body cameras. I couldn't agree  more. It is something we added in the bill but something she advocated  for and championed. We agree on the need for additional training. There  is lots we can find in common as we try to work through this, and I  hope we are able to do that.\n\nThe important thing…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Award for  Exceptional Utility Management from the Association of Metropolitan  Water Agencies.\n\nTed also understood that public service extends beyond pipes and  pumps. He championed the transformation of Water Works Park into a  welcoming community space, helping to lead the development of the  Lauridsen Amphitheater and creating new opportunities for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…charitable contributions.\n\nThey are all being targeted by the D.C. Council. Specifically, the  D.C. Council is opting out of the following tax provisions that House  Republicans championed for all Americans: no tax on tips, no tax on  overtime, no tax on Social Security for senior citizens, no tax on auto  loan interest for certain personal car loan deductions,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to facilitate operations between the FDA and regulatory  authorities and innovators in Abraham Accords countries.\n\nLast but not least, this bill also includes a provision championed by  Representatives Dunn and Mullin that will ensure more affordable drug  options are available to patients faster rather than being delayed by  unnecessary red tape.\n\nMr.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…has been a steadfast advocate for  religious freedom and unity among Christians worldwide. He has  consistently called for the protection of religious minorities and has  championed the rights of Orthodox Christians to worship freely. His  efforts to promote dialogue between the Orthodox Church and other  Christian denominations have significantly strengthened…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Musser has led efforts to enhance  operational performance, strengthen Corning's global footprint, and  implement systems that drive long-term efficiency and growth. He  championed key improvements in productivity and efficiency,  institutionalized operational best practices, and built a strong  foundation for future leaders. His efforts have helped…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693658/recognizing-eric-musser-on-his-retirement-from-corning-incorporated"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…backbone of our Nation. It was inspiring.\n\nOn the Transportation and Infrastructure Committee, I saw the same  tenacious commitment to his beloved State of California as he  championed water rights and fought for the conservative values at the  very core of our American culture.\n\nDoug was a steadfast warrior for the country and State he loved. He  will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698718/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…through her deep expertise in ancient artwork.\n\nDuring her tenure, Dr. Wight curated landmark exhibitions,  strengthened the Museum's research and educational programs, and  championed initiatives that broadened public appreciation for the art  and history of glass. Her scholarly leadership and dedication to her  work have left a profound impact on the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697880/recognizing-dr-karol-b-wight-on-her-retirement"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…Christians.\n\nElected in October 1991, Ecumenical Patriarch Bartholomew has  continuously shown his desire for peace, even in the face of attacks  and persecution. He has championed international peace conferences,  bringing together Christians, Muslims, and Jews for the purpose of  alliance and understanding.\n\nHis efforts across multiple realms have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695849/welcoming-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…like to sit on the couch and play video games or  otherwise not contribute to their own welfare. Work requirements for  able-bodied adults were an important provision that I championed in  this bill, and I am glad we  got it done as part of this legislation. So able-bodied adults who  willingly refuse to work shouldn't expect a handout from the Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "…build peace and reconciliation among diverse faiths and nations. He has  convened conferences with Jewish and Muslim  leaders, strengthened Christian-Muslim relations, and championed  environmental issues worldwide. Because of this work, he is endearingly  known as the ``Bridge Builder and Patriarch of Peace.''\n\nHis All-Holiness's commitment to interfaith…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695394/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…served as Executive Director of the  Hult Center for Healthy Living and as Vice President of Community  Investments at the Heart of Illinois United Way. In those roles, he  championed data-driven community investments, built expansive volunteer  networks, and led public health and education initiatives, including  211, Success by Six, and Supporting Student…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Congress was clear: These RMPs must abide by the  multiple-use mandate.\n\nNow, ``multiple use'' is a term that is thrown around a lot in the  public lands discussions. It was championed by President Theodore  Roosevelt, who drew from his experience in his two ranches in North  Dakota, the Maltese Cross and the Elkhorn Ranch, and throughout the  West.\n\nAnd,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…other distributed ledger technology,       tokens, and tokenization.\n\nMr. Speaker, I rise today in support of H.R. 1664, the Deploying  American Blockchains Act of 2025, championed by my good friend and  fellow Florida Gator, Representative Cammack.\n\nThis legislation directs the Secretary of Commerce to take the  necessary actions to promote the competitiveness…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Indianola until his untimely passing on April  17.\n\nJay spent his life working to make Iowa a better place, from his  years as CEO of the Greater Des Moines Partnership, where he championed  economic growth across the metro, to his time as president of Simpson  College, where he put his students first every single day. He brought  energy, vision, and a heart…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}]