[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Jackson High  School Automotive Teacher Joseph Drury as Ohio's 13th Congressional  District Champion of the Week.\n\nJoseph was recently awarded a $50,000 prize for his school's skilled  trades program as a winner of the 2025 Harbor Freight Tools for Schools  Prize for Teaching…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…chronic nature of CIDP differentiates  long-term care from GBS patients. Adjustments inside the home may need  to be made to facilitate a return to normal life.\n\nI continue to champion key priorities of the GBS|CIDP community,  including cosponsoring H.R. 1143, the Medicare IVIG Access Enhancement  Act, that will facilitate home infusion for the treatment…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Congressional Black Caucus, proudly representing  New York's Ninth Congressional District located in Brooklyn, New York.\n\nI thank my colleagues--Congresswoman Joyce Beatty, a real champion  for the people of Ohio, and Congressman  Jim Clyburn, leadership  extraordinaire--for co-anchoring this Congressional Black Caucus  Special Order hour.\n\nMr. Speaker, I rise…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…indescribable.''\n\nEmily lives in the Fifth Congressional District of Massachusetts, a  district that is represented by House Democratic Whip Katherine Clark,  who is a strong champion on your behalf, Emily, powerfully, ethically,  and principally fighting hard on your behalf.\n\nKasey lives in the Second Congressional District of Maine, a district  represented…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…service,  leadership, and enduring impact on public education. Her legacy is one  of integrity, dedication, and a deep commitment to the belief that  every child deserves a champion. We thank her for her remarkable career  and wish her continued success in all her future endeavors.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Speaker, today, I rise to recognize Lisa Gissendaner,  who retired recently as the Canton Program Director for The Ohio State  University Young Scholars Program as this week's Champion of the Week  for Ohio's 13th Congressional District.\n\nThroughout her career, Lisa helped and supported countless students  in Canton City Schools who aspired to be the first…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691972/recognizing-lisa-gissendaner"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Madam Speaker, I rise today to honor the life and  legacy of David DePetrillo, a tireless champion for Rhode Island.\n\nFor over three decades as our State's tourism director, David made it  his mission to showcase the best of Rhode Island, including our  historic landmarks,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688521/9999"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…While  Trump and House Republicans push for new handouts for the wealthy, we  have massive cuts to Medicare, Medicaid, Social Security, and SNAP. The  same man who claims to champion the forgotten American is cutting  healthcare for the disabled, for children, and for seniors.\n\nThis is an administration that rules not with hope but with fear, and  it is…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…struggling to manage having a new baby,  balancing work, and having a work environment that does not support  their needs.\n\nOnce again, I thank Representative Luna for being a champion, as well  as Representatives Jacobs and Lawler for all of their work on this. We  won't stop until we finally get this done.\n\nBefore I am done, I acknowledge Sam, who has…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…calling on leaders of all religions to condemn violence and forswear  the use of religious justification for terrorism and mistreatment.\n\nHis All-Holiness is also a true champion of peace, tolerance, and  defense of the environment. His coming to Washington will highlight the  role that religious leaders play in pursuit of these goals and remind  us…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…the people of  Missouri's Fifth Congressional District, in congratulating Mr. Gerard  J. Grimaldi as he retires from a successful and impactful career,  having served as a champion and ally for our underserved communities at  the local, state, and national levels. Gerard's friendship, positivity,  and his infectious and distinctive laugh will forever…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to recognize Dan Molnar as the  Champion of the Week for Ohio's 13th Congressional District.\n\nThis year during the Akron Marathon, Dan, a local nurse practitioner,  was cheering his fiancee on when a runner collapsed…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696700/recognizing-dan-molnar-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…you know what this administration did? Instead of  accelerating those clinical trials, instead of offering funding for  that research to continue, instead of wanting to be a champion of the  cure for cancer, this administration cut that research, cut that  funding, and cut those clinical trials. They cut funding to educational  institutions, to colleges,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…than a  decade on the Washington State Supreme Court. Her tenure is marked by  an unwavering commitment to fairness, dignity, and equity for all. She  is a trailblazer, a champion for justice and a visionary leader in  Washington's legal community.\n\nAs the first Asian American, the first Latina, and the first LGBTQ+  justice to serve on our state's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…unmatched oratory--she was a tough  lawyer--she served our community for 24 consecutive years, often as the  only woman in the Ohio Senate. Can you imagine that?\n\nShe was a champion for working families and labor rights, a defender  of women's rights, and an early advocate for the equal rights  amendment. Her work helped create the Ohio Lottery to support…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…co-lead of  this legislation, Congressman Gerry Connolly, for his work on this  legislation. Congressman Connolly is a respected voice of authority on  this issue and a tireless champion for the U.S.-Taiwan relationship. It  has been an absolute honor to work with the Congressman on this  legislation and so many other issues.\n\nMr. Speaker, Gerry and his entire…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, today, I rise to offer my sincerest  congratulations to the 2025 Masters champion, Rory McIlroy.\n\nSince 1934, amidst blooming azaleas, towering pines, and flowering  dogwoods, the first full week of April brings the world's greatest  golfers to my hometown…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691315/congratulations-to-rory-mcilroy"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…will not  be forgotten.\n\nWalt's loss is profound, and it is impossible to overstate the impact  he had on the Veterans' community, his colleagues, and his family. A  true champion for Veterans, his legacy will live on in the work he did  and the countless lives he touched. Walt's commitment to serving his  fellow Veterans, his courage in the face of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…introducing the Leo K9 Protection Act, a  straightforward bill to strengthen the penalties for those who assault  or injure these animals in the line of duty.\n\nI am proud to champion the Leo K9 Protection Act alongside the  dedicated team at K9s United, whose tireless advocacy ensures that our  service animals are treated not just as tools but as heroes.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…winning streak. In their five wins during the World  Series, West Suburban outscored their opposition 15-1.\n\nIn the championship game, West Suburban defeated the central region  champion, Floyds Knobs of Indiana, 1-0. More than 1 million people  watched as West Suburban captured that victory. This makes the 2025  championship the most watched Little League…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and skill in the cutting horse profession. Punk has also won a state  cutting horse event alongside his daughter on Father's Day, making them  the first father and daughter champion duo on that special occasion. I  am pleased to recognize Punk for his dedication to serving our  community and being an upstanding leader to those around him.\n\nIt is an honor…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690761/recognizing-congressional-patriot-award-recipient-punk-carter"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…purchase commodity surpluses to feed the hungry around  the world. It was signed into law by another Kansan, Dwight D.  Eisenhower, in 1954. Later, Senator Dole became the key champion of its  reauthorization. Since its creation, Food for Peace has reached more  than 4 billion people in more than 150 countries using American-grown  commodities.\n\nAnother…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…party of blue-collar American workers.\n\nWell, in the spirit of bipartisanship, I encourage my Democratic  colleagues to join me in support of this resolution to protect and  champion hundreds of blue-collar American jobs in the heart of our  country. To my Republican colleagues, let's join together as a team and  end this war on hydrocarbons now.\n\nPresident…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…largely credited with  President Trump's unprecedented success with young voters in this past  election.\n\nBut he didn't just reach out to conservative students. He was a  champion of free speech for everybody.\n\nOver the past week, I have enjoyed seeing many, many, many videos of  Charlie's debates with college students all over our great country.\n\nThe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…1980 Lake Placid games, from February 13 to 24, 1980,       in Lake Placid, New York.\n\n(2) Team USA, comprised of collegiate players, defeated the       defending Olympic champion the Soviet Union 4-3 on February       22, 1980, in the final round of the 1980 Winter Olympics       men's ice hockey tournament.\n\n(3) The 1980 United States Olympic Men's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "John Carter", "party": "Republican", "sentence": "…WASSERMAN SCHULTZ. Mr. Chairman, I yield 3 minutes to the  gentleman from California (Mr. Takano), the distinguished ranking  member of the Veterans' Affairs Committee and a champion of our  Nation's veterans.\n\nMr. CARTER of Texas. Mr. Chair, I yield 2 minutes to the gentleman  from North Carolina (Mr. Murphy).\n\nMs. WASSERMAN SCHULTZ. Mr. Chair, I yield…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…challenges are often  magnified, she has gone above and beyond to ensure that every student  receives personalized support and opportunities to thrive.\n\nShe is a tireless champion for her students, ensuring their needs are  represented and addressed with compassion and integrity. Her  collaborative spirit and willingness to work alongside general  education…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…BLACKBURN. Mr. President, I thank my colleague from Florida for  bringing this resolution forward and for taking the time to honor a  true American patriot Charlie Kirk.\n\nHe was a champion for freedom, and he was a role model for millions  of young people across our country.\n\nAs my colleague had mentioned, he was a devoted husband to Erika and  an amazing father…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, although I am originally from Babylon, New  York, like a few in the gallery today, Pennsylvania is home to a  champion horse known as Smarty Jones.\n\nI rise today to celebrate one of the great horses our Commonwealth  has ever produced. Born and bred at Roy and Patricia Chapman's Someday  Farm…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694960/recognizing-smarty-jones"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…our duty to honor their memory and ensure that attacks like this  never happen again.\n\nWe must remain vigilant against the threats posed by extremist groups  and continue to champion freedom and democracy around the world. We  must also work to strengthen the Abraham Accords, push hard for Saudi- Israeli normalization, and ensure that Iran's plan to destabilize…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}]