[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the absurd  incompetence underpinning Trump's trade war: the pseudo emergency used  as an authority, the nonsense methodology used to justify the tariff  rates, or the ever-changing rationale about the reasons for starting  this tariff tantrum.\n\nThe tariffs have already triggered a stock market plunge, wiping out  trillions of dollars in value. That is…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…choose, and local governments to transition. While  I value the research, let's be honest about having more research that  is more objective and consider the full cost to changing our energy.\n\nAlmost 50 million Americans live within a mile of a refinery or a  heavy processing plant. Their public health costs are  disproportionately affected by what…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…proposed a  complete elimination of funding for Head Start. In Georgia alone, over  22,000 children would stand to lose out on the opportunity to  participate in this life-changing and transformative program.\n\nAs a mother who fights for the safety and success of every child in  America, I will not be silent in the face of these attacks. That is why…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…special relationship between the  United Kingdom and the United States. His work ensured that the ties  between our nations remain robust and responsive to the challenges of a  changing world, fostering collaboration on issues of shared importance  and reinforcing the values that unite us.\n\nNick's efforts extended far beyond the day-to-day responsibilities…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…it is getting  a little bit harder to laugh. That is because it is not a joke anymore.  It is a case study in misplaced priorities.\n\nMr. Speaker, when you start erasing or changing phrases like  ``climate change,'' ``equity,'' or ``disadvantaged communities'' from  government websites, when you ban them from scientific reports, then  you are not just…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Georgia for her extraordinary leadership for gun safety and public  safety in America.\n\nMr. Speaker, this bill would rip a dangerous new loophole in the Gun  Control Act by changing the definition of firearm throughout the entire  criminal code to exclude from coverage certain less-than-lethal but  still highly dangerous weapons, such as tasers, which…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. Speaker, I am pleased to support the Baby Changing on Board Act.  This bill requires Amtrak to install baby changing stations in  accessible bathrooms on new passenger rail cars and include clear  signage indicating the availability…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692157/baby-changing-on-board-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…investments that create good-paying jobs across  America, infrastructure, security. That money isn't so available  because it is tied up paying for interest.\n\nSo these trends are changing the role of those Senate cardinals--the  chairs and the ranking members of the subcommittees who help guide us  in the 12 different sections of spending. And, I will say,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…prioritized  access to education for students of all ages and backgrounds, fought  for college affordability, and invested in workforce development  efforts to meet the needs of our changing economy. Joe is a true public  servant, and generations of students will remember his dedication to  higher education long after his retirement.\n\nOn behalf of the people of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689302/recognizing-chancellor-joe-garcia"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…with this  House.\n\nWe go back to where we were in 1965 at the Edmund Pettus Bridge. So  much changed as a result of the lives that were lost and Bloody Sunday.  So much is changing now to revert back to that time when persons of  color had difficulty voting and difficulty winning office because there  is still hate in the hearts of many Americans.\n\nThey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this virtually all day long if you  let them.\n\nIt is a concern for many conscientious parents that what is being  broadcast on those cell phones could be life-altering and -changing for  young people, and that is one of the issues I will address this  morning.\n\nYou see, during the period of time when I chaired the Senate  Judiciary Committee, we considered…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Democrats, Mr. Speaker, we are here fighting for people like  Kim and millions of others like her all across the United States of  America who will lose urgently necessary, life-changing, and life- sustaining Medicaid benefits as a result of Donald Trump's one big,  ugly bill.\n\nWe hear from Maria from Iowa in the great heartland of this country.  Maria writes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…rigmarole you saw last night and today was  all designed to do a parliamentary end run around the Parliamentarian,  overruling the determination that this was not a rule, changing the  Congressional Review Act and the Clean Air Act, but without the proper  procedures under the Constitution that we are obliged to follow when we  are passing or amending…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…prohibiting a nuclear weapon.\n\nAgain, we must come together. I cannot say this enough: The  devastation and the consequences of any nuclear launch could be, again,  life-changing around the world. We must continue to strive for a world  free from the threat of nuclear war.\n\nI cannot thank enough my colleague, Mr. McGovern, as he commits to  banning…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694114/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…on its own, the use of       TASERs and other ``less-than-lethal projectile devices'' do       not constitute deadly force. Moreover, even if that were not       the case, changing the federal definition of a firearm to       exclude TASERs and similar devices would in no way impact       liability for using deadly force, because such liability…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Her answer was: I didn't think there were critical minerals there.\n\nMr. Speaker, it was the biggest find in the world.\n\nWe have an opportunity right now, today, to start changing these  disastrous Biden policies and get this economy turning. We must become  American energy independent and critical mineral dominant. We need to  be. COVID has taught…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694892/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…of H.R.\n\nMr. LATTA. Mr. Speaker, I have no further speakers, and I reserve the  balance of my time.\n\nMr. LATTA. Mr. Speaker, as has been pointed out, the technologies are  changing so rapidly, especially when looking at AI and blockchain and  how they are revolutionizing the private sector because of the  efficient security and transparency and what…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…individuals; they affect entire families and communities.\n\nBefore coming to Congress, I spent nearly 30 years in the nonprofit  healthcare field, assisting those with life-changing diseases and  disabilities.\n\nMost of my congressional district is rural, and many constituents  must drive long distances to get the care that they need. Some do not  have…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696840/national-rural-health-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…new pharmaceuticals,  and new methodologies to crash the price of healthcare. I get the crap  kicked out of me because armies of lobbyists don't like it when we talk  about changing their business model.\n\nRemember, several months ago, I came here to the floor and showed  that we came up with a math experiment of, in America, how many  duplicative MRI…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…century ago. Their hard work and dedication have ensured that Hoskins  Drug Store remains a beloved part of the community, staying true to its  principles while adapting to the changing needs of the times.\n\nToday, we celebrate the achievements of Hoskins Drug Store, Mr. and  Mrs. Hoskins, and the ongoing contributions of Mrs. Dudley Hoskins  Bostic and Mrs.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…50th anniversary of the Medina  County Career Center in Medina, Ohio, right in our district. The center  opened in 1974 as the Medina County Joint Vocational School before  changing its name to what it is today. The career center is a  partnership with six public school districts in northeast Ohio and  offers advanced career and technical education for…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689426/recognizing-medina-county-career-center"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for rehabilitation instead of incapacitation and deterrence is rooted  in ``a belief that there was nothing permanent or absolute about any  man's nature . . . and that by changing his environment, we could  permanently change man and usher in a great new era.''\n\nPresident Reagan was right. There is a place appropriately for  forgiveness and rehabilitation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually do the big chart, which is how many people are  actually in the labor force compared to how many people are receiving  benefits. Remember, I am not talking about changing people's benefits.  I am talking about dealing with the reality of our demographics and  ways we can deal with it, particularly when we start talking about  healthcare.\n\nLet's…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…clients from diverse backgrounds, notably the  large Eastern European community in Bucks County. Through her ability  to blend American and Eastern European techniques with ever-changing  trends, her business serves as a true asset to the salon industry in  the United States.\n\nWe are incredibly grateful for the impact Jenya Rahazhynskaya has had  throughout…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Earlier this month, my team had the honor of joining the Spokane  Fatherhood Initiative's Building Legacy gala, where our community  rallied to raise nearly $175,000 for life-changing programs.\n\nWith weekly classes, some lasting half a year, and special outreach  to men reentering society after incarceration or dealing with drug  addiction, Spokane Fatherhood…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the better.''\n\nThat was Charlie Kirk.\n\nWe must never allow the left to become our teachers. If we ever do,  we will lose our country. There will be no moral high ground, no  changing of minds, and no rebirth of faith and freedom that we so  desperately need.\n\nFree societies do not fear words and thoughts, even those that are  hateful, ugly, evil, or obscene,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…clinical research in my district at the University  of Iowa. As a physician, a legislator, and a member of the Rare Disease  Congressional Caucus, I have seen firsthand the life-changing impact  that medical innovation can have on patients battling rare diseases.  Iowa's first congressional district is home to clinical trials for  several rare diseases that…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…commonsense idea, and I encourage my  colleagues to support the amendment.\n\nMr. McGUIRE. Mr. Chair, talking about DOGE is a thinly veiled attempt  to score political points by changing the topic of the conversation  from this amendment, which protects our national security from foreign  entities of concern, and turning it into something political.\n\nThe previous…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…able to  invest more in his operations and grow his family business due to the  progrowth policies.\n\nI talked to a waitress in Cassopolis who called this legislation  life-changing because she will be able to pocket more of her hard- earned money thanks to no tax on tips and overtime.\n\nAs I travel across my district, it is clear that we are delivering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695325/delivering-for-hardworking-michiganders"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…characteristics. We need to protect the core  principles that make this country exceptional: liberty,  limited government, and the right to privacy.\n\nWe are on the verge of the next game-changing technological  evolution, and we must embrace this push for a more developed digital  economy. In doing so, we cannot jeopardize who we are as Americans, and  this bill is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}]