[{"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…together as Republicans and  Democrats to condemn political violence and, for that matter, violence  of all kinds.\n\nJust as an aside, I hope that the American people have a chance to  watch this particular debate because I think that it really illustrates  the unity and resolve that I think all of us must exhibit at all times.\n\nRepresentative Hortman…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692857/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…have the insulin pump, phone app and       other devices she has now to help her monitor her blood       sugar. ``I didn't have the easiest time with it, so if I get       the chance to maybe help other kids not have that, it's       really important to me,'' she said. ``I think that's a big       part of what keeps me involved with this stuff.'' Last…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…grandkids will fund a tax cut for Elon Musk. Now,  while I am proud that we are defeating a number of extremely concerning  provisions in this House bill, this is our last chance to stand up for  our values.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this big BS bill.  The American people are watching.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693237/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Representative McCaul in the Foreign Affairs Committee.\n\nMr. MEEKS. Mr. Speaker, Republicans who have complained about  executive overreach and rules distortions for years, now is the chance  to put their money where their mouth is. This is the time. The American  people will hold them accountable if they don't.\n\nDo you support the largest peacetime tax increase…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689861/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "Mr. IVEY. Mr. Speaker, I rise today with deep concern over the  weaponization of ICE by the Trump administration.\n\nJust this weekend, I had a chance to see Trump Border Czar Tom Homan  talking about how the administration is conducting the sweeps on the  streets and that they are doing it to prioritize public safety and…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…served for over 3  years.\n\nChief Colucci was a mentor to many. His legacy includes training a  good chunk of the current force, including the new chief, Marc Myers.\n\nI had a chance to work directly with Chief Colucci last year in an  effort to upgrade a 130-year-old railroad tunnel in the community that  was falling apart and was a real public safety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…howling at the wind, I guess,  because we don't have hundreds of billions of dollars to waste on a  system that you can calculate from elementary principles that doesn't  have a chance of working and has failed the majority of times it has  been tried.\n\nFor those who have not, please take the time to see a recently  produced movie called ``A House of Dynamite.''…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…sensitive drone technology, the  Predator drones, into the Middle East, selling them to Qatar. It is not  a coincidence that they are also willing to send him this jet.\n\nI had the chance this morning to talk to the Secretary of Defense  about this jet because one of the claims the administration has made is  that the jet is actually being sent to the U.S. Government.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…implemented key police reforms, including updates to the use-of-force  standards. She established the city of Tacoma's first Youth Commission,  giving high school students a chance to learn how government works. She  passed Home in Tacoma, which expanded key and necessary housing  opportunities across the entire city. She also raised our profile  nationally…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698197/recognizing-retiring-tacoma-mayor-victoria-woodards-for-her-years-of-service"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…goods, get to work, and move  around their communities. Prices are going up, not just in America's  heartland, but across our great country.\n\nRepublican leadership today had a chance to authorize year-round E15,  a commonsense blend of ethanol and gasoline, but guess what. They  walked away from it again.\n\nInstead, and I can tell you this for the farmers…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…sake of our children, we cannot be numb.  We need to understand that our children never can become numb. They  won't become numb. They can't move on because this is their one chance  to be an elementary school student; this is their one chance to be a  middle school student; this is their one chance to be a high school  student. When they witness, even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…thanks to  four Republicans, we can force a vote. When you listen to the argument  earlier from the gentleman from Texas (Mr. Pfluger), he said that  Republicans never had a chance to vote on the Affordable Care Act. This  morning, we want to give you a chance.\n\nSpeaker Johnson could end this crisis and bring the bill up. Instead,  they are wasting time…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698400/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…control of that oil to sell it  on the open market. That is a disastrous plan, as I have outlined, for  America and the world. And so I will just tell you that we will have a  chance to debate this plan if that appropriations measure reaches the  Senate, and I would commend my colleagues to take a look at it and  support it.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…vote for an  energy crisis that benefits nobody except big oil investors.\n\nSo beginning, colleagues, with Senator Kaine's resolution, the Senate  now has an opportunity, a chance to go to innovation and modernization  and bring an end to Trump's manufactured energy crisis. This is a  chance for the Senate to use innovation to fight for lower prices,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…country. We have a right to know       why a serial sexual predator was treated with more humanity       than we have ever experienced from our own government.\n\nYou now have the chance to be on the right side of history.       Unlike past administrations, you are uniquely positioned to       tell us that our voices matter and that we have finally been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…never tell anyone where I got those pictures,  so I am not going to tell you, but I still don't know how he had my  number the minute I got sworn in.\n\nHe has never missed a chance to get me to sing Utah's State song with  him whether we are in an airport or on the House floor or walking  through the tunnels. He never failed to accompany that with jokes…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698744/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Their impact goes far beyond fundraising. Whether promoting literacy,  supporting youth mental health, or investing in dental care, their work  ensures our children have the chance to thrive.\n\nMr. Speaker, I thank the State College Kiwanis Club for a century of  service and wish them continued success for the next 100 years.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691117/recognizing-state-college-kiwanis-club"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the big appropriation bills that have  to pass every year.\n\nHowever, once a year, and due to a quirk, three times in the 2 years  that this body is elected, we will have a chance to pass a bill with  only 51 votes in the Senate. That is what we just did with regard to  the One Big Beautiful Bill Act.\n\nObviously, there should be more changes to this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694922/passing-bills-with-51-votes-in-senate"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…them 3 years ago?\n\nI submit this is a paper tiger and that there is no substance in  their arguments or, if some substance, just a small amount.\n\nMr. Speaker, they had the chance. They had the power, and they didn't  use it to do what they want us to do today to fix their problems with  their so-called Affordable Care Act.\n\nMr. GRIFFITH.  Foxx) who…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…our trade  laws to combat unfair practices. Both functions are critical to our  safety and prosperity.\n\nOn market access, when American farmers and manufacturers have a fair  chance to compete against international firms, they always win. Whether  it is automobiles from Ohio, refined chemicals from Pennsylvania, or  soybeans from Iowa, our products are…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…endangering a child and released;  arrested again for shoplifting and released again without citation.\n\nTime and time again, the people in power in this country were given  the chance to stop them as if God Himself was begging them to do  something. Time and time again, they refused. And now, another American  family will have to live the rest of their lives…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…are right back to square one.\n\nSo, for that reason, I can't substitute his for mine because his is  going to be as dead as fried chicken here in a few days, and mine has a  chance to pass.                            Parliamentary Inquiry\n\nNow, Mr. President, I need some clarification, a parliamentary  inquiry, if you will: Do I understand that Senator…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…voice to the many who are commending President Trump as he works toward  peace in Ukraine.\n\nThe President recently gave the aggressor, Russian dictator Vladimir  Putin, every chance to put down his guns and end the killing. He has  done that over and over, but our President is now showing that he will  not wait on Mr. Putin forever. Every time Ukraine…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Chair, I thank the gentleman for  yielding me time.\n\nFor far too long, the Lumbee Tribe of North Carolina has been  wrongfully denied full Federal recognition, but today is a chance to  make it right.\n\nWith over 55,000 individuals, the Lumbee people are a core part of my  district and the great State of North Carolina. I am honored to be  their advocate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…provide the fuel at no cost to the  university. That is to those reactors that have met those stringent  requirements.\n\nMr. Chair, this advanced nuclear technology is the best chance for  America to beat China in the very important nuclear power race and  secure our Nation's future energy security.\n\nI urge my colleagues to support this amendment.\n\nGod bless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694865/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…all across  the country.\n\nIn the last few weeks, communities I represent in southeastern and  south central Missouri were struck by 19 deadly tornadoes and storms. I  had the chance to visit and talk with the people impacted. I saw  destroyed homes, tossed cars, and crop damage. I also saw how  neighbors, churches, and charities spring into action to provide…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…were ignored.\n\nI think the words from the North Slope trilateral are particularly  strong and powerful, and I thank them for their leadership on the  issues.\n\nThere is a good chance you will see Senator Sullivan and me here on  the floor of the Senate seeking to disapprove any administrative action  that unreasonably restricts access to public land in…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the strength of the community he's built around  it. He has created hundreds of family-sustaining jobs right here at  home. He's mentored young tradespeople, empowered second-chance  workers, and in doing so, restored something too many communities have  lost: the dignity of work, and the hope that comes with it.\n\nAt a time when much of our Nation's industrial…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…checklist of 14 factors to decide whether to pursue a fleeing suspect.  One of those factors even requires an officer to determine whether  anyone in the suspect's car had a chance to surrender a weapon. That is  absurd. Officers rarely have time or information to work through such a  checklist when a suspect takes off.\n\nThis legislation repeals those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…State of  Alaska, what is bad for American energy is bad for Alaskan energy.  Alaska holds over 100 trillion cubic feet of natural gas, and the  Alaska LNG project is our best chance to bring it to market. Yet,  burdensome Federal regulations discourage investment, keeping Alaska's  energy potential locked away.\n\nMeanwhile, Cook Inlet gas supplies are declining,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]