[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…prohibiting a nuclear weapon.\n\nAgain, we must come together. I cannot say this enough: The  devastation and the consequences of any nuclear launch could be, again,  life-changing around the world. We must continue to strive for a world  free from the threat of nuclear war.\n\nI cannot thank enough my colleague, Mr. McGovern, as he commits to  banning…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694114/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…summers are longer and  more intense. Back in the Tampa Bay area, we are trying to rebuild from  the most devastating hurricane season that we have ever experienced.\n\nThe changing climate isn't just about the weather. It is about your  wallets, and folks really need help. They need Republicans, in addition  to Democrats, looking out for them, not just…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…choose, and local governments to transition. While  I value the research, let's be honest about having more research that  is more objective and consider the full cost to changing our energy.\n\nAlmost 50 million Americans live within a mile of a refinery or a  heavy processing plant. Their public health costs are  disproportionately affected by what…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans,  especially those who may have difficulty leaving the house or who live  in extremely rural areas.\n\nWe can clearly recognize that after the pandemic, we must be open to  changing the way we provide care to everyone, especially veterans, to  reflect technological advancements, individual preferences, and the  necessity of expanding access to care. In…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…We want to restore that vision of that careful,  detailed, determined coordination so that we advance the best  strategies. And, of course, battlefield strategies are also changing  dramatically as we go--being able to adjust to this changing world.\n\nSo that is my hope, that building on the work the committee did  today--and hopefully those bills will…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…life for our Nation's veterans, spurred health  care business development and encouraged innovation across our  government.\n\nMedical innovations are only lifesaving and life-changing if new  technology and treatments can reach hospitals and clinics and if the  veterans who need care can afford them. Maryam's vision and expertise  helped facilitate the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…or Zach Bryan or everyone in-between,  the tide has turned, and the President knows it. That is why he is  slinking Bovino and other people out of town. That is why he is  changing his tune.\n\nBut what he says publicly is still fundamentally different from what  is going on today in Minneapolis. You still have 3,000 agents doing the  same list of things…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…communities through PEPFAR could       finally bring an end to HIV as a devastating public health       threat.'' Cuts to PEPFAR will prevent USAID from deploying       this game-changing tool. Dr. Atul Gawande, former Assistant       Administrator for Global Health, USAID\n\n``We're in the opposite place now. We're seeing babies born       again with HIV at…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…High has over  700 students enrolled and is now a leading institution for families in  Jefferson County. Through its 125-year history, the school has adapted  to meet the changing needs of its students through initiatives like the  Empowerment Academy, which provides specialized support to students who  require additional resources and increases equitable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695847/recognizing-arvada-high-school"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…with this  House.\n\nWe go back to where we were in 1965 at the Edmund Pettus Bridge. So  much changed as a result of the lives that were lost and Bloody Sunday.  So much is changing now to revert back to that time when persons of  color had difficulty voting and difficulty winning office because there  is still hate in the hearts of many Americans.\n\nThey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this virtually all day long if you  let them.\n\nIt is a concern for many conscientious parents that what is being  broadcast on those cell phones could be life-altering and -changing for  young people, and that is one of the issues I will address this  morning.\n\nYou see, during the period of time when I chaired the Senate  Judiciary Committee, we considered…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the absurd  incompetence underpinning Trump's trade war: the pseudo emergency used  as an authority, the nonsense methodology used to justify the tariff  rates, or the ever-changing rationale about the reasons for starting  this tariff tantrum.\n\nThe tariffs have already triggered a stock market plunge, wiping out  trillions of dollars in value. That is…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…companies and universities, and banners of the President's face that  would even make Kim Jong-un blush.\n\nThis is a toxic agenda, and the President knows it. That is why he is  changing the rules in the middle of the game. Need I remind you, 4  years ago, he demanded Georgia find him votes? Now, he is demanding red  States find him more seats in Congress.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…country.\n\nMr. Speaker, I thank the women who joined me here today to stand up  and highlight the powerful women of their home States and the impacts  that they have had on changing the course of history.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…hurt: the more than 140 million Americans who  don't have a passport, including Republicans, by the way.\n\nAs many as 69 million women who follow the traditional practice of  changing their name after marriage do not have a birth certificate that  matches their legal name. Republicans know this and want to use that  misinformation to block them from voting.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700013/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…able to  invest more in his operations and grow his family business due to the  progrowth policies.\n\nI talked to a waitress in Cassopolis who called this legislation  life-changing because she will be able to pocket more of her hard- earned money thanks to no tax on tips and overtime.\n\nAs I travel across my district, it is clear that we are delivering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695325/delivering-for-hardworking-michiganders"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…of H.R.\n\nMr. LATTA. Mr. Speaker, I have no further speakers, and I reserve the  balance of my time.\n\nMr. LATTA. Mr. Speaker, as has been pointed out, the technologies are  changing so rapidly, especially when looking at AI and blockchain and  how they are revolutionizing the private sector because of the  efficient security and transparency and what…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…reason, and it  is to protect sensitive technology from getting into the hands of bad  actors.\n\nHowever, when our laws were established, they did not take into  account the ever-changing technology, and so it is imperative that we  as a Congress act with urgency to update our laws and ensure that  China, Russia, Iran, and others do not have access to sensitive…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…background, and community. Many suffer in silence  out of fear of being judged or misunderstood.\n\nFor many years, this topic was highly stigmatized, but this is,  fortunately, changing. This month, I am honored to bring attention to  it. Mental Health Awareness Month is part of that  change and a reminder to prioritize rest, connection, and the things  that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…overnight around the world.\n\nFred Smith turned that idea into a global enterprise, revolutionizing  international supply chains, transforming how businesses operate, and  changing how people connect. Fred Smith not only directed and dominated  the modern logistics industry; he created it. For more than 50 years  after the conception of FedEx, he continued…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the better.''\n\nThat was Charlie Kirk.\n\nWe must never allow the left to become our teachers. If we ever do,  we will lose our country. There will be no moral high ground, no  changing of minds, and no rebirth of faith and freedom that we so  desperately need.\n\nFree societies do not fear words and thoughts, even those that are  hateful, ugly, evil, or obscene,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…have newfound  love and respect for the 60-vote threshold.\n\nMy point being, if we are going to change the body institutionally,  then let's have a real conversation about changing the body  institutionally.\n\nClosed rules, I get it. In the majority, we are sitting here, and we  have more closed rules. Do we want open rules? Then what will happen  when…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we try  to make the anti-firearm groups happy. It turns out we would meet their  requests, and then they would change their standard. The problem or the  disagreement kept changing.\n\nI don't know what the motivation is for playing games, but we bring  this to the floor with honest hearts. We want our brothers and sisters  not to die in this moment of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…College is the oldest private college in  Georgia, and its vision is to be an innovative institution,  holistically educating students to connect with and contribute to an  ever-changing world.\n\nCompeting in NCAA Division III, its athletic program has won national  and conference championships in baseball, basketball, golf, soccer, and  softball, instilling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694895/recognizing-lagrange-college-panthers-and-the-point-university-skyhawks"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 248) to require Amtrak to install baby changing tables in  bathrooms on passenger rail cars.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 248\n\nBe it enacted…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692155/baby-changing-on-board-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692594/recognizing-clint-jackson"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…you know me well enough to know that I speak the truth. And I  know the Trump family, and I know  President Trump really well. I have seen Eric Trump underneath my  vehicle changing the tire on my vehicle so far back in the woods that  you can't imagine how far away we were. They are good people, and they  are a good family, and God knows what he has…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…formal establishment of the Greater Hernando County Chamber of  Commerce on December 22, 1992.\n\nOver the past 100 years, the Chamber has evolved and expanded to meet  the changing needs of Hernando County's business community. Guided by  its Pillars of Success--Advocacy, Marketing, Networking, and Training-- the Chamber has become the largest and oldest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…Canine Companions, Paws of War, and America's  VetDogs, headquartered in my home state of New York, are leading the  way. They prepare and place service dogs that make life-changing  impacts, while continuing to stand behind each partnership well beyond  the first match. This month is an opportunity to educate the public  about the vital role service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695913/recognizing-september-as-national-service-dog-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…give people the placebo and not  give them access to the drug.\n\nWe have 40,000 people who die in this country every year on our  roads. Many, many others suffer serious life-changing injuries. Every  American pretty much has been affected in some way, knows someone who  has been involved in an accident, and we now have the technology within  our reach…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]