[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in strong opposition to this bill.\n\nThis year, Minnesota has witnessed a state of unbelievable violence,  which has led to chaos and terror at the hands of President Trump and  DHS.\n\nMinnesotans are being racially profiled on a mass scale, assaulted on  our streets, and kidnapped from our communities.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699348/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…and across America, working people across the country, to  defend the Americans who are fighting to keep a roof over their heads  and food on their table and can't afford the chaos that is ensuing in  their lives.\n\nI shouldn't be standing for them by myself. They are who we all  should be fighting for. They are the ones who sent us here to represent…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…article I. The executive responsibility is to be the Commander in  Chief. Once Congress--535 people--has declared war, you don't need 535  Commanders in Chief. That would lead to chaos. So a war once declared  by a debate and vote by the people's elected body then gets handed to  the President, who as Commander in Chief is responsible for executing  on that…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…that he told the American people on day one,  inflation would go down. Prices would go down on day one, he said.  Instead, what the President has done is, unleashed an economic chaos on  the American people. Recessions are normally caused by complex factors  like oil price shocks, overleveraged financial markets, or global  pandemics.\n\nThis new economic…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…This is especially concerning at a time when we are hearing more and  more stories about the damaging impacts of Trump's extreme tariffs, the  rising cost of groceries, and the chaos and uncertainty that Trump is  bringing every day to our economy.\n\nPeople are concerned about a Trump recession. That is what they are  worried about today. That is what I…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Exporting more fossil fuels mean families pay more at the pump, and  they pay more to heat their homes. That is Trumpflation.\n\nAnd burning more fossil fuels intensifies climate chaos and wildfires  and  hurricanes. It blows the top off the cost of insurance for people's  homes as insurers flee the markets. That is Trumpflation.\n\nMeanwhile, fossil fuel companies…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…office when there was no energy emergency.\n\nHe is denying funding for innovative, promising projects. He is  stopping nearly complete offshore wind projects. He is creating chaos.  It makes America weaker.\n\nAnd so I urge my colleagues to vote to end the Trump energy emergency  and recommit to finding real solutions to lowering energy costs for  consumers…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…last several months, not only  has he not made it more efficient, but he has mired the Federal  Government in constant litigation and constant dismantling, disruption,  and chaos of our agencies.\n\nNow, he is telling us that he is going to leave the Federal  Government in just a few weeks to expand his data and AI operations, as  he announced last week,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689400/demanding-answers"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…counsel.  They are parents doing school drop-offs, workers heading to their jobs,  and longtime neighbors who strengthen our communities.\n\nTrump promises safety, but he delivers chaos. Cruelty is not law  enforcement. It is intimidation, and the harm goes beyond our immigrant  families.\n\nIn Portland, an elementary school had to relocate students because…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…illegal action he takes is designed to spite  Congress and make sure his dark vision comes to pass.\n\nRuss Vought wants a shutdown. He wants the country to continue  spiraling into chaos so that he can keep stealing from our communities  and dismantling Congress' power of the purse.\n\nI stand ready to move forward to fund the government in a bipartisan  way,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…watching the President take  the oath of office, I couldn't help but ponder the final question that  Dr. King pondered in the last year of his life: Where do we go from  here? Chaos or community.\n\nDr. King asked this question after the victory of the Civil Rights  Act and after the victory of the Voting Rights Act. He pondered what  the Black community…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I can tell you exactly what is going on in  Louisville, Kentucky, right now. Grocery prices are up, and retirement  savings are in chaos.\n\nRepublicans could put an end to this crisis, but instead, they are  going to make things worse.\n\nRepublicans are about to hand billionaires like Elon Musk $5.3  trillion…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689901/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Americans, Republicans are wasting time with this  resolution.\n\nAs far as I can tell, the only beneficiaries of today's resolution  are foreign manufacturers. If Republicans create chaos and uncertainty  by revoking this Department of Energy rule, they will create an  opportunity for cheap foreign imports, with misleading claims about  performance, to flood…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Dobbs would simply  return the issue of reproductive rights to the State was always  disingenuous. States across the country have created a full-blown  healthcare crisis in the chaos and confusion that has ensued.\n\nSince Dobbs, more than 31 million women live in States where abortion  is banned or under the threat of banning it, and nearly 9 million women…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…built over centuries, and both parties must work  together to protect the things we love.\n\nThese two proposals before you are misguided. This Chamber should not  deepen the chaos it has already created. Instead, we should be working  together to pass legislation that resolves land management conflicts  and restores stability to our public lands planning…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…just look at the gas  pump. I mean, the gas pump is down substantially.\n\nHere is the problem: With your baseload energy production, the past  administration threw it into total chaos because we know that baseload  is the only way that we can reliably produce the electricity and the  demand in the future that we are going to need to expand this economy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…5, 2024, America endorsed the  greatest political comeback in modern history by electing President  Trump the 47th President of the United States. The country rejected the  chaos sowed by the Biden-Harris administration for the past 4 years and  voted for the candidate that could lead our country and make America  strong again. On day one, President…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…America into her  next golden age.\n\nOver 40 days, that is how long the government has been closed. For  over 40 days, Democrats here in this body and in the Senate have chosen  chaos over our country. They chose to shut the government down because  politics demanded it, not policy.\n\nThe elites who dominate their party's decisionmaking are the ones  least…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696677/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Slaughter and the 116th were part of the first wave on the  beaches. Mr. Speaker, when you watch the opening scenes of the film  ``Saving Private Ryan,'' you will see the terror and chaos the men of  the 116th saw.\n\nMr. Slaughter was one of more than 34,000 Americans who stormed the  beach over the several days of the operation and faced heavy artillery  from…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…abruptly closed off 225,000 acres of Federal  land in the Duluth Complex for mineral development, he threw a future  of American abundance, security, and global leadership into chaos. The  decision undermined America's economic, military, and strategic  interests and those of our allies.\n\nThe minerals in the Duluth Complex are called ``critical'' for a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…this bill in the spring, I have heard from energy  leaders across Ohio--energy co-ops, utilities, manufacturers, and grid  operators--who all say the same thing: Regulatory chaos driven by  climate activists is putting grid reliability at risk and driving up  costs.\n\nJust look at this map I have with me today. You can see for yourself  how shortsighted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…say this to every police officer,  firefighter, EMT, dispatcher, and emergency responder: I thank them for  their service. They are the thin gold line that separates us from  chaos. They are the reason that our Constitution is more than words on  paper.\n\nMr. Speaker, to every Gold Shield family, their loved one's service  mattered. The sacrifice of their…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and I agree on how we opened this, but not on much  more this morning because we see a different view on this 100th day  that is marking Trump's service in office, 100 days of chaos,  corruption, and economic sabotage. After these 100 days, House  Republicans are wasting time on cynical Congressional Review Act  resolutions instead of addressing the economic…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…the democratically elected members of Burma's  Government were deposed by the military junta. As we approach almost 5  years since the military's unlawful seizure of power, chaos has  overtaken Burma. Since the coup, more than 6,000 people have been  killed, 20,000 detained, and more than 3.5 million displaced from their  homes.\n\nCaused directly by…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697195/no-new-burma-funds-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…lows this weekend in my State of North Dakota  are forecasted to be 20 degrees below zero. Having heat provided by  natural gas is literally the difference between comfort and chaos, and,  yes, between life and death in States like mine.\n\nIf we want affordable and dependable energy in our country, then we  must build the infrastructure that delivers it.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…mission.\n\nLet's remember who we are dealing with here. The Iranian regime is  the world's foremost sponsor of terror. They have funded monsters,  sponsored violence, and sewn chaos far beyond their borders. Their all- consuming obsession is the obliteration of America's principal ally in  the Middle East, and they have avowed death to America itself.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…when you take your  foot off the gas. People die. Families are destroyed, and communities  suffer.\n\nThis resolution does nothing to promote peace. It invites danger,  continued chaos, and the loss of more American lives--more American  lives.\n\nIt tells terrorists and cartels that the United States Congress is  willing to tie the hands of our Commander in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Why? It is because college sports is on a downward  trajectory, and the magic of what used to make it special is gone.\n\nNow the House v. NCAA settlement will unleash even more chaos with no  plan to protect small schools, Olympic sports, or competitive balance.  That is why tonight I am introducing the Restore College Sports Act. It  replaces the NCAA…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689618/protect-college-sports"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…similar  moments in the late 1930s, when the fascist states of Germany and Italy  teamed up with the imperialist state of Japan to form the Axis and to  plunge the world into chaos.\n\nI have often asked myself: Would I have seen and known what was  around the bend, what was happening next?\n\nWell, to know the future, you need to know the past, and I have…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Congress has the power  of the purse. If we don't like what a President is doing in terms of  military engagement, we can stop the funding for that engagement.\n\nJust think of the chaos that would ensue in this country if there  were not one Commander in Chief but 535, and we had to sit down and  talk among ourselves and debate as to whether or not we should…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}]