[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump and Russell Vought have  made clear they want to continue launching partisan broadsides that  will inflict deep harm on the American people, raising costs,  unleashing chaos, inviting even deeper corruption across the Federal  Government.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…It is that simple.\n\nToday, I ask my colleagues to join me in voting for this package.  Let's pay our troops, fund clinical trials right now, work to rein in  DHS, and end the chaos that is happening on America's streets.\n\nMrs. MURRAY. Mr. President, this amendment would strike funding for  one Member's project simply because the Senator offering the amendment…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699437/consolidated-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Portland. These deployments are a flagrant violation  of U.S. law, including the Posse Comitatus Act, as noted in recent  court decisions. Not only have these deployments created chaos in  American cities and communities, they have also pulled the military  away from its mission and expended funds meant to defend our Nation.  Senator Warren and I, along with…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…built over centuries, and both parties must work  together to protect the things we love.\n\nThese two proposals before you are misguided. This Chamber should not  deepen the chaos it has already created. Instead, we should be working  together to pass legislation that resolves land management conflicts  and restores stability to our public lands planning…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…too much time protecting tax breaks for millionaires and  billionaires, blocking reforms that would help families, and  threatening government shutdowns that only add to more chaos. I would  also mention the no tax on overtime that they have so happily touted  doesn't really help so many people in organized labor. We do have a  bipartisan fix for that,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…more  to support and protect all of our Federal first responders.\n\nThese public servants dedicate their lives to serving the American  people. The administration has created chaos and confusion that adds to  the difficulty of their jobs through Federal hiring freezes, which have  left them short-staffed.\n\nIn addition to showing our appreciation for these…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…in the United  States. These lawless terminations hamstring American competitors,  drive up energy costs, and hurt domestic manufacturing.\n\nBut this is nothing new for this chaos administration, which has  already prevented hundreds of thousands of clean energy megawatts from  getting onto the grid. That is more than $42 billion in private sector  clean…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Dobbs would simply  return the issue of reproductive rights to the State was always  disingenuous. States across the country have created a full-blown  healthcare crisis in the chaos and confusion that has ensued.\n\nSince Dobbs, more than 31 million women live in States where abortion  is banned or under the threat of banning it, and nearly 9 million women…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…and across America, working people across the country, to  defend the Americans who are fighting to keep a roof over their heads  and food on their table and can't afford the chaos that is ensuing in  their lives.\n\nI shouldn't be standing for them by myself. They are who we all  should be fighting for. They are the ones who sent us here to represent…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…present, I would have voted  no. Overturning California's Clean Air Act waivers is a climate setback  of massive proportions that will delay much-needed actions to abate  climate chaos. By expanding the scope of the Congressional Review Act  to accomplish this, the Senate has created a new process to undermine  the ability of States to innovate and invites…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692393/vote-explanation"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…all  of the people I represent across the Great Lakes region, the industrial  and agricultural heartland.\n\nTrade policy must be targeted carefully, and it should never cause  chaos. That is exactly what it is doing, causing chaos. Let me state  plainly: Tariffs on our Canadian allies are foolish. The businesses and  people of northwest Ohio and all of…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…can operate with ``absolute immunity.''\n\nCongress has a choice this week. My Republican colleagues can sign  over another blank check to Kristi Noem and ICE and endorse this chaos  and lawlessness, or Congress can do our job and stop these lawless,  masked, armed agents from terrorizing another community.\n\nPeople want action. Alex deserves action. I…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the country about the consequences of Trump's actions--the firing of  people, what they are trying to get our schools to not teach--and they  have told us in two words: ``It's chaos.'' Much like everything else  Trump touches and does, chaos follows.\n\nJust this week, Homeland Security agents terrorized a group of  teachers from the Philippines living and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…criminal activity.\n\nMr. Speaker, we ignore the ongoing crisis in Haiti at our own peril.  We have a duty to make sure that we identify and hold accountable those  who perpetuate chaos.\n\nI thank my colleagues for working in a bipartisan manner because this  is the right thing to do, and I encourage my colleagues to join me in  supporting this bipartisan measure.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…which has 20 times as many  undocumented immigrants as Minnesota, or Florida which has 12 times as  many.\n\nInstead, President Trump and Secretary Noem have brought fear and  chaos to the Twin Cities and across Minnesota with this  disproportionate and punitive surge. I want to state for the record  what is happening on the ground in my state.\n\nMinnesotans…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…just look at the gas  pump. I mean, the gas pump is down substantially.\n\nHere is the problem: With your baseload energy production, the past  administration threw it into total chaos because we know that baseload  is the only way that we can reliably produce the electricity and the  demand in the future that we are going to need to expand this economy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…this bill in the spring, I have heard from energy  leaders across Ohio--energy co-ops, utilities, manufacturers, and grid  operators--who all say the same thing: Regulatory chaos driven by  climate activists is putting grid reliability at risk and driving up  costs.\n\nJust look at this map I have with me today. You can see for yourself  how shortsighted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…America into her  next golden age.\n\nOver 40 days, that is how long the government has been closed. For  over 40 days, Democrats here in this body and in the Senate have chosen  chaos over our country. They chose to shut the government down because  politics demanded it, not policy.\n\nThe elites who dominate their party's decisionmaking are the ones  least…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696677/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…D.C., that cares about the  everyday Americans who make America work every single day.\n\nFinally, I will say this about our President. My entire lifetime, I  have watched the chaos in the Middle East created by one nation, Iran.  They wreaked havoc on the region. They undercut the idea of democracy,  let alone freedoms, not only around the nations that…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…abruptly closed off 225,000 acres of Federal  land in the Duluth Complex for mineral development, he threw a future  of American abundance, security, and global leadership into chaos. The  decision undermined America's economic, military, and strategic  interests and those of our allies.\n\nThe minerals in the Duluth Complex are called ``critical'' for a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…mess. No. It is the Republicans who have to clean  up the Democrats' mess.\n\nUnder the Biden-Harris administration, they waged war on American  energy, opened our borders to chaos, and drove inflation through the  roof, all while families struggled to keep up.\n\nThat is exactly why Americans were fired up at the ballot box last  November. The American…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…They are going  to vote again--they are whipping their votes--so they would not be  paying Federal workers and won't be funding essential programs like  SNAP and undoing the chaos at our airports.\n\nI spent the last 43 days in my district talking with these groups,  talking with SNAP, talking with Head Start, seeing their pain,  realizing it, understanding…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696737/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and I agree on how we opened this, but not on much  more this morning because we see a different view on this 100th day  that is marking Trump's service in office, 100 days of chaos,  corruption, and economic sabotage. After these 100 days, House  Republicans are wasting time on cynical Congressional Review Act  resolutions instead of addressing the economic…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…the democratically elected members of Burma's  Government were deposed by the military junta. As we approach almost 5  years since the military's unlawful seizure of power, chaos has  overtaken Burma. Since the coup, more than 6,000 people have been  killed, 20,000 detained, and more than 3.5 million displaced from their  homes.\n\nCaused directly by…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697195/no-new-burma-funds-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and abroad.\n\nNeedless to say, 4 years of recordbreaking illegal immigration at our  southern border, under President Biden, left a gaping hole in our  national security. The chaos that raged at our southern border was an  invitation to terrorists and criminals, and law enforcement was  stretched thin trying to deal with the flood of illegal immigration.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689044/border-security"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…repeatedly,  that the violence was only concentrated in part of L.A. and that we  need to zoom out and look at the city as a whole.\n\nFor the folks who had to deal with this chaos in downtown L.A., it is  little comfort to them that things might have been more serene in  Beverly Hills.\n\nMy colleague from California uses the term ``hellscape'' for L.A.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…when you take your  foot off the gas. People die. Families are destroyed, and communities  suffer.\n\nThis resolution does nothing to promote peace. It invites danger,  continued chaos, and the loss of more American lives--more American  lives.\n\nIt tells terrorists and cartels that the United States Congress is  willing to tie the hands of our Commander in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…aliens, unvetted illegal aliens, including dangerous, violent  criminals.\n\nThe woke policies of Democrat-run sanctuary cities, fueled by woke  politics, have become magnets for chaos, stretching public resources to  the brink, and crowding out citizens who actually follow the law.\n\nWhat happens? Well, it often depletes the public resources meant for  U.S.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…similar  moments in the late 1930s, when the fascist states of Germany and Italy  teamed up with the imperialist state of Japan to form the Axis and to  plunge the world into chaos.\n\nI have often asked myself: Would I have seen and known what was  around the bend, what was happening next?\n\nWell, to know the future, you need to know the past, and I have…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…mission.\n\nLet's remember who we are dealing with here. The Iranian regime is  the world's foremost sponsor of terror. They have funded monsters,  sponsored violence, and sewn chaos far beyond their borders. Their all- consuming obsession is the obliteration of America's principal ally in  the Middle East, and they have avowed death to America itself.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}]