[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…GrassRoots wasn't just a business. It  was part of the rhythm of Newark, a reminder that local businesses  create connections and build community.\n\nAs GrassRoots closes this chapter and Marilyn begins a well-earned  retirement, Delaware wishes her all the best and thanks her for her  years of community service and creativity.                         Recognizing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Mr. President, I was necessarily absent for rollcall vote  No. 632, H.J. Res. 131, a joint resolution providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Bureau of Land Management relating to ``Coastal Plain  Oil and Gas Leasing Program Record of Decision.'' On…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697695/vote-explanation"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…January 22, the Trump administration  forced the National Park Service to remove panels at Independence Hall  National Park, the cradle of our liberty, telling an important chapter  in George Washington's Presidency.\n\nEarly in our Nation's history, Philadelphia was our Nation's Capital,  and when Washington moved to the President's house near Independence…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…methane emissions exceed a threshold specified by law.\n\nEstimated revenue effects of H.J. Res. 35, a joint       resolution providing for Congressional disapproval under       chapter 8 of title 5, United States Code, of the rule       submitted by the Environmental Protection Agency relating to       ``Waste Emissions Charge for Petroleum and Natural Gas…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…are published under this       section, the Secretary shall publish final regulations       implementing this Act.\n\n(d) Paperwork Reduction Act.--The requirements under       chapter 35 of title 44, United States Code (commonly known as       the ``Paperwork Reduction Act''), shall not apply to any       action to implement this Act.       SEC. 8. CONFIDENTIALITY…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…of  State Cathy Cox; Excellence in Community Award from the NAACP; the  Trailblazer Award from 100 Black Men of Albany; Citizen of the Year  from Omega Psi Phi--Eta Omicron Chapter; the Liberty Bell Award from  the Dougherty County Bar Association; a Certificate of Special  Congressional Record from yours truly for his leadership in Stop the  Violence…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…2012 Martin  Luther King Jr. Achievement Award from Inter-Civic Council of the  Southern Christian Leadership Council; 1996 Commitment to Excellence  Award from Mid-Florida Chapter of NFBPA; 1992 Summit Award from the  Women's Source Center; and Life Time Achievement Award from the  Metropolitan Orlando Urban League.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…President, I was absent, but had I been present, I  would have voted no on rollcall vote No. 623, H.J. Res. 130, a joint  resolution providing for congressional disapproval under chapter 8 of  title 5, United States Code, of the rule submitted by the Bureau of  Land Management relating to ``Buffalo Field Office Record of Decision  and Approved Resource Management…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697183/vote-explanation"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…and earn their trust. Emma's hard work has ensured every New Dem  Member and their staff has the tools, knowledge, and resources they  need to succeed. As she starts her next chapter, Emma should know she  has made an indelible mark on our Members and the Coalition.\n\nWhile we will deeply miss her at New Dems, I am so proud and excited  to see her step…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…trigger, and  increase cancer-causing pollution without consequence.\n\nThe Clean Air Act is an incredible public health success story, and  we are at risk of writing a new, dark chapter in this law's history.  There have been five decades of strong, bipartisan support in Congress  for the law, which has allowed us to make steady progress to reduce air  pollution…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…contributions to the University and our community  are immeasurable. He has built an incredible legacy that will  strengthen and inspire future generations.\n\nAs he embarks on the next chapter, I extend my deepest gratitude for  his decades of service and unwavering leadership. On behalf of the  University of Rochester community and all those who have benefited…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690121/recognizing-peter-robinsons-retirement"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…steadfast  commitment to Minnesotans living with disabilities and mental  illnesses.\n\nFor the past 24 years, Ms. Abderholden has served as Executive  Director of the Minnesota chapter of the National Alliance on Mental  Illness.\n\nUnder her leadership, our state has become more compassionate, more  informed, and more responsive to the needs of those facing…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690723/recognizing-sue-abderholden-for-her-work-on-behalf-of-those-with-disabilities-and-mental-illnesses"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…institutions of higher education  and State Departments of Education to create seamless transitions into  the education field.\n\nIn Virginia, over 70 schools have an Educators Rising Chapter that  contributes to ending the teacher shortage in America, including eight  in Virginia's 4th District. Since 1994, over 325,000 students have  participated in Educators…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688484/recognizing-the-10th-anniversary-of-educators-rising"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…immigration reform.\n\nMr. Speaker, we cannot allow these abuses of power and lawless  actions to continue. We must all speak out. Let's work together to put  an end to this ugly chapter in our country's history.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Kick-off at AT&T Stadium, to its many ``Done in a  Day'' projects, JLA consistently answers the call to serve families,  women, and children in need.\n\nAs the League begins a new chapter in its new home at Wellspring on  Main--The Arlington Center for Community Engagement--it reaffirms its  dedication to building stronger, more inclusive communities. Through…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…earned a reputation not only for its design expertise but also for  its enduring client relationships through many generations.\n\nNow, as Bucks Country Gardens enters a new chapter, Mr. Hebel looks  with pride to his sons, Gregory and Ryan Hebel, who together represent  the next generation of leadership. Gregory, who oversees the company's  design-build…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…commitment to advancing agriculture education  through their comprehensive learning model.\n\nLuke earned his national secretary position after serving as the  Felicity-Franklin chapter officer and Ohio State officer for 2 years.\n\nIn addition to his service in the FFA, Luke is currently pursuing a  degree in agriscience education at the Ohio State University.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691474/recognizing-luke-jennings"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Economic Development Course at Auburn  University. He is also a graduate of Wallace State Community College  and Athens State University.\n\nRetirement marks the close of one chapter and the beginning of  another, but the impact of Dale Greer's work will continue to be felt  for decades to come. His leadership, service, and devotion to Cullman  County…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, pursuant to House Resolution 879, I call  up the joint resolution (H.J. Res. 131) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Bureau of Land Management relating to ``Coastal Plain  Oil and Gas Leasing Program Record of Decision'', and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…commercial radio station. She ran WJNZ, which is now known as  WREB and serves Greencastle to this day. In 1996, she received the  Lifetime Achievement Award from the Indiana Chapter of American Women  in Radio and Television.\n\nJinsie Bingham retired from broadcasting in 1994 but continues to be  active in the Greencastle community to this day. She is…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…The sacrifices made by military families are  profound, and their strength and resilience are vital to the success of  our armed forces.\n\nAs Mr. Austin embarks on this next chapter, I wish him and his family  a future filled with peace, joy, and well-deserved rest. The United  States Army Reserve--and indeed, our Nation--is better because of his  service.…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Mr. GRIFFITH. Mr. Speaker, pursuant to House Resolution 177, I call  up the joint resolution (H.J. Res. 42) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Department of Energy relating to ``Energy Conservation  Program for Appliance Standards: Certification Requirements,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Corrigan  for his decades of committed service to the Des Moines community and to  the people of Iowa. We extend our best wishes to him and his family as  he enters this next chapter.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…retire from KETV, his absence will be noticed not  just by the numerous people he covered but by the audiences who relied  on his accurate stories.\n\nWherever Andrew's next chapter takes him, his integrity, compassion,  and commitment to storytelling have left a mark on our State that will  endure for years to come.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…opportunity to  proceed to.\n\nThe other would be Senator Curtis's Congressional Review Act, S.J.  Res. 31, a joint resolution providing for the Congressional disapproval  under chapter 8 of title 5, United States Code, of the rule submitted  by the Environmental Protection Agency relating to ``Review of the  Final Rule Reclassification of Major Sources As…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…4 of the Endangered Species Act of 1973       (16 U.S.C. 1533).\n\n(c) Savings Clauses.--Nothing in this Act shall preempt       rights or obligations under subchapter II of chapter 5 of       title 5, United States Code (commonly referred to as the       ``Administrative Procedure Act'').\n\nMr. WESTERMAN.  1001, the bill now under  consideration.\n\nMr.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Field during Green Bay Packer home games.\n\nMr. Speaker, I thank Bill for his many years of service to northeast  Wisconsin and congratulations on his retirement. May this next chapter  be as fulfilling as the legacy he leaves behind.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688600/recognizing-bill-jartz-the-voice-of-lambeau-field"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…economic opportunity, human dignity, and community well-being.  I congratulate Don on his retirement and wish him, his wife Kim, and  their two daughters all the best in this next chapter of life.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…and events across the district  to supporting veterans, Amy has been far more than an asset--she has  been family.\n\nMr. Speaker, I am excited for Amy as she enters the next chapter in  her life and am extremely grateful to her husband, and former staff  member, Josh, for sharing Amy with us for all these years. I also want  to recognize Josh and Amy's…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, pursuant to House Resolution 242, I call up  the joint resolution (H.J. Res. 75) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Office of Energy Efficiency and Renewable Energy,  Department of Energy relating to ``Energy Conservation Program:…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}]