[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…see      Behind the scenes of liberty      Even though this class' end is near,      We are grateful for our fall term here      Throughout votes, runs and UC requests,      Chaplain Doctor Black makes sure we're blessed\n\nMr. BOOKER. Mr. President, you will enter all the page poems because  they are so good. So for the rest of time, it will be noted in…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…serves the city of Yonkers as director of Veteran  Services, commissioner for the city's Human Rights Commission, as a  member of the Yonkers Auxiliary Police, and as a police chaplain for  the Yonkers Police Department.\n\nHe has served with distinction as a United States Marine for 4 years  on Active Duty and 2 years in the Reserves. A native of North Carolina…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696971/recognizing-reverend-william-e-norman-sr"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to congratulate Lieutenant  Colonel Chaplain Reverend Dr. A'Shellarien Addison on her recent  promotion at the Delaware Army National Guard.\n\nEarlier this month, I was honored to attend her promotion ceremony  and celebrate…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…area. He is always a welcoming and  friendly face who is known for buying pizza for the neighborhood kids  or opening up the gym for pickup basketball games.\n\nHe is also the chaplain for both the Worcester Police Department and  the Worcester Fire Department. He cares deeply about our immigrant  community.\n\nDay in and day out, Father Jonathan lives out…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700103/welcoming-reverend-jonathan-slavinskas"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, I rise today to recognize Father Paul  Shaughnessy and to welcome him as our guest chaplain for today.\n\nI first met Father Shaughnessy at the College of the Holy Cross in  Mr. McGovern's district, in Worcester, Massachusetts. We were  classmates, friends, teammates,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692466/recognizing-father-paul-shaughnessy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…currently serves as a parish priest at  St. Cecilia's Church in Leominster, Massachusetts, but his impact  extends far beyond any district lines.\n\nHe is a Jesuit priest and a Navy Chaplain who has dedicated his life  to service. He is a graduate of the College of Holy Cross--a classmate  of my colleague, Congressman Mark DeSaulnier--and also a graduate of  Weston…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692491/welcoming-reverend-paul-shaughnessy"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…the remainder of  his distinguished law enforcement career. Upon his retirement from that  position, he continued to serve as a reserve deputy and as the  Sheriff's office Chaplain until 2023.\n\nBill's commitment to Milam County is evident in every aspect of his  life. His business, Cameron Tire Store, has been a staple of the  community since he purchased…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I rise today to welcome today's  guest chaplain, my friend, Rabbi Pinchus Ciment.\n\nRabbi Ciment is the director of Chabad Lubavitch of Arkansas in  Little Rock and is currently the longest serving rabbi in our State.\n\nHe…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689253/welcoming-guest-chaplain-rabbi-pinchus-ciment"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…it is my honor to introduce Dr. Michael  Gossett, pastor of Green Acres Baptist Church in Tyler, Texas, to the  United States House of Representatives to serve as the guest chaplain  this week and offer a prayer this morning.\n\nDr. Gossett and his wife, Katie, lead the largest congregation of  believers in east Texas. They also proudly shepherd a flock…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690047/welcoming-guest-chaplain-dr-michael-gossett"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, I want to thank Chaplain Black for his  reminding all of us about the government shutdown and how irregular it  is and how we aren't helping people that government would normally be  helping.\n\nToday,…", "date": "2025-10-27", "source_url": "https://justfacts.votesmart.org/public-statement/1696407/nomination-of-rebecca-l-taibleson"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…take the sniper out; but they forced him away.\n\nHe was carried on a stretcher to the hospital tent where he fully  expected to die. He was given Last Rites by the Company Chaplain and  left by himself. Presumed dead by the doctors and nurses, he was not  tended to. Eventually, one doctor said ``Hey, this guy is still  alive!'' Miraculously, after his…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…years of  his life, he earned a master's degree in Catholic theology from  Franciscan University of Steubenville. He planned to retire from  General Atomics and serve as a chaplain. He attended St. Ann Catholic  Church in Ridgecrest, California, and enjoyed serving meals and singing  in the choir.\n\nBruce will be remembered for his great sense of humor…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…onsite gym access, organized  challenges and workouts, and free wellness exams and cancer screenings.  Its mental health support includes confidential counseling, peer and  chaplain programs, and an annual screening with a licensed mental  health clinician. Additionally, between 2023 and 2024, information  gleaned from nutrition and financial wellness…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…his military service in April 1972, Longo continued  his lifelong commitment to helping others, particularly his fellow  veterans. For the past six years, he has served as a chaplain,  providing spiritual guidance and emotional support to those who have  sacrificed for our nation. Today, he serves as Chaplain for People of  Impact at Freedom Lake in Lapeer,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Samaria Baptist Church in Van Alstyne  and St. Philip Baptist Church in Celina.\n\nFor nearly four decades, Pastor Moore has worked as a firefighter in  North Texas and volunteer chaplain for the Celina Police Department. He  is a board member of the Celina Police and Firefighters Benevolent  Association, the Collin Baptist Association Board, the McKinney Area…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690155/recognizing-congressional-patriot-award-recipient-pastor-isiah-moore-jr"}]