[{"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…gratitude  for the opportunity to recognize a great Missourian, Mr. Gerard Joseph  Grimaldi, for his exemplary personal and professional accomplishments  as he begins his next chapter of life, enjoying retirement. An  experienced leader, dedicated professional, and tireless advocate,  Gerard serves as a prime example of a true public servant, and most  importantly,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…School of Law. On behalf of a grateful  Nation and the residents of Maryland's beautiful 8th District, I wish  Maryam Azarion nothing but the best as she begins a new chapter in her  life after her decades of federal service.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Therefore, Mr. Speaker, I ask my colleagues to join me in  celebrating Theodore M. Renz for his outstanding contributions and  wishing him good health and joy in this next chapter of life.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…much to my colleague from Arizona for your  question.\n\nI so appreciate the decades of experience and knowledge you bring in  regard to the services. I have only a small chapter in my life of 2  years working for Secretary Weinberger as a Presidential fellow. But I  didn't wear a uniform. I was a civilian working on a host of different  programs for 4 months…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…always being there for the citizens, for  the community of the City of Orange. I congratulate him on a well- deserved retirement, and I look forward to seeing the next chapter in  his life.\n\nMr. Speaker, I congratulate Tom.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694968/recognizing-tom-kiesla"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…grows, he can  look back with great satisfaction for time well spent.\n\nTo him, his wife Micki, his children Cooper, Jack, and Parker: I wish  them all the best on their next chapter in life and thank them  sincerely for being part of Phil's amazing work on behalf of our  Nation.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…colleagues to join me in thanking Mayor  Holtzclaw for his leadership and service. He has left a lasting mark on  Mill Creek, and I wish him well as he begins the next chapter of his  life.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…collaboration,  and tireless dedication. I thank him for his service, leadership, and  enduring commitment to the safety of our communities. He has truly  earned this next chapter in his life.                    Eliminating Wasteful Federal Spending\n\nMr. CLINE. Mr. Speaker, the House is finally doing what the American  people have demanded for years. We are…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…agrees with  this sentiment.\n\nMr. Speaker, I congratulate Vance on a well-earned retirement. May  God continue to bless him and his family as he enters a new and  exciting chapter in his life.                           Recognizing Scottie Cook\n\nMs. FOXX. Mr. Speaker, I rise to recognize Mr. Scottie Cook, a career  and technical education teacher in the Alexander…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…we know is that Jack is a true friend, and I can say that  from personal experience. We are all going to miss him, and I wish him  the best of luck as he begins his new chapter in life.\n\nMr. GRAVES. Mr. Speaker, in closing, naming the House Press Gallery  after Frederick Douglass is going to honor his commitment to the free  press, his legacy, and his…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…opportunity, human dignity, and community well-being.  I congratulate Don on his retirement and wish him, his wife Kim, and  their two daughters all the best in this next chapter of life.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…worst day  of their lives, and being a lifeline to those in the field, I  congratulate Mary on a well-deserved retirement. I wish her the best as  she begins the next chapter of her life.                              Congratulating Dave Preisler\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate Mr. Dave Preisler  on receiving the Minnesota Pork Board's…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689397/congratulating-mary-gislason"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…bittersweet to see Jim retire, I know that we will still  see him around Warren, probably on his mountain bike, enjoying the  outdoors. I wish him the best as he starts this new chapter of life.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…service has mattered, her leadership has made a difference, and  her example will continue to guide us long after she steps away from  this role. As she begins the next chapter of her life, she leaves with  our deepest respect, our sincere gratitude, and our very best wishes.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…whom the College has a long history of partnership,  to maintain their effort to provide the best outcome for their  students.\n\nWith the College primed to begin this new chapter in its life with  the start of the Fall 2025 semester the administration feels it is only  right to celebrate both the storied past and bright future of the  College by holding…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Speaker, I thank James for his many years of service to this  great institution and for his friendship. May God continue to bless him  as he turns the page and begins a new chapter in his life.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688721/recognizing-james-min-after-25-remarkable-years-of-service"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…for Team Scalise and  for the Republican Conference. While we are incredibly sad to see her  go, I know that her expertise and drive will make her shine in the next  chapter of her life where she will, once again, continue to thrive.\n\nMr. Speaker, we will miss her here, but I congratulate Lauren Fine  and wish her the best of luck in the next chapter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694933/recognizing-lauren-fine"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…talents to causes and  organizations near and dear to his heart.\n\nI thank Dan for his incredible contributions to Iowa and wish him and  his family the very best in his next chapter of life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…to John Deere--which  will leave an indelible mark on a great American and Illinois  manufacturer. I wish John, and his wife Diane, all the best as he  enters the next chapter in his life.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…throughout the years. The community will miss him, but they are  grateful to him for making it a better place. May he enjoy his well- deserved retirement and the next chapter of his life. Mr. Speaker, I  congratulate Joe.                    Congratulating Officer Sara VanLeeuwe\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate Officer Sara  VanLeeuwe…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693572/congratulating-joe-jensen"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…by  all who know her.\n\nI congratulate Ms. Dickens on her well-deserved retirement. May God  continue to bless her and her family as she enters this new and  exciting chapter of her life.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693574/recognizing-tawanda-dickens-on-her-retirement-from-us-capitol-police"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…shaped Moshannon  Valley for the better, and his legacy will be felt for generations.\n\nMadam Speaker, I wish Stan the best as he enters retirement and  starts this new chapter of life.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697251/9999"}]