[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…military members       today. They serve in combat and leadership roles and are       vital to the function of the U.S. military. But it wasn't       always this way. When Charity Adams-Early joined the military       in 1942, women were restricted to certain occupations and       comprised just 1 percent of the military. Not only that, but       people…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…meet the demands of the future by returning to a past-- returning to a past--where only the privileged are protected. The work  of the Department of Education was never about charity. It has always  been about justice.\n\nAs bell hooks taught us in ``Teaching to Transgress,'' teaching is  about liberation. Education is about more than information. It is…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693636/in-defense-of-children"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Education Act, we affirmed a simple and profound truth: Every child, no  matter their disability or ability, has the right to a  free and appropriate public education; not as charity, not as an  afterthought, but as a civil right.\n\nLet's be honest. That promise has never been self-executing. Making  IDEA real has required vigorous Federal oversight, strong…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698942/protecting-education-for-children-with-disabilities"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…reasserts congressional oversight  over critical independent agencies that were targeted for dismantling.\n\nThis legislation affirms a simple truth: Foreign assistance is not a  charity. It is a strategic investment. At just a small fraction of our  Federal budget, it delivers outsized returns for our national security,  our economy, and our global influence…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…and jeopardize  America's global leadership and medical innovation. Those people are  holding on too.\n\nJust last weekend, I went with the Parkinson's Association on their  charity walk. Those people are holding on for hope in their  wheelchairs. They are holding on for hope. They are daughters and sons;  they are brothers and sisters. We are so close…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…This year's march raised nearly a million dollars, and that is a lot  of money, but it is nowhere near enough to make up for the cuts imposed  by Trump's big, ugly bill.\n\nCharity alone has never, will never, can never make up for the  hundreds of billions of dollars in Federal cuts. Ending hunger requires  strong Federal investments in basic needs…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…please reach out.            Sincerely,\n\nJewish Women International; Catholics for Family Peace       Education and Research Initiative; Congregation of Our Lady       of Charity of the Good Shepherd, U.S. Provinces; Hope Rise       Thrive; Interfaith Coalition Against Domestic and Sexual       Violence; Legal Momentum: The Women's Legal Defense and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…for years, but they stocked shelves, checked out customers, and  prepared sandwiches with enthusiasm. They pitched in not because they  had to--many donated their salaries to charity--but because they felt  the store's survival was essential to their community.\n\nDespite the challenges they face as a small business--staffing  shortages, supply chain issues,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…servicemembers was an act  of patriotism and putting country over hate.\n\nThat leads me to someone who lived much of her life until she died in  my hometown, Lieutenant Colonel Charity Adams Earley, whom I finally  called Aunt Charity. She mentored me and taught me much of what I know  today. She always reminded me of barriers and challenges, but always…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…understood the value of food aid. He once said: ``We don't  have to give foreign aid. We do so because it furthers our national  interest.''\n\nHe is right. This is not just charity. This is about strengthening  our alliances, bringing stability to fragile regions, and saving lives.\n\nSecretary Rubio needs to do the right thing: Restore this aid  immediately.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692971/restore-funding-for-malnourished-children"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…HALOS Act of 2025, sponsored by the gentleman from  New York (Mr. Lawler).\n\nI want to comment on the terminology of the bill. Let's face it, this  is not an effort to help charity or, perhaps, God or angels. We have  halos. We have angels. These are private investors trying to get the  best deal for themselves.\n\nThat being said, and perhaps not giving…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…student. I didn't have much income, and I had no health insurance. So  my wife and I took our baby girl over to Children's Hospital here in  Washington, DC.\n\nWe sit in the charity ward, and we waited until our name was called.  And we saw a doctor who I prayed to God would be able to save our  baby's life. I never felt more helpless in my life than…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…student in law school at Georgetown  here in Washington, DC.\n\nGod gave us this beautiful little girl, but I didn't have health  insurance as a law student. We ended up in the charity ward of  Children's National Hospital waiting for our name to be called to be  introduced to the doctor--the new doctor--at the hospital who would do  his best to help my…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…tradition of seeking  peace through equality, fraternity, and respect, while striving to  overcome division through sacred teachings and the admirable tenets of  honest work, charity, volunteerism, and sharing with those in need.\n\nMr. Speaker, it is altogether fitting that the House recognize Guru  Tegh Bahadur's supreme sacrifice for human rights and…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…been able to have many of the  opportunities that all parents want for their kids and that all kids  want for themselves.\n\nShe has a part-time job at a nearby bank. She does charity work  delivering flowers to seniors. She loves horseback riding and has  competed as a Special Olympian. She accomplished all this thanks to her  bravery, optimism, and generosity,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Metropolitan Police, as we spend a lot of  our time back here, as well. They do an exceptional and professional  job.\n\nThey also beat us in the Congressional Football Game for Charity that  we do each year. I am nursing an injury from the soccer charity game. I  have turned 45 this year, and I think I have finally realized that I am  no longer 18. This…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…now  representing the Congressional Baseball Game and our team.\n\nThe Congressional Baseball Game was played on June 11, and I am proud  to say that we raised $2.7 million for charity right here, a record. We  sold almost 40,000 tickets and had 34,000 in attendance, another  record.\n\nThe Republican team, the USA team, Team USA is on a 5-year winning  streak.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694187/republicans-win-record-setting-game"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the best Americans  just got here--but our welcome mat should not be a welfare check.  Anyone who sponsors immigrants or refugees should be responsible for  their welfare. Charity is when you give your money. Any groups  assisting immigrants or refugees should themselves be responsible for  the welfare of the refugees.\n\nSo my amendment will remove from…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699441/consolidated-appropriations-act-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…has extensive experience in the Medicaid  space, and he knows that it must be guarded to protect those who rely  upon it here in the United States. It is not an international charity,  and it is especially not for the illegal immigrants here in this  country. I will ask him to elaborate on his experience with this issue.\n\nMr. KNOTT. Mr. Speaker, I am ready…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Lightning Hockey  Team awarded the WOG a $50,000.00 Hero's Award. Each year, during the  annual meeting, funds are donated throughout the Foundation's programs,  which include: Charity Care, Adult and Child Bereavement Counseling, a  camp for kids ages 6 to 17 that teaches them to manage grief and  reassures them they are not alone in their loss, Building…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…people that own those businesses, that work in  those businesses. They are all active in their communities. They  support everything from the local sports team to the local charity to  the local school's foundation. That is what they are focused on: making  a living, making their business work, whatever it is they do: providing  professional services,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John James", "party": "Republican", "sentence": "…restrictive setting possible.\n\nThat promise changed America.\n\nBefore 1975, more than a million children with disabilities were shut  out of public schools. Too many were pushed into charity-run facilities  or psychiatric institutions. Far too many were left without any  education at all.\n\nWe turned that injustice around. IDEA opened doors that had been  closed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…football  field and raising a family with his high school sweetheart Linda, Mr.  Arve embodies dedication, integrity, and hometown pride.\n\nFurther, his decades of experience in charity auctioneering, show his  unwavering community spirit.\n\nMr. Arve's contributions to local causes and organizations have left  a lasting mark on the South-Dade community. It…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690190/recognizing-mr-harold-r-arve-jr"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…for her exceptional service  to the Citizens of Pennsylvania, and for her tireless efforts to build  love and compassion into every sector she touches, from healthcare to  charity. Her life stands as a model of resilience, passion, and public  service.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693665/recognizing-dr-hagir-elsheikh"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…Principal Financial to  philanthropic causes in Des Moines and across the State of Iowa.\n\nUnder his leadership, Principal donated generously to United Way and  the annual Principal charity golf classic which raised millions of  dollars for Iowa youth. The Principal Foundation awards grants to  worthy causes including disaster recovery, affordable housing, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…painting of a baby chick next to  me right now, I will tell you that it is about one of the most charming  traditions of our Washington delegation.\n\n``The Chick'' was bought at a charity fundraiser and presented to  then-Congressman Joel Pritchard as a gift to his office in the early  1970s.\n\nCongressman Pritchard, as the story goes, wasn't too fond of the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia. Mr. Speaker, I rise today to recognize a  rising tradition out of the University of Georgia. It is The Fight  Against Suicide. Born out of a student movement, this charity boxing  event was created to spread mental health awareness, particularly among  young men.\n\nWhat began in Athens now spans across eight universities with the  proceeds benefiting…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…amplifying the program's reach and capacity. Financial stewardship and  ethical governance flourished under his leadership, with UWPC earning  the highest 4-star rating from Charity Navigator for four consecutive  years and maintaining a remarkably low 6.5 percent overhead. Charles  built strong partnerships with local, state, and federal leaders,  ensuring…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…innovative leadership, and his commitment to the shareholders and  associates of Walmart make him one of America's true success stories,  and not only that, but his spirit of charity and funding opportunities  for young entrepreneurs and in healthcare for fellow citizens.\n\nI am proud of what he has accomplished and the inspiration he has  given to thousands…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today on the birthday of my wonderful  wife, Charity, to recognize Ms. Joanna Sheaf, who celebrated her 100th  birthday on March 19, 2025.\n\nBorn during the Great Depression, Joanna grew up in southern Ohio and  lived with her…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}]