[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…has weaponized his office to target Democrats with allegations of  mortgage fraud.\n\nEarlier this year, Fannie Mae has terminated hundreds of my  constituents, as well, over charitable donations, without any due  process to them. Months later, Fannie Mae has still not answered my  letters or provided these employees with any meaningful explanation for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Dan & Whit's.  Customers stop by for milk and end up chatting with so many familiar  faces they forget what they came in for. The store is also a leading  participant in charitable giving around town. They were a pioneer of 19  Days of Norwich, an annual holiday drive where businesses donate a  portion of their December sales to the local food shelf.…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Mr. BOYLE of Pennsylvania. Mr. Speaker, I rise today to honor The Pew  Charitable Trusts, an incredible organization that is focused on  improving and invigorating civic life. Founded in 1948, The Pew  Charitable Trusts has been advancing solutions to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…lawsuits that secured  settlements with the major corporations McDonalds and Comcast. Allen is  also a noted philanthropist, helping to raise tens of millions of  dollars for charitable causes.\n\nOver the years, Allen has established himself as a prominent Black  entertainment mogul who holds the principle of equity in extremely high  regard. He recognizes…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. Speaker, when I call this a deeply unserious bill, I think I am  probably being charitable. It is unserious, and it comes from a  Republican majority that is either unable or unwilling to do the real  work of Congress.\n\nIn the first disastrous 100 days of President…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…millions to oppose reform efforts       across the country. It has partnered with well-funded       conservative organizations to push legislation that       criminalizes charitable bail funds--programs that help       families avoid these predatory practices. In short, mandatory       cash bail enriches a few at the expense of justice, safety,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…married Prince Whipple, who for many years was  enslaved by William Whipple, one of the signers of the Declaration of  Independence.\n\nDinah Whipple conducted the Ladies African Charitable School for  several decades, providing education for formerly enslaved people and  their children.\n\nOver two centuries later, her legacy still lives on in New Hampshire…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…technical leadership. Additionally,  Waterford 3 has maintained a strong and ongoing partnership with the  St. Charles Parish community, providing local jobs, supporting  charitable organizations, investing in STEM education, and preparing  future generations through workforce development initiatives.\n\nThis year marks the 40th anniversary of the plant's…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to recognize the charitable work in  Yonkers during this holiday season of Operation Santa Claus, raising  money to support organizations that work directly with individuals,  especially children with…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697681/operation-santa-claus"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…education, civic engagement, and social justice--offering  programs and outreach efforts that extend far beyond its walls. Whether  through fellowship events, support groups, or charitable initiatives,  the church continues to be a source of hope and healing for the broader  community.\n\nIn marking 160 years of ministry and service, we celebrate not just a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…roofing contractors provide vital services to their  communities, on and off the clock. NRCA members will recognize National  Roofing Week June 1-7, by supporting numerous charitable projects,  employee training programs and other activities across the Nation. I  commend NRCA and the vital role the organization and its members play  in every community,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…who labor  to involve everyday residents in the important issues of the day, the  Scarsdale Forum.\n\nThe organization traces its roots back over 120 years to 1904, with a  charitable and educational mission at its core. The forum sponsors  events and seminars addressing the issues, choices, and solutions that  directly impact the community. The floor…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…empowering families, and supporting generations of Igbo  descendants as they navigate life in the diaspora. From cultural  education and youth mentorship to advocacy and charitable outreach,  ICAN DFW has consistently demonstrated what it means to lead with  purpose and pride.\n\nThe Igbo Day Celebration stands as a vibrant reminder of the strength  and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…families.\n\nThe unused funds roll over. Contributions will grow tax-free within  these accounts. Families can even help a neighbor in need through  direct, tax-advantaged charitable support.\n\nThis isn't about micromanagement from Washington. It is about  restoring personal responsibility and real purchasing power.\n\nThe second part of MAHA is the insurance,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Sarrault volunteers his time  at Bishop Baraga School, teaching students about patriotism and proper  flag etiquette. His community commitment is further reflected in his  charitable efforts, including distributing toys at Christmas and making  pasties to support his local VVA chapter.\n\nMr. Speaker, let us all join in recognizing Roger Sarrault for his…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…define the WOG's operating  structure, roles, mission, and vision. Together, the members aimed to  create a significant pool of funds to support the Foundation's various  charitable programs, all under the guiding principle of ``Igniting Love  and Spreading Hope.'' In addition to her committee work, Sue also  became a trained Ambassador for the Foundation.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…nurse working overtime, this legislation will make sure that  your hard-earned money stays where it belongs: in your pocket.\n\nThe legislation also benefits those who give to charitable causes,  including tithes or religious contributions, allowing individuals who  do not itemize their deductions to claim charitable deductions.\n\nThe One Big Beautiful Bill…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…themselves to cultivating character and serving  their communities with distinction.\n\nToday, KA's across the country continue to make a meaningful impact  through ongoing charitable work, campus leadership, and a lifelong  commitment to honor and duty. The Order's presence in our local  community is a point of pride, and I applaud their continued  contributions…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693202/recognizing-kappa-alpha-orders-81st-convention"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…and  motorcycle awareness nationwide. However, realizing the strength of  their unity, these firefighting bikers have turned their fun and  relaxation into fundraising and charitable work. For example, their  Kentucky chapters collectively support the Shriners Hospital and  Transportation, Scars Uncovered, and the Hoosier Burn Camp for Kids.  The five…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…sponsoring and that can also be included as part of the  budget reconciliation process.\n\nThe first is the Educational Choice for Children Act, which will  provide a tax credit for charitable contributions that enable  scholarships to attend private, parochial, and independent schools.  This could potentially expand  private school choice to millions of families…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…classrooms have operated in over 500 K-12 schools  across the United States.\n\nNow, these programs are not about education. They are about  influence. The CCP does not act with charitable intent. These programs  exist because the CCP expects something in return: control over  curriculum and influence over young minds.\n\nIt is unacceptable that American school…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…legislation, passed by House Republicans last July,  delivers meaningful tax relief to working Americans by expanding the  child tax credit, allowing nonitemizers to claim charitable deductions,  eliminating taxes on tips and overtime, and more.\n\nAs much as my colleagues on the other side have tried to spin this  resolution as a tax giveaway to the wealthy,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, I am honored to recognize Dr. Hagir Elsheikh,  a distinguished resident of the 10th Congressional District, for her  exemplary public service, charitable leadership, and extraordinary  contributions to healthcare and autism advocacy within the Commonwealth  and the Nation. Dr. Elsheikh is the Chairwoman and CEO of Hagir Network…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693665/recognizing-dr-hagir-elsheikh"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…are doing some of that in this legislation.\n\nWe are also increasing the HSA contribution limit and cap for small  business expensing, reinstating a temporary deduction for charitable  contributions, and 529 accounts will now extend to include career  training and credentialing.\n\nWe are providing income on tax-exempt status to servicemembers  serving in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…focused on  students, not bureaucracy.\n\nTo that end, I am pleased to support H.R. 833, the Educational Choice  for Children Act, which offers a Federal tax credit to encourage  charitable donations toward scholarships that help families cover K-12  expenses, tuition, books, supplies, and more.\n\nThis bill is expected to benefit over 2 million students nationwide,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…opportunities for everyday Americans to  invest in public and private markets, expands access to capital,  facilitates capital formation, promotes transparency, and helps  charitable organizations build retirement security for their employees.\n\nFor example, it allows people to invest in private markets based on  their knowledge and experience, whereas…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697823/increasing-investor-opportunities-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…workers relying on  tips as part of their wages, workers relying on overtime, senior  citizens relying on Social Security, and even residents just trying to  write off their charitable contributions.\n\nThey are all being targeted by the D.C. Council. Specifically, the  D.C. Council is opting out of the following tax provisions that House  Republicans championed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Adams were joined by their neighbors and community leaders as they  broke ground on what will soon be their newly constructed home, the  first home rebuilt by a nonprofit charitable organization in Grizzly  Flats after the Caldor fire. This new home will provide Mac and Cathie  with a safe, comfortable, and dignified living space after their home  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]