[{"senator": "John Larson", "party": "Democrat", "sentence": "Mr. LARSON of Connecticut. Mr. Speaker, I, first and foremost, will  associate myself with the remarks of Mr. Neal from Massachusetts about  our dear friend and colleague, Charlie Rangel.\n\nAlso, Mr. Speaker, I will point out, as well, that I believe the  Representative from Indiana was on the floor talking about how we  should go after PBS and NPR.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…opportunity to alleviate the  suffering of the people of Haiti.\n\nI also, again, can't help but celebrate the legacy of the former  chairman of the Committee on Ways and Means, Charlie Rangel, who  championed meeting our moral responsibility to support stability and  dignity for Haitians.\n\nThat is precisely what this bill does today. The Haiti Economic Lift…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698851/haiti-economic-lift-program-extension-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…these Notices of       Decision and the application of CRA procedures.\n\nIf you have any questions, please contact Shirley A. Jones,       Managing Associate General Counsel, or Charlie McKiver,       Assistant General Counsel for Appropriations Law.            Sincerely,                                             Edda Emmanuelli Perez,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…We have to keep weapons of mass death out of the hands of those  who would use them to kill innocent people.\n\nIn the last few hours, we have one more example, the murder of  Charlie Kirk. Any person, regardless of their politics, should be able  to express their ideas without violence.\n\nCommonsense gun laws save lives, Mr. Speaker, and we must pass them…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695226/calling-for-substantive-action-on-shootings"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…all the more to do this  work.\n\nIn the almost 7 years since, our empathy and our common humanity has  been tested in unimaginable ways.\n\nThe latest is the horrific murder of Charlie Kirk.\n\nBeyond the horror of such a vile act is the pervasive ugly rise in  political violence.\n\nWe have witnessed it in my home State of Pennsylvania with the  attempted assassination…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…few minutes ago, four Republicans saved  this House from disgrace. We almost passed a resolution to remove a  Member from committees for the sin of exercising free speech.\n\nCharlie Kirk was a prominent figure, beloved by many, disliked  heartily by others.\n\nIf the First Amendment means anything, it means the ability to say  anything we want, short of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695637/first-amendment-is-keystone-of-our-liberties"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…violence across the Nation, targeting elected officials and high- profile individuals associated with both political parties.\n\nWhether it is the horrific assassination of Charlie Kirk at a college  campus in Utah or the tragic assassination of former speaker of the  Minnesota House of Representatives Melissa Hortman and her husband in  their home,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…any.\n\nWorld War II saw the service of many African Americans who never got  their just due in or out of the military.\n\nMy father had two brothers. Both of them, William and Charlie, served  in World War I. Every time I tried to engage them in conversations  about their experiences in that war, they never ever would discuss  that. They made it very clear…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the horrific  events of last week in my community and the rise of political violence  nationally.\n\nLast week I was sitting in my office in a meeting when the phone lit  up. Charlie Kirk had been shot at an event in Utah. Seconds later, my  phone lit up again. There was an active shooter at Evergreen High  School, which is not far away from my house.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…Speaker, I thank the gentleman from Texas (Mr.  Green) for yielding to me.\n\nToday the Republican House majority brought to the floor a resolution  honoring the life and legacy of Charlie Kirk.\n\nCharlie Kirk's assassination was a horrific and vile attack. It was  an incident of political violence, and condemning the depravity of  Kirk's brutal murder is a straightforward…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…would like to say, humbly, I am sorry for taking part in  the toxic politics. It is very bad for our country. It has been  something I thought about a lot, especially since Charlie Kirk was  assassinated.''\n\nMadam Speaker, I thank the gentlewoman and wish her and her family  all the best in her future.\n\nHaving said that, on the gentlewoman's bill, Madam…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…special recognition to the parishioners  of the Church of the Annunciation in Cranston, RI. Last week this  parish, with Father Andrew George, Father Nicholas Lanzourakis, Charlie  Samaras, Denise Panichas, and other proud parishioners, celebrated a  touchstone of Rhode Island summers, the Church's 39th annual Cranston  Greek Festival. Thank you for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695489/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…of Representative Melissa Hortman's two children as they  try to cope with the assassination of their mom and dad.\n\nThen I sat, and I thought of the pain and the torment of Charlie  Kirk's family as they try to cope with the killing of their dad.\n\nToday, Mr. Speaker, I am inviting Americans across the Nation to do  the same. I invite them to sit for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695814/bringing-compassion-to-our-nation"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…single quote from Representative  Ilhan Omar (MN-05) and seeks to punish her for comments she never made.  After the unconscionable act of gun violence that took the life of  Charlie Kirk, Representative Omar clearly and immediately condemned  this assassination. She expressed her profound shock, sadness, grief  about this despicable act of political violence.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695762/issues-with-h-res-censure-of-rep-omar"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Political Violence\n\nMr. President, I rise tonight in deep sadness for a nation that is  increasingly beset by political violence.\n\nYesterday, political activist Charlie Kirk was killed while speaking  to students on a college campus--a place that is set up for the  exchange of ideas.\n\nHe was just 31 years old, a husband, a father of young…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Speaker, let's go back to the year 1919. We  had just 48 States. World War I had just ended but we called it the  Great War because we didn't know there was going to be another. Charlie  Chaplin had just released a short silent film called ``Sunnyside,''  before talking pictures would be all the rage. In this very Chamber,  the House voted to send the 19th…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, I thank my colleague from Florida for  bringing this resolution forward and for taking the time to honor a  true American patriot Charlie Kirk.\n\nHe was a champion for freedom, and he was a role model for millions  of young people across our country.\n\nAs my colleague had mentioned, he was a devoted husband to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, it seems hard to believe that it is not  even 10 days since Charlie Kirk was assassinated.\n\nWe all know why he was assassinated. He was assassinated in part  because he stood by our Constitution and believed in the limited  government that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695805/what-charlie-kirk-stood-for"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Several  other Spartans, including medalists Rebekah Steinweg, Luke Stovall,  Kody Hinnant, and Abby Jones also delivered outstanding performances.\n\nAlso competing for Salem were Charlie Bain, 12th grade, and Nesa  Garcia-Perez, 10th grade, in congressional debate, and Leah Johnson,  10th grade, and Ashley Toapanta, 10th grade, in policy debate. Students…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  contributions of Mr. Charles ``Charlie'' Webb. Charlie graduated high  school in Colorado in May 1970 and in August 1970 reported to Fort  Knox, Kentucky. for Basic Training and Advanced Individual Training at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, I want to compliment Erika Kirk, wife of  the assassinated conservative leader Charlie Kirk. She has made the  emotional appeal to have cameras in the courtroom at the trial of her  husband's murderer. I commend her for this brave plea because it fits  in with…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696518/cameras-in-the-courtroom"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, I rise today still in shock and saddened at  the political assassination of Charlie Kirk. There is no place for  political violence in our country, and it is antithetical to who we are  as Americans.\n\nThe beauty of our Nation and the First Amendment is that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…limited in years but  immeasurable in impact.\n\nI offer my own heartfelt prayers along with hundreds of millions of  others in this country and around the world. As we pray for Charlie and  his loved ones, so too do I pray for our country.\n\nWe are in a perilous moment. We don't yet have all the facts about  yesterday's horrifying events, and the killer remains…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…his favorite pastimes was tinkering on engines, along with pulling  weeds, long conversations on the front porch, kayaking, eating hearty  meals, and rescuing animals, like Charlie the dog and Gus the goose.\n\nMr. Chapman was also known for his work ethic and perseverance  despite the challenges faced as a polio survivor.\n\nToday, I ask that we all take…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693467/recognizing-ben-chapman"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…matter is that we need to do a lot better job of  speaking truth here in this Chamber. As a number of my colleagues were  debating a resolution honoring a friend to many of us, Charlie Kirk,  who, as is well known now, lost his life last week, I am reminded of  the importance of truth. Truth matters.\n\nCharlie stood for the proposition that you should go…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…further debate.\n\nMr. SCOTT of Florida. Mr. President, like most Americans, my wife Ann  and I are completely heartbroken by the tragic loss of our friend and  fellow patriot Charlie Kirk in a despicable, targeted assassination.\n\nThis is a devastating loss for his wife Erika and their two precious  kids and the millions, including myself, who felt the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695709/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Republicans, he has worked to implement Trump  accounts to ensure financial resources for future generations.\n\nAbove all, President Trump has built off the work of the late Charlie  Kirk to put God at the center of American exceptionalism.\n\nOur country has rebounded with safer streets, peace through strength,  and tremendous tax cuts.\n\nAs America marks…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700206/congratulating-president-trump"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Europe,  leftist governments now criminalize it.\n\nMr. Speaker, I raise these points because a Member of this House  recently made some truly vile and despicable remarks about Charlie Kirk  after his brutal assassination. Her words should be loudly and  universally condemned.\n\nLast night, on the House floor, a resolution of censure was brought  against…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…city, to our  county, and to our country. I pray this work continues to inspire young  people to lead by his strong values.\n\nWe just had the tragic passing of a great American, Charlie Kirk, who  extolled the values of faith, family, and freedom. Jeff Wilson extolls  the values that Mr. Kirk extolled for 31 years of his life.\n\nGodspeed.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…light-rail line. It  turns out, by the way, that she and her family lived in my district.  Then, of course, there is also the senseless murder yesterday, the  assassination of Charlie Kirk, and the violence and evil that is all  around us. This is one step to try to prevent and stem even more of  that possibly happening. It is by dealing with dangerous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}]