[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…fully permitted projects, pause leases, and cancel projects that were  already under construction.\n\nSo what this administration is doing doesn't just undermine one of  our cheapest sources of power; it wrecks the trust that is needed with  the executive branch to do bipartisan permitting reform. It poisons the  well.\n\nCertainty is what is required for…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…electricity shut off by utilities.\n\nThis is not an accident. This is a choice by Trump and Republicans.  Clean energy, like wind and solar paired with battery storage, is the  cheapest power we can build. If we build more of it, we can lower  electricity prices, which means American families will be able to turn  the heat on in the winter or the AC on during…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…find the calories within their $6 or $8 or $12 budget.\n\nFinally, people are going to pay hundreds of dollars more per year in  electricity because this bill throttles the cheapest and most abundant  form of energy in wind and solar. And this is where you have got to  stay with me for a moment.\n\nI am very passionate about climate action. I think it is…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…whether you had capital, whether you could hire the lawyers and the  engineers to go and fight with the utility. It was to make sure that  every American had access to the cheapest energy.\n\nThat bill, the Inflation Reduction Act, took a significant step  forward in expanding access to cleaner, more affordable energy sources  to lower costs for all Americans.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…happen in the blink of an  eye. They are going to be consuming as much electricity as 100 million  homes in our country.\n\nOn the supply side, well, Trump is cutting off our cheapest and  quickest-to-deploy sources of energy that can meet this demand. Trump's  sham energy emergency pushes fossil fuels as the solution, but those  fossil fuels are polluting,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…year in exchange for promoting  their interests as President.\n\nPerhaps it is no surprise we are seeing policies that benefit the  most expensive energy sources instead of the cheapest options available  to consumers.\n\nUtility-scale solar and wind are the lowest-cost sources of new power  today. Together with battery storage, they can be built quickly,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697888/state-planning-for-reliability-and-affordability-act"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…but be taken away. They  were taken away by this ideology on Wall Street and the politicians  around here who helped them, which says that all that matters is  chasing the cheapest labor, the weakest labor rules, and nonexistent  environmental rules. They made them citizens of nowhere. They didn't  care about this country or the communities and the people…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…heat their homes and keep their  lights on and all the rest of it.\n\nAll of that is out the window. Why? Because clean is cheap and cheap  is clean. Clean energy is now the cheapest kind of electricity that we  can get on the grid in any kind of reasonable timeframe.\n\nThere was a time where it was coal. That is definitely more expensive  now. There was…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…reconciliation bill and the Trump energy emergency put into motion:  punishing low-income Americans by making it more difficult for them to  access what is now one of the cheapest forms of energy.\n\nOh, yes, there was a prediction. We predicted it on the floor in  March that electricity prices were going to go up, and then others,  when the bill passed,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…adversaries.\n\nThe hypocrisy is simple. On the one hand, they say we need more  energy for AI and for everything else, but then, on the other hand,  they greatly curtail the cheapest form of electricity we could make,  which is solar and then wind, because, really, what they are doing is  just hugging Big Oil because Big Oil hates clean energy because…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…regard to our energy future.  They refuse to engage, invest in, and celebrate the innovation that is  going on with regard to renewable energy and how they are indeed the  cheapest forms of energy.\n\nMr. Speaker, I seek unanimous consent to enter into the Record an  article from June 17, 2025, in Scientific American, titled: ``Wind and  Solar Energy Are…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…There is a second layer to this. Even if data centers build dedicated  generation, the broader grid still absorbs the consequences of rising  demand. If demand rises and the cheapest new resources are constrained,  prices rise for everybody. If transmission is insufficient, congestion  increases and wholesale prices spike for everybody. If fossil fuel…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…alert. Given the long record of       false alarms, such hypervigilance is a possible tripwire for       an accidental apocalypse.\n\n``Getting trapped in an argument about the cheapest way to       keep ICBMs operational in their silos is ultimately no-win,''       Daniel Ellsberg and I wrote for The Nation in autumn 2021. We       added: ``Better sooner…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…report came out that Americans will pay 13 percent  more on energy costs than they did last year. In part, why? Because  Donald Trump and his obeisant Republicans cut out the cheapest way to  get new power and new electrons on the grid--solar energy. They cut it  out in obeisance to the oil industry. It was disgraceful.\n\nThat is what is wrong with this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…fuel  industry.\n\nSo what is about to unfold is that we are going to see the pursuance  of a vendetta against wind and solar energy by cutting incentives for  the cleanest and cheapest sources of electricity, all to pad the  pockets of the big oil and big gas industries.\n\nThis bill eliminates the residential clean and efficient energy  incentives. Let me…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…require an  evaluation of potential national security concerns associated with the  LPTA FAR standard.\n\nInstead of just looking at the initial price tag and procuring the  cheapest product and service, it is vitally important that the United  States Government understand the national security implications  associated with its own Federal procurement…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…not  to the oppressors of Iran, but to the people of Iran and the resistance  groups actively seeking their overthrow.\n\nThe overthrow of this regime from within would be the cheapest,  surest, and most peaceful way to remove it as a threat to the freedom  of the Iranian people, the stability of the region, and the peace of  the world. That is what the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…where wind makes sense, and where fossil  fuels make sense.\n\nWhen he says best of the above, he doesn't mean we don't do all of  it. We do what fits in the right place at the cheapest price for our  citizens. When you talk about investing in your own utilities, if clean  energy--they keep saying they are going to go for more expensive energy  as opposed…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…accurate. Why wouldn't we embrace it? We don't reimburse it.\n\nThe barriers to entry here are protection rackets saying we are not  fighting  for what is fastest, best, and cheapest. We are often here because we  know our incumbency.\n\nWe really are on the edge of miracles. How do I get the left and the  right to understand the math is the math? Demographics…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}]