[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…behind, but all chose to fold and abandon, fighting instead for  special interests and opposing the ability for this country to stand up  a cleaner energy economy, which means cheaper energy.\n\nBecause of the attack on clean energy jobs, on the clean energy  economy, and on the economic development that had already been set in  motion, often in districts…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Zeldin, Burgum, and Wright. If they are conspicuously and  consistently failing to tell the truth about savings, specifically  misleading the public, telling them fossil fuel is cheaper when it  isn't, what does that tell you about their motives and their bias and  inability to faithfully execute the laws?\n\nIt tells me that there is really no point in passing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…of  those plants, you build the plant, you hook it up, you connect it to  the grid. The person who now is controlling the dispatch of that plant  never runs it unless it is cheaper than the electric grid. Every minute  you own a solar panel, every minute you own a cogeneration plant, a  wind turbine, all of these technologies that are out there, you…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…it, not  wind, not solar, not either of those even when paired with battery  storage. It is completely ridiculous and the latest example of  Republicans' relentless attack on cheaper and cleaner energy sources.\n\nEver since President Trump took office earlier this year, Republicans  have been obsessed with crusading against wind and solar whenever they…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…fuel  industry--the President was reported to have said ``get me a  billion''--what I don't understand is why you would kill jobs in the  clean energy sector that is producing cheaper power and good jobs.  There is no justification for an Executive or Member of Congress doing  that.\n\nThe other final point is that we are having this bizarre debate about…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688164/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…The person says: I can spell it. I have seen so many ads. I think I  need it, Doctor.\n\nAnd in too many cases, the doctor, rather than get into a debate or  say there is a cheaper generic for this drug or the other, ends up  writing a prescription for an expensive drug. It is one of the major  reasons that health insurance premiums have gone up so high…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…price here in the United States? The price is  higher in the rest of the world than it is here, and that is why the  rest of the world wants more of our LNG, because it is cheaper for  them.\n\nWhat about us, though? Shouldn't we be primarily concerned about  Americans and the price here?\n\nThis bill, in my opinion, is just a giant handout to Big Oil and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Republican  colleagues. It is about whether we keep building the future or tear it  down before it has had a chance.\n\nWe should be competing with China. We should be making energy  cheaper, not more expensive. We should be backing the American workers  who are finally getting the chance to accelerate our energy leadership.  Instead, the Republicans' big, ugly…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…of each other, they are no longer functionally  intermittent.\n\nSo I kind of was like--I am sort of like from the future, right,  because 10 years ago, 15 years ago, it was cheaper for us to move in  the direction of clean energy in Hawaii, but you couldn't say that on  the continental United States side. And we moved in that direction as  fast as we…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Rather than help,  Republicans have only made things worse. They have gone along with  arbitrary tariffs that have raised the cost of living and taken a  hatchet to cleaner, cheaper energy. They have gone along with illegally  halting energy projects. They ended tax cuts and rebates that helped  people afford their electric bills in order to pay for tax…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…power bills in half. Instead, he and his Republican  accomplices in the House are causing those prices to soar with their  backward policies and, essentially, their war on cheaper, clean energy.\n\nThanks to Republicans, electricity prices are climbing more than  twice as fast as inflation, and more than 80 million Americans are  struggling to pay their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…families: What you are now saying is a hoax.\n\nHe has called affordability a ``con job.'' But the only hoax, the  only con job is Trump and the Republicans repeatedly promising a  cheaper alternative to the Affordable Care Act and instead offering  nothing--absolutely nothing. That is where they have been.\n\nThe Affordable Care Act went on the books in 2010.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…package of bills and say: Oh,  we are really concerned. They are not concerned. Rates are going up.  They are canceling projects. They are throwing wrenches into cleaner,  cheaper energy. This is really a giveaway to the fossil fuel companies.  What other explanation can there be to sock it to hardworking people  who need a break?\n\nThey need a break.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Trump and congressional Republicans  scrapped these credits for solar energy with their so-called Big  Beautiful Bill. So while utility bills go up, people who want to go to  cheaper forms of sustainable energy, such as solar, are told the tax  incentives are no longer there, which is just the opposite of what we  should be doing. Then they went further,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…add what they are doing by  enforcing uneconomical plants to stay online so consumers pay the cost,  with the big, ugly bill, you are taking away clean energy incentives,  cheaper and cheaper energy, and you are asking consumers to pay the  cost of what utilities are. Everyone is grappling with these arbitrary  Trump tariffs.\n\nThis is not fair, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…That is businesses. That is  private groups, charities. Give us more money, or create a barrier to  entry so I don't have to compete with someone else with better, faster,  cheaper technology. That is particularly true in healthcare.\n\nWe have done presentation after presentation here showing how you  could crash the price of healthcare legalizing technology.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…with other countries in the  world. The United States, I think, is now maybe 13, maybe number 12 on  the credit stack. Think of this. I believe Greece can sell a 10-year  bond cheaper than the United States. That is worth thinking about.\n\nLet's actually walk through what is going on right now with the  reconciliation budget. Let's sort of explain. Why do…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Mr. Speaker, the global economy is at a crossroads when it comes to  digital payments. Jurisdictions around the world are upgrading their  payment systems to be faster, to be cheaper, and cross-border. The  private sector is leading the way, including payment stablecoins to  enhance the payment rails.\n\nAs the United States grapples with modernizing our…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…maintain baseline services.\n\nThe whole presentation of walking through what happens when you get a  moment to actually disrupt policy and do things that are better,  faster, and cheaper--because I will argue the army of lobbyists,  basically the rent seekers, if you remember your high school economics,  who are around us all, despise the concept of reform.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…that health insurance  premiums are continuing to rise. Here we are dealing with it and trying  to get it right for the American people.\n\nWhen you say that wind and solar is cheaper and then complain because  you took away the tax--people aren't doing it because you take away the  tax credits and subsidies. If it is cheaper and more reliable, then you…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…customer, we  need modern and reliable infrastructure. Far and away, the best way to  transport natural gas from point A to B is by pipeline. It is safer,  more efficient, and cheaper, and further reducing costs for consumers.\n\nBecause of the outdated regulations, a lack of coordination, and  political obstruction, critical pipelines that provide reliable…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…week, I did a presentation here and basically showed where  Democrats are turning healthcare into financial engineering instead of  the incentives to do it better, faster, and cheaper.\n\nWe have turned healthcare into--remember the whole debate here on  subsidies on top of subsidies? When you turn healthcare into financing  instead of helping people be healthier,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…satisfaction continues to  decline.\n\nAt the center of socialism is the mistaken belief that profit is  waste, and if it can be removed from the equation, everything will be  cheaper. That is the fundamental misconception behind Mamdani's  government grocery stores. Yet, profit is not waste. Profit is the  essential ingredient that spurs competition, drives…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…begun as a five-story, 92,000-foot  international shoe plant in Cape Girardeau, nicknamed ``the Pride of  Southeast Missouri.'' At one point, it employed 1,200 workers, but  cheaper imports from low-wage countries began to flood the market, and  by 1990, the old factory was razed and replaced with a one-story plant  of, roughly, 300 to 500 workers. By…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Speaker, I urge my colleagues to support H.R. 3015, and I reserve  the balance of my time.\n\nMr. Speaker, we are absolutely concerned about families making ends  meet through cheaper electricity. There are also hardworking families  in my Commonwealth of Kentucky who work in the coal industry and have  been really hurt by the policies that came out of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…for our  reconciliation bill and put some more money in the bank.\n\nMy point is that if we would actually think about policy, the  modernization, doing things better, faster, cheaper--next week we are  going to do a--I think one of our Democratic colleagues a couple of  moments ago was attacking some of the--we will call it the DOGE cuts.  Last year, for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Where are my own brothers and sisters, particularly on the  conservative side, saying: We want to unleash technology. We want to  unleash doing this a better, faster, and cheaper way?\n\nFor those Members who run around saying: PBM reform. Fine, but  understand that every study we have right now is that PBM reform saves  a fraction of a fraction of money,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…before. We have been bouncing between the 13th  position--I think we fell to the 12th position, then the 14th  position--where other countries are able to sell their bonds cheaper.  Yet, the one that just enrages me, here is Greece. Greece can sell a  10-year bond cheaper than the United States today.\n\nWhen you run around thinking that the United States…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…are available, in many cases, the LPTA slides  the Federal procurement preference scale away from American drones in  favor of these Chinese drones merely because they are cheaper.\n\nTo emphasize, all companies in China are required by Chinese law to  give the Communist Chinese Party access to all their information upon  request.\n\nIn fact, in August…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…somewhat  unique system. We actually buy managed care capitated policies for our  indigent population. It is remarkably effective, and we deliver  remarkably effective healthcare cheaper than almost every other State  in the country, demonstrating that planned design, managed design, can  both be much healthier for our society and save money. You don't start…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]