[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…degree in public administration from Metro State University and  graduated from the FBI National Academy.\n\nIn 2016, New became a Deputy Chief before being named Eagan Chief of  Police in 2018. As Chief, New prioritized building strong community  partnerships, implemented innovative practices and invested in officer  mental health and well-being.\n\nI…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…resources to downtown Los Angeles to maintain control of the situation.  This kept the situation contained to 10 blocks of the downtown area.\n\nBut even when the Los Angeles Chief of Police stated that the  demonstrations ``were nowhere near a level'' where the National Guard  was needed, President Trump disregarded his opinion and took the  escalatory action…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…and he is someone I was proud to serve with in local government. Chief  Story has spent over 18 years in service to Las Cruces, rising through  the ranks from cadet to chief of police. He is a U.S. Marine Corps  veteran, a graduate of New Mexico State University, and a man deeply  rooted in the values of duty, accountability, and community.\n\nEarlier…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Chief Tim Carter. A native of Fauquier County, Chief Carter has served  his hometown as a police officer, corporal, detective sergeant,  lieutenant, and deputy chief before becoming police chief in 2023.\n\nAlso recognized with a Lifetime Achievement Award was retired fire  chief Dale Koglin. Chief Koglin served the Warrenton Volunteer Fire  Company…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690556/recognizing-valor-award-winners-and-honorees-from-fauquier-county"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…mayor of 8  years, I worked with over 700 amazing men and women of a police  department who were heroic in the work that they did. I know that, in  conversations with our chief, our police officers, and our community,  these decisions are best left to our communities to write the laws of  when these police chases should actually go into effect.\n\nWhile I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…California Governor and Republican  President Ronald Reagan. He then served our country in the marines for  6 years through two wars.\n\nToday, Chief Rodriguez is our Santa Ana chief of police. He fulfilled  a lifelong dream of being an American and serving his great country.\n\nHe inspires our community. I thank him for his hard work. God bless  him and God bless…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…public safety advocacy.\n\nFor over 25 years, Chief Tholen served with dedication and integrity  as a police officer for the City of Edina. He then continued his  service as Chief of Police for the South Lake Minnetonka Police  Department for three and a half years, leading with courage and  professionalism.\n\nA graduate of the University of St. Thomas and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…public safety advocacy.\n\nFor over 25 years, Chief Tholen served with dedication and integrity  as a police officer for the city of Edina. He then continued his  service as chief of police for the South Lake Minnetonka Police  Department, leading with professionalism and courage.\n\nA graduate of the University of St. Thomas and the FBI National  Academy,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693614/recognizing-brian-tholen"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to honor the Golden Police  Department of Golden, Colorado, for serving and protecting our  community.\n\nWe are all grateful to the Department and Chief of Police Joe Harvey,  as they strive to maintain a culture of positive public engagement,  equity, and compassion for all. Founded in 1874, the department has a  long history of…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692010/recognizing-the-golden-police-department"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…County is 4,060 square miles, not the  10 blocks. When President Trump deployed the Marines and National Guard  in L.A., it was not at the request of local officials, the chief of  police, or the Governor. It was unprecedented, unnecessary, and a clear  attempt to take over the State's law enforcement authority. In fact, I  think it did aggravate tensions…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693144/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…wear the badge rests not with an unaccountable labor       arbitrator, but with the official who bears ultimate       responsibility for those members' conduct--the Chief of       Police. I urge you once again to reject H.R. 2096, the       ``Protecting Our Nation's Capital Emergency Act of 2025,''       and to support the work of my Administration,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…agreed to a $5  million settlement with an estate of a January 6 rioter who was killed  while attempting to violently breach this Chamber just outside those  doors. As the chief of police of the Capitol Police said at the time:  ``This settlement sends a chilling message to law enforcement  nationwide, especially to those with a protective mission like…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…the City of Orange.\n\nTom started in 1986 as a reserve police officer with the Orange  Police Department. He worked his way up to officer, sergeant,  lieutenant, and then chief of police.\n\nTom retired from the Orange Police Department in 2021 and was then  appointed to become the interim city manager for the City of Orange.  Under his leadership, the city's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694968/recognizing-tom-kiesla"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…for officers. The Mayor,  the D.C. City Council, and the community all worked together to pass a  series of reforms and laws, work they were proud of. They empower the  chief of police to lead the police department and do it the right way.\n\nThis bill repeals all of that. It would damage the trust between D.C.  police and the communities they protect…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696935/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…McLin is embarking on a well- earned retirement. For more than three decades, he has served as a  member of Somersworth Police department, rising from patrol officer to  Chief of Police in 2022. Throughout his career Chief McLin has played a  crucial role in supporting Granite Staters through the Adverse  Childhood Experiences Response Team (ACERT) and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688242/recognizingmc-the-achievements-and-retirement-of-somersworth-police-chief-timothy-j-lin"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…investigator, and fire prevention captain.  As a result of his contributions to the city and exceptional public  service abilities, Mark attained the positions of Fire Chief, Chief of  Police, and Director of Public Safety, before retiring in November  2023.\n\nIn addition to his public service, Mark has participated in many  community service initiatives…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, today, I recognize our Chief of Police  in Palm Bay, Florida, Chief Mario Augello, who has been serving for 25  years in our community.\n\nThroughout his career, the chief has exemplified amazing dedication,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693664/recognizing-chief-mario-augello"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia. Mr. Speaker, I rise today to honor U.S.  Marshal David Lyons from the Southern District of Georgia, who is  retiring this June.\n\nMarshal Lyons previously served as chief of police in Garden City,  Georgia, a position he held for 16 years. While serving as Garden City  police chief, Marshal Lyons was appointed to the Criminal Justice  Coordinating…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…knew him.\n\nRecognizing Chiefs of Police Robert Butler and Edward Kinney\n\nMr. MILLER of Ohio. Mr. Speaker, today, I rise to recognize two  individuals: Independence, Ohio Chief of Police Robert Butler, and  Medina, Ohio Chief of Police Ed Kinney.\n\nEarlier this year, Chief Butler was sworn in as president of the Ohio  Association of Chiefs of Police and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the  next step in his career.\n\nChief Glenny attended Juniata College before beginning his 35-year  career as a law enforcement officer with the last 6 years spent as the  chief of police in the Gettysburg Police Department.\n\nBefore arriving in Gettysburg, Chief Glenny started his career in the  Ferguson Township, Pennsylvania, Police Department, where…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…face every day. I talk to the men and women in blue virtually every day  in the district that I represent, as I know many of my colleagues do.\n\nMy grandfather was the chief of police of a small west Texas town  called Sweetwater. I was blessed to work in the United States  Attorney's office and the Office of the Attorney General of the State  of Texas,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…wrapped around his neck,  and they tried to get him. One of these guys did that to an ICE  officer.\n\nWhere is the concern for our law enforcement? My grandfather was the  chief of police of a small town in West Texas back in the 1940s. Where  is the concern for them? My great-great-grandfather was a Texas Ranger.  I was proud to be in the U.S. Attorney's…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…in January 1987 and served for 10 years before  being promoted to Sergeant. In 2017, he was promoted to Lieutenant,  where he served for three years before being named Chief of Police and  Director of Public Safety on January 1, 2020.\n\nThroughout his outstanding and tireless career, Chief Kingsborough  was recognized by Middlesex Township with an Exceptional…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698017/recognizing-chief-steven-kingsborough"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Clerk\n\nWai Logan, Treasurer\n\nPete Howes, Volunteer Fire Department Chief\n\nMichael Doan, Emergency Management Coordinator\n\nNeal Stone, Municipal Judge\n\nMichael Staiger, Chief of Police\n\nOn August 30, 2025, the town's officials, residents, and visitors  will celebrate its 100th anniversary. The community festival will  include a 5K walk/run, children's…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…years in law  enforcement.\n\nKerry Nye began his career with the Lititz Borough Police Department  in 1980 and has remained there since, becoming a sergeant in 1994 and  the Chief of Police in 2016. A staple of Chief Nye's leadership was his  geniality and his visibility in the community. He planned emergency  services events, such as cancer treatment fundraisers,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689982/congratulating-chief-kerry-nye-on-his-retirement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…served in  this role for four consecutive terms. Over his 50-year career, Mark has  held a variety of positions, including patrolman, criminal  investigator, corporal, chief of police, and deputy coroner.\n\nMark's leadership has been pivotal, and he was responsible for many  rescue operations when the county experienced major floods.\n\nBeyond his role…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698576/recognizing-mark-lusk"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…through the  ranks, and in 2021, was appointed Captain of Patrol, the largest  division of the Lancaster City Bureau of Police.\n\nIn July 2022, Chief Mendez was sworn in as Chief of Police, becoming  the first Hispanic police chief in the bureau's history. During his  tenure, the bureau achieved accreditation from the Pennsylvania Chiefs  of Police Association…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}]