[{"senator": "John Larson", "party": "Democrat", "sentence": "…see that so many people have died  waiting to receive their disability payment.\n\nIt is long overdue for the number one antipoverty program for the  elderly  and for children of this country. More disability goes out to veterans  from Social Security than goes out from the VA.\n\nCongress needs to act. I would hope it would be bipartisan, but we  can't even…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…inform rural Americans and serve news deserts to discuss local  news, which, of course, they do, and they are often the only source of  educational programming for children around the country, but they are  also essential for disaster response and emergency preparedness.\n\nThere are 20 States that list NPR in their emergency response plans.  This infrastructure…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…HIRONO. Mr. President, I rise in recognition of educators in  Hawaii as well as across the Nation who are dedicating--have  dedicated--their lives to the benefit of the children of our country.\n\nThis week is Teacher Appreciation Week. And as this administration  attacks education and educators, it is more important than ever that we  recognize our educators…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Medicaid and Medicare, so they need these long-term hospitalization  programs available to them. That can be cut.\n\nWe are talking about the approximately 40 percent of children in this  country who benefit from Medicaid at some point in their lives. That  can be cut.\n\nThese cuts that would impact children and seniors would then go into  the coffer. Again,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…because of the Trump administration's budget.\n\nTheir budget proposes to eliminate Head Start, the nationwide program  that provides essential care to nearly 1  million children across our country. Meanwhile, the White House is  assessing ways to ``persuade women to have more children.''\n\nI am an OB/GYN. It has been my life's work to help women have  children.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…know if their funding will be cut, and from young people, the  very children that these programs serve, who are afraid because this  administration is terrorizing the children of this country by attacking  education and schools and their families, attacking the most vulnerable  families.\n\nI have to say this, Mr. Speaker, there is no demand for this. There…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698935/protecting-education-for-children-with-disabilities"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…or we could rename the Gulf of Mexico.\n\nWe could be protecting Social Security and Medicare, protecting  Medicaid, finding affordable childcare for the millions of children in  this country and reducing the high cost of living that so many families  in all of our districts are struggling to afford basic necessities, or  we could rename the Gulf of Mexico.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690744/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Congress is shoving a budget through that will  gut Medicaid, the very health insurance program that covers 40 percent  of all births and insures almost half of all children in our country.  As an OB/GYN, as a mother, as a Member of Congress, and as an American,  this is unconscionable to me. We already have a maternal health crisis  in our country.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691420/gop-tax-scam-hurts-everyone"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…This repeal will widen educational disparities in our country, it  will deepen the digital divide, and it will slam shut the doors of  opportunity for millions of children in our country.\n\nWe should be doing everything in our power to close the homework gap  that exists between rich and poor in our Nation, not reopen it, not  make that homework gap…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…was sent to the  President drawing on our diverse backgrounds and constituencies to let  him know exactly why science is a good investment for the future of our  children and for our country.\n\nMake no mistake, we can always be better and more efficient, and  these are ideals that we should all strive for. These are ideals that  Americans fairly demand…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…would have to go into a facility.\n\nSo I want to thank you for shining the light and ringing the alarm.  And I want to ask you, what do you think will be the impact on children  in this country without Medicaid?\n\nMr. BOOKER. I am so grateful for that question. It sobers me when you  ask it because just a reduction in Medicaid--I love that metaphor use--…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, for years, I have come to this floor  and I have talked about what Big Tech is doing to our children in this  country. There is an entire generation of children that have become the  product when they are online on some of these social media platforms.\n\nWhat we have learned, as we…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…she will lose $25,000 to $30,000 a year.\n\nThis is why since the Great Society in the 1960s we have gone from a  situation in which in the fifties, 4 percent of the children in this  country were born out of wedlock. Now we are in a position in which we  have over 40 percent of the children in the country who are born out of  wedlock. It did not happen…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "John James", "party": "Republican", "sentence": "…teachers, and given children the opportunity to learn, grow,  and succeed.\n\nToday, IDEA protects nearly 8 million students, roughly 15 percent of  all public school children in this country. It requires our schools to  identify and support students who need services, including children  experiencing homelessness and those attending private schools.\n\nFor…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…benefits.\n\nMr. Speaker, a question is: Is this a penalty for getting married? It  has had a huge impact on society. I point out that in the 1950s, 4  percent of the children in this country were born out of wedlock. That  number is now over 40 percent. America has fundamentally changed  because of these programs.\n\nThe question is: Was this on purpose,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…saved money for everyday  Americans, President Trump has kept his commitment to protect American  children and families by halting so-called gender-affirming care for  children in this country.\n\nAs another testament to his impressive pace, President Trump has also  signed 27 bills into law, the greatest of which, the One Big Beautiful  Bill Act, delivers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that great if we continue to punish and penalize  any family that has both parents at home.\n\nAmerica has changed dramatically. In the 1960s, about 5 percent of  the children in this country were born into families without both a  mother and father at home. I want to point out, I know families of all  sorts of backgrounds. I know parents who have done…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Commonwealth, from Laurel County to Jefferson  County, are facing serious health and safety concerns due to THC  poisoning from hemp-derived products, and so are children all across  the country. It is not just a Kentucky problem.\n\nHow did we get here? Let's go back to the beginning.\n\nBack in 2014, I lead the effort to secure pilot programs for  industrial…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Americans who have had their Social Security  numbers stolen or misused each year.\n\nBy taking swift action today, we can prevent a lifetime of financial  harm to American children across the country.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  yield back the balance of my time.\n\nMr. SMITH of Missouri. Mr. Speaker, on that I demand…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…situation in  which you are penalized $25,000 a year if you get married.\n\nThis is the primary reason why, in the 1950s, we only had about 4  percent of the newborn children in this country  born without a mother and father at home, and now, we are over 40  percent.\n\nIt is not difficult if people in this body would meet with some  average people rather…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698433/republicans-have-delivered-in-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Speaker, I rise today in support of  H.R. 649, the Whole Milk for Healthy Kids Act, legislation to permit  schools to provide whole milk at school lunches.\n\nSchool children throughout our country are unable to receive the  health benefits and the nutrients that whole milk provides due to out- of-date regulations that limit the type of milk that students…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}]