[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…majority of new jobs, drive innovation, and generate almost half of  our Nation's economic activity. They are the heart and soul of our  communities. Whether it is a neighborhood childcare center, or a bakery  on Main Street, they are creating neighborhood jobs and reinvesting in  the local economies.\n\nMore than 21 million small businesses were launched during…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…rely on SNAP to feed  their babies; disabled veterans in Randolph who receive lifesaving care  and benefits through the VA; families in Roxbury who rely on Head Start  for childcare.\n\nThis Republican majority said they would spend the next 2 years  cutting costs for the middle class, but the only thing they are cutting  is trillions of dollars from lifesaving…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…household. That is money many families in New  Hampshire and across this country can't afford to pay when they are  trying to cover the costs of groceries, of housing, of childcare, of  energy--all of those things that President Trump, when he was running  for President, said he was going to address.\n\nI have heard from many New Hampshire families about…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…immediately, and then we need to get back to work on progressive and  equitable solutions that leave no family behind.\n\nFamilies are still facing high costs for housing, childcare,  groceries, and other everyday necessities. House Democrats and the  Congressional Progressive Caucus will continue to stand with the  American people to protect their healthcare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…provisions that will help ease  the financial pressures of military families.\n\nIt also extends the Child Care in Your Home pilot through 2029 and  requires annual reviews of childcare fee assistance.\n\nWe also include protections I championed for our Department of  Defense civilian workforce, barring arbitrary layoffs for DODEA  teachers and childcare staff,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…their tax credits expire in 17 days.\n\nThis is all in the context of folks seeing their housing costs  increase, whether it is rent or mortgage, their energy bills increase,  childcare increase. A lot of folks are facing the prospect that they  cannot pay their rent and their health insurance, so they are playing  the lottery, figuratively: The lottery…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Caucus freshmen colleagues and I are focused on  making life better for the American people and driving down grocery  prices, utility bills, rent and mortgage payments, and childcare and  elder care costs so that hardworking people can breathe easier.\n\nTo help working families, especially multigenerational households,  deal with the rising costs of living,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…because the  Republican majority chooses to spend the American people's money on tax  breaks for billionaires instead of spending it on our kids, and instead  of spending it on childcare, housing, healthcare, on things that really  make people's lives far more affordable.\n\nWhat is the worker getting in return in this situation? It is just  the opportunity…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…premiums increase as much as $1,000 a month.\n\nOpen enrollment deadlines have already passed. Parents have sat at  their kitchen tables and realized that between rent, groceries,  childcare, and Trump's tariffs driving up the cost of damn near  everything, health insurance is something they could no longer afford.\n\nInstead of a plan on healthcare, last night…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Democrats will lay out cleanly and comprehensively how we can  lower costs for the American people on a number of different topics-- from health to housing, to groceries, to childcare, to energy costs,  and beyond.\n\nIn the coming weeks, for example, I will work with a number of my  colleagues, including Senator Warren, on the many options we have to  help…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…community center that protects public health and provides       valuable resources for local residents. That sounds like a       home run project to me. The center would provide childcare       for up to 200 children, create an on-site learning       laboratory, and provide vocational scholarships for students       to pursue careers in fields such as engineering…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…year later in the United States of America, Mr.  Speaker, costs haven't gone down. Costs have gone up. Housing costs are  out of control. Healthcare costs are out of control. Childcare costs  are out of control. Electricity bills are out of control, and the price  of groceries and everyday goods are completely out of control.\n\nOne of the reasons why the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "…American people sent us here to work together to  address issues like the affordability crisis. Democrats are ready to  work with anyone to make housing more affordable, to make childcare  more affordable, and to make everyday goods like groceries less  expensive.\n\nMr. Speaker, the policies within this big, ugly bill are going to  raise costs and not lower…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693158/one-big-beautiful-bill-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…BELL. Mr. Speaker, I rise today because working people in St.  Louis and across this country are getting squeezed from every  direction. Groceries cost more. Rent costs more. Childcare costs more.  Healthcare costs more. For too many families, every month feels like a  math problem they can't solve.\n\nFor generations, the American Dream meant that if you…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…$40,000 a year,  yet the median rent is more than $1,000 per month. That means housing  costs are often the largest part of a monthly budget, and this is even  before groceries, childcare, or healthcare.\n\nIt is not just renters who are feeling the squeeze. Homeowners are  feeling the squeeze, too. The median home value in Ohio's 13th District  is about $228,000.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…pays the price.\n\nMany employers want to provide child and elder care for their  employees, but the law discourages them from  doing so by asserting that routinely provided childcare must be  included in an hourly employee's regular pay rates.\n\nThe Empowering Employer Child and Elder Care Solutions Act removes  this longstanding obstacle for employers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…efforts. It is critical that our servicemembers and their families have  the infrastructure and support they need. This bill delivers to  construct and improve military housing, childcare centers, and other  quality-of-life components that are so important to those who risk so  much.\n\nThis bill continues to build on investments that strengthen our  national…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…most. One of these groups is  families with children. Those with small kids often have to choose  between living on one income or incurring the increasingly high cost of  childcare. If we hadn't passed the Working Families Tax Cuts bill,  these families would have been slapped with a tax increase, with the  child tax credit scheduled to decrease from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…passed the  Working Families Tax Cut Act. This important legislation puts more  money back into the pockets of Americans and will help lower the cost  of healthcare as well as childcare.\n\nThanks to the Working Families Tax Cut Act, all Bronze and  Catastrophic ACA Marketplace plans are now considered high-deductible  plans, allowing more people to contribute…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…world.\n\nAt Naval Station Norfolk, I heard from commanders and sailors about  the importance of readiness and from military families about the daily  challenges of housing, childcare, and the costs of moving.\n\nThe One Big Beautiful Bill Act makes historic investments in quality  of life for our servicemembers, providing over $7.5 billion this year  for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…families who sustain our national security  every single day.\n\nIt invests directly in the men and women who wear the uniform by  improving pay, strengthening housing, expanding childcare, and ensuring  access to timely, high-quality healthcare. It also makes targeted  improvements to training capabilities and modernization so our force  remains the world's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697791/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Under this bill, the budget will provide for restoration and  renovation of barracks, more funding for the Defense Health Program,  aid to military families by adding to the childcare fee assistance, and  bonuses for members of the military.\n\nThis policy reflects our commitment to honoring the sacrifices of our  military by investing directly in servicemembers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…individuals on the spectrum. By raising awareness, we can  better support individuals and families affected by autism, helping  them lead fulfilling lives.\n\nOur schools and early childcare programs must be equipped with the  knowledge, resources, and training to assist those living with autism.  Early diagnosis and intervention are critical, as they can  significantly…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…(as defined in section 2102 of title 5)       in the Coast Guard:\n\n``(1) Any category of medical or health professional       positions within the Coast Guard.\n\n``(2) Any childcare services position.\n\n``(3) Any position in the Coast Guard housing office of a       Coast Guard installation, the primary function of which is       supervision of Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…the delivery of Next Generation  aircraft and autonomous systems.\n\nJust as important, it puts our troops first, with $8.5 billion to  improve barracks, housing, healthcare, childcare, and career support  for military families.\n\nAt a time when global threats are growing, this bill ensures America  leads from a position of strength, not weakness. It is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…American people.\n\nMr. Speaker, I rise today to highlight a critical investment for Iowa  families, the $2.78 million in community project funding I secured for  the Newton YMCA childcare expansion.\n\nThis funding will allow the Y to open 50 new childcare slots, giving  working parents in Jasper County the reliability and support they  urgently need.\n\nAccess…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "John Carter", "party": "Republican", "sentence": "…amendments that  raise awareness on programs that we all care about. That includes the  need to address a variety of medical care issues at the VA, the need to  build more childcare development centers, construct more State  extended-care facilities, expediting claims processing, and many  others.\n\nMr. Chair, I encourage my colleagues to support this…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…financial support workers need  to provide care for their young children and elderly parents.\n\nCurrent law discourages employers from helping their workers pay for  onsite childcare or elderly dependent care because of the unreasonable  pay calculations that increase costs and burdensome regulations for the  company.\n\nThis guidance is so outdated. It…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…quality of life, the 3.8 percent pay raise is vitally important to  these folks who are serving our country. There is the $350 million this  bill authorizes for expanded childcare facilities for military  families. There is the $35 million that it authorizes for impact aid in  support of the communities who support our fighting men and women.  There…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695108/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…businesses by increasing the section 199A deduction  to 23 percent.\n\nIt incentivizes made in America.\n\nIt creates new Trump savings accounts for newborns. It expands access  to childcare for hardworking families.\n\nIt provides historic increases in funding for the U.S. Coast Guard.\n\nIt supports building new factories to grow domestic business  operations.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}]