[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…primary source of long-term care, the single largest payer in the  country for behavioral health services, and a principal source of  insurance for pregnant women and children with disabilities.\n\nOne of the proposals that is now being discussed in Congress to  achieve Medicaid savings is adding work requirements. In fact, Georgia  added work requirements…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…is too late.\n\nTexans are paying attention, and I am here to sound the alarm on this  outrageous bill. In Texas, over 5 million people depend on Medicaid.  They are children with disabilities, working moms, and aging parents in  nursing homes. These cuts will lead to fewer doctors, longer wait  times, and hospitals closing. Yes, people will die because…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…administration promises comes  with little accountability, making it unclear whether the funds will  actually reach the students and schools that need them the most:  children with disabilities in rural and low-income communities.\n\nEducation lays the foundation for a strong future. Our Founding  Fathers understood that. Today's students are the entrepreneurs,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…vital part of the  American Dream. The embodiment of that promise came in 1975 when  Congress passed the Individuals with Disabilities Education Act to  ensure that children with disabilities could receive a free, fair, and  equal education.\n\nThis landmark legislation changed the lives of millions of Americans.  The disabled children's right to an education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…schools and manage the $1.6 trillion Federal student aid program.\n\nParents are concerned about disruptions to programs and services that  ensure that the 7.5 million children with disabilities and the 49  million students enrolled in K-12 public education will still get the  education they deserve.\n\nMy legislation, the Department of Education Protection…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689051/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…everything going on, it is easy to overlook what is  happening at the Department of Education.\n\nToday, I would like to highlight the concerns of parents who have  children living with disabilities. They are scared, concerned, and  confused.\n\nThe Individuals with Disabilities Education Act, or IDEA, is the  Federal law that ensures children with disabilities…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…stay  out of the workforce because they can't afford treatments for chronic  conditions like lupus, making them too sick to work; a country where  families who have children with disabilities can't find adequate  coverage to provide the kind of complex care, both at home and in  school, that these children need. One issue, in particular, I want to  highlight…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Education.\n\nIDEA is not a suggestion. It is not discretionary. It is the law of  the land, and for more than four decades, it has represented a  bipartisan commitment that children with disabilities have the right to  a free, appropriate public education, one that meets their individual  needs and recognizes their full potential.\n\nBefore IDEA, millions of children…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…protect our children,  especially making sure that we have access to public education and  quality education for all of our children.\n\nAlongside millions of children, including children with disabilities  and their families, we are demanding that Congress fulfill its promise.\n\nNearly 50 years ago, Congress passed the Individuals with  Disabilities Education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…abstract policy. It is about whether people can get care and whether  caregivers can keep going.\n\nI have met grandparents caring for grandchildren, parents caring for  children with disabilities, and adult children caring for aging loved  ones, often with no backup and no break.\n\nThat is why the 5-year reauthorization of the Lifespan Respite Care  Program…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699329/consolidated-appropriations-act-2026"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…are pursuing.\n\nRepublicans will also cut $1 trillion out of Medicaid, and that will  gut healthcare services for millions of seniors, for pregnant women,  and for children with disabilities.\n\nMr. Speaker, the Democrats will defend our borders, and we will do  this with wise legislation and comprehensive reform.\n\nUnfortunately, last year, a congressional…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…the 50th anniversary of  the passage of the Individuals with Disabilities Education Act. At the  time, that was a landmark piece of legislation that made sure our  children with disabilities had what they needed to succeed in the  classroom.\n\nThe IDEA hasn't been fully funded for decades, meaning these kids  aren't receiving all the support that they…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697177/ensuring-access-to-education-for-our-children-with-disabilities"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…workforce, and worked to strengthen housing  and community-based support services.\n\nHer compassion extended to her home where Ms. Abderholden and her  family fostered children with disabilities and youth aging out of  foster care, offering stability and care when it was most needed.\n\nOn behalf of myself and countless Minnesotans, I offer my gratitude  to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690723/recognizing-sue-abderholden-for-her-work-on-behalf-of-those-with-disabilities-and-mental-illnesses"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…this bill in the House of Representatives and understands  exactly what I am talking about.\n\nThat is an example, when you look at Medicaid and the use for, yes,  children with disabilities, kids throughout our land, but also our  seniors for nursing homes and assisted living, then you look at  Medicare and how important that is, then you look at the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…access to care.  Ambulances end up having to drive farther and farther. Wait times  increase. Lives are at risk.\n\nThe ripple effects are vast. Schools will suffer when children with  disabilities lose access to Medicaid support services like physical  therapy, transportation, and mental health support. Children's  abilities to learn and thrive is compromised.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…you to get out from having to live with your parents as a benefit for  having a low income.\n\nMedicaid; TANF, a cash benefit; childcare; Pell grants; payments for  children with some disabilities, all of these programs are conditioned  upon not making too much money and, of our primary concern today, not  marrying somebody who makes too much money.\n\nFrequently,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…same. It is to root  out waste, fraud, and abuse and to strengthen and sustain Medicaid for  those for whom the program was intended to serve: expectant mothers,  children with disabilities, the poor, and the elderly.\n\nMs. FOXX. Mr. Speaker, all time yielded is for the purpose of debate,  and I do not yield for that request.\n\nMs. FOXX. Mr. Speaker, all…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a high school band in the 1930s,  the Leechburg Rotary has always stepped up to improve life for their  neighbors.\n\nWhether it is supporting veterans or assisting children with  disabilities or flipping pancakes for a good cause, generations after  generations of Rotarians have kept the spirit of service alive.\n\nThe Leechburg Rotary Club has helped build…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692828/leechburg-rotary-club-celebrates-100-years-of-service"}, {"senator": "John James", "party": "Republican", "sentence": "…disability, deserves a free and appropriate public education in  the least restrictive setting possible.\n\nThat promise changed America.\n\nBefore 1975, more than a million children with disabilities were shut  out of public schools. Too many were pushed into charity-run facilities  or psychiatric institutions. Far too many were left without any  education at…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}]