[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "Did any one of them vote to say to children that, until they are 26  years old, they have access to your policy?", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Simply put, our economy is not serving hardworking families and the  basic promises of the American Dream, like homeownership or putting a  child through college, are harder and harder to reach.", "title": "Stop the Republican Affordability Crisis", "date": "2026-02-03"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "It is dairy farmers in Vermont who produce the powdered milk  that USAID uses to feed millions of hungry children in Africa, Central  America, and Asia.", "title": "Usaid", "date": "2025-03-04"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "5658, the Child  Care for Every Community Act, a bill originally introduced by  Representative Sherrill of New Jersey, for the purpose of adding  cosponsors and requesting reprintings pursuant to clause 7 of rule XII.", "title": "Permission for Member to Be Considered As First Sponsor of H.R. 5658", "date": "2026-02-04"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Do we believe that the greatest country in the world should be able  to treat the people who need help in our country or are we OK with the  poorest among us, the weakest among us--those who are disabled, those  who are elderly, those who are children--just not having access to  care?", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "However, I am also a mother, deeply concerned about the world  we are leaving our children.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "The other one of these countries acted like a child.", "title": "Gun Violence Tragedies", "date": "2025-12-17"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "6715, the Child  Predators Accountability Act of 2025.", "title": "Child Predators Accountability Act", "date": "2026-01-12"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "As technology has become more sophisticated, online threats against  children have become more complicated, malicious, and sometimes deadly.", "title": "Coercion and Sexual Abuse Free Environment Act", "date": "2026-01-12"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Her unwavering belief that ``nothing you do for children  is ever wasted'' has guided her leadership and inspired a generation of  educators to pursue equity, access, and excellence in every classroom.", "title": "Recognizing Parvin Ahmadi", "date": "2025-06-03"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "I am here because I know what education can do, what it did  for me, what it has done for millions of children across this country,  and I cannot sit quietly as one of the cornerstones of our democracy is  chipped away.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "On Halloween weekend alone, Bovino deployed tear gas in a residential  neighborhood as children were gathering for a Halloween parade.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "When I was just 9 years old, I had a very serious childhood illness.", "title": "Healthcare", "date": null}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "China is now replacing a canceled American program for child  nutrition in Cambodia, and Beijing just announced an early childhood  project in Rwanda, where the United States recently cut our program.", "title": "-9999", "date": "2025-04-29"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Speaker, I rise today in support of the  Whole Milk for Healthy Kids Act, as amended by the Senate, which allows  for plant-based milk alternatives to be more easily and readily  available for children with lactose intolerance.", "title": "Whole Milk for Healthy Kids Act of 2025", "date": "2025-12-15"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "While at home sick from school, 11-year-old Josie Pethan was  confronted with a nightmare scenario that no child should have to  experience.", "title": "Recognizing Josie Pethan and Brenda Dawes", "date": "2026-01-14"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Speaker, how do you look a rape victim or a domestic violence  victim in the eye and tell them that the good folks in your community,  the advocates and the supporters of domestic violence services or rape  crisis centers or child advocacy centers who want to be there to help  you in your time of greatest need may not be there because their  government didn't pay the bills?", "title": "Crime Victims Fund Stabilization Act of 2025", "date": "2026-01-12"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "UNLAWFULLY COMPELLING CHILDREN.", "title": "Coercion and Sexual Abuse Free Environment Act", "date": "2026-01-12"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "We are not going to use child slave labor like over in Congo.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "The English philosopher Francis Bacon (1561-1626)       said truth is the child of time, meaning that it emerges and       is revealed through the passage of time, not through       someone's immediate authority or declaration.", "title": "Recognizing Campbell: the Nature of Truth, Odessa American", "date": "2025-08-26"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "He was unafraid to declare himself a child of God.", "title": "-9999", "date": null}, {"senator": "Blake Moore", "party": "Republican", "sentence": "That is what we knew was  coming, and we worked hard to accomplish a lot of really key important  progrowth elements: no tax on tips or overtime, an increased child tax  credit, tax relief for seniors, an increased standard deduction  targeted entirely at the middle- and lower-income Americans, investment  in rural America.", "title": "How Republicans Have Delivered for Americans", "date": "2026-01-14"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "And what we have learned  is that today in the United States a child is either bought or sold for  sex every 2 minutes.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-02-26"}, {"senator": "John Thune", "party": "Republican", "sentence": "Back in 2017, during the first Trump administration, Republicans  passed the Tax Cuts and Jobs Act, legislation that cut Americans' tax  rates, doubled the child tax credit, and nearly doubled the standard  deduction.", "title": "One Big Beautiful Bill Act", "date": "2025-07-08"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "In the past few  months, Director Berg's officers have removed dozens of dangerous  criminal illegal aliens from Minnesota, including known terrorists,  gang members, child predators, and murderers.", "title": "Recognizing St. Paul, Minnesota Immigration and Customs Enforcement Field Office Director Peter Berg", "date": "2025-06-23"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "In Louisiana alone, that is 804,000  individuals, including 312,000 children, who rely on SNAP.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Each year, during the  annual meeting, funds are donated throughout the Foundation's programs,  which include: Charity Care, Adult and Child Bereavement Counseling, a  camp for kids ages 6 to 17 that teaches them to manage grief and  reassures them they are not alone in their loss, Building a Children's  Bereavement Center, Circle of Hope in Pasco County, and renovations in  Citrus and Hernando counties.", "title": "Recognizing Sue Simone", "date": "2025-06-04"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "The most vulnerable are our children and young adults.", "title": "Human Trafficking Awareness Month", "date": "2026-01-13"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "The perpetrator's rap  sheet includes arrests for homicide, assault, cruelty toward children,  domestic violence, and damaged property.", "title": "Providing for Consideration of H.R. Consolidated Appropriations Act, and Providing for Consideration of H.R. Department of Homeland Security Appropriations Act, and for Other Purposes", "date": "2026-01-22"}]