[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…knowledge  not just from the Energy and Commerce Committee, but I serve on the  bipartisan Select Committee on the Strategic Competition Between the  United States and the Chinese Communist Party. My colleague, Republican   Rob Wittman, and I led a critical minerals working group in the last  Congress.\n\nIt is clear the United States is way too reliant on…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…this year, that a stunning number of battery factories are being  canceled.\n\nWhy are factories being canceled in the year 2025, Mr. Speaker?\n\nAre we supposed to call the Chinese Communist Party and ask them to  go and get these batteries and start making these batteries?\n\nAre we just not going to have batteries made in the United States of  America?\n\nWhy…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Confucius Institutes  and Chinese Entities of Concern Act seeks to help address the threat  posed to U.S. colleges and universities by the People's Republic of  China and Chinese Communist Party.\n\nThe People's Republic of China and the CCP have poured hundreds of  millions of dollars into U.S. universities through Confucius Institutes  and other programs.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…after week after week.  Donald Trump found the time to pardon serial fraudsters like George  Santos and Rudolph Giuliani. Donald Trump found the time to meet with  the Chinese Communist Party. Donald Trump found the time to destroy the  east wing of the White House. Donald Trump found the time to extort  $230 million from the Department of Justice so…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…is why I would like to submit for the  Record a report by Rutgers University entitled ``A Tik-Tok-ing  Timebomb: How TikTok's Global Platform Anomalies Align with the Chinese  Communist Party's Geostrategic Objectives,'' which can be found online  at https://networkcontagion.us/wp-content/uploads/A-Tik-Tok-ing- Timebomb__12.21.23.pdf.\n\nOn the flip side…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…was the greatest catastrophe of the 21st century. Of him,  Trump said, ``Putin, very smart,'' and, ``Will he become my new best  friend?''\n\nWhat about the chief of the Chinese Communist Party, President Xi?  Trump described him as a ``brilliant man,'' and that he has ``the look,  the brain, the whole thing.'' President Trump has no problem with the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…loud what they are  thinking. That  is they want to minimize and destroy the role of the U.S. dollar  internationally. What do they do to hobble the dollar? They say the  Chinese Communist Party can have a digital yuan, the bitcoin bros can  have a digital currency, but America is limited to 1776 technology.\n\nOur banking system is the envy of the world…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…whether or not that  export is consistent with the public interest. Republicans and the  industry want to eliminate that important review, that even if the gas  goes to the Chinese Communist Party and other foreign adversaries that  is okay, there is no need to look and no need to review that. That is  wrong and dangerous.\n\nAren't Republicans in Congress…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…gentleman from  Illinois (Mr. Krishnamoorthi), who is the distinguished ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party.\n\nMr. BEYER. Madam Chair, I yield 1\\1/2\\ minutes to the gentleman from  New York (Mr. Morelle), who is a distinguished member of the House  Administration Committee.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…since then, it has been the  main way that the United States has helped to strengthen democratic  institutions around the world.\n\nNED exposes Russian propaganda, counters Chinese Communist Party  censorship, circumvents the Iranian regime's efforts to silence  critics, and highlights corruption and drug trafficking in Venezuela.  And it does all of that…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699435/consolidated-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…From my vantage point of serving on the Science, Space, and  Technology Committee and the Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party,  I certainly understand the risks. Many of us who are delving into these  topics have really glommed on to the risks posed to our research  enterprise from adversaries…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Madam Chair, I rise today as the ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party, the CCP, to express serious  concerns about the proposed cuts in the Republicans' budget resolution.\n\nFirst, the resolution includes $880 billion in cuts to programs…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, on tariffs, early this morning, it was  reported that Donald Trump caved to Xi Jinping and the Chinese  Communist Party, with virtually nothing to show for American workers.  Donald Trump has changed his mind, once again, on his tariffs, with a  new ``deal'' with China to pause most…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…of H.R. 906, the Foreign Adversary  Communications Transparency Act. At the end of last year, we learned  that Salt Typhoon, a cyber espionage operation backed by the Chinese  Communist Party, infiltrated several American telecommunications  networks to gain access to detailed information on former Vice  President Harris and other political figures,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…D.C. and most of the country--think is important and  what House Republicans are willing to do.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I would remind you that the  Chinese Communist Party is no longer an economic adversary. They are an  enemy. They have been very creative in the way they have embedded  themselves into the university systems in this…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…exploited to gain the upper  economic hand is through both inbound and outbound flows of capital. By  investing in U.S. companies, the People's Republic of China and the  Chinese Communist Party can obtain access to intellectual property and  know-how. And, of course, they have no shame. Again, they don't play by  our rules. They are not afraid to cheat…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…minerals from coal ash and coal byproducts.\n\nMr. Speaker, the alternative to American mineral dominance is buying  foreign minerals from supply chains controlled by the Chinese Communist  Party. That is where we are now: mineral dependence. Mineral dependence  benefits no one except the CCP. Mineral dependence does not help the  environment. It does not…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…discovered in Reedley because I requested a report from the  House of Representatives, an investigation which resulted in a report  by the House Select Committee on the Chinese Communist Party.\n\nI want to share some of the details of that report, but I will start  with its conclusion: That no one knows whether there are other unknown  bio labs because…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…abuses against the Uyghur people.\n\nThis includes severe physical abuse, as well as the forced collection  of biometric data like DNA and fingerprint samples.\n\nWhile the Chinese Communist Party refuses to admit it, researchers  believe these abuses are a part of China's ``second-generation ethnic  policy.'' This policy advocates the forced assimilation…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…to manipulate the material children  are being taught.\n\nMillions of dollars of Chinese funds have flowed into America's K-12  classrooms where students are subject to Chinese Communist Party  propaganda under the guise of Chinese language and culture programming.\n\nIn fact, a recent Parents Defending Education investigation found  that 143 schools across…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…again will we allow open borders to trample our community,  endanger our citizens, and filter dangerous narcotics into our  communities.\n\nNever again will we allow the Chinese Communist Party to buy up our  lands, our meatpacking facilities, and our critical medical production  companies.\n\nNever again will we allow our communities to get overrun with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…finalize the NDAA this year, I remain  adamant in my provisions to address outbound foreign investments that  they be included in the final version.\n\nWe all know that the Chinese Communist Party is the greatest national  security threat--not just to the region but globally--at this time.  What many of us did not fully appreciate is how American investors…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…ensure democracy and Western values prevail.\n\nAdditionally, the National Endowment for Democracy does important  work to counter hostile, authoritarian regimes like the Chinese  Communist Party and the Iranian regime. It is important for us to  support this American institution and organization, which is based here  in Washington, D.C., that defends our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…necessitates diligent oversight by Congress to ensure that these  programs are operating efficiently and are protected from theft and  abuse by our adversaries, such as the Chinese Communist Party.\n\nThe reauthorization Congress passed in 2022 for these programs  addressed some vulnerabilities, but more work needs to be done. Both  the Small Business Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695451/extension-of-sbir-and-sttr-authority"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Madam Speaker, last week I was proud to  support the Stop Chinese Fentanyl Act, legislation that will put  sanctions on any individual, including senior members of the Chinese  Communist Party, who are responsible for the production, the  distribution, the sale, or the financing of synthetic opioids.\n\nIt is no secret that China is the leading producer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…1005) to prohibit elementary and secondary schools from  accepting funds from or entering into contracts with the Government of  the People's Republic of China and the Chinese Communist Party, and for  other purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. WALBERG.  1005.\n\nMr. Speaker, I rise…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…of American innovation could not be higher.\n\nMy 12 years of service in the Army provided me with a deep  understanding of the criminal transnational activities of the Chinese  Communist Party. CCP intellectual property theft is not a distant  threat. It is actively happening, and it is targeting military  readiness and the very foundations of American…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…chains and manufacturing  capabilities have been brought into sharp focus in recent years. We  cannot continue to allow foreign competitors, particularly China and  the Chinese Communist Party, to control our supply chains and create  economic vulnerabilities.\n\nConsider our infrastructure and emerging technologies. We have seen  how foreign control of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690289/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…for not  disclosing that a faculty member receiving a NASA grant taught at a  Chinese university.\n\nA 2024 joint investigation between the House Select Committee on the  Chinese Communist Party and the House Committee on Education and  Workforce found 21 joint U.S.-Chinese education institutes. A case  study of two such institutes, UC Berkeley and Georgia…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…and concrete produced  in China, which is home to the world's largest cement industry. It  should go without saying that it is a big problem to be at the whims of  the Chinese Communist Party when it comes to materials that are  absolutely critical to our national defense, economic security, and our  energy independence.\n\nBeyond that, this reliance comes…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}]