[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "One noteworthy  example is the legislation Congress passed to force the divestment of  TikTok from ownership by companies controlled by the Chinese Communist  Party, which passed overwhelmingly with hundreds of Democratic and  Republican votes."}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Krishnamoorthi), who is the distinguished ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "\"This resolution sends a strong, bipartisan message to the Chinese government that the United States stands with brave defenders of freedom--from the victims in Tiananmen Square and democracy advocates in Hong Kong, to the millions of Uyghurs persecuted in Xinjiang--against their repression.\" \n\n\"Today we commemorate the tragic massacre directed by the Chinese Communist Party at Tiananmen Square,\" said Suozzi."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Dear Secretary Pompeo, On this 31st anniversary of the Tiananmen Square massacre, we write with great alarm regarding the continued efforts by the Chinese Communist Party to rule by fear and oppression."}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "They say the  Chinese Communist Party can have a digital yuan, the bitcoin bros can  have a digital currency, but America is limited to 1776 technology."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "Senators Pat Toomey (R-Pa.) and Chris Van Hollen (D-Md.) have introduced bipartisan legislation to defend Hong Kong's autonomy against increasingly brazen interference from the Chinese Communist Party."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "It comes with a price of subservience and dependency on the  Chinese Communist Party."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Republicans and the  industry want to eliminate that important review, that even if the gas  goes to the Chinese Communist Party and other foreign adversaries that  is okay, there is no need to look and no need to review that."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "In November 2019, the Chinese Communist Party (CCP) nominated a candidate to head this global organization, which was created to \"promote the protection of intellectual property among states.\" Given China's persistent violations of IP protections, including through trade secret theft, corporate espionage, and forced transfer of technology, the United States and its allies must stand firmly against such a move."}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Of him,  Trump said, ``Putin, very smart,'' and, ``Will he become my new best  friend?''\n\nWhat about the chief of the Chinese Communist Party, President Xi?"}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "National security experts have raised concerns about TikTok's collection and handling of user data, including user content and communications, IP addresses, location-related data, metadata, and other sensitive personal information, particularly when viewed in light of laws that compel Chinese companies to support and cooperate with intelligence work controlled by the Chinese Communist Party."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "\"For far too long the Chinese Communist party has gotten away with the systematic use of forced labor by Uyghur Muslims and other Turkic Muslim minorities in Xinjiang,\" Rubio said."}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Speaker, I would remind you that the  Chinese Communist Party is no longer an economic adversary."}, {"senator": "Robert Menendez", "party": "Democrat", "sentence": "Tsetkova has been placed on house arrest and faces years of  imprisonment for her creative work at a youth amateur theater which the  state has labeled ``homosexual propaganda,'' for drawings described as  criminal ``pornography'' and for administrating two LGBT-themed groups  on social media deemed'' gay propaganda.') \n\n  The Chinese Communist Party has waged a powerful campaign to suppress  vibrant ethnic minority communities and political dissent."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "Senator Ben Sasse, a member of the Senate Select Committee on Intelligence, issued the following statement regarding the Chinese Communist Party's fraudulent coronavirus data."}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Parents may think the Chinese Communist Party isn't interested in  what their kids are learning, but the CCP wants to influence every  American."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Cruz targeting China's censorship, oppression, and human rights violations, including bills of relief for imprisoned political dissidents and a successful push throughout 2019 to secure the blacklisting of companies that the Chinese Communist Party uses in its oppression of minorities such as the Uyghurs in the Xinjiang Uyghur Autonomous Region (XUAR)."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "\"The Chinese Communist Party must be held accountable for misleading the world about the scope and danger of the coronavirus."}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Madam President, today is the 31st anniversary of the  Tiananmen Square massacre, when thousands of peaceful students asking  for their freedom were gunned down by Chinese Communist tanks and  troops."}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "Specifically, the Chinese Communist Party and its vast political-industrial apparatus will undoubtedly prey upon cash-strapped American companies during this crisis."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "journalists from China:\n\n\"The Chinese Communist Party's (CCP) decision to expel from China all U.S."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "\"The Chinese Communist regime withheld information and put the world at risk."}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Senator Tom Cotton (R-Arkansas) today introduced a bill that would prohibit the United States from sharing intelligence with countries that allow Huawei to operate their 5G networks:\n\n\"The United States shouldn't be sharing valuable intelligence information with countries that allow an intelligence-gathering arm of the Chinese Communist Party to operate freely within their borders."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "Are you trying to curry favor with the Chinese Communist Party?"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Xi, the General Secretary of the Chinese Communist Party, is a dictator and human rights violator who is denying basic rights to the people of Hong Kong, cracking down on dissidents, militarizing the South China Sea, and imprisoning more than one million Uyghurs in internment camps simply because of their religion."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Huawei's activities and infrastructure are a global espionage operation run on behalf of the Chinese Communist Party (CCP), thinly veiled as the business of a telecom company."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "We must do all that we can to counter Chinese Communist Party efforts to control the semiconductor supply chain, and work to help our own semiconductor industry grow.\"\n\n\"Semiconductors underpin nearly all innovation today and are critical to U.S."}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "The Chinese Communist  Party employs a CBDC that is being used to monitor and restrict its  citizens' spending."}]