[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…whether or not that  export is consistent with the public interest. Republicans and the  industry want to eliminate that important review, that even if the gas  goes to the Chinese Communist Party and other foreign adversaries that  is okay, there is no need to look and no need to review that. That is  wrong and dangerous.\n\nAren't Republicans in Congress…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…From my vantage point of serving on the Science, Space, and  Technology Committee and the Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party,  I certainly understand the risks. Many of us who are delving into these  topics have really glommed on to the risks posed to our research  enterprise from adversaries…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Confucius Institutes  and Chinese Entities of Concern Act seeks to help address the threat  posed to U.S. colleges and universities by the People's Republic of  China and Chinese Communist Party.\n\nThe People's Republic of China and the CCP have poured hundreds of  millions of dollars into U.S. universities through Confucius Institutes  and other programs.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…after week after week.  Donald Trump found the time to pardon serial fraudsters like George  Santos and Rudolph Giuliani. Donald Trump found the time to meet with  the Chinese Communist Party. Donald Trump found the time to destroy the  east wing of the White House. Donald Trump found the time to extort  $230 million from the Department of Justice so…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…is why I would like to submit for the  Record a report by Rutgers University entitled ``A Tik-Tok-ing  Timebomb: How TikTok's Global Platform Anomalies Align with the Chinese  Communist Party's Geostrategic Objectives,'' which can be found online  at https://networkcontagion.us/wp-content/uploads/A-Tik-Tok-ing- Timebomb__12.21.23.pdf.\n\nOn the flip side…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…was the greatest catastrophe of the 21st century. Of him,  Trump said, ``Putin, very smart,'' and, ``Will he become my new best  friend?''\n\nWhat about the chief of the Chinese Communist Party, President Xi?  Trump described him as a ``brilliant man,'' and that he has ``the look,  the brain, the whole thing.'' President Trump has no problem with the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…loud what they are  thinking. That  is they want to minimize and destroy the role of the U.S. dollar  internationally. What do they do to hobble the dollar? They say the  Chinese Communist Party can have a digital yuan, the bitcoin bros can  have a digital currency, but America is limited to 1776 technology.\n\nOur banking system is the envy of the world…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…communications networks.\n\nAlong with Representative Wittman, I serve on the bipartisan Select  Committee on the Strategic Competition Between the United States and  the Chinese Communist Party. Last Congress, the committee released a  bipartisan report on maintaining America's economic and national  security interests. The report found that the widespread…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…gentleman from  Illinois (Mr. Krishnamoorthi), who is the distinguished ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party.\n\nMr. BEYER. Madam Chair, I yield 1\\1/2\\ minutes to the gentleman from  New York (Mr. Morelle), who is a distinguished member of the House  Administration Committee.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…since then, it has been the  main way that the United States has helped to strengthen democratic  institutions around the world.\n\nNED exposes Russian propaganda, counters Chinese Communist Party  censorship, circumvents the Iranian regime's efforts to silence  critics, and highlights corruption and drug trafficking in Venezuela.  And it does all of that…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699435/consolidated-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…launching commercial  remote sensing systems and selling the data. We must ensure that the  United States remains at the forefront of this industry, especially as  the Chinese Communist Party is advancing in the remote sensing sector.\n\nAs a 2024 report from the Center for Strategic and International  Studies plainly put it: ``Should any one country dominate…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Madam Chair, I rise today as the ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party, the CCP, to express serious  concerns about the proposed cuts in the Republicans' budget resolution.\n\nFirst, the resolution includes $880 billion in cuts to programs…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, on tariffs, early this morning, it was  reported that Donald Trump caved to Xi Jinping and the Chinese  Communist Party, with virtually nothing to show for American workers.  Donald Trump has changed his mind, once again, on his tariffs, with a  new ``deal'' with China to pause most…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…of H.R. 906, the Foreign Adversary  Communications Transparency Act. At the end of last year, we learned  that Salt Typhoon, a cyber espionage operation backed by the Chinese  Communist Party, infiltrated several American telecommunications  networks to gain access to detailed information on former Vice  President Harris and other political figures,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…D.C. and most of the country--think is important and  what House Republicans are willing to do.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I would remind you that the  Chinese Communist Party is no longer an economic adversary. They are an  enemy. They have been very creative in the way they have embedded  themselves into the university systems in this…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…finalize the NDAA this year, I remain  adamant in my provisions to address outbound foreign investments that  they be included in the final version.\n\nWe all know that the Chinese Communist Party is the greatest national  security threat--not just to the region but globally--at this time.  What many of us did not fully appreciate is how American investors…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…I may consume.\n\nMadam Speaker, I rise in support for H.R. 1486, the Economic  Espionage Prevention Act, introduced by my colleague from Georgia (Mr.  McCormick).\n\nThe Chinese Communist Party is working to undermine America's  interests around the world and is the global supplier of America's  adversaries.\n\nAs President Trump and his administration are…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…support of  H.R. 1069, the Promoting Responsible Oversight To Eliminate Communist  Teachings for Our Kids Act, in order to protect our kids and to protect  our country.\n\nThe Chinese Communist Party is responsible for severe human rights  abuses and the suppression of fundamental freedoms, with a long and  well-documented history of censorship, oppression,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and it loses 60 percent of its battery life in a short period of  time?\n\nWe cannot forget that the critical minerals that are used to make  these EVs are sourced from Chinese Communist Party-controlled mines in  places like Congo, where 15 of the 19 industrial mines are owned by the  Chinese Communist Party. These mines have zero environmental standards,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…to manipulate the material children  are being taught.\n\nMillions of dollars of Chinese funds have flowed into America's K-12  classrooms where students are subject to Chinese Communist Party  propaganda under the guise of Chinese language and culture programming.\n\nIn fact, a recent Parents Defending Education investigation found  that 143 schools across…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Chair, imagine our esteemed universities, pillars of  free thought and innovation, quietly channeling millions into  investments linked to the Chinese Communist Party, Russian oligarchs,  or the Iranian regime. While our students learn about democracy and  liberty, their tuition dollars may be funding governments that stand…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Russia, Iran, Cuba, even Hezbollah. Communist China was  buying half a million barrels a day of oil from Venezuela--day after  day, after day. In exchange for that oil, the Chinese Communist Party  loaned Venezuela over $100 billion. Just hours before his arrest,  Maduro was meeting in Caracas with officials of the Chinese Communist  Party. This axis of aggression…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…ensure democracy and Western values prevail.\n\nAdditionally, the National Endowment for Democracy does important  work to counter hostile, authoritarian regimes like the Chinese  Communist Party and the Iranian regime. It is important for us to  support this American institution and organization, which is based here  in Washington, D.C., that defends our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…necessitates diligent oversight by Congress to ensure that these  programs are operating efficiently and are protected from theft and  abuse by our adversaries, such as the Chinese Communist Party.\n\nThe reauthorization Congress passed in 2022 for these programs  addressed some vulnerabilities, but more work needs to be done. Both  the Small Business Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695451/extension-of-sbir-and-sttr-authority"}, {"senator": "John James", "party": "Republican", "sentence": "…do everything in our power to ensure that our  Nation's supply chain is resilient, shock resistant, and protected from  nefarious foreign adversaries; this includes the Chinese Communist  Party. The threat from China is real, and the time to act is now.\n\nDuring COVID, we witnessed the risks of depending on a hostile supply  chain with shortages in medicine,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…WALBERG. Mr. Chair, I yield myself such time as I may consume.\n\nMr. Chair, I rise today in support of H.R. 1048.\n\nForeign nations, including our biggest adversaries like the Chinese  Communist Party, contribute billions of dollars to American  universities. The lack of transparency around foreign relationships  should concern every American as we see stolen…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…of American innovation could not be higher.\n\nMy 12 years of service in the Army provided me with a deep  understanding of the criminal transnational activities of the Chinese  Communist Party. CCP intellectual property theft is not a distant  threat. It is actively happening, and it is targeting military  readiness and the very foundations of American…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, I rise today in strong support of H.R. 1069,  the PROTECT Our Kids Act.\n\nThe Chinese Communist Party is executing the most sophisticated  global influence campaign of our time. They are not just targeting our  military or U.S. companies. They are targeting our…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697527/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…originates in China. Chinese labs manufacture the  chemicals. Chinese traffickers supply the cartels, and American  families pay the price in lives lost.\n\nThis bill holds the Chinese Communist Party accountable. It gives our  government stronger tools to sanction Chinese entities involved in the  fentanyl trade and puts pressure on the CCP to shut down the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…unlock AI's potential. It is time to ensure small businesses can  harness these capabilities as well, strengthening American  entrepreneurship and competing with the Chinese Communist Party across  every dimension of the AI race, including business innovation.\n\nThis legislation directs the National Institute of Standards and  Technology, or NIST, to…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}]