[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…that goes after foreign scapegoats instead.\n\nWe know that President Trump is the biggest threat to our education  system in America right now, not someone in North Korea or China.  Please, give me a break.\n\nI fully support financial transparency in our universities. No one is  against that. No one. That is why I am introducing amendments to this  bill…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…other 49 States--but  California. It is holding our Nation back in terms of improving air  quality and our transition to a clean energy economy.\n\nThe winner here is actually China because, like it or not, the clean  energy boom globally is happening. We have a big say in who leads it  and who benefits from it.\n\nIs it the United States? Not by the leadership…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…this bill. This bill  would allow unlimited amounts of our liquefied natural gas, or LNG, to  be sent abroad to any designation in the world including to our  adversaries like China.\n\nThis is all about China. The President gets up on a regular basis and  says we need to export more LNG to China. My Republican colleagues say  they worry about Beijing and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…proposed. Despite our stark differences with the Russians,  they have as much interest in preventing an unwinnable nuclear war as  we do.\n\nWe must also invigorate discussions with China, which has some 600  nuclear weapons. That number is expected to more than double in fewer  than 10 years.\n\nIf Putin refuses to replace New START, despite it being in Russia's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…history and learning from the mistakes of our past, we are poised  to repeat it with greater risk, fewer safeguards, and far more at  stake.\n\nToday, the United States, Russia, and China inched closer to an  unrestrained three-way arms race as we collectively spend well over $1  trillion on updated and new nuclear warheads and means of delivery.  Just one of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…cryptocurrencies to avoid U.S. sanctions and fund their nuclear weapons  programs.\n\nIn fact, bitcoin and Tether are the payment methods of choice for the  fentanyl manufacturers in China that supply the Mexican cartels, as  well as other fentanyl traffickers inside the United States. These  criminal organizations rely on crypto, and the legislation under  consideration…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…into it. That is what almost  happened here. We do not want a nuclear Iran. There is nobody in this  U.S. Senate who wants a nuclear Iran. Russia doesn't want a nuclear  Iran. China doesn't want a nuclear Iran. Our Presidents--bipartisan-- have worked hard to make certain that Iran didn't have it.\n\nThe Obama agreement was working. After President Trump…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…threatened. Repealing these tax credits won't  stop people around the world from driving EVs or using solar, but it  all but guarantees they will be using Chinese technologies.\n\nIf China is the big winner, American consumers are the big losers. If  these credits are functionally repealed, the average American could see  their utility bills rise by hundreds…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692366/american-energy-jobs-at-risk"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…fights  with Canada and Mexico, our friends, and the next day he is launching a  global trade war. Today, he is pausing tariffs on some countries while  also increasing them on China. What our farmers, ranchers, and  producers need is certainty.\n\nI don't know how my Republican colleagues can say that any of this is  all according to plan with a straight…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…in our society, but I  come to the floor with really bad news, as though we needed more.  America's K-12 students are falling further and further behind,  particularly behind China's students, academically.\n\nThis lag is particularly concerning when we talk about the STEM  fields because our industrial base continues to tell us that we are not  educating…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…continues to conflate the need to bolster  manufacturing with the destruction of our scientific institutions.\n\nWe need to make things here at home. Does America really win if China  does all the innovation?\n\nI like the idea of an America that supports domestic manufacturing  and is a leader in innovation, not an America that does China's  manufacturing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691388/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…elected. I will let your companies run the show.\n\nI will give you this: Donald Trump kept his promise to Big Oil. He  has gutted American energy production, ceded ground to China on the  clean energy arms race, and rigged the system. There is no  technological neutrality, Senator Kaine. It is all about fossil fuels,  to the exclusion of everything else.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…let's make corruption criminal again.\n\nThree days before his inauguration, President-elect Trump launched  the Trump meme coin. Trump's partners and some investors based in China  pumped up the price, making hundreds of millions of dollars with early  selling while the price was high.\n\nAs they sold, though, the price plummeted. They duped more than…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688301/making-corruption-criminal-again"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…then  America will be alone, without allies, and in a less stable world  without the support of the international community.\n\nMr. Speaker, do you know who will come out ahead?\n\nChina, Russia, and Iran. When people in need see bags of food and  flour coming through that say USA, that shows the power of the United  States. That now will be traded for food…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Protection Act also imposes sanctions  on individuals who knowingly and directly engage in or facilitate the  involuntary harvesting of organs within the People's Republic of China  while strengthening reporting requirements regarding this heinous  crime.\n\nThese steps are vital to address the forcible harvesting of organs, a  grave violation of human…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…research and innovation,  and now more than ever, we must reinforce critical partnerships that  promote these advancements.\n\nAs we face increased competition from Communist China, we must ensure  WE lead the world in research and development, including in areas like  Artificial Intelligence, so that our country--not Communist China-- continues to set…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688988/doe-and-nsf-interagency-research-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…earlier this year.\n\nThis bill does three things, Mr. Speaker. First, it mandates a new  study on the cost of U.S. mineral import reliance, including from  adversarial nations like China. This will help give the United States a  much clearer picture into our critical mineral security, including what  kind of vulnerabilities we face by failing to mine here and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…was a private serving in the United States Marine Corps  during the Boxer Rebellion and Spanish-American War, ultimately earning  the Medal of Honor for his service in Peking, China, in the summer of  1900.\n\nIn addition to serving in the marines, Mr. Upham worked as a letter  carrier for the Guthrie Post Office for 40 years. He retired from the  U.S. Postal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Harvesting Critical Mineral Resources\n\nMr. JOYCE of Pennsylvania. Madam Speaker, for years, my colleagues  and I in the House and Senate have been sounding the alarm on China's  control of the critical mineral resources that our Nation relies on.\n\nOur Nation is rich in natural resources, and we need policies that  allow us to utilize them and limit…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Iran, in check.\n\nFor nearly 40 years, the B-1 has been the tip of the spear of  America's air superiority. The B-1 has served us well, but at a time  when our adversaries like China are making their own historic  investments in their own military, it is time we roll out America's  next generation warfighter.\n\nThat is why I rise in strong support of this…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…In recent years, the United States has faced an alarming surge in  malicious cyber activity originating from  groups aligned with the Government of the People's Republic of China.\n\nThese actors have demonstrated a level of sophistication and planning  that reflects both significant resources and a deep understanding of  the essential systems that keep…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…traffic, including a       summary of--\n\n(A) the sizes, ages, and flag states of vessels; and\n\n(B) the oil and product tankers that are--\n\n(i) in transit to or from Russia or China; or\n\n(ii) owned or operated by a Russian or Chinese entity.\n\n(2) An assessment of the state and adequacy of vessel       traffic services and oil spill and emergency response…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Starmer--I don't  mean any disrespect; I just think he is wrong. The only person on this  planet who thinks this is a good idea besides Prime Minister Starmer is  Xi Jinping of China. He has been for years anticipating that this might  happen, cozying up to Mauritius, and they have become best buddies.\n\nIn fact, China has convinced Mauritius to sign on…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…recruit students with this expertise from their other school       experiences.\n\n(9) Mathematical modeling has been a strong educational       priority globally, especially in China, where participation       in United States mathematical modeling challenges in high       school and higher education is orders of magnitude higher       than in the United…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…As Members of Congress, it is our solemn duty to ensure the safety  and well-being of our great Nation. We cannot afford to ignore the  increased aggression and influence of China on the global stage.\n\nIn the 118th Congress, I was honored to have the backing of my  colleagues in advancing this legislation through the House. I now urge  all Members to…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688749/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…pushing to ensure that several provisions, including addressing  outbound investment transparency, are included in the final  legislation.\n\nIt is no secret to any of us that China is our near-peer competitor,  and they don't have benign intentions with regard to the United States.  They want to dominate the United States economically and militarily.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…emboldening adversaries worldwide.\n\nThat is why integrated deterrence is essential. The world is safer  when America leads. And it is not just Taiwan that feels pressure from  China; the Philippines, one of America's treaty allies, is locked in a  contentious territorial dispute with China. Beijing wrongly claims  islands and shoals that have been internationally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…often--and, Mr. Speaker, you have probably had  this experience. You are at a townhall, and someone says: How much do  foreigners own of our debt?\n\nAnd now you try to explain that China is actually, I think, down from  $1.2 trillion down to $700 billion and is maybe now third. Japan is  number one, but there were certain things that happened. When Central…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Because of his prior policies as President, we now have economic  energy security so we are not as reliant on the Middle East because the  truth is our true threat now lies in China.\n\nIf we can secure this area in the Middle East because of the  President's bold actions, we finally have security and certainty, which  so many American families are hoping…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…families.\n\nAs chairman of the House Committee on Energy and Commerce, one of my  top priorities is ensuring that America has the energy needed to win  the race for AI against China and power our future.\n\nI am proud to report that the One Big Beautiful Bill Act unleashes  American energy dominance through strategic investments and eliminating  wasteful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}]