[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…stress the China part again. China is one of  the top recipients of American LNG, and not only the President but LNG  companies are openly bragging about how they can sell to Chinese  buyers. This bill completely removes any review of whether exporting  more of our LNG to China is in the public interest.\n\nThe chairman said that that is a presumption that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…factories are being  launched in Indiana, Alabama, Georgia, Ohio, and Michigan.\n\nEvery signal we send to American industry and to the world that we  are throwing in the towel to Chinese EV manufacturers will resonate far  longer than I think this Senate realizes this week, and it will hit  American families in the exact place it will hurt the most. It will…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…they have learned nothing  from 1939 Czechoslovakia.\n\nThere is one dictator in our world who is cheering the loudest of  all, and that dictator is the general secretary of the Chinese  Communist Party. This is the world he covets. This is the world that he  has worked for. This is the world that turns the lock and opens the  door on his ambitions. This…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…those  strategic goals by compromising programs that have long received  bipartisan support.\n\nFunding for programs like Feed the Future and efforts to counter  Russian and Chinese influence have been cut in this bill. These  programs just don't support communities abroad, they actually stimulate  local businesses and economies right here at home. Feed…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…support of H.R. 906, the Foreign Adversary  Communications Transparency Act. At the end of last year, we learned  that Salt Typhoon, a cyber espionage operation backed by the Chinese  Communist Party, infiltrated several American telecommunications  networks to gain access to detailed information on former Vice  President Harris and other political figures,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…communications  security and competitiveness around the world.\n\nIn recent years, Mr. Speaker, the United States and many allies have  recognized the threat posed by untrusted Chinese telecommunications  equipment to our national security. Thanks to the work of the Energy  and Commerce Committee and Congress, we have taken steps to remove  suspect equipment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…corruption and conflict of interest, but it  allows the President to create electronic Monopoly money.\n\nWho is buying? Abu Dhabi is buying $2 billion of Trump stablecoin  while the Chinese interests behind TikTok are buying $300 million worth  of Trump coin, and that is just what we know about. There is a lot we  don't know about because cryptocurrency literally…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…knowledge  not just from the Energy and Commerce Committee, but I serve on the  bipartisan Select Committee on the Strategic Competition Between the  United States and the Chinese Communist Party. My colleague, Republican   Rob Wittman, and I led a critical minerals working group in the last  Congress.\n\nIt is clear the United States is way too reliant…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in opposition to H.R. 881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern  Act.\n\nH.R. 881 is a solution in search of a problem. In 2018, Congress  passed provisions prohibiting the Department of Defense from providing  funds…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…and since then, it has been the  main way that the United States has helped to strengthen democratic  institutions around the world.\n\nNED exposes Russian propaganda, counters Chinese Communist Party  censorship, circumvents the Iranian regime's efforts to silence  critics, and highlights corruption and drug trafficking in Venezuela.  And it does all of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699435/consolidated-appropriations-act-2026"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…from colleges and  universities with a Confucius Institute, which is known to have CCP  ties, but it expands the prohibition to any institution that has a  relationship with a Chinese entity of concern.\n\nWhat is a Chinese entity of concern? Because a bill defines such  entities so broadly, that list could potentially include every single  college in China.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…between the Black  community and the Asian American, Native Hawaiian, and Pacific Islander  communities.\n\nIn the 19th century, Frederick Douglass spoke out against the racist  Chinese Exclusion Act and used his voice to advocate for Asian  immigrants who wanted to earn the right to become U.S. citizens.\n\nDuring the civil rights movement, Asian American…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688013/standing-with-cbc-in-shared-fight-for-equality-and-justice"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…provocation toward Taiwan.\n\nAs recently as last month, China flew over 70 warplanes over the  Taiwan Strait, encroaching into Taiwanese territory and raising new  concerns about Chinese Government aggression.\n\nThe commander of the U.S. Indo-Pacific Command shared in his April  congressional testimony that the Chinese military pressure on Taiwan  has reached…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…getting President Xi to do more to stop fentanyl precursors from  reaching our shores. Of course, the issue is far from solved.\n\nThis bill will strengthen sanctions on major Chinese producers of  fentanyl and those who aid and abet opioid traffickers. If you are  knowingly sending deadly chemicals to American citizens, you absolutely  must be sanctioned,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…countries would love to replace the dollar with their  currency or something else. One way China hopes to do this is to show  that the dollar is an antiquated currency, whereas the Chinese currency  is the future.\n\nIt is so shortsighted to not even study how the dollar could be  digitized, especially during the same week that Republicans want to let  private…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…has exploited to gain the upper  economic hand is through both inbound and outbound flows of capital. By  investing in U.S. companies, the People's Republic of China and the  Chinese Communist Party can obtain access to intellectual property and  know-how. And, of course, they have no shame. Again, they don't play by  our rules. They are not afraid to…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…helps places like  India and sub-Saharan Africa, where many of their people don't have a  steady supply of electricity. Nobody can blame them for using dirty  coal and those Chinese technology plants, which are not as good as the  U.S. plants, because they want to make sure their people have a chance  at prosperity, as well.\n\nDOE plays an important role…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rock minerals from coal ash and coal byproducts.\n\nMr. Speaker, the alternative to American mineral dominance is buying  foreign minerals from supply chains controlled by the Chinese Communist  Party. That is where we are now: mineral dependence. Mineral dependence  benefits no one except the CCP. Mineral dependence does not help the  environment. It does…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…changed. The economy of today is altogether different  than the economy our ancestors knew, but that is no excuse for standing  by as our home becomes a dumping ground for cheap Chinese goods. Are we  really still a sovereign people today? Our independence and our  sovereignty are not commodities to be sold on the global market. We  can't and won't make everything…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…example would be conducting surveillance to undermine human  rights through spyware location tracking or biometric identification.  That is not good stuff. We don't want the Chinese and our countries of  concern to be using the best American technology remotely to do that.  Nor do we want them to train AI models to enable weapons of mass  destruction,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…from the Wuhan University of Technology in  Wuhan, China.\n\nIn July 2024, University of Maryland, College Park paid $500,000 for  failing to disclose foreign funding from the Chinese companies of three  researchers who simultaneously received Federal grants.\n\nIn September 2024, the Research Foundation of the State University of  New York paid $313,574…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…of my bill,  H.R. 1069, the PROTECT Our Kids Act, and I urge my colleagues, both  Republican and Democrat, to support this bill.\n\nThrough the Belt and Road Initiative, the Chinese Communist Party has  been spreading its malign influence for over a decade. This initiative  has one goal: to increase China's economic and political dominance over  the United…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Arrow scouting honor  society. On October 21, 2024, he earned the rank of Eagle Scout. For  his Eagle Project, Oliver constructed two raised bed planter boxes for  the Plano Chinese Alliance Church as a show of appreciation for the  Church's generosity in allowing Troop 219 to host meetings using their  space. In the planter boxes, he chose to set flowers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…inconceivable concept. We have already seen examples of  governments developing these types of tools and using them to weaponize  their financial systems against their citizens. The Chinese Communist  Party employs a CBDC that is being used to monitor and restrict its  citizens' spending. The data is being used to develop a social credit  system that rewards…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…security  interests unchecked and the opportunity to lead in the development of  standards for the next generation of wireless technology.\n\nAlready, we are hearing about the Chinese Communist Party's efforts  to dominate the upcoming 2027 World Radiocommunication Conference.\n\nI again thank the Representatives from New Jersey's Seventh District,  Michigan's…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…good legislation, sometimes a little long- winded on the names.\n\nExport controls are a critical tool for protecting American national  security. Foreign adversaries like the Chinese Communist Party are  working tirelessly to steal and exploit U.S. technology. We have known  this.\n\nThe CCP is using its military-civil fusion strategy to fuel China's  military…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…to do the next couple of minutes, talk about the  Freidman piece and, in my view, why it is so naive and misses so many  things and, particularly, gives Xi Jinping and the Chinese Communist  Party a giant pass in terms of their history and what they have done to  the international trading system.\n\nFirst, the Freidman article kind of condescendingly…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…system,  and Washington needs to start acting like it. Nearly one in three  Americans have used them in some form, and we cannot afford to let our  adversaries, especially the Chinese Communist Party, write rules for  this new financial frontier as we sit on the sidelines.\n\nThat is why we are advancing these three critical pieces of  legislation to make…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…to ensure democracy and Western values prevail.\n\nAdditionally, the National Endowment for Democracy does important  work to counter hostile, authoritarian regimes like the Chinese  Communist Party and the Iranian regime. It is important for us to  support this American institution and organization, which is based here  in Washington, D.C., that defends…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…Autonomous Region of China.\n\nSlavery in any form is morally repugnant. America, known on the  international stage as a beacon of freedom and liberty, must not be  complicit in the Chinese Communist Party's genocide and oppression of  the Uyghur people.\n\nThe United States must push back on China not only in our words but  through our actions. Failing to do so…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}]