[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…means new  weapons programs cannot get started.'' Shipbuilding will be delayed.  ``A yearlong CR means we are not serious about building a military that  will deter China, Russia, and Iran.''\n\nThe White House may be out of touch with reality when it comes to  Ukraine and supporting our allies abroad, but their fealty to Vladimir  Putin doesn't mean the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…America will be alone, without allies, and in a less stable world  without the support of the international community.\n\nMr. Speaker, do you know who will come out ahead?\n\nChina, Russia, and Iran. When people in need see bags of food and  flour coming through that say USA, that shows the power of the United  States. That now will be traded for food aid from…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…considering with whom to form alliances, and there  are many, it causes them as well to turn away from us.\n\nIt gets worse. With President Trump actually allying himself with  China, Russia, Iran, and North Korea, these countries now seemingly  have America's explicit backing to spread their influence, and in some  cases to spread their force, like we have seen…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…how we regulate  all other energy sources. Sources like oil and coal, we have laws that  impose certain restrictions on exports to foreign entities of concern,  like China, Russia, Iran, and North Korea.\n\nMr. Speaker, under this new bill, LNG would not be subject to this  policy, and I have to ask: Why?\n\nIf this bill is really about better supporting…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697082/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…political factions inside Venezuela--factions  that have been waiting for precisely this moment to seize power.\n\nI have seen no contingency plan for what happens when China, Russia,  Iran, or Cuba--nations with deep economic interests in Venezuela-- decide to block or back proxy groups in a country we have just  destabilized, nor have I heard any proposal…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…is our moment to save democracy. I know it  sounds like an exaggeration to say that our democracy is now under  attack, but it is from adversaries and enemies abroad--China, Russia,  Iran, North Korea. But we also have to make sure that we safeguard our  liberties at home against attack and efforts to undermine them, even if  some may feel they are well-meaning.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…prevent conflict and  promote stability. These cuts will lead to the deaths of hundreds of  thousands, devastating the most vulnerable in the world.\n\nAt a time when China, Russia, and Iran are working overtime to  challenge American influence, this bill says: Go right ahead. This is  China's dream come true, the U.S. pulling back our soft power from…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…vulnerable people, America will be alone without allies  in a less stable world without the support of the international  community.\n\nDo you know who will come out ahead? China, Russia, Iran.\n\nAll of this is being done in the name of combating waste. I will tell  you what waste is: 500 tons of food grown by American farmers destroyed  at a cost of $130,000…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…previous administration, America turned away from policies that had our  adversaries quaking in their boots and instead bent a knee to the axis  of evil. Make no mistake, China, Russia, and Iran are exerting  influence across the globe that is causing harm and posing major  threats to both the United States and our allies.\n\nIt is vitally important that the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…is included in this legislation. The RIFA Act ensures private  colleges and universities disclose whether they are investing their  endowments in hostile nations like China, Russia, Iran, and North  Korea. These financial partnerships should not be hidden from the  public.\n\nFor far too long, we have allowed educational institutions to become  conduits…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…The world is a safer place because of what  Donald Trump ordered and what our military carried out this past week.  The Western Hemisphere cannot be a safe space for China, Russia, Iran,  Hamas, Hezbollah, or the other terrorists that were being given safe  haven in Venezuela.\n\nSpeaker Pelosi in 2019 ended her round table comments with a  resounding:…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…foreign terrorist  organization. Noriega didn't have a reward. Noriega wasn't associated  with a designated foreign terrorist organization. Maduro is in league  with China, Russia, Iran, and Cuba. Noriega was not. Yet George Bush  invaded Panama and overthrew its government.\n\nI don't hear many Democrats, in retrospect, saying that this was an  unwise…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…906, the Foreign Adversary  Communications Transparency Act, led by the gentleman from Virginia  (Mr. Wittman), my good friend.\n\nEntities with ties to our adversaries--China, Russia, Iran, and North  Korea--are threats to our communications networks, unfortunately, but  it is a reality.\n\nThis legislation requires the FCC to publish a list of those entities…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690265/foreign-adversary-communications-transparency-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…The cost of inaction is too great.\n\nCongress must anticipate the threats, and we must work together to  curb the malign influence of foreign adversaries like communist China,  Russia, Iran, and North Korea. For too long now, we have allowed  foreign adversarial governments to secure a silent foothold in our  telecommunications infrastructure.\n\nTake, for…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…vulnerability to be addressed and data to  be secured before it is exploited by malign actors, including our  adversaries. My colleagues know that malign actors affiliated with  China, Russia, Iran, and others are after us all day, every day, 365  days a year.\n\nThese vulnerability disclosure policies are critical to preventing  cyberattacks on Federal systems.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Democrats are turning a blind eye  to the killing of Americans by illicit drugs from Venezuela, I also  highlight that Venezuela has become a strategic outpost for China,  Russia, and Iran, not to mention criminal and terrorist organizations.\n\nJust yesterday, at a Europe Subcommittee hearing, I made the point  that China and Russia are engaged in hybrid…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…ravaged American communities.  They have flooded our streets with deadly narcotics. They have  destabilized our hemisphere, creating openings for malign influence  from China, Russia, and Iran. Year after year, they have killed  thousands of Americans.\n\nWe decided long ago that we would not tolerate threats to the  American people from terrorists like al-Qaida…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…held  accountable.\n\nArresting Maduro also advances America's national security. Maduro's  allies and enablers are united in their commitment to undermine our  Nation: China, Russia, Iran, Cuba, even Hezbollah. Communist China was  buying half a million barrels a day of oil from Venezuela--day after  day, after day. In exchange for that oil, the Chinese…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…committee unanimously and certainly strongly encourage a  unanimous vote here on the floor.\n\nWe all recognize the threats we face around the globe and in  particular from China, Russia, Iran, North Korea, among many other bad  actors. Our export control laws are put in place for a reason, and it  is to protect sensitive technology from getting into the hands…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}]