[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…intelligence, ethics agencies, and       the courts. Soon after his inauguration, he sought to ensure       that the heads of U.S. intelligence agencies, including the       FBI, the CIA, and the National Security Agency, would be       personally loyal to him, apparently in the hope of using       these agencies as a shield against investigations into his…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…servicemembers' lives  at high risk.\n\nAll responsible must be held fully accountable, including through  removal or resignation from their positions. Secretary of Defense Pete  Hegseth, CIA Director Radcliffe, Director of National Intelligence  Gabbard, Secretary of State Rubio, National Security Advisor Waltz,  Chief of Staff Wiles, and Vice President Vance were…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689228/responding-to-signal-chat-leak"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…information that has not been declared such because it would inculpate  the Defense Secretary.\n\nSo you have the Vice President of the United States on the chat, then  you have the CIA Director. Now it is the Vice President of the United  States, Secretary of Defense, and the CIA Director, and this is not  classified information that they are discussing. They…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…the suburbs or at Boeing Air Force base. Boeing Air Force  base is a secured piece of much acreage, so they are not subject to  that risk.\n\nAll of these agencies, including the CIA at Langley and other  agencies, four of which are in Virginia, are so that those agencies can  be as secure as we can possibly make them, so that we will not lose  people, FBI…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…looked at my TV screen, and I said: No, you don't get  to do that. You don't get to ignore your constituents, vote against  their interest, and keep your job.\n\nI am a former CIA officer. I served alongside the military. In the  military, they have a term for this. It is ``dereliction of duty.'' It  is a fireable offense. I ran that year to fire him,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…President of Honduras, Juan Orlando Hernandez, or  Ross Ulbricht who operated the Silk Road drug marketplace. He wouldn't  seize an oil tanker off the coast of Venezuela or threaten CIA  operations, blockades, and strikes on Venezuela.\n\nThis is no joke. This is serious. This is not about drugs. It is  about regime change. It is about being honest with the people…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…troops at risk, that could drag us into a war, that is  not a debate that the Founding Fathers thought should take place behind  closed doors at the Department of Defense, at the CIA, and the White  House. That is actually the debate that they thought that this body  should have--the U.S. Senate--that the House of Representatives should  have, and that is…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Americans. We have seen the Administration remove references to Jackie  Robinson's military participation. References to women in health care  research or women who served at the CIA have been erased. References to  the plane which carried the first nuclear bomb in World War II, the  Enola Gay, because artificial intelligence flagged it as a reference to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…put American troops in  harm's way.\n\nLet me put it this way: Not only did the National Security Advisor  set up an illegal, unsecured chat with the Secretary of Defense, the  CIA Director, the Vice President, and others to discuss highly, highly  sensitive and imminent attack plans, but they also bungled their way  into adding a random person into the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Ms. SLOTKIN. Mr. President, I rise today in support of the War Powers  Resolution. As a Senator from Michigan, as a former CIA officer who  served three tours alongside the military in Iraq, I saw conflict up  close.\n\nBut I think it is important that we put this decision to go into  Venezuela in context.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…consequences. Look, some of these  chips would go to G42, a UAE AI company that American national security  officials have said could be a conduit for funneling technology to  China. The CIA has reportedly warned about G42's working closely with  blacklisted firms like Huawei that are tied to the Chinese military.\n\nNow, President Trump is denying that he knew anything…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…coordinator's purview.\n\nIt requires each IC agency to develop metrics for the adoption of  critical emerging technology.\n\nFinally, it provides a narrowly tailored authority to the CIA to  protect its domestic facilities from unmanned drones, a gap in the law  that we have been seeking to close for more than 5 years.\n\nOnce again, I appreciate the strong bipartisan…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…are eroding morale among some of the most dedicated  professionals in public service. And I fear that we are sending a clear  message to young officers, whether they are at the CIA or any of the  other intelligence Agencies: Don't bother building a career in  intelligence if you plan on telling the truth.\n\nMeanwhile, these aren't actions in a vacuum. Our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Constance Carrino, Senior Foreign Service Officer, USAID,       retired; Steven Cash, Former Senior Advisor, DHS, Former       Chief Counsel to Senator Feinstein, Former CIA Officer.\n\nAsha Castleberry-Hernandez, Senior Executive Service, DOD,       retired; Judith Chammas, Senior Foreign Service Officer,       retired; Phillip Chicola, Senior Foreign…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…could produce a  list of the organizations that are now considered terrorists by the  United States. They said they could not provide that list.\n\nNow, don't get me wrong. I am a CIA officer. I am a former Pentagon  official. I did three tours in Iraq--armed--alongside the military. I  participated in the targeting of terrorist groups. I actually have no…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…thrown her full support behind a new  commitment to Cyber Studies. Both degreed and certificate level  programs are growing at Sam Houston and the school is working with the  CIA, FBI, DHS and other agencies to create a pathway to jobs in this  fast-growing field.\n\nUnder her leadership, the SHSU College of Osteopathic Medicine is  making a name for itself…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…taxpayer benefits.\n\nThat withdrawal was an embarrassment and a stain on our country.\n\nThe 29-year-old, deranged terrorist who shot two National Guardsmen  in DC was working with the CIA in Afghanistan and was part of an elite  unit that was supposed to be helping fight our Nation's enemies.  Clearly, this person was deranged and should never have been allowed…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Nothing to  see here; the President can do whatever he wants, while their sons and  daughters are sent to fight wars in distant lands.\n\nAs the administration authorizes covert CIA action in Venezuela and  surges U.S. forces to the region, including our most advanced aircraft  carrier, the risk of imminent involvement in hostilities is evident.\n\nIt is…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…agenda.\n\nWith respect to draining the swamp, President Trump nominated  disrupters to lead his Cabinet and agencies, people like Kash Patel at  the FBI; John Ratcliffe at the CIA; and RFK, Jr., at HHS.\n\nI was proud to support every single nominee, and I am pretty  confident that every single nominee will win Senate confirmation, which  has never happened…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…communist China, Cuba, Iran, Russia, and even Islamic  terrorists like Hezbollah.\n\nI want to take this opportunity to commend the exceptional skill and  bravery of our troops, CIA officers, and FBI agents for executing such  an amazing military and intelligence operation that brought Maduro's  reign to an abrupt end. It is impossible to overstate the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}]