[{"senator": "Al Green", "party": "Democrat", "sentence": "…need of sanctions. I came to the floor today, and  while the Speaker was reading, I recalled what happened in the sixties.  I recalled that when we were faced with adverse circumstances, we would  sing a song that would inspire and encourage us to move forward with  alacrity.\n\nThe words were:\n\nWe shall overcome,\n\nWe shall overcome,\n\nWe shall overcome some…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to make things worse.\n\nMr. Speaker, the chairman of our committee knows I have great respect  for him, but the bottom line is that this bill does not consider  individual circumstances. It is not just people that are selling drugs.\n\nLook, I totally agree that if someone is selling fentanyl, it is a  totally different situation from someone who is arrested…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…rule of particular applicability is addressed to an       identified entity and also addresses actions that entity may       or may not take, taking into account facts and circumstances       specific to that entity. B-334309, Nov. 30, 2023 (citing B-      334995, July 6, 2023). We noted that the notice concerned a       specific entity--California--and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…traffickers, then they  need to come to Congress and seek an authorization to use military  force for that purpose because our Constitution is clear.\n\nThere are, essentially, three circumstances in which we can  constitutionally use force. One is if Congress declares war. We have  not declared war on Venezuela. We have not declared a literal fighting  war using…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…gap in Child Nutrition funding       that Congress has never had to fill with annual       appropriations, and USDA cannot predict what Congress will do       under these circumstances.\n\n10. The Child Nutrition Programs, which include the       National School Lunch and Breakfast Programs, Summer Food       Service Program, and Summer EBT (SUN Bucks),…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…colleague, Congressman Seth Moulton.\n\nMr. Speaker, Father Shaughnessy is not just a priest. He is a quiet  force who brings peace and strength to those in the toughest of  circumstances. I am honored to have him here with us today.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692491/welcoming-reverend-paul-shaughnessy"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…DUI without actually driving a  vehicle. While Republicans might wave away our concerns by saying that  prosecutors have the discretion to not bring charges under these  circumstances, we know about this case precisely because prosecutors  chose to file charges and it went to court.\n\nThis bill does not recognize under these overbroad DUI statutes the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…actions and deliberate inaction  from Republicans in Congress jeopardize the operation and availability  of facilities that are the first site of care in the most tragic  circumstances.\n\nI have a responsibility to be abundantly clear, Madam Speaker. The  consequences of inaction and ignoring hospitals, doctors, patients, and  your own constituents will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "John Larson", "party": "Democrat", "sentence": "Mr. LARSON of Connecticut. Mr. Speaker, due to unforeseen  circumstances, I regrettably missed votes today. Had I been present, I  would have voted YEA on Roll Call No. 125, NAY on Roll Call No. 126,  and NO on Roll Call No. 127.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691163/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…internal combustion engine motor vehicles, and there is an  exemption if the purchase or lease of such a vehicle is, to quote  directly from the law, impracticable under the circumstances.\n\nIn addition to these numerous exemptions, there is also a waiver  provision with no certification reporting requirement, making it very  straightforward to get a waiver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…requiring such procedures unless       otherwise required by law. The Policy Statement further       states that ``the good cause exception should be used in       appropriate circumstances in accordance with'' APA       requirements rather than ``sparingly,'' as directed in the       Richardson Waiver. The Policy Statement explains that the       ``obligations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…differently during Black History Month because it is a failure to  acknowledge the history. It is a failure to acknowledge a group of  people who persevered through the worst of circumstances in this  Nation, a group of people who literally emerged from bondage, a group  of people who emerged from torture, from rape, from kidnapping, and  from family separation.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…they can have what could have been a safe  abortion if performed earlier. If they mistime it and get closer to  death than they thought, many have actually died in those  circumstances.\n\nLegislators voted for those laws. We have to note that we should not  allow colleges to withhold information that could save women's lives.\n\nMr. SCOTT of Virginia.  Bonamici).…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…yielding. I want to  start by thanking my colleagues in the Democratic Party who did  everything in their power to make these bills as best they could under  very difficult circumstances.\n\nOver the past month, President Trump has made it his mission to  incite chaos and fear in Minnesota. He has taken his quest for  political retribution to our communities,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699323/consolidated-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…funding of roughly $2.9 billion.\n\nThe bill also included accountability measures that required  additional reporting by the Secretary and an inspector general review  of the circumstances surrounding the projected shortfalls.\n\nA few weeks later, on October 30, 2024, VA notified the committee  that it had reviewed its calculations at the conclusion of fiscal…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…officers put themselves in harm's way to  protect our communities and uphold the rule of law. They respond  without hesitation, often under dangerous and unpredictable  circumstances.\n\nA recent incident in my district highlights what that commitment  looks like. Last month, in Bartow, Florida, a man who had brutally  assaulted and held his own parents…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…now.\n\nMr. Speaker, if a bill that passed unanimously that costs almost  nothing and fulfills a 60-year Federal promise and protects public  health can be vetoed under these circumstances, then bipartisan work in  this institution is at risk.\n\nI ask my colleagues: How would you feel if a project like this in  your district that was passed unanimously and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…if       the President determines and reports to the appropriate       committees of Congress that--\n\n(A) such waiver would serve national security interests; or\n\n(B) the circumstances which caused the individual to be       ineligible have sufficiently changed.\n\n(c) Imposition of Sanctions With Respect to Undermining       Peace, Security, Stability,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…the  latest technology to ensure that everybody is getting the right deal  and the best deal and the most financial inclusion possible given that  particular customer's circumstances.\n\nFar from promoting problems, this resolution will actually help solve  the problems.\n\nMr. Speaker, let me give you an example of where a merger that was  recently approved…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…stop sign, when there was an unmarked car there,  who would be happy to hear that. They now have a new basis to challenge  that.\n\nI think we are all aware that there are circumstances, like when  someone is undercover or when they are doing a stakeout, in which it  doesn't make sense for the official to identify himself as an officer.\n\nOf course, that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Members of  Congress. But, oh, they say they have learned a lesson. As he put it,  ``Our processes could have been better suited to meet what was a new  and unique set of circumstances.''\n\nWell, you know what, we are turning 250 years old. I don't think the  Constitution is exactly new. I don't think the speech or debate clause  is exactly new. I think…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…arrest and  extradition to the United States. He was indicted twice in Federal  court and should stand trial in the United States.\n\nWith Maduro rightfully captured, the circumstances have now changed.  While I support the operation to seize Nicolas Maduro, which was  extraordinary in its precision and complexity, I do not support  committing additional…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…oath; provided,       however, that in either instance,       once a quorum is established, any one Member can continue to       take such testimony.\n\nRule 11. Under no circumstances may proxies be considered       for the establishment of a quorum.                                    voting\n\nRule 12. Voting in the Committee on any issue will normally…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…zeal. If benefits have  resulted to our country from these services, let it always be  remembered to your praise, and as an instructive example in our annals  that under circumstances in which the passions agitated in every  direction were liable to mislead, amidst appearances sometimes dubious,  vicissitudes of fortune often discouraging, in situations…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…event ticket sale the guarantee or refund policy of such       ticket issuer, secondary market ticket issuer, or secondary       market ticket exchange, including under what circumstances       any refund issued will include a refund of any event ticket       fee.\n\n(c) Disclosure of How To Obtain a Refund Required.--      Beginning 180 days after the date…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…are not going to shut down the government, punish  the American people, put people's lives at risk, and think we are going  to sit down and negotiate with you under those circumstances. That is  not going to happen.\n\nWe told you 43 days ago, from bitter experience, government shutdowns  don't work. They never achieve the objective that you announce. Guess…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…injured  parties. Traditionally, that means an injured party seeks redress  through his local district court. This simple process ensures decisions  are limited to the unique circumstances of the individuals involved and  are restricted to cases within that district, subject to appeal first  to the circuit court and ultimately to the Supreme Court.\n\nThis…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, I was unable to vote on roll call no. 84  and no. 85 due to unavoidable circumstances. Had I been present, I  would have voted YEA on Roll Call No. 84 and YEA on Roll Call No. 85.                             personal explanation", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689301/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…appropriate when  Federal agencies purchase innovative technologies and technical  services, and agencies should have the flexibility to pay more for a  superior solution if the circumstances are appropriate.\n\nI will say to the American people that, obviously with all of the  things that we are talking about in Washington around the Department of  Government…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…attractive. It  will be hard for us to track the right kind of people we want to be  able to fill those positions in law enforcement. It is absolutely  appropriate in certain circumstances to wear a mask.\n\nIn fact, in some operations, it is a safety issue. If we are having  our law enforcement officers, for example, go into a residence where  they know there…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}]