[{"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…husband and I raised our two children.\n\nThis year, there will be no shortage of celebrations of the  anniversary of our independence, but it will be up to us--today's  citizens of the United States--to decide as a country if these  celebrations will represent an empty pageant or a renewal of principle.  Because in this moment, a moment when our country is…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…healthcare,  period. Her family members won't be able to afford the medications that  they need to help keep them alive.\n\nHealthcare should be affordable for all citizens in the United  States. Amanda is worried that they will possibly lose their home if  they get sick and have to go to a doctor.\n\nAndrea from Tacoma works for a California-based company.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…how to read. The first sentence of the 14th  Amendment says: All persons born or naturalized in the United States,  and subject to the jurisdiction thereof, are citizens of the United  States. . . . `'\n\nThese people are finger painting all over the Constitution. They are  usurping the rule of law as adopted by the Congress of the United  States. They…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…American history, maybe  even in world history--I am not too sure. It is normal for a President  of the United States to try to alleviate economic pain for the citizens  of the United States, and this is certainly the first President that I  have experienced in the U.S. Senate but honestly the first President  that I have even been aware of who is intentionally…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…members of the military  are in major cities despite clear and consistent objections from  Governors, from mayors, from police chiefs, from community groups, from  citizens across the United States, and, yes, from Members of the U.S.  Senate.\n\nToday, in DC, California, Oregon, and Illinois, these National  Guardsmen are not only patrolling the streets, they…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Res. 489--Rule providing for consideration       of H.R. 2096--Protecting Our Nation's Capital Emergency Act;       H.R. 884--To prohibit individuals who are not citizens of the       United States from voting in elections in the District of       Columbia and to repeal the Local Resident Voting Rights       Amendment Act of 2022; H.R. 2056--District of…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692229/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…on the House floor so that the American people  can see because then ultimately, we will know which way is the right  way for them.\n\nWe are here to represent the citizens of the United States of  America, not a President. We soon will have a vote because that is what  is going to happen, which is what I have been asking for for over a  year. If you think…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…who receive it.\n\nMr. Speaker, I know you to be a man of goodwill and you understand  your district and what your people need, as well. It is long overdue  for the citizens of the United States to have their Social Security  benefits enhanced, not cut.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Comer, my good friend from  Kentucky, for yielding me time.\n\nMadam Speaker, I rise in support of my bill, H.R. 884, that would  prohibit individuals who are not citizens of the United States from  voting in elections in the District of Columbia. This is a commonsense  bill.\n\nI am going to start with a question. It is posed: For what reasons-- why--would…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…offer the first part, that it goes to  DHS. Why? Read the bill. It is actually to check if individuals who are  on the voter rolls in States across the country are citizens of the  United States. Our colleagues on the other side of the aisle don't want  to check the voter rolls to determine if an individual is a citizen of  the United States. It should…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…we  should know--I think everybody does know--that foreign nationals,  noncitizens, are not eligible to vote in U.S. elections. That is a  privilege reserved for citizens of the United States. Instances of  foreign nationals voting in our elections threaten the bedrock of our  democratic Republic. All of us should be thankful to the Department of  Justice,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Resolved, That upon adoption of this resolution it shall be       in order to consider in the House the bill (H.R. 884) to       prohibit individuals who are not citizens of the United       States from voting in elections in the District of Columbia       and to repeal the Local Resident Voting Rights Amendment Act       of 2022. All points of order against…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Madam Speaker, pursuant to House Resolution 489, I call up  the bill (H.R. 884) to prohibit individuals who are not citizens of the  United States from voting in elections in the District of Columbia and  to repeal the Local Resident Voting Rights Amendment Act of 2022, and  ask for its immediate consideration.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692313/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "French Hill", "party": "Republican", "sentence": "…provide Congress and the       public with a full and accurate understanding of the economic       costs resulting from the financial exploitation of senior       citizens in the United States;\n\n(2) frequency of senior financial exploitation and       correlated or contributing factors--\n\n(A) information about percentage of senior citizens       financially…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the 14th Amendment  actually confers automatic citizenship to anyone born here, wouldn't it  have said all persons born or naturalized in the United States are  citizens of the United States? That is simple enough.\n\nThat is not what it says. It says: ``All persons born or naturalized  in the United States, and subject to the jurisdiction thereof, are…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}]