[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…Honoring the Life of Joel Nelson\n\nMr. COSTA. Mr. Speaker, I rise to honor Joel Nelson, a proud son of  the San Joaquin Valley who served 37 years as the head of California  Citrus Mutual.\n\nMr. Speaker, you should understand that California produces 80  percent of all the citrus consumed in the United States: navels,  Valencias, mandarins, and lemons.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…looking to make a comfortable living. Even though founding  residents experienced hardships like the Great Depression, World War  II, and a devastating freeze that wiped out many citrus crops, the area  continued to thrive and develop.\n\nAs Fair Oaks grew, so too did its industry and commerce. The  completion of the Folsom and Nimbus dams, and arrival of Aerojet…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696704/recognizing-the-130th-anniversary-of-fair-oaks"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…from humble roots to a thriving community, celebrating a  strong economy, welcoming neighborhoods, and stunning environment. From  the pristine shores of Vero Beach to the citrus groves of Fellsmere,  Indian River County embodies the very best of Florida living.\n\nMr. Speaker, today, we recognize and celebrate a century in paradise.  I congratulate the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694133/9999"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…homage to the picturesque  topography of the regions, which Mr. Howey fondly referred to as ``The  Florida Alps.''\n\nMr. Howey was an entrepreneur who dreamed of creating a citrus empire  with the town serving as its commercial and shipping hub. He  constructed Florida's first citrus juice plant in 1921 and introduced  the ``Lifeguard'' brand of canned…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Ms. Marlene Law has made to our community through  her work over three decades to promote opportunities for youth with the  UF/IFAS Extension Citrus County 4-H program. Her tireless efforts have  been mostly behind the scenes. Marlene supports the core values of 4-H,  to develop citizenship, leadership, responsibility,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…of 1894 through  1895. That natural disaster forced many to seek new livelihoods, and  Coleman soon emerged as a center of diverse agricultural production. In  addition to citrus, settlers in Coleman raised cotton, cattle, sheep,  and hogs, with wool even shipped to Baltimore for processing. By 1923,  Coleman had earned national recognition as the ``Cabbage…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Godding Brooks has made to our  community through her volunteerism. Since 2008, 17 years, Kimberly  Godding Brooks has volunteered her time and talents to support Friends  of Citrus and the Nature Coast Grief Services for children. Kimberly  started as a Volunteer Coordinator, for Camp Good/Teen Encounter, a  grief support camp for kids and teens who have…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…oranges, almonds, pistachios,  and cotton. Alongside its agricultural success, Delano has experienced  steady commercial growth, attracting major businesses such as Wonderful  Citrus, the company behind the widely popular Halos brand.\n\nDelano is also a culturally rich and diverse community, shaped by  generations of residents from around the world. Since…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Lady Lake's  story reaches back to the 1880s, when a new railway depot sparked  growth in a community first home to the Seminole Indians.\n\nFrom its early years as a hub for citrus and watermelon growers to  the history now preserved by the Lady Lake Historical Society Museum,  the town's heritage reflects a century of resilience.\n\nThe recent weeklong…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Mr. Neil Quinn has made to our community through his  work as an exceptional volunteer for Habitat for Humanity of Citrus  County for the past five years. In 2024 alone, this retired electrical  engineer volunteered nearly 400 hours across our construction sites and  ReStores. Mr. Quinn's impact…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…oranges, almonds, pistachios, and cotton. Alongside  its agricultural success, Delano has experienced steady commercial  growth, attracting major businesses such as Wonderful Citrus, the  company behind the widely popular Halos brand.\n\nDelano is also a culturally rich and diverse community, shaped by  generations of residents from around the world. Since…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692510/recognizing-delano-ca"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Sue Simone has made to our community through her  volunteerism at HPH Hospice. HPH Hospice services Hernando, Citrus, and  Pasco Counties. In 2022, Sue joined the HPH Hospice Foundation as a  founding member of the Women of Giving (WOG). She played a crucial role  on the Steering Committee,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}]