[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…BISHOP. Mr. Speaker, I rise today to recognize and honor Al  Hutchins of Blakely, Georgia, who is retiring after more than 20 years  of dedicated service on the Blakely City Council. An event to celebrate  his extraordinary career in public service will be held on Tuesday,  December 16, 2025, at the Al Hutchins Community Center in Blakely,  Georgia.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…shop near their school. They were surrounded by multiple ICE  agents who were pointing guns at them. That is terrifying, outrageous,  and obviously dangerous.\n\nAt a recent city council meeting, an Oregon high school student  bravely shared his concerns and the concerns of his peers, especially  those who cannot speak up for themselves because they are…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and operates the station under a lease with the  federal government. The members of USRC's board of directors are the  Federal Railroad Administration, Amtrak, the Federal City Council, the  District of Columbia and the USRC President and CEO. USRC is the only  entity exclusively dedicated to the management and operations of Union  Station and therefore…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…first determined they had a problem. They include Code Officer Jesalyn  Harper from the city of Reedley, City Manager Nicole Zieba; mayor of  the city, Mayor Tuttle, of the city council; and Supervisor Nathan  Magsig. All of these individuals worked together with our office to, in  fact, act on the situation in Reedley, California.\n\nMr. Speaker, I urge…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Instead, today, we are debating to vote to actually  increase child poverty within the District of Columbia.\n\nWe strongly oppose this. Instead of actually acting like a super city  council for D.C., we should be considering issues like D.C. statehood.\n\nMr. Speaker, I urge my colleagues to oppose H.J. Res. 142.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699683/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…proportionality. If D.C. residents don't like  it, they can vote their elected officials out of office.\n\nToday, Congress is again injecting itself as some sort of super city  council to write laws for Washington, D.C. As a former mayor of 8  years, I worked with over 700 amazing men and women of a police  department who were heroic in the work that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…women  voters and bring light to the disparities women were facing within  workplaces. Her fearlessness led Jane McQueeney, a friend of Kitchen,  to give testimony to the City Council in Kansas City when McQueeney was  receiving less pay when working for the federal government. Kitchen  worked with Kansas City to adopt an ordinance to prohibit  discrimination…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…local safety decisions by D.C. residents who are  perfectly capable of making these decisions on their own.\n\nWe should be clear. This bill is also opposed by the Mayor, the city  council, and many in the community. It is an overreach by the  Republican majority to try to control the District.\n\nMr. Speaker, the bill is unnecessary. It undermines home rule,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696980/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…leave their households when there is no one else to take care  of their children.\n\nNo one would make these choices in one of our communities at home. I  would like to hear a city council meeting where these were the choices  that were being made: Cut electric for the poorest people in the  country. Borrow as much money as we have ever borrowed. Give the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Representative Garcia graduated from college and  began his career in public service with a community-based housing  initiative.\n\nSince his time as a member of the Chicago City Council, the Illinois  State Senate, and Cook County Board of Commissioners, Congressman Chuy  Garcia has served his community, the Congress, and our country with  great distinction.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…rise to wish a happy heavenly birthday  to my predecessor in representing New Jersey's 10th Congressional  District, the Honorable Donald Payne, Jr.\n\nHe served as Newark City Council president and went on to succeed his  father in this body.\n\nDonald M. Payne, Sr., was the first African American elected to New  Jersey's congressional delegation, and his…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698322/wishing-a-happy-heavenly-birthday-to-the-honorable-donald-payne-jr"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Rochelle Bar  Association as part of that commitment to the law, but Chris' work goes  well beyond that.\n\nShe served for over a decade as a councilwoman on the New Rochelle  City Council, representing the city's South End, service as president  of the New Rochelle Public Library Foundation, active in her  neighborhood Sutton Manor Residents Association,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699164/saluting-a-neighbor-and-friend-m-christina-selin"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…elimination. This double standard exposes this bill for  what it is: an act of political punishment, not a genuine reform.\n\nReal solutions to crime do not come from a ``Super City Council'' in  Congress. They come from empowering local communities and trusting  judges to make thoughtful, individualized decisions. I urge my  colleagues to stand with the residents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695721/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…DART's forty-two-year history, and he becomes the youngest individual  ever to lead the Board.\n\nMr. Bryant joined the DART Board following his appointment by the  Dallas City Council in 2024 to fill a vacancy, and he was reappointed  to a full two-year term in May 2025. Over the past fifteen years, he  has served our city through multiple appointments…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Vote'' project.  In addition, in that position on the League of Women Voters, she  facilitated candidate forums. I remember many years ago when I first  ran for the Concord City Council, Gwen was there doing her civic best  with the League of Women Voters.\n\nSadly, Gwen passed away in May. She will be remembered for her  advocacy and her commitment to service.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692306/recognizing-gwen-watson"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…1925, the Hanford Civic Auditorium has  served as the cornerstone of community life--a vibrant hub for artistic  performances, civic engagement, and social events. From city council  meetings and public forums to receptions, family reunions, and  community celebrations, it has hosted countless gatherings that reflect  the heart and spirit of Hanford.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Ebby Halliday specializing in luxury homes.\n\nIn addition to her real estate portfolio, Carmen has served as the  Mayor Pro Tempore of Celina and as a member of the Celina City Council  and Celina Economic Development Corporation Board. For her outstanding  contributions, Carmen has received the City of Celina's Distinguished  Public Service Award, the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…they did  in the summer of 2020 when our cities were burning and our law  enforcement were being attacked, when they defunded the police in  Austin, Texas, as the radical city council did there, then real people  suffer. Americans get hurt, and the American Dream dies.\n\nThe suspect that I talked about with the brutal stabbing in North  Carolina was 34…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…South Vietnamese Army. For his meritorious service,  he was awarded the Bronze Star, Air Medal, and Vietnam Cross of  Gallantry.\n\nCorbett was first elected to the Celina City Council in 1999. In  2002, he was elected to serve as the Mayor of Celina and was reelected  twice. Under Corbett's leadership, Celina transformed economically  through increased…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…it is intended to do, and that is to clean up the city of Washington,  D.C.\n\nMy legislation, co-led with Senator Ted Cruz, repeals the antipolice  provisions of the D.C. City Council's so-called Comprehensive Policing  and Justice Reform Emergency Amendment Act of 2022. If there is one  thing that act doesn't do, it is create more justice. It creates…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…pressing concerns. Debra is renowned in our community as a selfless and  caring servant and is a true friend to all who have the privilege of  knowing her.\n\nElected to the City Council in November 2018 and sworn into office  the following month, she went on to serve as Mayor from December 2020  through December 2023. Debra was instrumental in championing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…recognize the  retirement of Gary Fuller, Mayor of the City of Opelika, Alabama.\n\nMayor Fuller has tirelessly served the City of Opelika for over 20  years. He served on the City Council from 2000 to 2004 and was first  elected Mayor August 24, 2004.\n\nAs Mayor, he established Opelika as the first gig city in Alabama. He  helped establish a first-class Pre-K…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…been a resident of Royse City since  2006 and has dedicated much of his life to public service, community  engagement, and leadership. He was first elected to the Royse City  Council in May 2010, building on earlier experience serving on the  Royse City Zoning Board of Adjustment, as well as similar service in  other communities. In 2013, he served…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…civic  organizations, and a deep commitment to public service, Casey has left  a lasting impact on Brooksville and its people. A true public servant,  Casey served as a City Council member for the City of Brooksville,  where he worked diligently to improve the quality of life for  residents. His time on the Council was marked by his advocacy for local…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…This makes no sense to me. This is not a shutdown that makes any  sense at all. The American people, Kansans, deserve something different  from the U.S. Senate.\n\nEvery city council or commission, every school board, every local  government office in my State passes a budget and then lives within  that budget every year. Every local unit of government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Commerce, the Cuero Lions Club, the  Cuero ISD Education Foundation, and the DeWitt County Habitat for  Humanity. For 17 years, he represented the people of Cuero on the City  Council, including 14 years as Mayor Pro-Temp.\n\nMr. Speaker, Bill Matthys represents the very best of servant  leadership. His life is a testimony to the impact one person can…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…District of Columbia as the  epicenter, and they entrusted its care to Congress in Article I,  Section 8, Clause 17 of the U.S. Constitution.\n\nOn November 21, 2022, the D.C. City Council made a radical decision  to allow noncitizens, including illegal aliens and those who are  aligned with embassies of foreign countries, to vote in local D.C.  elections.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…have actively facilitated dysfunction and chaos  through  their progressive, soft-on-crime policies.\n\nInstead of addressing the clear epidemic of youth crime in this city,  the D.C. Council increased the age of youth offenders to individuals 24  years old and younger. Meaning fully grown, legal adults in the  District of Columbia can receive sentences…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…friend  and the Mayor of the City of Hialeah, Esteban Bovo, for his decades of  commitment to public service.\n\nMayor Bovo began his career in 1998 as a member of the Hialeah City  Council. In 2008, he was elected to serve his community in the Florida  House of Representatives.\n\nFollowing his service in Tallahassee, Mayor Bovo was elected to the  Miami Dade…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690226/recognizing-hialeah-florida-mayor-esteban-bovo"}]