[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…has resulted in more than  $1 trillion in taxpayer savings and other financial benefits. His  dedication to fighting fraud, waste, and abuse has helped shape the  federal civil service for more than half a century.\n\nGene joined GAO as an entry-level analyst in 1973 after graduating  from Pennsylvania's Lycoming College with a bachelor's degree in  accounting.…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Insurance and Real Estate Committee. In January 2017, Steve resigned to  serve on the state Board of Pardons and Paroles, a seat which he still  holds.\n\nIn addition to his civil service, Steve has dedicated much of his  time and energy to a myriad of local organizations. He is a former  volunteer for West Haven Hook and Ladder Company 1, a longtime member…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…probationary status  because they have done such a great job. They are being fired.\n\nYounger members of the Federal workforce--there for up to 2 years,  the future of our civil service--they are firing, and so many of them  are veterans who have worn the uniform, served and sacrificed, and want  to continue to benefit the country with the skills and dedication…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…authorization laws that  require USAID and other Agencies to exist and to operate the programs  as Congress has assigned to them. Nothing changes title 5, governing  the civil service, the Administrative Procedure Act, and so on.\n\nOne of the reasons I am voting for cloture is for the very reason  that these actions are illegal and no new law is needed…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…and Russ  Vought's Project 2025-inspired efforts to ``traumatize'' the Federal  workforce.\n\nStripping collective bargaining rights is a direct assault on our  nonpartisan civil service. This bill says: Not on our watch. That is  why I signed the discharge petition on my first day in office.\n\nThis bill restores basic rights for Federal employees, defends…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697984/protect-americas-workforce-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…him,  whether or not you actually do the job. In fact, he is taking us back  to the spoils system of the 1800s. And it is not only politicizing our  nonpartisan, expert civil service; it is jeopardizing our government's  ability to deliver crucial services to the American people.\n\nAnd like authoritarians in the past, President Trump doesn't want you…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…agencies across the board, labeling  probationary employees as if they are in  trouble for some reason, when really it just means they have been there  devoting themselves to civil service for less than a year, only causes  harm and disparages them. That is why I was so proud to lead a letter  with my Washington colleagues calling for Forest Service terminations…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…would  eventually be known as the Land of Lincoln. Although postmaster was  just one of the many jobs Lincoln had during his days in New Salem, it  was his first taste of civil service and his introduction to the people  of Sangamon County.\n\nBut Abraham Lincoln is not the only person whose life has been shaped  by the Post Office. For 250 years, the U.S.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…supplementals--for which I am deeply grateful.\n\nIn 2024, Ms. Barlow earned the Presidential Rank Award for  Meritorious Service, one of the most prestigious awards in the Federal  career civil service, which recognizes members of the Senior Executive  Service for a sustained record of exceptional professional achievement.  It was aptly awarded and richly deserved.\n\nI…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…I am so proud to partner with our city  unions, always making sure that the city and services ran effectively.  Our Federal unions are the same. They make sure that our civil service  is independent and nonpartisan, serving the citizens and not whichever  party is currently in power.\n\nThey make sure we attract and retain highly talented workers, and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…is hurting the health, safety, and financial  security of people across the United States.\n\nSince he came into office, the President has laid off at least 58,000  Federal civil service workers with plans to eliminate an additional  150,000 workers. Another 76,000 workers accepted buyouts after being  threatened with relocation or termination.\n\nThese layoffs…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692075/illegal-cutting-of-federal-workforce"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…yielding. I rise to urge my colleagues across the aisle to show some  humanity and compassion to the thousands of veterans who have been  recklessly dismissed from their civil service jobs at the political  whim of this administration.\n\nThe men and women who serve our country deserve our unwavering  support, not broken promises. The indiscriminate firing…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…60,000 of my constituents in Maryland's beautiful Eighth District woke  up every morning to serve their country in the federal government.  Today, thousands of professional civil service employees, among them  cancer researchers, climate experts, food safety inspectors, air  traffic controllers and civil rights lawyers, have been illegally fired  or forced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…collective bargaining by police  officers. The 2023 D.C. law maintained the right of police officers to  collectively bargain, except over discipline, and maintained the civil  service protections and due process rights of officers.\n\nCollective bargaining by police officers has been widely criticized  for protecting police officers from discipline. A…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Where are you? Stand up and speak out.\n\nThis is a continuation of what we have been seeing: Intimidate every  other check on Presidential power in this country. Fire the civil  service. Get rid of those people. Threaten to imprison judges.  Criminally charge House Members who try to visit an ICE facility.  Arrest Senators who ask questions.\n\nThis is not…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Inauguration Day. That undermines the will of the  voters and the authority of the Commander in Chief. It is legislative  sabotage, and we shouldn't give in to that.\n\nThe Civil Service Reform Act of 1978 explicitly gives the President  authority to exclude agencies from collective bargaining when national  security is at stake. This would undo that.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…words, seek concessions not from  private owners but from the taxpayers themselves.\n\nSince Federal salaries and benefits are determined by laws, which  also establish basic civil service protections for employees, what  exactly do Federal unions bargain over? They bargain over conditions of  employment like telework.\n\nUnions also seek contract provisions…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…the last.                             Honoring Anthony Adamo\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of Anthony  Adamo, southern region president of the Civil Service Employees  Association who passed away this week at the age of 46.\n\nBorn in Flushing, Queens, Anthony graduated from New Paltz High  School and began his career at SUNY…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}]