[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Mr. BOYLE of Pennsylvania. Mr. Speaker, I rise today to honor The Pew  Charitable Trusts, an incredible organization that is focused on  improving and invigorating civic life. Founded in 1948, The Pew  Charitable Trusts has been advancing solutions to societal challenges  for 77 years, and I know that the Philadelphia community has benefited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…community partnership and engagement--among many other certificates of  appreciation from local organizations. These awards reflect the respect  he has earned from colleagues, civic partners, and constituents. It has  been said that the ``True person of success is not the person that  climbs the ladder of this life with two hands but climbs the ladder…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…fifty years, the Mu Mu Lambda Chapter has       lived this mission with distinction--strengthening       communities, mentoring youth, awarding scholarships,       advancing civic engagement, shaping leaders, and uplifting       humanity through service, advocacy, and brotherhood; and\n\nWhereas, the Mu Mu Lambda Chapter was charted on April 14,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Many in immigrant and Latino communities, including U.S.-born  individuals, now report fear, reluctance to go to court, to public  services, or even to participate in regular civic life.\n\nThe violent incident at 26 Federal Plaza is not an isolated lapse. It  reflects a much broader policy of aggressiveness and unaccountable  enforcement with little transparency…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…disabilities in rural and low-income communities.\n\nEducation lays the foundation for a strong future. Our Founding  Fathers understood that. Today's students are the entrepreneurs, civic  leaders, teachers, doctors, lawyers, engineers, and Members of Congress  of tomorrow. We owe it to our parents, our grandparents, and our great- grandparents to protect and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Roosevelt, Jr.,  Larry, and Barbara--he was reared in a home firmly rooted in faith,  discipline, and service. Those foundational values shaped a life that  bore fruit in ministry, civic engagement, and community building.\n\nAt an early age, Bishop Williams accepted Jesus Christ as his  personal Savior and was baptized at Antioch Missionary Baptist Church  under…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Court reporters and captioners help ensure  meaningful participation for individuals who are deaf or hard of  hearing and support broader public access to court proceedings and  civic processes.\n\nI am also proud that the National Court Reporters Association is  headquartered in Reston, Virginia, within Virginia's 11th Congressional  District. Their presence…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I rise today to celebrate longtime Chicago  leader, organizer, and my dear friend, Amisha Patel, for her nearly  three decades of civic engagement and community organizing.\n\nFrom leading environmental justice efforts at just 19 years of age to  organizing Chicago care workers with SEIU Local 73, Amisha has…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…move is necessary to prevent  America's culture from being reengineered. Make no mistake: Cutting  public media doesn't preserve our culture. It silences local voices,  weakens civic engagement and education, and strips away the resources  that help children learn.\n\nMr. Speaker, we must oppose these cuts.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…of my time.\n\nMs. JACOBS. Mr. Chair, I demand a recorded vote.\n\nMs. JACOBS. I request her words be taken down.\n\nMs. JACOBS. Mr. Chair, the Overseas Humanitarian, Disaster, and Civic  Aid account empowers the U.S. to be a global first responder, advancing  our humanitarian goals and strategic interests at the same time.\n\nThis fund makes humanitarian responses…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…stands with  people fighting for basic rights, it makes a difference.\n\nOn this Human Rights Day, we should take that lesson seriously.  Supporting democracies and independent civic groups makes America  safer. That takes U.S. leadership. So I urge my colleagues to back  steady funding, credible election observation, and the resolve to call  out abuses…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…earliest beginnings in the aftermath of the Civil War  to its continued presence today, the church has grown alongside  Stockton, adapting and expanding to meet the spiritual and civic needs  of its neighbors.\n\nWhat began as a small gathering of individuals committed to living  out their faith in community has become one of the city's enduring  institutions.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…betterment of society, housing the Thoreau Wildlife  Sanctuary, supporting service initiatives, and providing an education  that encourages critical thinking, ethical leadership, and civic  engagement; and\n\nWhereas, the college's commitment to its students, alumni, faculty,  and staff has created a legacy of intellectual curiosity, innovation,  and community…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…diminished sense of unity among  residents and businesses. Aligning the ZIP Code designation within the  city's name will enhance community cohesion and promote a stronger  civic identity.\n\nWhen ZIP Codes were first assigned for this area, Green was a  township, mostly farmland and a few businesses, and fewer than 10,000  residents. In 1992, Green was…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…beyond the call of duty in her illustrious public service career.\n\nThroughout her life, Mrs. Pough remained committed to service by  advocating for causes such as voting rights, civic engagement, and  youth development. Mrs. Pough is truly an example of a life lived  fully. She has been blessed to break bread with First Lady Michelle  Obama and to cast her…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…editor--experiences that helped shape his understanding of  the community he would go on to serve so faithfully.\n\nMr. Greer's influence can be seen through his involvement with  numerous civic and community organizations. He has served as a founding  member of the Board of Directors for the Cullman Parks & Recreation  Foundation, contributed to the Cullman Rotary…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…on how  society grapples with competing claims of truth and encourages readers  to return to foundational and verifiable sources--a theme with deep  implications for both our civic culture and the way we approach  legislation.\n\nI believe this thoughtful reflection is a meaningful reminder of the  importance of clarity, honesty, and shared understanding…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…1960, mostly in the form of dimes. Those Scouts who sent in their  dimes have their names engraved at the base of that statue, reminding  us of the quiet strength and legacy of civic engagement.\n\nMadam Speaker, I, once again, encourage all my colleagues to join the  Congressional Scouting Caucus, attend Camp Capitol Hill, and support  the young people who…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…about the democratic process and engage in civil  dialogue. Through partnerships with four universities, it has offered  young adults hands-on opportunities to participate in civic engagement,  serve their communities, and develop strong leadership skills. Nearly  600 alumni now serve in business, government, and the nonprofit sector,  which is a testament…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699141/recognizing-the-maddy-institute"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…and quasi-judicial matters. She has demonstrated a strong  commitment to public service, holding leadership roles with the Miami  Downtown Development Authority and numerous civic and legal  organizations.\n\nHer dedication to education and public policy began early, with an  appointment by Governor Jeb Bush and her successful advocacy for the  establishment…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690947/congratulating-melissa-tapanes"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and later volunteering as an announcer for  youth games. Supporting young people and families has long been a  defining part of his life and legacy.\n\nMr. Branch's record of civic service is both extensive and  distinguished. He has made lasting contributions to the City of Royse  City through his work on the Parks and Recreation Board and the  Planning…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…natural landscapes and historic places. From our  forests and lakeshores to our battlefields and monuments, these sites  tell the story of our liberty, resilience, and shared civic values.\n\nThis is a simple, bipartisan bill that expands access to our public  lands, encourages public participation in the semiquincentennial, and  reaffirms the ideals that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…21, 2025.\n\nThe roots of Mascotte trace back to around 1885, when founder J.W.  Payne first settled the area. The city takes its name from the  Mascotte, a ship owned by Tampa civic leader Henry B. Plant. The  vessel, which played a role in transporting tobacco from Cuba during  the Spanish-American War, is proudly on the city's official seal.\n\nLocated…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692392/recognizing-the-100th-anniversary-of-the-city-of-mascotte-florida"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…That dedication only deepened after he and his family made  Buckingham Township their home. For more than three decades, Paul  Calderaio has exemplified the very best of local civic leadership,  devoting his time, energy, and experience to strengthening his  community.\n\nA resident of Buckingham Township since 1955, Paul and his wife have  raised their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698361/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…department unit clerk, an emergency  department unit clerk, and as office manager and receptionist for Dr.  Petty's Podiatry.\n\nBeyond her professional career, Lisa's dedication to civic engagement  has been extraordinary. She has been a volunteer with the Bowie County  Republican Party for 35 years, currently serving as Precinct Chair and  Volunteer Coordinator,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…rigor have led to  this proud moment for Carter and the entire Forrest family.\n\nCarter is a proud Iowan whose journey has exemplified both academic  excellence and a spirit of civic responsibility. In addition to her  legal education, she has already engaged in a range of professional  roles, including legal research, legislative policy, and campaign work…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691562/recognizing-the-graduation-of-carter-forrest"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Health Care  Center as the Alzheimer's Coordinator and Activity Director after his  retirement from DHR.\n\nMayor Baker was awarded a State of Alabama Senior Citizens Hall of  Fame Civic Award in 2008 and received the Piedmont Journal Citizen of  the Year award in 2013.\n\nMayor Baker has served the City of Piedmont since 1988, when he was  first elected to city…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693645/recognizing-the-retirement-of-mayor-bill-baker"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…festivals, and live music nights not  only highlight the exceptional talent and variety of local enterprises  but also strengthen the bonds among neighbors, business owners, and  civic leaders alike. These events serve as a testament to the Chamber's  unwavering commitment to building community through commerce.\n\nMoreover, the Orion Chamber has demonstrated…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692437/recognizing-the-75th-anniversary-of-the-orion-area-chamber-of-commerce"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the fiscal year.\n\n``(f) Covered Foundation Defined.--In this section, the       term `covered foundation' means an organization that--\n\n``(1) is a charitable, educational, or civic nonprofit       organization under section 501(c)(3) of the Internal Revenue       Code of 1986; and\n\n``(2) the Secretary determines operates exclusively to       support--…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…long been a cultural and educational  cornerstone in California's 40th Congressional District, enriching our  community through its commitment to historical stewardship and civic  education. As America prepares for this anniversary, the Nixon Library  is once again stepping up to inspire reflection, unity, and renewed  purpose.\n\nToday, I encourage Americans…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}]