[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "She exemplified our values of hard work,  respect, inclusion, and civil engagement.", "title": "Grieving Mark and Melissa Hortman", "date": "2025-06-23"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Qualified immunity protects government officials, including police  officers, from being held liable in civil lawsuits.", "title": "Upholding Rule of Law for Federal Officers", "date": "2026-02-04"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "The Woman's Relief Corps was formally organized in 1883 to preserve  the memory of those who served in the Civil War and provide assistance  to veterans, widows, and orphans.", "title": "Moving National Woman's Relief Corps Incorporation and Domicile to Illinois; Principal Office to Murphysboro, Illinois", "date": "2026-02-02"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "As a result of her unflinching leadership in the campaign  to address the needs of poor Americans, she has been both praised for  her determination and arrested for non-violent civil disobedience.", "title": "Recognizing the Dedicated Public Service of Reverend Dr. Della J. Owens-Barber", "date": "2025-12-02"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Over the last few years, I have met directly with AGOA country  leaders, civil society groups, and business communities about the  importance of maintaining and improving the AGOA program.", "title": "Agoa Extension Act", "date": "2026-01-12"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Chair, I will compliment the chair of the full committee for  understanding the need to reassert the constitutional power of the  purse entrusted to the Congress through the Appropriations Committee  and that we do have to hammer out the bills in a civil way; not for the  purposes of the process but for what the consequences are of these 12  bills and the services that they provide to the American people.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Importantly, the Department of Education is a civil rights agency.", "title": "Majority of Americans Support Department of Education", "date": "2025-03-25"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "Trump is also threatening to cut funding from schools that won't  comply with his draconian Executive orders--his obsession to stamp out  diversity, equity, and inclusion in our public schools; Executive  orders that direct our schools to stop teaching entire chapters of our  Nation's history like the Civil War, African-American history, and the  history of immigrants in our country.", "title": "Teacher Appreciation Week", "date": "2025-05-08"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "That is 1,100 civil servants and 246  Foreign Service officers.", "title": "Congratulating Military Academy Appointees", "date": "2025-07-15"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "First, let's be clear that immigration  is a civil matter, not a criminal matter.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Speaker, this week, I introduced a bill that would  exempt from Federal Government shutdowns the Federal and independent  agencies that are exclusively or primarily federally funded but have  jurisdiction over local District of Columbia civil and criminal justice  matters.", "title": "Introduction of A Bill to Provide for Interim Appropriations for the District of Columbia Courts and Related Agencies with Respect to Any Fiscal Year for Which Appropriations Are Not Otherwise Provided for Such Courts and Agencies", "date": "2025-10-03"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Our Nation has faced countless tests to our strength and our unity,  including a civil war, two world wars, natural disasters, and more.", "title": "Semiquincentennial Congressional Time Capsule Act", "date": "2026-02-09"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "President Trump took  an ax to the Department of Justice's Voting Section within the Civil  Rights Division, that historic section established to protect and  uplift the vote.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "In the last few weeks in Chicago, we have seen Trump's agents detain  innocent Americans, deny citizens their right to legal representation,  point weapons at civilians, zip-tie children, arrest elected officials,  ransack apartment buildings, injure journalists, and shoot a priest in  the head with pepper balls for the so-called crime of peacefully  praying for nonviolence.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": "2025-10-09"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "Speaker, we have courts gutting the Civil Rights Act, statehouses  cooking up new restrictions, and a President threatening to override  the will of the people with the stroke of a pen.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Reverend Middlebrook played a crucial role in the civil rights  movement during the sanitation workers strike in Memphis and later  founded the Dr.", "title": "Reverend Harold Middlebrook Post Office Building", "date": "2025-12-09"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "With my bill, the CVF  will also receive, through fiscal year 2029, the unobligated civil  penalties collected through antifraud law.", "title": "Crime Victims Fund Stabilization Act of 2025", "date": "2026-01-12"}, {"senator": "John Thune", "party": "Republican", "sentence": "President, this resolution concerns a subpoena for  deposition testimony and documents in a civil action pending in Federal  district court in the District of Columbia.", "title": "Authorizing Testimony, Document Production, and Representation By the Senate Legal Counsel in the Case of in Re Architect of the Capitol Employment Dispute", "date": "2025-06-04"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "A number of university  presidents have lost their jobs, and universities are increasingly  committing themselves anew to protecting civil rights and promoting  academic freedom.", "title": "Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "Speaker, I rise today to recognize Colonel John  Peyton Swain of the Civil Air Patrol, the U.S.", "title": "Recognizing Colonel John Peyton Swain", "date": "2025-07-16"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Recruitment, relocation, and retention incentive program for                civilian firefighters employed by Coast Guard in remote                locations.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-07-23"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Where civil law is subordinated to Islamic authority, freedom,  prosperity, and security collapse.", "title": "Sharia Free America Caucus", "date": "2026-01-14"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "We are a just and civil society that shows compassion, especially  for folks who are in need.", "title": "Read the Bill", "date": "2025-07-15"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Leading the way was Senior Guard Jaida Civil, a University of  Tennessee commit and McDonald's All American, who grabbed 9 rebounds  and scored 20 points.", "title": "Recognizing Palm Bay Pirates Girls' Basketball Team", "date": "2025-03-27"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "It restricts  the use of nonlethal tools during civil unrest and has fueled a  devastating staffing collapse.", "title": "Common-Sense Law Enforcement and Accountability Now in DC Act of 2025", "date": "2025-11-19"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "It is the ultimate civil  right.", "title": "Recognizing Chief Mario Augello", "date": "2025-07-16"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "He was a loving  father and a grandfather, a mentor and a role model, and an exemplary  civil servant.", "title": "Congratulating Greg Parker, Retailer Executive of the Year", "date": "2025-06-10"}]