[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pursuing a  nuclear weapon. Second, even though Iran possessed a significant amount  of 60-  percent-enriched uranium--more than the 3 percent to 5 percent that is  utilized for civilian energy--it was still not enriched to the level to  build a bomb. It would have had to be enriched to 90 percent. It would  have had to be converted to metallic form. It would…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…minister has been  accused by the International Criminal Court of ``the war crimes of  starvation as a method of warfare and of intentionally directing an  attack against the civilian population; and the crimes against humanity  of murder, persecution, and other inhumane acts;'' to a military that  has killed more than 70,000 thousand Palestinian men, women,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698049/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Force Base to Cannon Air  Force Base.\n\nWe owe it to those who have served to ensure that they can access  healthcare, reliable transportation, and opportunities to succeed in  civilian life.\n\nThat is why I am introducing a package of bills focused on real  solutions: expanding healthcare access, improving transportation, and  easing financial burdens for…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…regard to the services. I have only a small chapter in my life of 2  years working for Secretary Weinberger as a Presidential fellow. But I  didn't wear a uniform. I was a civilian working on a host of different  programs for 4 months or so. They were great assignments. I learned an  awful lot.\n\nBut everything you are talking about comes from your deep…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…this feels like. My sister, Olivia, was born  with microcephaly, which means her brain was small and the doctors  didn't know why. Even with insurance provided by my dad's civilian job  at the Department of Defense, Olivia wouldn't have gotten the care that  she needed to live for 19 years as healthy as possible if it weren't  for the Washington State…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…staff of the entire agency,       terminated 86% of its programs, and kneecapped the rest--all       against Congressional directives. They dismantled the US's       largest civilian force advancing global stability, peace,       economic growth, and survival. And they have done it in a way       maximized loss of life and mismanagement of taxpayer…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…that  we are trying to keep the Department of Defense from striking workers.\n\nThis has always been illegal. There has never been a strike at the  Department of Defense by the civilian employees. It is banned. It does  not impact national security. It is clear that this is union-busting  tactics by the union buster in chief.\n\nI was a union electrician, and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…our veterans  and brings much-needed transparency for the Veterans Readiness and  Employment Program which helps veterans with service-connected  disabilities transition to civilian careers.\n\nServing over 125,000 veterans each year, the VR&E program is  critical, especially for veterans in Florida and nationwide, helping  them gain the skills and opportunities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695446/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…War. The legislation awards three  Congressional Gold Medals, as the gentleman from Minnesota outlined.  They are going to three different locations. This is the highest  civilian award, and it makes that award to the members of the 1980 U.S.  Olympic men's ice hockey team, whose victory marked a pivotal moment in  American sports history.\n\nOn February…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…opened to the public on July 19, 1949, with services for five who lost  their lives in service to our Nation: an unknown serviceman, two  Marines, an Army lieutenant and one civilian--noted war correspondent  Ernie Pyle. Since then, it has become the final resting place for an  estimated 53,000 veterans from World War I, the Second World War, the  Korean…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…the sign on the door  said: The price of freedom is visible here. Our veterans gave  everything for this country. Our promise in return is that they will  not just get by in civilian life, they will thrive.\n\nCongress must ensure employment readiness programs truly work for  veterans, and that is exactly what the  FAST VETS Act does. I am heartened that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…whether it is drug interdiction, obviously doing the work in terms of  our coastal, littoral regions of the country, and making sure we have  safe passage of commercial and civilian maritime activity.\n\nIncluded in this bill is a provision to reach out to our great ally  Finland to update and modernize our icebreaker fleet. Our Polar Star  large icebreaker…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…of the  Army, the Navy, and the Air Force to ensure robust emergency services  that maintain safety and mission readiness across the Force.\n\nAcross the DOD, more than 8,800 civilian firefighters respond to  structural fires, aircraft emergencies, hazardous materials incidents,  and other life-threatening events each year.\n\nMr. Speaker, I cannot think…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695629/filling-firefighter-positions-on-military-installations"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Oversight employee training requirements) directing the U.S.  Department of Defense to make use of federally registered  apprenticeship programs for training military personnel, civilian  employees, and military construction contractors on anti-corrosion  activities. Under my amendment to the FY2022 NDAA, the DOD's Office of  Corrosion Policy and Oversight…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693007/introduction-of-the-bridge-corrosion-prevention-and-repair-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Madam Speaker, on March 13, the Department of Defense  issued new guidance: Military health clinics overseas would no longer  provide rape test kits to American civilian workers and contractors  serving alongside our servicemembers abroad. These are our intelligence  analysts, our teachers, our doctors, and our support staff performing  critical…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694036/safe-kits"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…efforts in  strategic competition in countering malign influence.\n\nWe owe it to the men and women who volunteer to serve in these roles,  our special operators, uniform and civilian intelligence personnel, and  security cooperation personnel, to equip them with the capabilities.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695148/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…it tightens the rules for military aircraft so air traffic  control and other pilots have a better idea of nearby planes and  helicopters.\n\nNo. 2, it requires all aircraft, civilian and military, to equip and  receive ADS-B signals.\n\nNo. 3, it directs the FAA to comprehensively evaluate the safety of  airspaces around airports across the country so that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…All Holiness has had  visitations with five Presidents, he has spoken to both houses of  Congress and has been awarded the Congressional Gold Medal; the highest  award that civilian Congress can bestow. His next trip will maintain  that longstanding tradition of friendship between the United States and  the Ecumenical Patriarchate.\n\nIt is Patriarch Bartholomew's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…before being selected as the Assistant Flight Commander for  Air Freight at the 436th Aerial Port Squadron at Dover Air Force Base.  In this role, he led 226 military and civilian personnel to ensure  efficient flight operations at the Department of Defense's largest  aerial port.\n\nFor his outstanding service, Capt. Hammond received the Air and Space…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690077/recognizing-the-military-service-of-nathan-l-hammond"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…2025 Community Wingman Award.\n\nHill Air Force Base is one of the most important contributors to  northern Utah's economy and livelihood, employing over 23,000 military  and civilian employees. Every year since 2007, they have given one  individual the Community Wingman Award in recognition of their support  for the base and its personnel. This gives the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…the State of Israel.\n\nThe United States has affirmed our resolve to stand with Israel by  helping defend against the recent missile raids launched by Iran  against Israel's civilian population.\n\nThe success of Israel's robust missile defense capability is, in  part, because these funds were provided in this bill and prior bills.  Furthermore, this funding…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…for and have the resources they need  to thrive so no veteran is left behind.\n\nCurrently, too many of our veterans struggle with the difficulties of  transitioning back into civilian life and far too many continue to face  homelessness or housing instability.\n\nThe Department of Veterans Affairs created the Grant and Per Diem  program to help address this…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688686/recognizing-essential-legislation-that-supports-our-nations-veterans"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…serve in the  precincts in their own communities.\n\nIt requires wisdom and experience, like the bill to give State and  local agencies the ability to rehire retired officers in civilian law  enforcement roles.\n\nIf you stand on the side of justice and our first responders, these  votes should be simple and easy.\n\nWith that, I would ask to move forward.\n\nMr.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…arms.\n\nPresident Putin said: No, I won't agree to a blanket cease-fire, but  I will stop bombing infrastructure in Ukraine. He lied like he  breathed. He continued to destroy civilian infrastructure in Ukraine.\n\nThen President Trump said: OK. Let's try for a cease-fire in the  Black Sea.\n\nThat would benefit both Ukraine and Russia, both of which use the…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…boating and travelling.\n\nWhile Lieutenant Delong will be retiring as a reserve officer on  March 28, 2025, he will continue to serve the Hamilton County Sheriff's  Office in a civilian capacity. My fellow Hoosiers and I appreciate  Kurt's dedication and contribution to our community.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689279/recognizing-lieutenant-kurt-delong"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…days after the date on       which the Office is established or designated, the       Administrator shall initiate a safety review of all military,       law enforcement, and civilian rotary wing, powered lift,       fixed wing, and unmanned aircraft system flight operations       and flight routes in the Washington D.C. Metropolitan Area       Special…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…that place.\n\nRedstone Arsenal is a hub for missile defense, with unmatched  infrastructure and mission synergy. Our workforce brings together  military expertise, leading civilian aerospace professionals, and a  pipeline of scientists and engineers. This is not just about geography.  It is about capability, efficiency, and effectiveness.\n\nThis decision…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…with accessing educational benefits that they have earned through their  dedicated service to our Nation. It helps ensure a smoother, more  effective transition back into civilian life.\n\nSpecifically, my legislation requires educational institutions to  clearly provide estimated tuition costs to potential GI Bill students.  If an institution cannot…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…officers of the District of       Columbia through collective bargaining, to restore the       statute of limitations for bringing disciplinary cases       against members or civilian employees of the Metropolitan       Police Department of the District of Columbia, and for other       purposes. All points of order against consideration of the       bill…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…education benefits and align them with today's workforce  needs.\n\nAs I represent nearly 80,000 veterans in southern Arizona, I know  firsthand when servicemembers transition to civilian life, they bring  discipline, leadership, and a strong work ethic, but too often the  system limits how they can use the benefits that they earned. This bill  changes that…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699510/veterans-education-and-technical-skills-opportunity-act-of-2025"}]