[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…servants.\n\nMichigan is seeing the real-time impact of President Trump's and Elon  Musk's mass firings. I have heard and seen people's fears firsthand at  my townhalls because civil servants are the quiet force behind the  services that hold our communities together.\n\nWhen a farmer in west Michigan loses a season's worth of crops, it is  the USDA employee who…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690734/public-service-recognition-week"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the promotion potential for  attorneys at the Board of Veterans' Appeals.\n\nI know that my colleagues on the other side of the aisle balk at  anything that might result in civil servants receiving more  compensation, but if we agree that we need to hire board attorneys with  greater experience, and we are asking them to do more work and more  complex work…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…cases.\n\nBut they are not stopping--this administration--at forcing attorneys  to dismiss cases. Justice Department officials have also removed all of  the senior civil servants--civil servants--in the Civil Rights  Division. That has had a ripple effect, as you can imagine, causing a  mass exodus of experienced attorneys from the Division. And rather…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…anxiety and making it impossible to plan for the  future.\n\nJust last week, this administration announced the firings of 1,300  staff at the State Department. That is 1,100 civil servants and 246  Foreign Service officers.\n\nWhile these cuts may not directly impact those embassy operations,  they are only going to have a domino effect that is going to hurt…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…because of its rank  incompetence and lawless assaults on the privacy data of hundreds of  millions of Americans and its unlawful summary mass firings of  professional civil servants like air traffic controllers, food and drug  inspectors, pediatric cancer researchers in my district, Forest  Service, and firefighters. They are getting run out of town…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…America's Workforce Act.\n\nIn my community, Mr. Speaker, public service is a way of life. More  than 80,000 of my neighbors work directly for the Federal Government.  These civil servants protect our national security, care for our  veterans, process Social Security claims, advance medical research, and  respond when disaster strikes.\n\nThey have also been…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697984/protect-americas-workforce-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…public lands. They are talented. They are critical.  They are experienced. They  choose to do this, frankly, for lower salaries simply because they want  to serve. These are civil servants.\n\nWe are losing these really talented and critical staff through  layoffs. Now, with the uncertainty, we are seeing early retirements.  Frankly, given the disrespect and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…losing, the kind of  losing that will be felt in this Nation for years to come.\n\nOne hundred days in, look at how they have treated the very best of  us--this Nation's civil servants, the Federal workers who serve with  absolutely no political motivation. I have met them. I know them. Close  to 160,000 of them live in the State of Maryland, and many…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…access to their equipment, no  offboarding information, and no details about their severance. This is  one of the many, many stories that I get at my office every week.\n\nCivil servants who dedicate their career to serving this government  deserve transparency, clarity, and respect. But across agencies, this  administration continues to blindly and abruptly…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694177/demanding-answers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the Department of  Energy to conduct these assessments and draft the periodic reports.\n\nPresident Trump has decimated and undermined our Federal agencies and  dedicated civil servants who fulfill their missions while also stealing  Federal funds promised to local communities all across the Nation. He  has created constant uncertainty for businesses with…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…workers  from this administration for weeks now. They are wrong, and much of  what they are built on is a lie. And they are dehumanizing.\n\nThis is, in fact, a witch hunt. Our civil servants are among the best  of what our Nation has to offer. They serve with no political  motivation. Many have served for years under Democratic administrations  and Republican…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…from Hurricanes  Helene and Milton, just like other parts of the country, in Georgia and  North Carolina. We don't need Elon Musk creating turmoil and firing  civil servants and public servants who are helping us rebuild. We do  not need the Trump administration making people's lives harder to  rebuild and harder to afford to stay in their homes.\n\nWe…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…groceries are still too  high.\n\nThe President handed an unelected, unqualified billionaire, Elon  Musk, unfettered access to private data and indiscriminately fired  devoted civil servants. Services at Social Security and IRS have been  slowed in the aftermath.\n\nBecause the President has aligned himself with dictators like Putin,  our allies across the globe…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…millions of older Americans, the national security experts  who keep our Nation safe from threats. These people are not loyal to  any party or President. They are career civil servants devoted to  serving Americans and answering to the Constitution. And they are being  abruptly and illegally fired from critical positions across the  government.\n\nToday,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…systems.\n\nTwo in my division were program assistants who provided       crucial support for the review process--both early in their       career and with tremendous promise as civil servants.\n\nAnother in my division was an intermittent expert.\n\nNational Science Foundation's work depends on bringing in       knowledgeable experts from many fields, and intermittent…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688192/fired-by-president-trump"}]