[{"senator": "Marc Veasey", "party": "Democrat", "sentence": "…communities, and his role  in bringing the 23rd Annual Korean American National Sports Festival to  North Texas underscores his commitment to cultural celebration and  civic engagement.\n\nWe honor Mr. Kim for his service, his vision, and the inclusive  spirit he brings to our region.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692616/regognizing-jaehyung-kim"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…exemplary residents  aged 60 and older who have selflessly dedicated five or more years to  volunteer service in Broward County. These individuals embody the  spirit of civic engagement and community service that strengthens the  social fabric of our region.\n\nThis year's distinguished honorees are Linda Hill Anderson, Sandra  Atkins, Timothy G. Curtin,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…High School lives on       through its alumni-many of whom have remained in Mississippi       and work tirelessly to improve their communities, including       through civic engagement, grassroots organizing, and       philanthropic leadership;\n\nWhereas more than 130 alumni from the graduating classes of       the 1960s, 1970s, and 1980s are expected…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694753/recognizing-the-amanda-elzy-high-school-multi-year-reunion"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…veterans, active-duty service members, and families  across northeast Bexar County.\n\nFor five decades, the Post has served as a hub for camaraderie,  patriotic education, civic engagement, and community service.\n\nFrom mentoring youth through programs that instill duty and honor, to  assisting veterans as they transition to civilian life, Post 667 has  embodied…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…society, housing the Thoreau Wildlife  Sanctuary, supporting service initiatives, and providing an education  that encourages critical thinking, ethical leadership, and civic  engagement; and\n\nWhereas, the college's commitment to its students, alumni, faculty,  and staff has created a legacy of intellectual curiosity, innovation,  and community engagement…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Throughout APAPA-SOC's ten years, its ability to empower       Asian and Pacific Islander Americans of all ages has left its       community a legacy that promotes civic engagement at the       local, state, and national levels of government. It is my       greatest hope that the APAPA-SOC Chapter continues to prosper       in the years ahead. I…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694253/congratulating-the-asian-pacific-islander-american-public-affairs-solano-county-chapter-ahead-of-their-10th-anniversary"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…who have  made a profound impact towards inspiring and uplifting the City of  Batavia.\n\nAs a native Batavian, Bob has lived a life rooted in the values of  compassion, civic engagement, and integrity. His contributions have  touched nearly every corner of the Batavia community and continue to  uplift countless lives.\n\nBob is a driving force behind the…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…Beyond the pulpit, the First Congregational Church has played a vital  role in the cultural and social life of Stockton. Its members have long  championed education, civic engagement, and social justice--offering  programs and outreach efforts that extend far beyond its walls. Whether  through fellowship events, support groups, or charitable initiatives,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…years, the Mu Mu Lambda Chapter has       lived this mission with distinction--strengthening       communities, mentoring youth, awarding scholarships,       advancing civic engagement, shaping leaders, and uplifting       humanity through service, advocacy, and brotherhood; and\n\nWhereas, the Mu Mu Lambda Chapter was charted on April 14,       1976 in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Americans have played a vital role in the growth  and vitality of the Keystone State and have enriched their communities  through their commitment to tolerance, service, and civic engagement.\n\nThese extraordinary ideals reflect the Sikh tradition of seeking  peace through equality, fraternity, and respect, while striving to  overcome division through sacred…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…commend Mr. Yeremyan for years of devoted leadership, service, and  commitment to the Armenian community and to the people of Colorado. His  efforts embody the spirit of civic engagement and cultural stewardship.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697495/recognizing-byuzand-yeremyan"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Jr.,  Larry, and Barbara--he was reared in a home firmly rooted in faith,  discipline, and service. Those foundational values shaped a life that  bore fruit in ministry, civic engagement, and community building.\n\nAt an early age, Bishop Williams accepted Jesus Christ as his  personal Savior and was baptized at Antioch Missionary Baptist Church  under Pastor…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…sustainable lifestyles and reduce their  ecological footprint.\n\nThe All-America City award from the National Civic League recognizes  outstanding communities that leverage civic engagement, collaboration,  inclusiveness, and innovation to address local issues. It is because of  the collective efforts of communities like the City of Lakewood that we  can…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694723/recognizing-the-city-of-lakewood"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…call of duty in her illustrious public service career.\n\nThroughout her life, Mrs. Pough remained committed to service by  advocating for causes such as voting rights, civic engagement, and  youth development. Mrs. Pough is truly an example of a life lived  fully. She has been blessed to break bread with First Lady Michelle  Obama and to cast her vote…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…committed to hard work, community, and service; and\n\nWhereas, for 175 years, Fulton County has stood as a proud       testament to the enduring values of self-reliance, civic       engagement, and American perseverance;\n\nNow, therefore, I, Congresswoman Marcy Kaptur, do hereby       recognize and celebrate the Demisemiseptcentennial of Fulton       County,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…major.\n\nAs a graduate of Penn State, I am proud of these students for  devoting their time and resources to educating and advocating for their  fellow students, promoting civic engagement, and showcasing the Penn  State community--We Are.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697393/welcoming-penn-state-lion-caucus-to-capitol-hill"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…children with autism, train and employ  caregivers, and create educational media. She also mentors women and  youth throughout Pennsylvania in leadership, business, and civic  engagement.\n\nDr. Elsheikh has earned awards such as the 2025 Globe St.  Humanitarian Woman of Influence Honoree, Honorary Doctor of Humane  Letters from Central Penn College, 2024…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693665/recognizing-dr-hagir-elsheikh"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…mostly in the form of dimes. Those Scouts who sent in their  dimes have their names engraved at the base of that statue, reminding  us of the quiet strength and legacy of civic engagement.\n\nMadam Speaker, I, once again, encourage all my colleagues to join the  Congressional Scouting Caucus, attend Camp Capitol Hill, and support  the young people who work…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…finished in the top ten. This is a truly impressive  accomplishment that speaks to their academic excellence and their  strong grasp of financial markets, economics, and civic engagement.  These students demonstrated exceptional teamwork, discipline, and a  genuine passion for learning throughout the competition.\n\nThe team members who I met today, along…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692339/recognizing-the-capitol-hill-challenge"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…social services along with  educational and cultural programs for the enrichment of the  community.'' This mission comes to life every day through compassionate  care, civic engagement, cultural preservation, and programs that  empower individuals and families to thrive.\n\nThrough health care access, senior workforce development,  scholarships, educational…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…presence at post- sponsored events, from Bingo at the Marquette County Fair and the  Jacobetti Veterans Home, to Boys State programs that promote youth  development and civic engagement.\n\nIn addition to his service to veterans, Mr. Carlson has been a pillar  of support for youth athletics in the Upper Peninsula. As a youth  baseball coach, he led his…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694083/recognizing-raymond-e-carlson-as-the-2025-upper-peninsula-veteran-of-the-year"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize an exceptional  group of young students who have worked with my staff and me to better  their civic engagement and understanding of the federal government.  This year's Congressional Youth Council consists of some of the  brightest and most dedicated young minds from throughout…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689362/recognizing-the-accomplishments-of-the-ninth-district-congressional-youth-council"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…unit clerk, an emergency  department unit clerk, and as office manager and receptionist for Dr.  Petty's Podiatry.\n\nBeyond her professional career, Lisa's dedication to civic engagement  has been extraordinary. She has been a volunteer with the Bowie County  Republican Party for 35 years, currently serving as Precinct Chair and  Volunteer Coordinator,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…advocacy for youth development  provides vital resources for school enrichment programs, residential  camping programs, adult volunteer training, teen workforce development,  civic engagement, and graduating senior and 4-H alumni scholarships.\n\nIt is clear that Marlene Law has made a profoundly positive impact on  our community, and I am grateful for her service.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Americans to our  society. Turkish Americans enrich our communities through their  entrepreneurial spirit, cultural traditions, academic and scientific  achievements, and civic engagement. Their success reflects the shared  values of opportunity and perseverance that define both our nations.\n\nMr. Speaker, as we mark this milestone in the history of the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this money didn't go to the victims  at all. Instead, it went to nonprofits, some of which have nothing to  do with fire relief, where they promote things like voting and civic  engagement and multigenerational power building. Some of them aren't  even located in L.A.\n\nI have asked the Attorney General to open an investigation in order  to restore the intent…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694134/investigation-into-the-fireaid-concert-in-los-angeles"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of the  Coastal Empire at the annual Women Who Rule event in Savannah, Georgia.\n\nMs. Seiler's leadership, service, and commitment to community reflect  the very best of civic engagement and personal dedication. A graduate  of the University of Georgia's Henry W. Grady School of Journalism, Ms.  Seiler built a distinguished career in corporate communications…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…started broadcasting live coverage of the  U.S. House of Representatives in 1979. At that time, I was a Member of  the House and appreciated C-SPAN's mission to foster civic engagement  and let the sun shine in on the people's business.\n\nSo, today, I wish C-SPAN2 a happy birthday and thank those who are  dedicated to its mission to bring the people's…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Troop 7056, Madison embodied the spirit of the Scouts,  which is to make ethical and moral choices that contribute to the well- being of society, ultimately fostering civic engagement and love of  community.\n\nSouthern Ohio is proud of Madison's accomplishments, and we are happy  to call her one of our own. I look forward to seeing how she continues…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Chair of the Ingalls Precinct Republican Party, and an active member of  the Avery County Schools Improvement Team. These roles reflect his deep  commitment to education, civic engagement, faith, and the future of  Avery County's youth.\n\nOn behalf of the people of North Carolina's 11th Congressional  District, I extend my sincere gratitude to Phillip Barrier…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}]