[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…National Defense Authorization Act which has critical investments in  our national defense, including in Maryland. In my State, tens of  thousands of military personnel and civilians work at military  installations and in the defense sector, driving innovation and  research to advance our defense. The NDAA governs this work and  provides essential support…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…disproportionate  show of force.\n\nWhat I saw was completely unacceptable, masked ICE agents in military  gear firing tear gas and other projectiles into a crowd of peaceful  civilians and reporters. Even a child was injured by shrapnel.\n\nUpon seeing these violent tactics, I demanded to speak to the person  in charge, but I was denied.\n\nAs the elected Representative…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…it continues to be  omnipresent in the skies above Ukraine. Ukrainians can't avoid the  Shahed drones that Russia is using and buying from Iran to kill  innocent Ukrainian civilians who are fighting for their very liberty.\n\nThis military parade took place at a critical moment in Moscow's  aggression on Ukraine as American efforts proceed to negotiate…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…unconstitutionally--using our  troops however he sees fit, rule of law be damned.\n\nTo put what he has done another way, the President has ordered  repeated military strikes against civilians without congressional  oversight, and he has claimed that such military action is justified  because he himself, in his ultimate wisdom, has deemed these civilians  to be…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…tactics instructor, and a member of the Southwest Metro SWAT Team  Consortium.\n\nIn the past 12 years, Chief Tholen has worked to train officers,  paramedics, firefighters, and civilians across the metro area in active  shooter response protocol. Through his work, he has emphasized the  importance of awareness, prevention, and survival, equipping  individuals…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693614/recognizing-brian-tholen"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the ``People's Defense  Forces'' of the government in exile.\n\nThe violent conflict between opposition groups and the Burmese junta  has caused immense suffering of Burmese civilians, primarily due to  displacement and military bombing campaigns, targeting civilians as  retribution for rebel gains on the battlefield.\n\nThe Burmese people are no stranger…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I yield myself such time as I may consume.\n\nThe terrorist atrocities committed by Hamas in Israel on October 7,  which took the lives of more than 1,200 innocent civilians, and the  subsequent war of mass destruction in Gaza, have been nothing less than  a catastrophe for humanity.\n\nMore than 70,000 people have been killed to date, including…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…how we solve this problem--the  Constitution says so--and the questions raised here.\n\nFor the first time in 250 years, the United States military is  deliberately targeting civilians. They may be awful civilians, I will  grant you that, but they are deliberately targeting civilians. We have  the largest military force ever assembled in the Caribbean,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698242/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…incidents in Chicago and the suburbs since October 1. Bovino and CBP  agents are violating court injunctions and agency rules. They are lying  in court about incidents where civilians have been put in danger.\n\nThe government alleges that Marimar Martinez used her car to assault  and impede Federal law enforcement, but then, Federal prosecutors filed  a…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…tactics instructor, and a member of the Southwest Metro SWAT  Team Consortium.\n\nIn the past 12 years, Chief Tholen has worked to train officers,  paramedics, firefighters, and civilians across the metro area in active  shooter response protocol. Through this work, he has emphasized the  importance of awareness, prevention, and survival, equipping  individuals…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…forward: go to Congress and make the case to the American people. If  President Trump cannot make that case, then he has no business  launching military strikes, killing civilians, and putting American  servicemembers in harm's way.\n\nEven after yesterday's classified briefing from ``Secretary of War  Crimes'' Pete Hegseth, we all left with far more…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…illegal Russian invasion.  Putin is attempting to rewrite the map of Europe through use of force.  He is doing so in violation of international law. He is deliberately  killing civilians, targeting hospitals and schools, destroying the  economy and the livelihood of Ukraine in the process.\n\nPutin and his thugs are committing war crimes on a mass scale. They…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…people were killed, and dozens more were injured. I am  offering my prayers for the victims and their families. I am thankful  for the heroic actions of first responders and civilians to end the  gunmen's rampage.\n\nThis act of violence is a grim reminder that we cannot stop combating  anti-Semitism. This tragedy occurred just hours after Brown University,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…harmful to allow many of my colleagues to  take great lengths right here to protect war criminals, apartheid  regimes, folks that continue to commit war crimes in targeting  civilians including tent communities, schools, and hospitals. This bill  undermines the international legal system for seeking to hold various  officials, again, countries that are…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…States, and in all 50  States, law enforcement pays zero excise taxes on these devices. It is  important to know that long-range tasers can already be legally  purchased by civilians. All they need to do is pass a background check.\n\nI support tasers. I support law enforcement. This bill does not  mention tasers once, and law enforcement is only mentioned…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Because of their work, and the courage of our veterans and  servicemembers, our Nation has been spared from similar attacks.\n\nWe thank all of those who serve our Nation, both as civilians and  servicemembers, in the fight to secure our homeland.\n\nDespite this success, we remain vigilant in the face of continuing  threats against our country. That means continuing…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…designed with such tools in mind.  The result is higher costs, more red tape, and slower adoption of  technology that can actually make encounters safer for both officers  and civilians.\n\nThis bill fixes that mismatch. It makes clear that less-than-lethal  weapons, such as tasers, should not be taxed like firearms. It gives  clarity to manufacturers; certainty…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…President Putin has responded with  aggression. With one hand, Vladimir Putin always makes a show of  participating in peace talks. With the other, he has repeatedly bombed  civilians--a clear war crime, a war crime--including just on Sunday of  last week, Palm Sunday, when he bombed worshipers and children who were  playing on a public playground.\n\nOn…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…key aspects to the Russian war  effort, including economic and electronic warfare, command and control,  and targeting. These components allow Russia to terrorize Ukrainian  civilians with ballistic missile strikes, as well.\n\nThe prevalence of U.S. manufacturing equipment in global  semiconductor production means nearly all are subject to U.S. export…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690678/economic-espionage-prevention-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…widespread attacks on the civilian population, further illustrates  the point.  One particular event in Bucha stands out. Russian troops intentionally  massacred more than 400 civilians, apparently as part of a systematic  clearing operation to secure their path to the capital, Kyiv. Russian  paratroopers from the 234th Guards Air Assault Regiment interrogated…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…new information has emerged relating to the       involvement of the Haqqani Network in terrorist attacks       targeting the United States Military or United States       civilians.\n\n(iii) Form.--The report required by this subparagraph shall       be submitted in unclassified form but may include a       classified annex.       SEC. 3. REPORT ON DIRECT…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…that as they look to expand and threaten Poland that we  will be there for them.\n\nMr. TURNER of Ohio. Mr. Chairman, I oppose this amendment. Russia is  murdering innocent civilians in Ukraine.\n\nOur support to Ukraine opposes Russia's murderous aggression. Ukraine  is fighting on the front lines against Russian aggression. Vladimir  Putin is threatening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695258/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…OF THE ARMS EXPORT CONTROL ACT\n\n(U) On October 7, Hamas launched the worst attack on Israel       since the 1973 Yom Kippur War, firing thousands of rockets,       striking civilians and locations as far as Tel Aviv and       Jerusalem. Hamas gunmen crossed into Israel, entering towns       and communities as far as 15 miles from Gaza, slaughtering…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Mrs. FISCHER. Mr. President, since December 28, Iranian civilians  have taken to the streets to protest the bleak economic conditions and  the daily hardships imposed on their families by the Iranian regime.  Local protests have spread…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Beautiful Bill Act.\n\nMr. Speaker, the men and women who put a badge on every morning,  every afternoon, every evening want to leave the world better than they  found it. Yet we civilians don't fully appreciate just how much time  they spend away from their families to protect ours. They stay late  writing reports or working events. They are often required…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Obama's administration.\n\nUnder President Obama, Putin conducted his overt and covert actions  in Ukraine with some 10,000 Ukrainians killed in the fighting,  including 2,000 civilians, yet Obama and his European allies simply  looked down at their shoes. In 2014, Putin took Crimea without firing a  shot. He is a disgrace to the rich, cultural history of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Omar,  calling Somalia a wonderful place. If it is such a wonderful place, why  doesn't she move back? If Somalia is all that, why is the terrorist  group al-Shabaab murdering civilians by the masses, and why is the  capital of Somalia considered to be one of the most dangerous capitals  in the world due to frequent terrorist bombings, targeted killings,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…other vehicular terrorist       incidents represent an enduring and evolving threat to public       safety in the United States and around the world, targeting       innocent civilians and first responders.\n\n(3) These attacks, carried out by both organized terrorist       groups and individual actors, often aim to exploit high-      density public gatherings,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…native of Oregon and a proud graduate of the United States  Military Academy at West Point, Mr. Austin has left an indelible mark  on the lives of countless Soldiers, Army civilians, and their families.\n\nEven after retiring as a Colonel in the U.S. Army, Mr. Austin's  passion to serve endured. In June 2015, he returned to the Army Reserve  as a member…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…overwhelming odds, and heavy  casualties, these men executed a successful fighting retreat to the  port of Hungnam. In doing so, these heroes evacuated over 100,000  troops and civilians, through unyielding courage, sacrifice, and  determination.\n\nThe Battle of Chosin Reservoir is remembered not only for the extreme  conditions that were faced, but more importantly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695858/recognizing-the-75th-anniversary-of-the-battle-of-chosin-reservoir"}]