[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…decline in gun violence in the history of recorded  statistics in the United States of America. That is extraordinary. That  is extraordinary. I am not going to sit here and claim that the entire  reason was the Bipartisan Safer Communities Act, but it was a big part  of the reason because we did make it harder for bad people to get their  hands on guns.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…destroyed  at a cost of $130,000 to American taxpayers because of the chaos caused  by dismantling USAID. It was left there to expire.\n\nThis is the bill to help Republicans claim that they are practicing  fiscal responsibility while concealing that what they are doing is  ripping health insurance away from at least 17 million Americans in  order to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…services that hold our communities together.\n\nWhen a farmer in west Michigan loses a season's worth of crops, it is  the USDA employee who helps them adjudicate a crop insurance claim,  making sure they can recover and keep food on our tables.\n\nPublic servants are the problem-solvers, neighbors, and first  responders in times of crisis. They protect our…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690734/public-service-recognition-week"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…on  law enforcement officials, Republican law enforcement officials,  because they won't bend the knee and politically persecute people  against whom there is no actionable claim?\n\nMr. KAINE. Mr. President, might the Senator from Oregon yield for  another question?\n\nMr. KAINE. Thank you. And I will tell a quick story. In fact, I am  going to hand you…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…should be expanding them in the wake of the Honoring our PACT Act.\n\nVeterans exposed to toxic substances deserve swift justice. Right  now, the average time for processing a claim is 165 days. Over 2.3  million claims have been submitted, and more than 6,000 of those  veterans are right in my district, Indiana's First Congressional  District. That number…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692946/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and gratuitous destruction  and theft of Palestinian property are often observed and tolerated by  IDF soldiers. This too fuels hatred and more violence.\n\nAbsent a legitimate claim of self-defense, violence is wrong no  matter who engages in it. But the incarceration, prosecution, and  punishment of Palestinian children by Israeli military prosecutors…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…my wife and I sit at and eat breakfast. We have come to know just about  all of the waitresses and helpers in this restaurant.\n\nIt is legendary, by Chicago standards. They claim to be the starting  point for the creation of U.S. Route 66. There are people, literally,  coming from all over the world to make that journey down Route 66 and  start with…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…families fleeing  their homes, and the National Guard troops confronting peaceful  protesters--are a chilling reminder of how far we have strayed from my  democratic values that we claim to uphold.\n\nThis is not the America I know. This is not the America we aspire to  be. We are a nation built on justice, compassion, and the unwavering  belief that every person…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692239/ice-raids-in-california"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…This is something that President Trump said.\n\nThis is from the story:\n\nPresident Donald Trump said that he thought California       Governor Gavin Newsom should be arrested, a claim that Newsom       described as an unmistakable step toward authoritarianism.\n\nI concur with what he said about the step, but I would simply say  this: I think we are already…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…three resolutions that demand the reinstatement of every  veteran who has been fired and betrayed by Donald Trump. If Republicans  actually care about our heroes, like they claim to when they are on the  campaign trail, then they will vote with us Democrats and help give our  veterans their Federal jobs back. Otherwise, they are making it clear  that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…U.S.  Steel, MP Materials, Lithium Americas, and Trilogy Metals to hand over  stock to the U.S. Government. These are capitalist companies who are  doing business that they claim this government supports. Trump is also  considering forcing Lockheed Martin to do the same.\n\nWhy are my colleagues, who are so quick to tout their capitalist  leans, silent…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…dual power       system that continues to divide Libya to this day.\n\nSporadic clashes also persist, sometimes among internal       factions of the two major governments that claim legitimate       authority in Libya, such as occurred between military and       militia units in Tripoli in May. Without a mutually agreed       framework for Libya's unification…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Chair, I claim the time in opposition to the amendment,  though I am not opposed to it.\n\nMr. BELL. Mr. Chair, we must continue to stand with our Baltic allies  who remain on the front lines…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…rely on Medicaid for their healthcare, and the MAGA  majority wants to strip away their healthcare.\n\nIf any of my colleagues vote for this, they have forfeited the right  to claim they are pro-life ever again. It is not pro-life to take away  a newborn baby's healthcare. It is not pro-life to take away healthcare  from 65,000 children in my district.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…doubts. A Department of Homeland Security spokesperson declared for  the first time--now, I want to make sure I get this right, so I am  going to quote:\n\nIllegal aliens who claim to be recipients of DACA are not       automatically protected from deportations.\n\nShe went on to say that DACA recipients should now self-deport from  the United States. Think…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…information, the court often has no ability to offer relief  to that taxpayer. Cases can be dismissed before the merits are even  heard, putting taxpayers at risk for losing their claim when they are  not at fault for missing the deadline. That is not a just result. This  bill ensures the court can make determinations based on the substance  of claims, not…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…they didn't release it. They had 4 years. They could have released  it all. They didn't choose to do it, and now my colleagues on the other  side of the aisle somehow want to claim that it is a conspiracy by  Trump to hide information that was in the hands of their party's  President and their party's Department of Justice. It was in their  hands, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…understanding that       forgoing further consideration of this measure does not in       any way alter the Committee's jurisdiction or waive any       future jurisdictional claim over these provisions or their       subject matter. We also reserve the right to seek appointment       of an appropriate number of conferees in the event of a       conference…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Mr. Speaker, I thank my colleague, Representative  Crank, for yielding.\n\nMr. Speaker, I rise in support of H.R. 2916, my bill to ratify the  land claim settlement agreement between the Saint Regis Mohawk Tribe,  the Mohawk Council of Akwesasne, New York State, Franklin and St.  Lawrence Counties, the towns of Fort Covington…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…ensure the industry is kept  safe from such reckless attacks in the future.\n\nSome argue that LNG exports raise energy prices for Americans by  reducing domestic supply. This claim is simply false. Increased export  opportunities incentivize production and drive efficiency gains, which  will help domestic prices continue to be affordable.\n\nGiven the abundance…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697092/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…month  last year under Joe Biden.\n\nIt is noteworthy, Mr. Speaker, that the only thing the President  needed to accomplish this was leadership. We heard the last  administration claim time and time again that Congress would need to  pass legislation to secure the border. We heard a blank check would end  the unprecedented illegal immigration happening at…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…annual adjustment for inflation.  Without our legislation, the standard deduction would have dropped to  $8,300 next year. This means that the 12 million Texas families who  claim the standard deduction each year would have had to pay an  additional $7,450 in taxes next spring without that legislation having  passed. The lower rates from the Tax Cuts…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of liberty.\n\nEven President Trump didn't try to argue that this law called IEEPA,  which is normally used for sanctions--he didn't act upon it in his  first term. He makes a claim today, though, likely because the  appropriate trade laws on the books require months to be implemented,  and he can't wait. And the Republicans go along, and they say:  Emergency?…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…problem: nearly 12       million enrollees, or 35 percent of all exchange enrollees in       2024, do not use their benefits at all. For these enrollees,       known as zero-claim enrollees, health coverage did not       translate to health care. Many zero-claim enrollees are known       as ``phantoms''--people who are enrolled but not practically…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…a strategic  plan based on this assessment.\n\nUnfortunately, this bill seems to be a little too late. The  administration is already bombing boats in the Caribbean that they  claim to be Tren de Aragua. I hope they have already done an assessment  and have a plan. They certainly have not shared anything with Congress  to that effect.\n\nMr. Speaker, it…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…United States Code, which arise in a       foreign country in connection with U.S. Customs and Border       Protection operations in such country.\n\n``(ii) Submission deadline.--A claim may be allowed under       clause (i) only if such claim is presented not later than two       years after the date of the incident that gives rise to such       claim.\n\n``(iii)…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…bill at a later date, freeing up resources to instead  help replace the items that they have lost. For the average taxpayer  who requests a filing extension, the deadline to claim a tax refund or  credit for that tax year is also extended; not so for the victims of  natural disasters. They do not receive the same amount of additional  time to claim a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…attractive.\n\nOf course, the Democrat leader has made an attempt to attack  Republicans' measure and defend his party's historic obstruction, and  one thing he is fixated on is his claim that Democrats' historic  obstruction is justified because President Trump has put forward  ``historically bad'' nominees. But I would just like to ask, if these  nominees…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "John Thune", "party": "Republican", "sentence": "…see--from 2021, when they made this change to take the lid  off of income and to create zero-dollar premiums and then to see this  explode--the number of people who didn't file a claim tripled in the  last 4 years. What does that suggest? I would argue it suggests there  are a lot of people out there who have no idea they are even covered.  They have no idea…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "French Hill", "party": "Republican", "sentence": "…use can at any time yield.\n\n``Of all the dispositions and habits which lead to political  prosperity, religion and morality are indispensable supports. In vain  would that man claim the tribute of patriotism who should labor to  subvert these great pillars of human happiness, these firmest props of  the duties of men and citizens. The mere politician,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}]