[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…That is why I rise  today in support of this resolution.\n\nI rise because no President can unilaterally decide to use our  military to target or kill anyone that they simply claim to be a  threat.\n\nI rise because if we do not hold this President accountable, we  abdicate our responsibility to be a voice for the American people and  instead embolden Trump…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…explicit things. Tell me what the so-called leftwing has done. They  speak in these broad, general terms about people without giving the  explicit evidence of the thing that they claim that they have done.  Speak with specificities. Have the courage to speak with specificities.  They don't have the courage to speak with specificities. They just want  to use…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…reviews claims for two       disability programs was on life support following massive       pandemic turnover--and still takes 233 days on average to       review an initial claim.\n\nBut current and former officials, advocates and others who       interact with the agency--many of whom spoke on the condition       of anonymity for fear of retribution--said…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…trying to undermine its  credibility.\n\nRather than debate the facts or the evidence, which he knows he would  lose, isn't it just a lot easier to simply shoot the messenger and  claim that everything bad about you is just fake news?\n\nMr. Speaker, while many, rightly, have been focusing on the arbitrary  and devastating cuts to essential Federal programs…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…recovery.\n\nIf Republicans really support these programs, my colleagues should be  opposing the President's budget, which lays out plans to cut the very  programs Republican Members claim to care about. In fact, the Trump  administration budget goes further and proposes eliminating nearly all  of the SUPPORT for Patients and Communities Reauthorization Act of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…camps in the countryside.\n\nFor 75 years, the National Science Foundation has kept the U.S. at  the forefront of science and has made us the envy of the world.\n\nThe NSF can claim 268 Nobel Prize winners. Yet now we have a  President and an administration that is antiscience and antiprogress.\n\nJust as we have made investments in projects that are pivotal…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…people, having less services,  and charging larger interest rates. I am not on the side of big banks.  I am on the side of the people.\n\nLet me continue. The Republicans may claim this resolution also  prevents the OCC from updating its merger review procedures in the  future. Why would they want to do that with just one banking agency?  Perhaps they…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…harm. We have seen 5-year-olds come home from school only to  be detained and then sent to Dilley, Texas, then be returned and see  the administration try to end their asylum claim. This is what people  are experiencing across the country. We need everyone to speak out  against it, not just in Minnesota, not just in New Jersey, and not just  Democrats…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700054/safety-in-america"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Chair, I claim the time in opposition to the amendment,  though I am not opposed to it.\n\nMr. BELL. Mr. Chair, we must continue to stand with our Baltic allies  who remain on the front lines…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Act.  I believe this misguided legislation will have devastating impacts on  our financial stability, national security, and investor protection.\n\nWhile my Republican friends claim that this bill will regulate crypto  market structure, in reality, it eviscerates the longstanding history  of investor protections that have made our markets the envy of the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693784/digital-asset-market-clarity-act-of-2025"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…health insurance.  This is the largest healthcare cut ever.\n\nMr. Speaker, 42 million Americans are at risk of losing food  assistance. Children will go hungry.\n\nRepublicans claim to be the party of faith, patriotism, and families.  A ``yes'' vote supports none of these virtues.\n\nThis is shameful. I am a hell no.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693181/one-big-beautiful-bill-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…only when a judge determines it is appropriate. This bill is an  undemocratic attack on D.C., its residents, and is also just bad  policy.\n\nNow, Republicans in the majority claim D.C.'s policies are too soft,  but we know that the sponsor of this bill is also from Florida, which  has allowed judges to waive mandatory minimums for decades.\n\nFlorida even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…grass seed growers estimate that about half of their exports-- nearly $200 million in sales--are being canceled, thanks to the global  tariffs.\n\nDonald Trump and his advisers claim there is nothing to worry about.  They say the economists and the pundits are overreacting, and  everything is going according to plan. Secretary Bessent is on cable  news…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…office, let  alone serve in the Senate, I came to this building, but I came as a  faith leader. I came with other faith leaders across various  religious traditions and people who claim no particular faith tradition  but people of moral courage. And we gathered in the Rotunda, and they  were discussing, back then another reconciliation bill. And, once  again,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…should be expanding them in the wake of the Honoring our PACT Act.\n\nVeterans exposed to toxic substances deserve swift justice. Right  now, the average time for processing a claim is 165 days. Over 2.3  million claims have been submitted, and more than 6,000 of those  veterans are right in my district, Indiana's First Congressional  District. That number…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692946/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…together for the purpose of planning attacks against  American civilians, our troops, or our friends abroad, to have the  authority necessary to take action.\n\nThe Democrats claim: Oh, there is a carve-out in our resolution. Oh,  we have a saving clause. We have a rule of construction that says our  troops can defend themselves.\n\nOnce again, they are…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…This is a bipartisan issue. It is a bipartisan bill, and it had a  bipartisan process from the very beginning. And if Democrats were  interested in further changes, as they claim, they would have had the  chance to make those changes on the floor. All they had to do was vote  for cloture.\n\nNot every bill that comes to the floor is a final bill. Now,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690892/genius-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…years, Democrats sold a bill of  goods to working-class Americans while they turned a blind eye as their  factories closed and their jobs were shipped overseas.\n\nToday, Democrats claim to be the party of working families, and we  know that is not the case. Yet, it is President Trump, over the  Democrats' loud objections, who is fighting for fair trade deals…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…half of Americans--more than half-- are concerned about noncitizens voting and more than half fear  electoral fraud.\n\nThe bottom line is we cannot stand in this Chamber and claim there is  not a problem. There is a problem, and the people who put us here  agree.\n\nColleagues, we have a duty to root out the source of this distrust  and restore the integrity…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…latest in a long chain of violations of Iran's  nuclear commitments. These actions confirmed what we have known all  along: The Iran nuclear program is not civilian, as they claim; it is  the pursuit of a bomb to destroy Israel and threaten U.S. national  security interests in the region.\n\nThe international community must not tolerate this activity any…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…``Big Ugly Bill'' and claiming that somehow  it benefits only a fraction of the American people at the top 1 percent  and accusing us of fiscal irresponsibility, while they claim that  somehow the most vulnerable among us have become even more vulnerable.  None of these accusations are true.\n\nOf course, again, our Democratic colleagues could have worked…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…don't want to protect us from that  either.\n\nIn fact, yesterday, after we had a classified briefing, the gentleman  on my left, the ranking member, went directly to the press to claim  that these strikes were not protecting America. He literally said that  these strikes were not stopping drugs. Everything that he said is very  easy for me to prove wrong.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Extension Act of  2025.\n\nThis bill extends the application period for the Alaska Native  Vietnam era veterans land allotment program by 5 years, ensuring that  eligible veterans can claim the land that they were promised.\n\nFor decades, thousands of Alaska Native veterans who served in  Vietnam were unfairly denied the ability to apply for land allotments  due…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693425/land-conveyances-for-alaska-native-vietnam-veterans"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…they didn't release it. They had 4 years. They could have released  it all. They didn't choose to do it, and now my colleagues on the other  side of the aisle somehow want to claim that it is a conspiracy by  Trump to hide information that was in the hands of their party's  President and their party's Department of Justice. It was in their  hands, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Further, in regard to the various things that my colleague said, I  have seen it before where the EPA goes out and they create a maximum  achievable control technology and they claim, oh, it is out there or it  will be soon, and industry tells me it doesn't exist.\n\nNow, in this case, it does exist. It is just very expensive and it  would take longer than…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…bill at a later date, freeing up resources to instead  help replace the items that they have lost. For the average taxpayer  who requests a filing extension, the deadline to claim a tax refund or  credit for that tax year is also extended; not so for the victims of  natural disasters. They do not receive the same amount of additional  time to claim a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…landmark legislation, passed by House Republicans last July,  delivers meaningful tax relief to working Americans by expanding the  child tax credit, allowing nonitemizers to claim charitable deductions,  eliminating taxes on tips and overtime, and more.\n\nAs much as my colleagues on the other side have tried to spin this  resolution as a tax giveaway…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…We will fight our country's battles      In the air, on land, and sea;      First to fight for right and freedom      And to keep our honor clean;      We are proud to claim the title Of      United States Marine.\n\nOur Marine Corps men and women--both our veterans and those in active  service--deserve our eternal gratitude for the battles they…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…no way diminish or       alter the jurisdiction of the Committee on Armed Services       with respect to the appointment of conferees, or to any       future jurisdictional claim over the subject matters       contained in the bill or similar bills.\n\nI would appreciate your response to this letter confirming       this understanding, and would request…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…They actually have one reactor in Iran. The fuel for that reactor  comes from Russia. They haven't taken 1 gram of their enrichment  program to run the peaceful reactor they claim they want. To run a  reactor, you need to enrich between 3\\1/2\\ and 5 percent, not 60.  Weapons-grade enrichment is 90 percent; 60 to 90 is like walking across  the street.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}]