[{"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…news outlets like  the New York Times and the Washington Post.\n\nMatt's commitment to learning led him to be an active and consistent  participant in the many communications classes offered in the House-- even serving as an instructor from time to time. He routinely briefed  his Democratic press colleagues on the many Judiciary Committee bills  that came…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…in, we had a  great researcher. This man had a great engineering degree, and we would  do the STEM education. He would tell the students that he didn't always  pass his math classes the first round, but he had the surrounding  cushion to help him go back for a second round.\n\nThat is what it is all about in America. If you want to be an  engineer or if…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…school serves all students grades K-8 with free breakfast and  lunch. They place a strong emphasis on core subjects, notably English  and math, foreign languages, enrichment classes, ELL, special ed  services, music, arts, after-school, and athletics.\n\nAmani honored four outstanding individuals at their recent gala: John  Howard, Stephanie McCaine, Charles…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Thanksgiving, her senior year in high school, Cindy  started chemotherapy. Each session lasted 3\\1/2\\ hours, and she had to  do them every other week for 6 months. She went to classes as much as  she could, took the SAT, and continued her plans to go to college. She  went to her senior prom, even though it was just 2 days after her  chemotherapy.\n\nBut now…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Dean of the Minnesota Congressional Delegation, issued the       following statement on Wednesday after a gunman opened fire       on a mass service during the first week of classes at       Annunciation Catholic School, killing two children and       wounding 17 others.\n\n``The horrific violence this morning at Annunciation       Catholic Church in Minneapolis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694811/mourning-the-tragic-shooting-at-annunciation-catholic-church-in-minneapolis-minnesota"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…serves hundreds of seniors annually  with a daily nutrition program at lunchtime 5 days a week and  activities and programs to engage seniors of all ages.\n\nThere are fitness classes daily, from tai chi and dance to chair yoga  and mental fitness programs; my favorite, sports trivia; and a variety  of board games, mah-jongg, bridge, Rummikub, along with…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…of Chabad Southwest Las Vegas will serve as a  hub for worship, education, and fellowship. It will house weekly prayer  services, holiday programs, adult and child education classes, Mommy &  Me programs, women's groups, after-school enrichment, and a wide  variety of cultural and social gatherings. This expansion will allow  Chabad Southwest Las Vegas…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695341/recognizing-the-groundbreaking-of-chabad-southwest-las-vegas"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…career prospects and  other opportunities. It sets them back for a lifetime, potentially. We  saw the impact of the homework gap during COVID, when students were  forced to take classes and exams from the parking lots of McDonald's.  Literally, some of us saw students in those so-called hotspots, away  from their homes, because it was the only way they could…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…Christianity, a crime punishable by death under the  brutal Islamic regime.\n\nArtemis converted to Christianity in secret through a network of  underground churches and online classes in Iran. Last December, she set  out for the United States in search of a new life. In a haunting image,  she was photographed from inside her detention room in Panama with…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…expect  greatness. But your poems were exceptional. I literally texted Senator  Britt in agony.\n\nI was like, how do we decide on which poems to choose, because in  past page classes--I hope they are listening out there in the world.  They are just so top class. So it was very difficult.\n\nKatie and I went back and forth. We did a lot of consternation,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…course, I remember growing up and going to grammar school, and I  looked forward to milk. We had milk breaks, and it made a difference to  pay attention in those afternoon classes and to be active in your  sports activities right after that.\n\nThe second reason is that the dairy farming industry is not so much  an industry as it is a way of life, and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…many students employed at local auto shops,  dealerships, or starting their own businesses. In the last 3 years,  100% of students enrolled in Joseph's automotive technology classes  have graduated, and 85% of them have done so after earning one or more  industry certifications. Thank you Joseph for doing this work to  inspire the next generation of skilled…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Trump's big, beautiful bill, again. The first version  didn't cut enough from critical programs like Medicaid and SNAP. This  budget is a direct attack on the working and middle classes, all while  handing more than $7 trillion in tax breaks to billionaires.\n\nOver 196,000 residents in my district are at risk of losing Medicaid  coverage, including 73,000…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690060/republicans-budget-plan-passage"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…But the Gaspee affair, which shook the colonies and rattled       the crown, has been largely forgotten outside of Rhode       Island. It's been overlooked in U.S. history classes and       remains little studied by historians of the American       Revolution. The Washington Post reviewed six high school and       college U.S. history textbooks and…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I congratulate the 457 graduates of  Briar Woods High School class of 2025.\n\nIn their time as Falcons, they have put time and effort into classes,  sports activities, and clubs while building lifelong friendships.\n\nThey have excelled in a wide range of fields this year. The football  team went to the State championship.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…for\n\nmembers of deck departments\n\n`` `(a) In General.--The Secretary may issue a merchant       mariner credential, to members of the deck department in the       following classes:\n\n`` `(1) Able Seaman-Unlimited.\n\n`` `(2) Able Seaman-Limited.\n\n`` `(3) Able Seaman-Special.\n\n`` `(4) Able Seaman-Offshore Supply Vessels.\n\n`` `(5) Able Seaman-Sail.\n\n`` `(6)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…carelessness of a bloated  government. Every dollar comes from working American families  struggling to pay both their bills and their taxes.\n\nNow, this waste is enabled by two classes of expenditures that we  should foreswear forever. One is grants, cash handouts to political  favorites with little accountability or oversight, whether directly or  through…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692548/rescissions-act-of-2025"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…proudly shared, saying, ``Dad drives the big truck  downtown.''\n\nIn addition to his many years with the Fort Worth Fire Department, he  has spent nearly two decades instructing classes at the Fire Academy at  Tarrant County College. As an instructor for both new recruits and  continuing certification courses for commissioned firefighters, his  positive impact…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Matter, a group opposed to the nuclear  family.\n\nWe know that many of the feminists in the sixties, I think Kate  Millett, who was described as the mother of women's studies classes,  which are all over our universities, were outright opposed to the  nuclear family.\n\nIt is disappointing they are not doing more in this budget to address  that problem,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Foundation, which donates homes and cars to wounded veterans. A devoted  man of faith, he attends the Stonebriar Community Church in Frisco,  where he has led Bible study classes for over 33 years. I am proud of  the work Corbett has accomplished, and I wish him continued success for  many years to come.\n\nIt is an honor to bestow Corbett with the Patriot…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Cash assistance alone does not end dependence. It often  merely just manages it. Pregnancy resource centers offer the best hope  of achieving this goal by providing parenting classes and life skills  training to help that mother move from a crisis to self-sufficiency.\n\nPregnancy centers are the backbone of community-based support. The  impact of their…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reach in and take some of your  retirement? This is no longer about your grandkids. It is no longer  about your kids. It is you, Mr. Speaker.\n\nYet, I believe the political classes lied their backsides off for so  long, or we play this game. You will see some people on social media:  You could save a million dollars doing this.\n\nOkay. You borrow $250…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…part-time officer.\n\nOver her 30 years, Officer VanLeeuwe has had a huge impact throughout  her community and especially loved the work she did in the schools. She  taught antidrug classes to hundreds of students and served for 19 years  as the Marshall School resource officer.\n\nMr. Speaker, I thank Sara for her courage, compassion, and service. I  know Marshall…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693572/congratulating-joe-jensen"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…helping student athletes build  confidence, discipline, and independence both on and off the court.  These athletes balance the same rigorous demands as all EWU varsity  players--classes, practices, study sessions, travel, and competition-- all while setting a powerful example of determination and excellence.\n\nThey continue to raise the bar for what collegiate…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…everything she does. NAMI is grounded in the  power of lived experience, and Joanne embodies that mission  wholeheartedly. For eight years, Joanne has taught Family-to-Family  classes and led Family Support Groups, offering encouragement and  understanding to others walking a similar path. She is also a certified  instructor for Mental Health First Aid…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…liberal projects.  Let's look at some of them. One of those pet projects included net-zero  cities in Mexico. Another cut out electric buses in Africa and  taxpayer-funded classes on ``environmental racism.''\n\nAdditionally, Republicans created a $50 billion rural hospital fund.  It is the single largest Federal investment in rural healthcare in  American…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…nominee, or named executive officer       of the issuer, or who is the beneficial owner of securities       with 5 percent or more of the total combined voting power of       all classes of securities entitled to vote in the election of       directors--\n\n``(A) the number of shares of all classes of securities       entitled to vote in the election of directors…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…degree by building a career in  data processing, eventually retiring as the information systems manager  for the Kansas Farm Bureau while also teaching information systems  classes at Kansas State University and at Fort Riley.\n\nJim's life of service continued well after his time in the military.  His dedication to his faith and his community showed itself…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…left  at that time, made it clear that a goal of theirs was to get rid of the  nuclear family.\n\nHere is Kate Millett, who has been described as the mother of women's  studies classes which dot our universities around the country: ``The  complete destruction of traditional marriage and the nuclear family is  the `revolutionary or utopian' goal of feminism.''…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…shut down the government  until you put that back in.\n\nWe found $500,000 of American taxpayer money for electric buses in  Rwanda.\n\nWe found $3.6 million for pastry cooking classes and dance focus  groups for male prostitutes in Haiti. I kid you not. I am not making  this up. It was in the budget under President Biden. We took it out.\n\nCongresswoman…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}]