[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Environment  and Public Works Committees. Most of the time, I have focused on the  many red flags raised by outrageous behavior of top DOJ and EPA  officials in their attempts to claw back nearly $20 billion in grant  funds that were awarded in April 2024 and fully dispersed into private  bank accounts by August. After terrorizing grantees with false  allegations…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…CHIPS and Science Act, is already  helping to turn the tide.\n\nI am concerned that actions by the Trump administration are putting  this great success at risk. The attempts to claw back these historic  investments in our manufacturing sector, unstable and erratic tariff  policies, and mass elimination of trusted Federal programs and partners  put American…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…million bailout for coal plants to keep them online.\n\nIn October, while shutting down the government to deny Americans  access to affordable healthcare, the White House tried to claw back  billions in clean energy funds.\n\nThese actions are costly, and American families deserve better. We  should be working together to solve problems and not wasting time…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…is  unconscionable. It is unacceptable.\n\nMany of us are clear: The Department of Homeland Security is the  greatest threat to the homeland right now, and that is why we must claw  back funding for DHS and ICE. It is why we must pass my Melt ICE Act  and end DHS detention and monitoring, disrupt immigration enforcement,  and return taxpayer dollars back…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…is--that  a deal is a deal; that we not write it, agree to it, celebrate  reopening the government, and then have President Trump on day two  start to fire a whole lot of people or claw back more money from the  Virginia Department of Health or cancel more economic development  projects in Virginia. Let's just say a deal is a deal. Congress will  live by our…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Speaker, Republicans are trying yet again to write a  blank check for ICE while American families struggle to afford the  basics.\n\nIf we defeat the previous question, we can claw back the $75 billion  in the ICE slush fund that Trump and Republicans established with their  big, ugly law and redirect that money to where it belongs: lowering  healthcare…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…utilize federal funds awarded to repair roads and  infrastructure damaged by disasters.\n\nCurrent U.S. Department of Transportation regulations allow the  federal government to claw back ``emergency relief'' funding for  highway projects if those projects do not reach construction within 2  fiscal years. The ``Transportation Emergency Relief Extension Act''…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694581/introduction-of-the-transportation-emergency-relief-extension-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…bipartisanship.  We should be bipartisan. That is why, in this Congress, I introduced an  AUMF repeal bill with Representative Roy. That is why this week, I co- led a bill to claw back tariff powers from the executive with  Representative Bacon. That is why I did many bipartisan bills with  Representative McCaul in the Foreign Affairs Committee.\n\nMr.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689861/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Related Programs  Subcommittee.\n\nMs. LOIS FRANKEL of Florida. Mr. Speaker, I rise today in fierce  opposition to the Republicans' reckless rescission bill, a backdoor  scheme to claw back critical Federal funding that protects America's  global leadership, public safeguards, and trusted public broadcasting,  all while bypassing congressional constitutional…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…thing for my colleague on the other side of the aisle and add a  little bit more color or correct the truth with the other half of the  truth. That is, yes, Trump is trying to claw back some money for the  infrastructure of building these charging stations. Why is that?\n\nIt is because the Biden administration gave them approximately $1  billion to build…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…includes the work of the House Committee on Energy and  Commerce, to unleash American energy, promote innovation, and protect  healthcare for the most vulnerable Americans.\n\nWe claw back wasteful and unnecessary spending. We unleash affordable  and reliable American energy. We support technological innovation by  reauthorizing the spectrum auction authority.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…welfare programs in  Minnesota. Congress didn't discover this theft; a member of the public  did. How did Congress respond? Did Congress open an investigation? Did  Congress claw back the money from Minnesota? No. Congress simply  decided to give another $5 billion in refugee welfare.\n\nMy amendment says: Stop. No more welfare for refugees until there…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699441/consolidated-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…judgment of consumers with that of politicians, distorting the flow of  capital from its highest and best use.\n\nAs we express our outrage at this waste and take this first step to  claw it back, let us remember that Congress approved all of it, and it  is time that we repented before we bankrupt our country.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692548/rescissions-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…showerhead to  use. They need the government to get out of the way so they can afford  the necessities and have money to spend on other things in their lives.  This bill will claw back ridiculous Biden-era red tape and put American  families first.\n\nLastly, I am working alongside my fellow Republicans to pass full- year funding for several critical programs.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…made an  assumption that this year, if the Senate were to pass these, that there  will be a delayed sign-up, so there will be half a year or so where  people--but if they did a claw back, the actual number on these  subsidies is about $105 billion.\n\nOkay. Even if you do the CBO's number of $80 billion for 3 years of  subsidies on top of subsidies, and then…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the pearl-clutching here in Washington, our allies  simultaneously decapitated Hezbollah and crippled Hamas. Their bold  operations created a new opportunity for Lebanon to claw back its  sovereignty from a terrorist state within a state.\n\nMeanwhile, the collapse of the brutal Assad regime in Syria brought  down a Russian vassal and Iran's favorite…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Angeles, where it was made very clear that this project is a failure.  In fact, there is now an investigation that has been launched by the  Department of Transportation to claw back billions of dollars that have  been granted.\n\nI have also asked for an investigation by FBI Director Kash Patel to  figure out how it is exactly that they have already…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…about some of the consequences of the Biden-Harris  administration's irresponsible actions over the past 4 years and how  Congress and the Trump administration are working to claw our way back  to sanity for the United States of America.\n\nWe have lived through the most devastating border crisis in modern  American history. Let's be honest. It wasn't a…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, this week, the House will  vote on the first DOGE rescissions package that will claw back nearly  $10 billion in wasteful spending. The American public expects their  government to be good stewards of taxpayer dollars and to use their  taxpayer dollars for programs…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…way that these funds are used to help the American people.\n\nThis is why I am proud to support the rescissions package sent to  Congress by President Trump. This package will claw back $9.4 billion  of wasteful government spending, including $8.3 billion allocated to  dozens of wasteful programs at USAID and $1.1 billion to prop up the  Corporation for…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}]