[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to pay their utility bills. Now Republicans and the Trump  administration are making it worse. They have passed the big, ugly bill  to rip away savings and rebates for cleaner, cheaper energy a few  months ago and energy efficiency that keeps bills lower, all to pay for  tax breaks for the wealthy and the well-connected.\n\nNow they want to ramp up gas…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…produce more oil and gas.\n\nHere is the connection to higher bills. While they want to pad the  profits of oil and gas companies, what they are doing to sabotage jobs  and cleaner, cheaper energy now is showing up in people's electric  bills, and they are angry.\n\nI was with neighbors a couple of weeks ago who were burning their  electric bills because costs…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…percent in North  Carolina.\n\nWe mentioned that the big, ugly bill will raise electricity prices by  a staggering 61 percent over the next decade due to its attacks on  cleaner and cheaper energy and its crippling of the American clean  energy industry.\n\nThe big, ugly bill destroyed tax credits that were designed to  incentivize developers to build more…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…wallet. Rather than help,  Republicans have only made things worse. They have gone along with  arbitrary tariffs that have raised the cost of living and taken a  hatchet to cleaner, cheaper energy. They have gone along with illegally  halting energy projects. They ended tax cuts and rebates that helped  people afford their electric bills in order to pay for…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…administration has done to serve the fossil fuel industry,  the dirty fuel industry, from canceling clean energy projects that  would help lower electric bills that would bring cleaner and cheaper  resources onto the grid, projects like offshore wind that is fully  permitted and ready to go and provide resources we can rely on during  winter storms.\n\nThis administration…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…bring a package of bills and say: Oh,  we are really concerned. They are not concerned. Rates are going up.  They are canceling projects. They are throwing wrenches into cleaner,  cheaper energy. This is really a giveaway to the fossil fuel companies.  What other explanation can there be to sock it to hardworking people  who need a break?\n\nThey need a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…That is particularly shameful when we consider coal consumption has  declined by nearly two-thirds since its peak in 2007. Instead of  celebrating the newer sources of cleaner and cheaper energy,  Republicans are frantically trying to turn back the clock and ignore  Americans' pleas for real and meaningful help in the process.\n\nMr. Speaker, I urge opposition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…trend has been in a good direction.  Coal plant-caused death rates have decreased in the last 15 years as  more and more coal plants have either shut down in favor of cleaner and  cheaper energy sources or--often in answer to Clean Air Act programs-- adopted broadly available pollution reduction technologies which  significantly reduce but do not eliminate…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that the case? First of all, the big, ugly bill that  Republicans passed in July to provide tax breaks to the wealthy and  well-connected took away tax credits to keep cleaner, cheaper energy  producing across America. They ripped away rebates for households to  help them afford the cost of upgrading their homes, making their lives  more energy efficient.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…working families with higher  costs.\n\nMr. Chair, this spending bill adds insult to injury by slashing home  improvement weatherization savings and taking a hatchet to cleaner,  cheaper energy and the important initiatives to modernize the grid.\n\nIf my colleagues care about helping their neighbors out of the  affordability squeeze, they will vote ``no''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…better than they are getting here.\n\nThis bill, H.R. 3628, amends the Public Utility Regulatory Policies  Act to four States to favor more expensive, dirty energy over cleaner,  cheaper energy. It is a ridiculous requirement that they want to add,  and it directly conflicts with the provisions in the law right now that  require States to maintain a diverse…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…well.\n\nThis bill is a good example. You can peer into Congress and say,  okay, who is fighting for me. This GRID Power Act is unnecessary. What  has been happening is that cleaner, cheaper sources of energy are  waiting to come onto the grid, and the Trump administration and  Republicans in Congress now are throwing up as many barriers as  possible because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}]