[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Pete's hard work, determination, and perseverance at  Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Pete Rapa on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689458/recognizing-pete-rapa"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in the Caribbean--there is sure to be a show of force,  maybe subject to attack even by Venezuela, poorly armed country that it  is.\n\nSo I would say that if we are thinking clearly about this, we would  think long and hard before we engaged in any conflict with Venezuela.  That is what article I, section 8 is about. The American people, before  being…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Ranking Member Pallone and others have explained how these  resolutions go far beyond what is legally allowable under the  Congressional Review Act and how the Clean Air Act clearly authorized  California to pursue and be granted these waivers as has been the case  many, many times over the past 50 years.\n\nNow, I understand that many Republicans in Congress…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690480/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Devonte's hard work, determination, and perseverance  at Oberon Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Devonte Bonggas-Ellenburg on achieving  the Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691185/recognizing-devonte-bonggas-ellenburg"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…even ask for ID before they were gun-faced and then  handcuffed and taken away. The bottom line is that these men were taken  into custody simply because they were Latino.\n\nClearly, these tactics are unconstitutional. The use of race as the  basis for grabbing people on the street the courts have long ago ruled  are across the line and illegal.\n\nThese…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…know  that they will be presented to the House this month.\n\nThe President is unfit to hold the office that he has. The things  that he says and the things that he has done are clearly indicative of  an authoritarian presidency.\n\nMr. Speaker, I have been censured by this House for the things that I  have done. I was in here, and I called to the attention…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…that will guide them for the rest of their lives. This award  is a testament to Perla's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Perla Lopez on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690318/recognizing-perla-lopez"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Republican  lawmakers in Ohio announced they would do everything in their power to  prevent our laws from being removed.\n\nThat is right. Just days after the people spoke loudly and clearly,  some legislators pledged to ignore the will of the voters, and now they  are following through. Just last week, members of the Ohio House of  Representatives introduced…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Eamon's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Eamon VanDyke on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691744/recognizing-eamon-vandyke"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…noncitizens who engage in terrorism or are involved with terrorist  organizations from entering the United States. For any of those  noncitizens who happen to be here, our laws clearly allow us to remove  them and prevent them from obtaining any immigration benefits.\n\nThese laws were designed to apply broadly to any individual or  organization engaged in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…complex decisions, and  you want robust analysis. You want an independent FERC fully staffed  with experts to make these decisions in partnership with local grid  operators, clearly, because FERC already has the authority to do a lot  of this as long as it is supported by evidence.\n\nThis Republican bill says: Forget the evidence. We are just going to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Tommy's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Tommy Seiler on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691920/recognizing-tommy-seiler"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Amelia's hard work, determination, and perseverance  at Warren Tech North and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Amelia Brown on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691860/recognizing-amelia-brown"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…anniversary of Citizens United v.  Federal Election Commission. It was a 5-4 ruling. This decision  overturned longstanding precedent that we had in this country, where we  had clearly established limits on independent political spending by  corporations and billionaires, and it was working.\n\nFor many years, political spending had essentially flattened out.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Lucas's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Lucas Steiskal on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1692004/recognizing-lucas-steiskal"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…and was obviously very, very smart. She also  was a patriot who loved this country, and she served as vice president  of the College Republicans at Brown University. She was clearly a very  courageous young lady, and I can't imagine that was an easy job on such  a liberal campus as Brown. But Ella was resolute in her mission to  speak the truth and to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…President Trump's life. Yet this threat information wasn't  shared with Secret Service personnel or local law enforcement  officials--all responsible for securing that event. Clearly, had all  Federal, State, and local law enforcement officials known of this  threat, it would have changed how they secured the AGR building where  the sniper opened fire…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…highly enriched uranium at 60 percent.  Is there a commercial purpose for uranium enriched at 60 percent? No.  In 2025, 3 years later, they have 900 pounds of this stuff. So,  clearly, they are not stopping their enrichment program; they are  accelerating it, and they are enriching it at a level that has no  commercial purpose.\n\nThey actually have one reactor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…misconduct, to disgrace or injure the professional standing       of an individual, or otherwise to expose an individual to       public contempt or obloquy, or will represent a clearly       unwarranted invasion of privacy of an individual;\n\n(4) will disclose the identity of any informer or law       enforcement agent or will disclose any information relating…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…December 31, it reverted back to the Affordable Care Act, which  they have championed, what they passed, not Republicans, Democrats.\n\nMr. Speaker, the healthcare crisis is clearly created by the  Democrats.\n\nWe have highlighted the fraud and waste within the exchanges. More  than half of the people on the exchanges did not even file one medical  claim…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…myself such time as I may consume.\n\nMr. Chair, this isn't a hollow exercise. This is our opportunity to  say these programs are important to us. Article I of the Constitution  clearly gives us legislative authority: All legislative authority will  vest in the Congress of the United States.\n\nWe authorize these programs. I don't think the answer is to say…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…misconduct, to disgrace or injure the professional standing       of an individual, or otherwise to expose an individual to       public contempt or obloquy, or will represent a clearly       unwarranted invasion of the privacy of an individual;\n\n(d) will disclose the identity of any informer or law       enforcement agent or will disclose any information…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…across the country. Republicans in Congress are finishing the wall,  hiring more border agents, and investing in Immigration and Customs  Enforcement. The drug cartels are clearly on notice: The border is  closed, and America is once again protecting our citizens.\n\nToday, our communities are safer, and the economic turnaround has  been equally dramatic.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Russia. Putin has made his unwillingness to end  this unprovoked and barbaric war as plain as day. He has shown no  remorse that his country is nearing 1 million casualties. He clearly  doesn't care about the Russian people, who have been sacrificed to his  fantasy of an empire restored, and his tolerance for casualties appears  without limit.\n\nIn fact,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…pressure and uncertainty, he played a critical role in coordinating  local response efforts and guiding recovery planning. His ability to  bring people together, communicate clearly, and keep the public  informed helped Avery County navigate hardship with resilience and  unity.\n\nPhillip's service has been widely recognized for his leadership and  impact.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "James Risch", "party": "Republican", "sentence": "…something that isn't happening, I asked the President of  the United States to confirm that it is not happening. Obviously, they  responded--the administration responded and said clearly that there are  no hostilities and no troops in Venezuela.\n\nI sent a letter to the President, and the response confirmed that the  operation has ended, that it is over, that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. I have been very critical of government performance in  our State, with giving taxpayers the services that they are paying for.  This latest example makes that point very clearly.\n\nFor the last 6 or so years, Californians have been paying an extra  fee on their phone service. This was due to legislation enacted by the  legislature and signed into law…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…businesses and       consumers understand the implications of this proposal to       enable them to provide comprehensive feedback on its impact.\n\nFurther, it is important to clearly delineate the extent of       the rulemaking's scope. In its current form, the proposal       leaves open the possibility that entities far outside the       market for general-use…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…procedures shall, with       respect to each project--\n\n(1) for each risk identified, explicitly state the source       of such risk in the relevant risk documentation;\n\n(2) clearly define risk parameters;\n\n(3) establish and maintain risk management strategies;\n\n(4) identify and document risks for all phases of the life       cycle;\n\n(5) evaluate, categorize,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…terrorist who shot two National Guardsmen  in DC was working with the CIA in Afghanistan and was part of an elite  unit that was supposed to be helping fight our Nation's enemies.  Clearly, this person was deranged and should never have been allowed to  work with our intelligence Agencies or to come to the United States  where he viciously attacked two American…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}]