[{"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise. I rise to call to  my colleagues' attention that they are no longer claiming that this is  a clean CR. The truth is that it is a dirty, filthy, and stealthy CR  that has been contaminated with millions of dollars for people who have  not earned it. They want to take it from…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696678/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…because their party refuses  to accept the responsibility of governing. That is what has led us to  this yearlong CR.\n\nBoth the President and the Speaker have called for a ``clean'' CR,  but neither of them can articulate what that means.\n\nNot only is Republican leadership struggling to say what my  Republican colleagues want to see in it, but a yearlong…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…accord on, I believe, is a simple notion that a deal is a  deal. A deal is a deal. If we reach a funding agreement--and some have  characterized the Republican proposal as a clean CR, but I would  actually say it is not a clean CR unless you are guaranteed that the  parties will honor it.\n\nWhatever we do--if we do something for 30 days or if we do something…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…against the corruption, the lies, and the BS coming out of this  administration. We will not back this so-called deal. It is not a real  solution, and it is certainly not a clean CR. This CR leaves families  twisting in the wind with zero guarantee there will ever, ever be a  vote to extend tax credits to help everyday people pay for their  healthcare.\n\nMr.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Hickenlooper", "party": "Democrat", "sentence": "…their healthcare or have dramatically significant  increases in the cost of their premiums if we do nothing.\n\nSo I hope that we can come together and move forward with this clean  CR with the extension of the subsidized tax credit for the ACA.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696606/9999"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…more  affordable for millions of Americans who go to work every day. We  couldn't do that because the Speaker and Senator Thune, the majority  leader, insisted it had to be a clean CR. It had to be a clean  continuing resolution with no other provisions, yet somehow this got in  there.\n\nThis wasn't clean. There is nothing clean about this. By the way,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, instead of a clean CR, this bill contains  language that has been air-dropped in that will destroy hemp farming in  Kentucky and across the United States.\n\nTucked away on page 163, title VII, division…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…silliness of where we are today is impeding our  ability to make that true.\n\nI don't know when a shutdown makes sense, but the consequences of  this one, in lieu of a short-term, clean CR for a few more weeks to  complete our appropriations work, is a shutdown that makes absolutely  no sense or is of any benefit to America.\n\nI urge my Democratic colleagues…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…minority leader in the Senate has not been abundantly clear as to  what exactly he is looking for in order to avoid this outcome. After  all, we are dealing with a so-called clean CR, which simply extends  funding levels as they have been for quite some time now. This is  really not the way things should be done, by the way, but that is where  we are,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695800/continuing-resolution-compromise"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…wrap up a few things  that have been discussed today.\n\nWe were closed as a Federal Government for 43 days because Democrats  in the House of Representatives voted against a clean CR and then  cheered on their Democratic colleagues in the United States Senate to  keep the government closed as people suffered, as individuals who were  showing up to work…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…not opinion, and this is not messaging  like Democrats keep trying to spin it. It is a fact that anyone can  check the vote record. Democrats voted against a nonpartisan, clean CR  free of poison pills that would have continued Biden-level funding and  kept the government open for negotiations.\n\nDemocrats chose politics over people. They refused to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, the Democrats rejecting a clean CR,  shutting the government down, creating all of the havoc, the pain and  suffering for our fellow Americans is so obviously disingenuous.\n\nThey never vote against clean CRs.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696731/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…for five Democrats to join us.\n\nIt is already bipartisan. Three Democrats have joined us. If five  more join the Republicans, we have done this 11 times in voting for  this clean CR, which Democrats have done repeatedly under Joe Biden's  watch. If five Democrats join us, we will open the government back up.  But just wanted to set that straight at home.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696364/government-funding"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…agree on a budget. That is  all we are asking. We are not asking for any additional appropriations,  any conditions, any stipulations. All we are asking for is what we call  a clean CR. All we are asking for is just to further negotiate.\n\nCongresswoman Ocasio-Cortez has done a stellar job in rising to the  leadership of her party as a member of the socialist…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…you explain that?\n\nUnfortunately, Democratic leadership is demanding more than $1  trillion in new spending just to keep the government open. So instead  of voting for this clean CR, they want more than $1 trillion in new  spending in a CR that--the CR has no Republican priorities in it; it is  just a clean CR.\n\nSo how is it we are supposed to put trillions…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…to benefit the Democratic Members of this Chamber.\n\nI just really think he is sorely mistaken on this because the  measure--the continuing resolution in front of us--is a clean CR, which  means it is funding that is going to continue at levels where they  were, for a period of about 7 weeks, while we finish exercising our due  diligence and passing…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}]