[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…that will guide them for the rest of their lives. This award  is a testament to Violeta's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Violeta Monserrat Diaz Martinez on  achieving the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690383/recognizing-violeta-monserrat-diaz-martinez"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…specific period of time without being able to call their loved ones or  an attorney.\n\nDHS is now claiming they can enter anyone's home without a warrant  signed by a judge, clearly ignoring the Fourth Amendment of our  Constitution. A recent memo distorting the truth was circulated to our  offices.\n\nStill, congressional Republicans continue to fund this…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…criminal records.\n\nWhen the government goes after people just because of the color of  their skin or the jobs that they hold, they are not going after  criminals. They are clearly using racial profiling to meet the  arbitrary detention quotas they have been given.\n\nThe Congressional Hispanic Caucus and the Congressional Progressive  Caucus are standing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…second way an Agency could work to  defeat Congressional intent in crafting the CRA would be this  situation, the incident situation, where an Agency submits actions,  which clearly do not meet the definition of a rule under the CRA. This  would pose an over submission problem.\n\nThe three CRA submissions at stake here illustrate well the slippery  slope…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…we are third.\n\nThis happened in large part due to Congress providing long-term  certainty for tax incentives to both produce and deploy American-made  energy technologies.\n\nClearly, this strategy was working, but the Republicans' big, ugly  tax scam is putting hundreds of thousands of American energy jobs at  risk.\n\nThe uncertainty caused by this process…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692366/american-energy-jobs-at-risk"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…that will guide them for the rest of their lives. This award  is a testament to Heyzel's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Heyzel Perez on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691009/recognizing-heyzel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Indio's hard work, determination, and perseverance at  Mandalay Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Indio Porter on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691510/recognizing-indio-porter"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…about which programs are funded, how they  will operate, and how they are funded decided by the Congress or by the  President? That is the power of the purse, and it is so clearly laid  out by our Founders that you put it in Congress's hands because if you  put it in the President's hands, you have a strongman--1 person, not  100 people in this Chamber…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Jackson's hard work, determination, and perseverance  at Drake Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Jackson Rogers on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689986/recognizing-jackson-rogers"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Omar's hard work, determination, and perseverance at  Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Omar Lautenbach on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689451/recognizing-omar-lautenbach"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Parker's hard work, determination, and perseverance  at Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Parker Wells on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691947/recognizing-parker-wells"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…ethic that will guide them for the rest of their lives. This award  is a testament to Alma's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Alma Moreno Del Valle on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691061/recognizing-alma-moreno-del-valle"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…No. 64, wiped the Surgeon General's advisory calling gun violence a  public health crisis--wiped.\n\nNo. 65, called for the firing of judges who have disagreed with him,  which clearly would violate the U.S. Constitution.\n\nNo. 66, illegally fired the Democratic Commissioners at the Federal  Trade Commission.\n\nNo. 67, cut off legal representation for unaccompanied…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Nayeli's hard  work, determination, and perseverance at Arvada High School and is  clearly just the beginning of a bright and promising future.\n\nIt is my honor to congratulate Nayeli Andazola on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689493/recognizing-nayeli-andazola"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…ethic that will guide them for the rest of their lives. This award  is a testament to Gael's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Gael Alvarez Acosta on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690273/recognizing-gael-alvarez-acosta"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…procedures shall, with       respect to each project--\n\n(1) for each risk identified, explicitly state the source       of such risk in the relevant risk documentation;\n\n(2) clearly define risk parameters;\n\n(3) establish and maintain risk management strategies;\n\n(4) identify and document risks for all phases of the life       cycle;\n\n(5) evaluate, categorize,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…President Trump's life. Yet this threat information wasn't  shared with Secret Service personnel or local law enforcement  officials--all responsible for securing that event. Clearly, had all  Federal, State, and local law enforcement officials known of this  threat, it would have changed how they secured the AGR building where  the sniper opened fire…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…colleagues are  hanging their hats on is that this is legitimate because it is actually  a law enforcement function. I respect what you are saying, but I don't  agree. This is clearly beyond issuing a warrant. This is clearly beyond  using law enforcement power. The game plan is not only to take the  indicted leader of the country--who is a horrible person--and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…of Venezuelan voters. And, until very recently, he  slept in peace while they starved.\n\nA Western Hemisphere without him or his ilk in power serves America's  interests. But clearly, Venezuela and the hemisphere have a ways to go.\n\nTo the extent that our colleagues are concerned about the mechanisms  and timeline of a transition to democratically elected…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…its  dismal track record of violating the rights of taxpayers. The very  least we can do is ensure that an entity that exists to fight on behalf  of taxpayers actually has a clearly defined and reinforced independence  from the IRS.\n\nMr. SMITH of Missouri. Mr. Speaker, I imagine the American people  would be surprised and no doubt disappointed to learn…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…significant capital expenditure which will  have to be passed down to American families in the form of higher  prices. This is a lose-lose situation for small business owners and  clearly violates the letter of the law.\n\nWe must pass H.J. Res. 75 to repeal this midnight rule and provide  certainty to American manufacturers and small retailers.\n\nMr. Speaker,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…with college students all over our great country.\n\nThe first thing you notice when you watch these videos is how  brilliant Charlie was. He could beat anyone in a debate and, clearly,  had a great career in front of him.\n\nBut the second thing you notice about these debates is how kind  Charlie was. He never raised his voice. He never said anything hateful.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, tonight President Trump will take the  podium, and he will have a joint address to Congress, and, clearly, to  the Nation.\n\nI just heard the minority leader of the Senate come to the floor and  talk about President Trump's promises. Well, let me talk about those  promises--promises…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…across the country. Republicans in Congress are finishing the wall,  hiring more border agents, and investing in Immigration and Customs  Enforcement. The drug cartels are clearly on notice: The border is  closed, and America is once again protecting our citizens.\n\nToday, our communities are safer, and the economic turnaround has  been equally dramatic.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…pressure and uncertainty, he played a critical role in coordinating  local response efforts and guiding recovery planning. His ability to  bring people together, communicate clearly, and keep the public  informed helped Avery County navigate hardship with resilience and  unity.\n\nPhillip's service has been widely recognized for his leadership and  impact.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…there is such wide bipartisan support, but  for my Democratic colleagues to say: Nope, we want to drag this out for  weeks, I just don't think it is the right thing to do. Clearly, they  disagree, but I don't think it is the right thing to do.                  30th Anniversary of Oklahoma City Bombing\n\nMr. President, next week, Oklahoma and the Nation…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. I have been very critical of government performance in  our State, with giving taxpayers the services that they are paying for.  This latest example makes that point very clearly.\n\nFor the last 6 or so years, Californians have been paying an extra  fee on their phone service. This was due to legislation enacted by the  legislature and signed into law…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…businesses and       consumers understand the implications of this proposal to       enable them to provide comprehensive feedback on its impact.\n\nFurther, it is important to clearly delineate the extent of       the rulemaking's scope. In its current form, the proposal       leaves open the possibility that entities far outside the       market for general-use…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…terrorist who shot two National Guardsmen  in DC was working with the CIA in Afghanistan and was part of an elite  unit that was supposed to be helping fight our Nation's enemies.  Clearly, this person was deranged and should never have been allowed to  work with our intelligence Agencies or to come to the United States  where he viciously attacked two American…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…take that away.\n\nAs I talked about with Glen Lyn, if you start shutting down  factories, you shut down towns, and people don't have jobs. Then you  will have people who are clearly going to have more issues with their  health than they currently have.\n\nFurther, in regard to the various things that my colleague said, I  have seen it before where the EPA…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}]