[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…possible, I could have just  been made to wait and risk my reproductive health. I went on to have  two healthy children because I had that procedure.\n\nThe intent of this bill is clear, Mr. Speaker. It is clear from the  text. It is clear from the debate. It is certainly clear from the  timing. It is another attempt to have politicians interfere in the  intensely…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…to El Salvador to one of the most notorious megaprisons  in the hemisphere. It is a prison that American taxpayers are helping  to support in a foreign country.\n\nLet me be clear. Mr. Garcia had rights. The government ignored them.  That is not how justice works.\n\nIt is not just Mr. Garcia. We now have learned of children who are  U.S. citizens who were…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…is  all it would take, just a few Republican Members to save healthcare for  millions and millions of Americans and save food assistance for  millions more.\n\nI think it is clear, Mr. Speaker, the difference in priorities  between this side of the aisle and the other side. It is the Members on  this side of the aisle that are fighting to save healthcare…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…agency into a rogue  and lawless force that is terrorizing our communities.\n\nThis week, the House will consider funding for DHS and give even more  funding to ICE.\n\nLet me be clear, Mr. Speaker: I am not only a no, I am a hell no.\n\nFrom unleashing violence in Minneapolis to dog whistles from the  White House, I have received countless calls from New Mexicans…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699193/defund-ice"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…decimated--if you push a legislative agenda of more junk  fees, abusive medical debt collection practices, Big Tech domination,  and predatory lending--then the answer is pretty clear.''\n\nMr. Speaker, S.J. Res. 28 is opposed by nearly 200 consumer, civil  rights, religious, and good governance organizations. It was also  opposed by a bipartisan group of Senators.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…their lights on. I think it is  a disgrace that, instead of offering up solutions to this affordability  crisis, Republicans are here today to just make it worse.\n\nLet's be clear, Mr. Speaker. It is a well-established fact that  unlimited LNG exports would increase prices here at home. If my  colleagues don't believe me, last year the Secretary of Energy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…mental health block grant,  the substance abuse block grant, the State opioid response grants, and  consolidating them into one program with a deep funding cut.\n\nI will be clear, Mr. Chair. This is not a budget proposal in the  traditional sense. This is a roadmap for what the Trump administration  plans to do unless the Federal courts prevent them from…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…237 years ago to write the United  States Constitution, that no one body would become so powerful that it  could do as it pleases without any checks or balances.\n\nLet me be clear, Mr. Speaker. This is not about partisan politics. It  is about the preservation of our Republic.\n\nWhen an administration past, present, or future believes it can  operate without…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692931/holding-power-accountable"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…safety regulations. Trump's OSHA doesn't have to  consult the experts because it said so. It is just because they said  so. It is truly unbelievable.\n\nLet's make something clear, Mr. Speaker: The administration's actions  at the Department of Labor aren't just tinkering, and they are not just  some complicated, bureaucratic procedure. They are life-and-death…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…House of Representatives are openly  talking about impeaching the President of the United States if he  invades Greenland, as one was quoted today in the press.\n\nLet us be clear. Mr. President, Greenland is not for sale. Greenland  is not for war. Greenland is not to be invaded. Greenland is for the  Greenlandic people and our NATO allies, and we in…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699145/greenland-is-not-for-sale"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…chain saw to nutritional  assistance for hungry children, a chain saw to farm country, and a  chain saw to vulnerable Americans.\n\nYet, as House Democrats, we are here to make clear, Mr. Speaker, that  we are determined to take a chain saw to Project 2025--a chain saw--a  chain saw to Project 2025 on behalf of the American people. We don't  want this country…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…200  lawsuits, and a grift for the ages as Musk stole data, primed the pump  for billions in contracts, and set our agencies on a path for  privatization.\n\nYet, let me be clear, Mr. Speaker. No one is above the law; not Elon  Musk; not the OMB Director; not Donald Trump; not the grifter in chief.  We will hold them accountable.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691867/zombie-of-doge-lurches-on"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…there is much,  much more that we agree on than we disagree on. We would not have  gotten to this point without working together.\n\nHaving said that, I do think this is pretty clear, Mr. Speaker. The  right thing to do here is to fund the people that protect America, that  defend our borders, that help us in times of disaster, and, yes, who  find criminals…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…those who needed help. A truly selfless  leader, Mr. White was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mr. Harry White has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Operation  Midnight Hammer is a vivid example of what our long-range strike  capabilities are all about: strategic reach, rapid response, and  incredible deterrence.\n\nLet me be clear, Mr. Speaker, these were not just strikes, they were  a message to the world. It is a message to every rogue regime that  threatens American lives and our global stability that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…coverage but little care, or we can offer  Americans a new path, one grounded in freedom, responsibility, and  trust in the people that we serve.\n\nI want to make this very clear, Mr. Speaker: The American people  don't want Republicans to do half measures or to tinker around the  edges. They don't want excuses. They want leadership, and they want  bold…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…under the Trump-era guidance, those that cut emissions,  are actually being punished. That is not environmentalism; that is  government overreach plain and simple.\n\nLet me be clear, Mr. Speaker. This resolution does not strip the EPA  of its authority to regulate air pollutants. It doesn't. It simply  returns us to the commonsense, pro-growth, pro-clean-air…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…others and  contribute to a positive and supportive school environment. Mr. Ross's  unwavering commitment to the school and its community is truly  commendable.\n\nIt it is clear Mr. Robert Ross has made a profoundly positive impact  on our community, and I am grateful for his service. May we all strive  to serve our communities with the same dedication…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…bicameral basis.\n\nPresident Trump's priorities, alongside the priorities of the  American people, are interwoven within this important package.\n\nLet me make this abundantly clear, Mr. Speaker: Not only does this  legislative package contain no poison pills, but it also cuts foreign  aid by 16 percent. That is more than $9 billion.\n\nFurther, this package…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…passage of the Protection of Women and Girls  in Sports Act, a bill that simply ensures fairness and common sense in  athletics. Instead, Senate Democrats made their priorities clear. Mr.  Speaker, 45 Senate Democrats voted against protecting women's sports,  45 Senate Democrats voted against keeping women's spaces safe, and 45  Democrats voted against protecting…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…family, and continued to live with  honor, humility, and strength. His son, Mike, speaks with great pride  about the man he is, and that pride is deeply deserved.\n\nIt is clear that Mr. Henry ``Floyd'' Wells represents the very best  of America--commitment, sacrifice, and love of country. I am proud to  represent a district that includes heroes, like…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…happens? Well, it often depletes the public resources meant for  U.S. citizens.\n\nMoving SBA offices into nonsanctuary jurisdictions is a step in the  right direction.\n\nLet me be clear, Mr. Speaker. The Federal Government should not  reward sanctuary cities with permanent SBA infrastructure. That is not  just wrong, quite frankly, it is insulting to every law-abiding…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}]