[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…centers like ours across the country at risk.\n\nMr. Speaker, 200 of the 600 Planned Parenthood clinics across the  country may close and women will die. Planned Parenthood closures will  disproportionately impact Black and Brown mothers, who already have a  maternal mortality rate more than three times their White counterparts.\n\nThese cuts will disproportionately…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…clinical  trials will push back the ability to have cures for some of the most  debilitating and dangerous diseases facing humanity today.\n\nCuts to hospitals is another one. Now, closures of rural and urban  hospitals in many instances are going to be a result of the Medicaid  cuts that they are talking about making right now, and that is not just  President…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…cripple our ability to quickly identify and respond to public  health threats. And right now, we are experiencing the worst flu season  in over 15 years, resulting in school closures in at least 10 States.  We are monitoring an outbreak of Ebola in Uganda. We are keeping track  of the growing threat of avian influenza.\n\nWithout a strong workforce, we will…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…this news. We are not alone. It has been a staple of our  community for over 70 years and services tens of thousands of my  constituents.\n\nI say we do not know the scale of closures because, even after I  submitted an inquiry to the Acting Postmaster General, we have not yet  been given a straight answer. What we do know is that the White House  has been…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692996/closure-of-quartz-hill-post-office"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…right for the families who are counting on us  every day.\n\nThere is no legitimate reason that any child or family in this  country should have to personally deal with program closures and larger  class sizes. That is what the Secretary and President are demanding of  parents every single day that they fail to meet this incredibly basic  responsibility.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…people that we all represent. Let's do  something about it. Let's reject this budget. Let's stop the healthcare  cuts. Let's stop the premium hikes. Let's stop the hospital closures,  and let's stop the billionaire giveaways.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696729/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…bill will restore the Affordable Care Act's premium tax credits,  which will bring down costs. It will reverse Republican cuts to  Medicaid, remove redtape, and prevent the closures of rural hospitals-- something I think we all agree on.\n\nSo I urge my Republican colleagues, vote for your constituents, vote  to save our rural hospitals, and vote to restore…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…system is like a three-legged stool. One of  those legs is Medicaid. If we start taking that away, the whole system  collapses.\n\nThat is what we are talking about: Hospital closures, taking away  services, long waits in emergency departments, and a population that is  sicker and that needs more care. That care becomes more expensive. It  hurts us all.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…across  the State of Illinois.\n\nI am proud to have worked alongside Amisha during her 15 years as the  executive director of Grassroots Collaborative, where we opposed school  closures, championed affordable housing, and fought for critical  investments to our social safety net.\n\nAmisha is a fighter for peace, justice, and community. As a three- time cancer…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…needed to move up the timeline. Cuts to SNAP  will take effect as soon as next year. That makes it even harder for  food pantries to adapt--more chaos, more hunger, and more closures  among our food pantries and kitchens that serve the hungry.\n\nWidespread hunger is now on the fast track. Republicans seem to be  saying that the average person who needs…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…this proposal from  day one and they have continued it.\n\nEssential hospitals, which are the safety net hospitals for this  country, have also said that it is going to lead to closures of  hospitals as well as the private-sector hospitals.\n\nThe Federation of American Hospitals, Director Chip Kahn, came right  out and said that it is imperative that congressional…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…years ago  while Henry's remains standing proudly on Bank Street. During COVID-19,  like many other Vermont businesses, the diner weathered staffing  shortages and temporary closures.\n\nIn the face of all these difficulties, Henry's has persevered. For a  century now, Henry's has remained a place where people from all walks  of life can gather over hearty…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694323/recognizing-henrys-diner"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…costs associated with uninsured       patients. Many studies also found that Medicaid expansion       helped with overall hospital funding and resulted in fewer       hospital closures.\n\nAnd Medicaid--not Medicare--is the single largest payer of       long-term coverage, including nursing home care.\n\nHere are some of the ways Medicaid is crucial for so many…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…presents  access barriers to the elderly. Nor can they get help in person given  the increased distance to offices and longer wait times due to dramatic  staff cuts and office closures.\n\nAt the time when the greatest number of baby boomers are retiring and  need the most help and when SSA already is at its lowest staffing level  in decades, it is unconscionable…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…up, not down.\n\nIn fact, we are facing the biggest increase in health insurance costs  in 15 years, even as the cuts in this big, bad bill threaten to bring  more hospital closures.\n\nTrump's attacks on the Federal Reserve could cause another financial  crisis. Masked agents are roaming our streets, and reports of human  rights abuses at ICE detention…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…to over 40  refineries in the 1980s. This number has now decreased to 14 as of last  year, with two additional refineries slated to close in early 2026.\n\nThese anticipated closures will disrupt fuel supplies and increase  energy prices for consumers, businesses, and farmers.\n\nAn analysis by the University of Southern California anticipates  retail gas…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…all dismissed by the BLM.\n\nIn a letter they submitted to the agency, they stated:\n\n``BLM consistently downplayed the reasonably foreseeable negative  impacts of the mines' closures on the surrounding social justice  communities. And it did not even consider the jobs lost in the  downstream communities that rely on the [Powder River Basin] coal.''\n\nEnergy…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…already caused many nursing  homes to close down.\n\nSince 2015, 44 nursing homes and 35 assisted living facilities have  shut their doors in my State--in Nebraska--alone. These closures  deprived Nebraskans of over 3,000 beds. They hurt seniors who wanted to  stay in their home community to be close to their family, to be close  to their friends.\n\nThis CMS…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…actually $1.5  billion more than the agency's own requested budget. They cited safety  concerns and manning issues, which we addressed appropriately, although  they announced the closures after they actually did it.\n\nThanks to the efforts of myself, Congressman Clyde, and our amazing  local officials, State legislators, and county commissioners, we were  able…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…empowering every student to  succeed.\n\nPerhaps most remarkable is the academic transformation Mrs. Rost has  led since the COVID pandemic. In the wake of prolonged school closures,  Lo-Inyo Elementary School saw its math scores drop to new lows with  just 20 percent of students meeting or exceeding standards.\n\nRecognizing this challenge, Mrs. Rost spearheaded…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…regulatory regime. Simply put, the Biden EPA and  its ``once in, always in'' rule not only disincentivizes innovation and  cleaner operations, but it also threatens plant closures and kills  jobs.\n\nMr. Speaker, you would have to be more concerned with appeasing  environmental extremists than protecting American workers to support  this punitive and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…imbalance has contributed to a dire crisis for small community- based pharmacies, particularly in rural areas like Pennsylvania's 13th  Congressional District, leading to closures and leaving many  communities to be pharmacy deserts.\n\nThis week, Congress will begin to deliver on producing meaningful  transparency for the American patient as we consider…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Why the 2024 ROD Is Harmful to Kaktovik and ANCSA Rights\n\n2024 ROD:\n\nIgnores the statutory mandate for area-wide leasing.\n\nDisregards congressional limits on habitat closures and       surface disturbance.\n\nUndermines ANCSA village lands specifically conveyed to KIC       for local benefit.\n\nRemoves opportunities that Congress intended to support…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rule, dozens of miles of popular trails and shorelines  are closed off to highway vehicles in what the State of Utah called de  facto wilderness management. Even small road closures can have profound  consequences for public access.\n\nFor example, the National Park Service effectively cut off access to  the adjacent 1.45 million-acre Henry Mountains travel…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "John Thune", "party": "Republican", "sentence": "…whose homes are in a rural area know  simply accessing a doctor or emergency room can be challenging. That is  all the more true with the troubling trend of rural hospital closures  over the last several years. With the One Big Beautiful Bill,  Republicans have taken action to support rural hospitals. All 50 States  have now applied for funding from…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…know this bitter reality all too well in my home State of  California.\n\nFrom 2020 to 2022, we lost more than 1 million barrels of production  capacity per day, and refinery closures are projected to slash that  capacity by 20 percent over the next year. Twenty percent of our  refining capacity is going to disappear overnight.\n\nSince 2018, over 360 energy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the 2024 ROD is Harmful to Kaktovik and ANCSA Rights\n\n2024 ROD:\n\nIgnores the statutory mandate for area-wide       leasing.\n\nDisregards congressional limits on habitat       closures and surface disturbance.\n\nUndermines ANCSA village lands specifically       conveyed to KIC for local benefit.\n\nRemoves opportunities that Congress intended to       support…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Since 2010, more than 150 rural  hospitals have cut inpatient services or closed their doors  permanently, including some in northern Michigan and the Upper  Peninsula.\n\nThese closures aren't happening because communities don't need care  but because the financial reality of providing it in rural America  keeps getting tougher.\n\nWhen a rural hospital closes,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "John Thune", "party": "Republican", "sentence": "…during the event, including       potential human exposures to toxic aerosols;\n\n``(IV) reports of human or animal illnesses or mortalities       during the event;\n\n``(V) any closures of fishing or shellfish harvesting       locations or recreational public waters, including beaches,       during the event;\n\n``(VI) the duration and spatial extent of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…prices are so much  higher than anywhere else in the country.\n\nThere are various reasons why they are so much higher. In fact, they  are going to get even higher with refinery closures that are happening,  but a big part of the equation is that we have a much higher gas tax  than anywhere else in the United States--71 cents per gallon.\n\nAll of this money,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}]