[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…meaningfully forward.\n\nMs. CRAIG. Mr. Speaker, I have no other speakers at the moment. I  continue to reserve the balance of my time.\n\nMs. CRAIG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I, too, would like to thank the gentleman from  Pennsylvania, Chairman G.T. Thompson, and his team for working on this  consumer…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…safety officers who have given all for this  country, and I would put at the top of that list right now Brian  Sicknick and Howard Liebengood.\n\nMr. Speaker, I am ready to close, and I reserve the balance of my  time.\n\nMs. SCANLON. Mr. Speaker, I support H.R. 3497, the Medal of Sacrifice  Act, which would award medals to honor those who lose their lives while…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699503/medal-of-sacrifice-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…bill.\n\nFor those reasons, Mr. Speaker, I recommend a ``no'' vote on the bill  and reserve the balance my time.\n\nMr. SCOTT of Virginia. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. SCOTT of Virginia. Mr. Speaker, may I inquire how much time is  remaining.\n\nMr. Speaker, when you hear the title, PROTECT Our Kids Act,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…as to how much  time is remaining.\n\nMr. SMITH of Washington. Mr. Speaker, I reserve the balance of my  time.\n\nMr. SMITH of Washington. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, the first thing I will say is we have mentioned  repeatedly ``acquisition reform,'' which is such a huge part of this  bill and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…request  of the gentleman from New York?\n\nMr. PALLONE. I yield 4 minutes to the gentlewoman from New Mexico  (Ms. Stansbury).\n\nMr. PALLONE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I have to respond to the chairman of our committee who,  of course, I respect a great deal.\n\nThe Republicans have never supported…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…a mortgage  last week, was inundated with literally hundreds of these contacts, so  this is very personal to me and my family.\n\nMr. ROSE. Mr. Speaker, I am prepared to close and reserve the balance  of my time.\n\nI emphasize just how much support there is for this legislation. My  colleague has just enumerated some of that. This month, 43 attorneys  general…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…colleagues on the other  side will reflect on this, will reconsider, and will do the right thing  and vote for this bill.\n\nMr. KNOTT. Madam Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. KNOTT. Will the gentleman yield?\n\nMr. KNOTT. The issue with your characterization, sir, is number one,  someone who enters illegally must…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…We have to actually sit down and  have those discussions, and that is what getting the government back  open will do.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nAs we wrap up this debate, I want to take a moment…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Alaska delegation that outdated PLOs be lifted so land selections  could begin.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time. I am  prepared to close and reserve the balance of my time.\n\nThis CRA is crucial to unleashing Alaska's abundant natural  resources. It will unleash billions of dollars' worth of oil, natural  gas, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of the House Labor,  Health and Human Services, Education, and Related Agencies Subcommittee  on Appropriations.\n\nMr. HILL of Arkansas. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, I thank Mr. Aderholt for using this historic precedent  to, again, have a numismatic memory of our semiquincentennial with this…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…their  bartenders helping out cooks, hosts, and other nontipped employees, all  who often work in a fast-paced environment.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. WALBERG.\n\nMr. Speaker, we can all agree that our Nation's workers deserve to be  compensated fairly. H.R. 2312, the Tipped Employee Protection…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…programs.\n\nMr. Speaker, I urge all of my colleagues to vote for H.R. 1816, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support  this commonsense legislation, and I yield back the balance of my time.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…generally consistent with results of similar testing we       conducted for plan years 2014 through 2016.\n\nMr. SMITH of Missouri. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, I will remind the body that the reason why these  enhanced subsidies are expiring is because the Democrats are the only  ones…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. WILLIAMS of Texas. Madam Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Madam Speaker, I yield myself the balance of  my time.\n\nMadam Speaker, for the reasons I explained earlier, I urge my…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…are doing with the CRA to make sure that these rules are followed.\n\nMr. Speaker, I have no further requests for time.\n\nMr. WESTERMAN. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, it has been stated that gas and energy prices won't be  reduced by passing this CRA, and I contend that they will because  overturning…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…around this Capitol. We are  very blessed.\n\nMr. Speaker, I understand that Mr.--I am going to say this in a  second--Mr. McGovern is ready to close, and I am ready to close. I  reserve the balance of my time.\n\nMr. Speaker, for months, bipartisan, bicameral negotiations and  collaboration have been underway. They have yielded consistent,  consecutive…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…reserve  the balance of my time.\n\nMr. LATTA. Mr. Speaker, I have no further speakers, and I reserve the  balance of my time.\n\nMr. LATTA. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. LATTA. Mr. Speaker, cybersecurity is something we have talked  about not only in the Energy and Commerce Committee for many years, but…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…taxpayer  dollar, and address illegal immigration, but know that it will be a  vote against the will of the American people.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nMr. Speaker, I will clarify some things. My colleague continues to  talk about the tax bill, which is not actually in front of us right  now.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Equipment'', and ask for its immediate consideration.\n\nThe Clerk read the title of the joint resolution.\n\nMr. GRIFFITH.  Res. 42.\n\nMr. GRIFFITH. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I find this debate fascinating and interesting. That may  come as a shock, because it is really pretty boring. However, I find…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…our economy. This  bill passed the House in the 117th and 118th Congresses, and I urge my  colleagues to pass it again today.\n\nMr. BABIN. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, as teachers prepare the next generation of American STEM  workers, we must invest in the best curricula and teaching methods.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}]