[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Raven's ``Burning the Gaspee.''\n\nA handful of longboats glided across the water on a       moonless night. The men--some at the oars, other nervously       fingering muskets or clubs or handspikes--were silent as they       drew closer and closer to the silhouette of a schooner a       short distance away. A white British ensign fluttered from       the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…President's own words. The tariffs  will be painful, but it is a price that must be paid; but paid by whom?  It won't be Trump or the billionaires in his Cabinet or at his golf  clubs. No, it is going to be real people, people who work for a living,  who will have to pay the price for his ill-conceived trade war. It is  not going to be guys like Bessent…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…there, unarmed, marching peacefully from Selma to  Montgomery. After having been told by the officers that they must turn  back and peacefully marched on, they were then beaten--clubs, men on  horseback. They were beaten all the way back to the church where they  started.\n\nThe Honorable John Lewis reminded me that he thought he was going to  die on that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…anniversary of one of the  darkest days of our democracy. On January 6, rioters stormed the heart  of American Government and sought to overthrow the will of the people  with bats and clubs. Now, the individual responsible for promoting such  baseless allegations once again occupies the highest office in the  land.\n\nI extend profound gratitude for the Capitol…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698550/january-6-attack"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are the facts. The fact is  that his economy sucks.\n\nI just spent the last week at grocery stores, senior centers, and  townhalls. I went to food pantries and Boys and Girls Clubs across  Massachusetts. I spoke with people who are working hard and getting  crushed.\n\nThey are paying more for food, more for rent, more for utilities, and  more for healthcare.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…routinely visit New Roc City and Cross-County Shopping  Center, and Westchester residents visit and work in Bay Plaza in the  Bronx. The Woodlawn neighborhood, with associations and clubs, spans  the line between the Bronx and Westchester. The Westchester Bee-Line  public bus system takes passengers down to Fordham Road in the Bronx  and back. The Montefiore…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Congressional  District. For a century, the members of this association have been a  positive presence in the community. They have raised funds to support  youth athletics, clubs, churches, schools, and both the Fire and Police  departments.\n\nBeyond their philanthropic work, the Stickney Police Association has  played a vital role in building and maintaining…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690438/recognizing-the-stickney-police-association-100th-anniversary"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Speaker, I congratulate the 457 graduates of  Briar Woods High School class of 2025.\n\nIn their time as Falcons, they have put time and effort into classes,  sports activities, and clubs while building lifelong friendships.\n\nThey have excelled in a wide range of fields this year. The football  team went to the State championship. Seventeen students in the DECA…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…inclusion.\n\nDuring her confirmation hearing, Mrs. McMahon seemed unsure whether  this edict meant that schools can't celebrate or teach classes on  African-American history or host clubs like Special Olympics or Girls  Who Code.\n\nAs a reminder, by law, the Secretary of Education may not interfere  with the content that schools teach, nor the academic standards…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…put  partisanship aside and play a good game for a good cause.\n\nTogether, we raised a whopping $2.8 million which will go toward  sports scholarships, local girls' and boys' clubs, and other youth  charities. That is something I think we can all be proud of.\n\nAgain, I congratulate Coach Williams and his team. I would say to my  friend, we are coming…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694188/republicans-win-record-setting-game"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize the  Chicago Indo-US Lions Club for its outstanding service to communities  across Illinois and for continuing the proud legacy of Lions Clubs  International. Founded in Chicago in 1917 by Melvin Jones, Lions Clubs  International has grown into the world's largest service club  organization, guided by a mission of…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698522/recognizing-the-chicago-indo-us-lions-club-for-its-outstanding-service-to-communities-across-illinois"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…constant surveillance.\n\nFounded in Chicago in 1905 with the motto of Service Above Self,  Rotary International is the headquarters organization for a vast number  of Rotary Clubs. It is one of the largest nonreligious and nonpolitical  civil society membership organizations. It provides people-to-people  assistance reaching the community level with…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…purpose, and for acquiring and  maintaining and club house and grounds.''\n\nThe pioneering women who founded the Town & County Club at a time  when membership at most private clubs was exclusive to men created an  organization worthy of its storied 100-year history. It is my honor to  celebrate the Town & County Club of Hartford, Connecticut.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of service organizations in  promoting humanitarian assistance, while also showing our youth the  value of giving back.\n\nWe specifically applaud Kiwanis International, Lions Clubs  International, Optimist International, and Rotary International for  encouraging and promoting community service and humanitarian assistance  through their local chapters.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695366/recognizing-celebrate-community-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…community in Lock Haven.\n\nThe club has 43 members, and it works to help children by improving  literacy rates, health, and educational outcomes.\n\nLock Haven Kiwanis sponsors two Key Clubs, one at Central Mountain  High School and the other at Jersey Shore High School. It awards annual  scholarships to Key Club members at both schools.\n\nThe club recently started…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698269/recognizing-lock-haven-kiwanis-club-on-centennial-anniversary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…weapon that expels a projectile with an       explosive);\n\n4.1.8 Handcuffs, Flex Cuffs, or items that can be used as       restraints;\n\n4.1.9 Impact Weapons (batons, blackjack, clubs, maces,       slungshot, etc.);\n\n4.1.10 Knives, 2.5 inches or more, to include sharp tools,       pointed objects or implements such as a switch blade, dagger,       dirk,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "John Rose", "party": "Republican", "sentence": "…and pleaded guilty to stealing over $100  million that were intended for the 4-H Military Partnership Grant  Program.\n\nThe 4-H Military Partnership Grant Program serves 4-H clubs that are  in many military installation youth centers. These programs include 4-H  positive youth development programming, engaging in hands-on learning  in day and overnight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Association, Lee County Salvation  Army, Achievement Center Easter Seals, Chattahoochee Council Boy Scouts  of America, Chattahoochee Historical Commission and Boys & Girls Clubs  of Greater Lee County.\n\nMayor Fuller has served the Alabama Municipal Electric Authority  (Chairman), Alabama League of Municipalities (Past President), Alabama  Monument…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…money raised within the community  is reinvested back into the community.\n\nThe Manheim Lions are currently led by Club President Aaron  Henderson. They are one of 49,000 Lions clubs across 200 countries and  regions, and Lions Club International boasts 1.4 million members  worldwide.\n\nAs the Manheim Lions Club celebrates 100 years of community service,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696418/recognizing-100-years-of-the-manheim-lions-club"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…by the Lee County Community Foundation for his volunteer  work  and philanthropy. He has also served as a board member for the Sanford  Area Growth Alliance, Boys and Girls Clubs of Central Carolina, and Lee  County Education Foundation, among others.\n\nIn his career, Mr. Oldham's company's involvement in a variety of  projects, including critical infrastructure,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}]