[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Political  Science from Millsaps College in 2008, where he stood out as both a  scholar and an athlete. He was named to the Dean's List, served as  Chair of the Political Science Club, and received several athletic  honors, including selection to the National Football Foundation  Hampshire Honor Society, the ESPN The Magazine Academic All-District  Team,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…personal experiences, growing up in  Chicago, to realize safety in our communities by investing in our  city's young people.\n\nThrough the establishment of the Chicago Youth Boxing Club, and as  the director of mentoring at New Life Centers, Mario understands that  building community and building relationships are the recipe for safer  neighborhoods. Through…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to share the latest photo of the  founding of another billionaire private club here in Washington, D.C.,  in Georgetown, for the superrich, spearheaded by Donald Trump, Jr.; JD  Vance; and their billionaire buddies.\n\nMembers can join for the low price…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690166/executive-branch-club"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "Mr. RUIZ. Mr. Speaker, I rise today with pride to recognize the  Coachella Football Club, an awesome soccer organization from  California's 25th District that is lifting up young athletes and  inspiring our entire community.\n\nThis past year, the Coachella Football…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692140/recognizing-coachella-football-club"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…the land was conveyed to the city, the National Park Service  still retains a deed restriction. Today, the parcel is utilized, as you  heard, by the Oscar Cross Boys & Girls Club, which provides programming  for youth in the community. The club is a central part of the community  but faces challenges in accepting new members and a growing wait list…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…bank crash laid over  the underlying great climate insurance collapse.\n\nThat is not from me. That is not from the League of Conservation  Voters. That is not from the Sierra Club. That is from the  international Financial Stability Board.\n\nSo that was the second message: Look out. This is about to get deadly  serious, and people at the top of the finance…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Congregation Community.\n\nWe are both diehard Anaheim High School football fans, and at  Anaheim, he served as a sports team manager. Upon graduation, Jimmy  joined the football booster club and took over as president in 1976,  and he has held that position.\n\nJimmy was inducted into the Anaheim High School Hall of Fame in 2008.  Please join me in recognizing Jimmy's…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…can  now funnel money directly into Donald Trump's pockets, and it is  happening.\n\nWe know that he actually offered the top buyers of this coin a  private dinner at his golf club. He is basically selling access to the  Presidency for cash.\n\nWe also saw Donald Trump fire someone whose job was actually to look  into and punish Hatch Act violations. By…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…while advancing the broader  goals of civil rights and economic justice. In 2019, Reggie was named  Labor's Representative of the Year by the Labor's Educational &  Political Club Independent in recognition of his effectiveness in  organizing, legislative engagement, and grassroots mobilization. These  accolades reflect the tangible, community-level impact…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…bringing home a Class 1 State title  for the women's basketball team and winning a Scholastic Bowl regional  championship. Whether on the field, in the classroom, in the drama  club, or as part of one of Rappahannock County High School's bands, I  know they will carry the lessons they have learned as a Panther to  whatever comes next.\n\nI congratulate the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…programs, and the right to payment  under each of them is separately deserved. Not everyone who is entitled  to retirement pay gets disability benefits. You have to be in that club  that nobody wants to join of being combat injured. And it is a separate  form of right that in no way involves double-dipping, as we commonly  refer to it. The retirement pay…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Morehouse College, and culminated with a Doctorate in Theology from  North Carolina University Wilmington, where he was recognized as a  distinguished member of the President's Club.\n\nBefore full-time ministry, Bishop Williams worked at McGregor Golf  for eleven years and later served the community as a bus driver for the  Dougherty County School System…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…Trump shrugs at all those rising costs, he  certainly wants us to know this. While all this was happening to  American families, he wanted us to know that he won his Senior Club  Championship golf tournament.\n\nWhat are House Republicans doing?\n\nAre they voting to cancel these taxes? No, they are carving them into  stone, prohibiting us from revealing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689842/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans' signature  legislation is to cut Medicaid and Social Security and other programs  by hundreds of billions of dollars in order to pay for tax breaks for  the billionaires club.\n\nLet's look at another claim by Donald Trump:\n\nThe next economic boom will begin the instant . . . Donald       J. Trump has won 4 more years.\n\nThat is his quote. He said:…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…High School College and  Career Academy Advisory Board, RiverCenter for the Performing Arts,  Columbus State University Military Affiliated Student Support Fund, the  Rotary Club of Columbus, and the Miracle Riders.\n\nOn a personal note, I have had the privilege of knowing Judy for many  years. I am incredibly grateful for her support and the fidelity…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…U.S. Youth Ambassador to South Korea as part of the State  Department's National Security Language Initiative Program. He is the  President of his school's Model United Nations Club and plays the  trombone in concert and marching band. Moreover, Oliver received first  place in the Texas History Essay Contest. As a recipient of the Czech  Republic government's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…bring  the fresh, local produce directly to the consumers.\n\nThroughout his life, Jeff has been deeply involved in serving his  community. He has served 50 years with the Ruritan Club, 30 years with  the Young Farmer and Agribusiness Association, and he is on the Clemson  Extension Advisory Committee. He was also awarded County  Conservationist of the Year.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…heart  into Pirate Athletics. He was the voice of the Pirates. At every  football game, Mr. Speaker, you would hear Billy-O with the call.\n\nHe was president of the Quarterback Club, which is the fundraising  arm for the football team. Our kid was on the football team. Like so  many others, our kid graduated--sorry, Mr. Speaker. He was just a big  deal.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…and community organizations. He has served as a founding  member of the Board of Directors for the Cullman Parks & Recreation  Foundation, contributed to the Cullman Rotary Club, and supported  Wallace State Community College through the Future Foundation and  Alumni Association. He also served on the Cullman Area Chamber of  Commerce Board of Directors…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…soccer). Their home-base in Horsham township continues to be a center  where the community comes together. Some notable achievements of the  UASC Tryzub include in 1856 the Club's Majors' Division soccer team  reached the national championship game for the coveted US Amateur Cup.  A year later the UASC Tryzub organized a professional soccer franchise;…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Managing General Partner for Fuller Properties, LTD and former  host of the Lee County Report.\n\nHe's served as past President of The United Way of Lee County,  Opelika Rotary Club and The Opelika Chamber of Commerce. He has served  as past director of Opelika Dixie Youth Baseball, Opelika Main Street,  Opelika Utilities Board, Opelika Arts Association,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "David Valadao", "party": "Republican", "sentence": "Mr. VALADAO. Mr. Speaker, I rise today to recognize Mr. Vincent Sola,  as he is awarded  the title of Farmer of the Year by the Kiwanis Club of Tulare.\n\nMr. Sola was born in Porterville, California and developed his love  of farming at two years old from his father, John Sola. As a high  school student, he rented…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…Chamber, that  not very many people ever get to set foot into.\n\nThis is something we should hold to a higher standard. We have to or  else what are we? Are we just a debate club that yells at each other,  or do we stand for something? Do we truly see ourselves as  Representatives of the people of the United States?\n\nSomething has to change. It truly…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Madam Speaker, I rise today to  recognize the State College Kiwanis Club for reaching a remarkable  milestone, 100 years of service to children and families in our  community.\n\nSince 1925, the club has lived out Kiwanis International's mission of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691117/recognizing-state-college-kiwanis-club"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…attitude. While we  will feel his absence on our team, I am excited for him as he takes on  a new challenge in the Senate and am pleased to welcome him to our  esteemed Alumni Club.\n\nI know his parents, Scott and Alicia, are so proud of all he has  accomplished. I wish Mitchell the best of luck in this next chapter,  and I thank him for his nearly 10 years…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Kentucky.\n\nIt is an honor to serve the people of Paducah and McCracken County in  Congress. One of their community's most impactful institutions, the  Oscar Cross Boys & Girls Club has been a cornerstone of support and  opportunity for local youth for over 60 years.\n\nThe club is located on land currently owned by the city of Paducah,  which has held the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to commend Jekyll  Island Club Resort and Sea Island for being named among Southern  Living's Best Resorts for 2025.\n\nJekyll Island Club Resort is a historic retreat that combines  timeless elegance with…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Chapter, where he served as All Pro Dad's  Chairperson for Carver Primary School and West Forest Intermediate  School, Longtime coordinator of the Lions Tamers Social and Civic  Club's Family Fun Day/Juneteenth Celebration, Certified Member and  Volunteer with the American Red Cross for 19 years, including service  as a former Shelter Manager on the Disaster…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my pleasure to recognize  and celebrate the 100th Anniversary of the Rotary Club of Winter  Garden.\n\nFor the past 100 years, the Rotary Club of Winter Garden has stood as  a pillar of leadership and service. Its business and professional  members have generously…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699377/recognizing-the-100th-anniversary-of-the-rotary-club-of-winter-garden"}, {"senator": "John Carter", "party": "Republican", "sentence": "…years in a  row. Beyond his veterinary work, Dr. Gosney has made significant  contributions to his community. A past president and longtime member of  the Temple Founder Lions Club, he has raised thousands of dollars to  support local charities. Additionally, as an avid supporter of the  arts, he has contributed to over 100 Temple Civic Theater productions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689327/saluting-the-service-of-dr-gary-l-gosney"}]