[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…now as the director of a tenant advocacy clinic, Eric uses  litigation advocacy to advance housing equity in Illinois and beyond.  His work with the Illinois Fair Housing Coalition led to the passage of  a State law prohibiting discrimination against housing choice voucher  holders.\n\nEric co-led the Partnership of Just Housing, a national coalition…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699030/recognizing-eric-sirota"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Saddam Hussein back into Kuwait's border.  Hussein's objective was to steal from Kuwait's crude oil fields which  extended across the adjoining borders of Kuwait and Iraq. The Coalition  of the Willing Forces rolled back Saddam's forces inside his own  borders. When I landed in Kuwait during the Iraq War that came two  decades later, I entered the headquarters…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…served on the  boards of the Lone Tree Arts Center Fund and the U.S. Bank Development  Network, and currently contributes his time and expertise as a board  member of the Coalition Against Global Genocide (COAGG).\n\nI commend Mr. Yeremyan for years of devoted leadership, service, and  commitment to the Armenian community and to the people of Colorado.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697495/recognizing-byuzand-yeremyan"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Honoring Sue Ryan\n\nMs. McBRIDE. Mr. Speaker, I rise to honor Sue Ryan, who is retiring  after 10 years of extraordinary service as the executive director of  the Delaware Coalition Against Domestic Violence.\n\nFor a decade, Sue has been the steady, principled voice behind a  coalition that works every day to prevent domestic violence and support  survivors…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…because without it, its       exploitative business model collapses.\n\nThe bail industry has built a powerful political machine to       protect its profits. The American Bail Coalition, its chief       lobbying group, spends millions to oppose reform efforts       across the country. It has partnered with well-funded       conservative organizations to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…kids. I talked my kids into voting for him. And I am so upset. I am so  embarrassed. I never thought that this would happen. This is so messed  up.\n\nThis, colleagues, is the coalition of the horrified, the people who  see this and feel a sense of moral outrage, people who are bound  together not by politics or faction or identity but by that feeling in…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…they have stood up to Russia's  unspeakable brutality and destruction.\n\nWe have seen--and, indeed, the United States should take great pride  in having led--an impressive coalition of nations coming together to  support Ukraine in this fight to preserve its democracy.\n\nAt the same time, an alarming convergence of authoritarian states-- Russia, China,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…rates but also to high fees that can quickly surpass the  amount of money originally borrowed. These are hallmarks of predatory  lending and poor underwriting.\n\nAccording to a coalition of community organizations, payday lenders  are known to target the most vulnerable, including seniors, veterans,  and low-income borrowers. Many in these communities are…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…speakers, and I yield  myself the balance of my time for the purpose of closing.\n\nMr. Speaker, as you have heard, this legislation has bipartisan  support and support from a broad coalition of employers and health  stakeholders. I appreciate my colleagues on the other side being so  concerned and so focused on this. Let's just hope they have that same  concern…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…expand affordable  housing, revitalize neighborhoods, and create jobs. Increasing supply  is essential if we want housing prices to come down.\n\nAs chair of the New Democrat Coalition's Affordable Housing Task  Force, I helped develop a housing action plan with more than 20  recommendations to increase housing supply, reform zoning and  permitting, strengthen…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…Humanitarian Award from the Orlando  International Film Festival; 2021 Civil Rights Hall of Fame from City  of Orlando 2022; Outstanding Public Official Award from Healthy Start  Coalition of Orange County; 2019 MLK Humanitarian Award from Central  Florida Steppers; 2022 Warrior for Democracy Award from The League of  Women's Voters: 2022 Mountain Top Trailblazer…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…constrain him and prevent him from doing,  because the House controls the purse strings.\n\nHe said: I want five seats. Four of the five that he actually  identified were minority coalition seats, where minority people were  electing the persons of their choice, and they were electing minority  people. Well, he wanted five, four of the five being these seats…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…for Family Peace       Education and Research Initiative; Congregation of Our Lady       of Charity of the Good Shepherd, U.S. Provinces; Hope Rise       Thrive; Interfaith Coalition Against Domestic and Sexual       Violence; Legal Momentum: The Women's Legal Defense and       Education Fund; National Advocacy Center of the Sisters of       the Good…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…places like South Dakota or Texas. This makes rehabilitation harder and  increases the likelihood of recidivism.\n\nDon't just take my word for it, Mr. Speaker. There is a large  coalition opposing this bill.\n\nScientists tell us that young people's brains are not fully developed  until their twenties. They don't share the same culpability for their  actions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…legality of four of Texas's congressional districts. As       stated below, Congressional Districts TX-09, TX-18, TX-29 and       TX-33 currently constitute unconstitutional ``coalition       districts'' and we urge the State of Texas to rectify these       race-based considerations from these specific districts.\n\nIn Allen v. Milligan, 599 U.S. 1, 45 (2023),…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Act is supported by law enforcement groups across the  Nation: the Fraternal Order of Police, the National Association of  Police Organizations, the Police Officers' Defense Coalition, the North  Carolina Fraternal Order of Police, the National Sheriffs' Association,  and the Major County Sheriffs association.\n\nLadies and gentlemen, I don't know why it…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and economic progress       in Asia.\n\nThe proposed sale will improve Singapore's capability to       maintain operational readiness and interoperability with U.S.       and coalition forces. Singapore will have no difficulty       absorbing these articles and services into its armed forces.\n\nThe proposed sale of this equipment and support will not…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696549/arms-sales-notification"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…where she led the mammography department and  was selected as a cadre for the Combat Medical Badge course.\n\nShe later deployed to Afghanistan, where she trained over 200  coalition troops and American troops in combat lifesaver skills.\n\nLyndsay medically retired in 2017 after service-connected injuries,  but today, Lyndsay is pursuing her Ph.D. and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691773/recognizing-lyndsay-gray"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…permitting  process that Republicans and Democrats disagree on, but this is not one  of them. A more efficient and a more transparent permitting system is  bipartisan. Our diverse coalition of cosponsors and supporting  stakeholders shows just that.\n\nI thank Mr. Peters for being a good partner on this legislation. I  thank Chairman Westerman and Ranking Member…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…California (PORAC)\n\nCivic, Community & Reform-Focused Organizations\n\nAfrican American Mayors Association\n\nNext Generation Alumni Leadership Council\n\nPrince Jones Jr. Foundation\n\nCoalition of Moms Against Police Brutality\n\nThis broad coalition reflects a shared understanding across       communities, law enforcement, and advocacy groups that       improving…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…the Major Cities Chiefs Association, the Major County  Sheriffs of America, the National Association of Police Organizations,  the National Narcotics Officers' Associations' Coalition, the National  Sheriffs' Association, and the Sergeants Benevolent Association NYPD.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Group. I have gone to every NATO conference. I have gone to  the security conference. I have met with almost all of the leaders of  the countries that are part of the 32-nation coalition known as NATO,  the North Atlantic Treaty Organization.\n\nNow, let's talk about why I think it was an amateurish comment and  something that a Deputy Chief of Staff and senior…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…certainly deserve.\n\nThis One Big Beautiful Bill Act fulfills all the promises of the  America First agenda. It is the people's bill. It is made for and  shaped by the most diverse coalition of American voters in American  history.\n\nToday, we are making the dream of a government that puts the American  people first a reality.\n\nI would need this entire notebook…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…American Principles  Project, Center for Urban Renewal and Education, Advancing American  Freedom, AdvanceUSA, Concerned Women for American Legislative Action  Committee, the Coalition for Jewish Values, the Commission of the  Southern Baptist Convention, Eagle Forum, Family Watch International,  Faith and Family Foundation, Independent Women's Forum, Students…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…for  his tremendous leadership.\n\nI thank the gentleman from Wisconsin (Mr. Steil) for being a subject- matter expert and working in a bipartisan way to build a bipartisan  coalition for this moment.\n\nThere has been a lot of talk, Mr. Speaker, made in this term of  Congress about the One Big Beautiful Bill Act. It is a historic piece  of legislation,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Organizations comprises 34 community health organizations serving over  750,000 patients nationwide.\n\nAdditionally, Jeffrey acts as the founding co-chair of Hep B United,  a national coalition to unify and enhance local coalitions and  community health centers dedicated to eliminating Hepatitis B virus  infections and its complications. Hep B United was founded…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "James Risch", "party": "Republican", "sentence": "…12th  largest foreign military sales customer. It would be about how the UAE  has fought alongside the United States in Afghanistan and Iraq, is a  participant in the Global Coalition to Defeat ISIS, and is working  against Iran and its terror proxies. The debate would mention that the  UAE was the first Arab state to join the Abraham Accords when it…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692354/motion-to-discharge-sj-res-54"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…forced organ harvesting.\n\nThank you for your thoughtful consideration of this       legislation.            Respectfully,      Susie Hughes,\n\nExecutive Director, International Coalition to End       Transplant Abuse in China.      Dr. Katrina Lantos Swett,\n\nPresident, Lantos Foundation.      Kristina Olney,\n\nExecutive Director, The Remembrance Society.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…non-MDE       items that increase the sensitivity of technology. The       proposed sale will improve Lithuania's capability to deter       current and future threats to support coalition operations,       as well as promote its interoperability with United States       and other NATO forces.\n\n(v) Justification: This proposed sale will support the       foreign…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…bipartisan policies is the Whole Milk for Healthy Kids  Act which I proudly introduced alongside my colleague, Representative  Kim Schrier, a pediatrician, and a bipartisan coalition in both  Chambers of Congress. This bill is about returning whole and reduced  fat milk to school cafeterias. It reflects updated science, addresses  years of flawed Federal…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}]