[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "And I will include the Coast Guard,  too, because we like to count the Coast Guard, especially when they  partnered with us on things that really mattered to the United States.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Coast Guard, the U.S.", "title": "Halt Work Orders", "date": null}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "military to use lethal force against  individuals who posed no imminent threat of attack and who could have  been stopped thousands of miles from our shore had we interdicted and  arrested those on board just as they routinely are by our Coast Guard.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Coast Guard Academy that ``no politician in       history, and I say this with great surety, has been treated       worse or more unfairly.'' The question, then, was how Trump       would respond.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "4275, the Coast Guard Authorization Act of 2025.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-07-23"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "President, I rise to support Senator Cruz in our  efforts here to pass the Coast Guard bill.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-03-05"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "We have others outside of  the jurisdiction of the NDAA who are part of this, including Coast  Guard reauthorization, Foreign Affairs reauthorization, and the intel  community's reauthorization.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "It requires a  memorandum of understanding with the Army, Navy, Air Force, and Coast  Guard to share safety data, and it directs the Army inspector general  to audit pilot training, maintenance protocols and the compliance.", "title": "Rotorcraft Operations Transparency and Oversight Reform Act", "date": "2025-12-17"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "In the Thumb region,  Delta College Public Media hosts transmitters for the FBI and the Coast  Guard to ensure that they can effectively communicate during emergency  situations.", "title": "Rescissions Act of 2025", "date": "2025-07-15"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Coast Guard\n\nMr.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "4275, the bipartisan Coast  Guard Authorization Act of 2025, which includes my provision to improve  navigation in the East Rockaway Inlet off the South Shore of Long  Island and to strengthen maritime drug enforcement in our waters.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-07-23"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "4275, the  Coast Guard Authorization Act of 2025.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-07-23"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "I would also like to recognize the Federal agencies working on the  recovery and investigation, including the National Transportation  Safety Board, the FBI, the Federal Aviation Administration, the Coast  Guard, the Army, and all the others who contributed.", "title": "Expressing Condolences to the Families, Friends, and Loved Ones of the Victims of the Crash of American Eagle Flight 5342 and Pat 25", "date": "2025-03-03"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Coast Guard  correspondence and even photographs confirm that these are anything but  routine.", "title": "Introduction of the Merchant Marine Allies Partnership Act", "date": "2025-08-01"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "It increases funding for TSA by $149 million and provides a pay  raise for air traffic controllers and uniformed members of the United  States Coast Guard.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "1071, the National Defense Authorization Act of 2026, which includes  the Coast Guard Authorization Act of 2025, bipartisan legislation to  authorize appropriations for the Coast Guard for fiscal years 2026 and  2027.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "(5) Pursuant to section 1562 of title 38, United States       Code, the Secretary of Veterans Affairs shall pay monthly to       each living person whose name has been entered on the Army,       Navy, Air Force, and Coast Guard Medal of Honor Roll a       special pension.", "title": "Medal of Honor Act", "date": "2025-02-26"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Madam Speaker, I rise today to recognize two exceptional  members of the United States Coast Guard from Port Security Unit 308 in  Gulfport, Mississippi.", "title": "Recognizing Bm1 Bradley Walker and Mk1 James Lang", "date": "2025-05-08"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "As chairman of the Transportation and Infrastructure Committee, we  are ready to do our part to produce a bill that fulfills President  Trump's border security agenda by providing funding for the United  States Coast Guard for drug and migrant interdiction.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "This includes: the  FAA Reauthorization Act of 2024 and other important aviation safety  legislation; multiple water resources development acts; Coast Guard  authorizations; public buildings and Federal office space reforms; and  pipeline safety reauthorizations, just to name a few of the things that  are out there.", "title": "Designating the House Press Gallery in the United States Capitol As the ``Frederick Douglass Press Gallery''", "date": "2025-06-09"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Coast Guard is essential to  protecting our Nation's maritime borders from threats like illegal  drugs, illegal immigration, and transnational crime.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-03-05"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "In November, the Coast Guard announced it seized 510,000 pounds of  cocaine in the eastern Pacific and the Caribbean since the start of  2025.", "title": "Resolution, to Remove United States Armed Forces From Hostilities with Presidentially Designated Terrorist Organizations in the Western Hemisphere", "date": "2025-12-17"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "But what you are doing to  the American people, what you are doing to FEMA, what you are doing to  the people who rely on their communities to be rebuilt, the TSA agents  that go to work every day, the Coast Guard, is shameful.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "It is millions of Armed Forces, Active-Duty Reserves, National Guard,  civilians supporting them, the Department of Defense, the Coast Guard,  the intelligence Agencies; they are keeping us safe now, like all  Federal employees, not knowing when they will get another paycheck.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-10-30"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Agencies like FEMA, the Coast Guard, the CDC, and the VA cannot  afford to be paralyzed by union red tape when lives are on the line.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I rise today to honor one of our  country's heroes, Coast Guard Rescue Swimmer Scott Ruskan.", "title": "Recognizing Uscg Petty Officer Scott Ruskan", "date": "2025-07-23"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "2351) to direct the Commandant of the Coast Guard to update the  policy of the Coast Guard regarding the use of medication to treat drug  overdose, and for other purposes.", "title": "Controlled Substance Onboard Vessels", "date": "2025-06-09"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "The Coast Guard will stop  getting paid.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}, {"senator": "John Thune", "party": "Republican", "sentence": "(2) Clerical amendment.--The table of contents in section 2       of the Coast Guard Authorization Act of 1998 (Public Law 105-      383; 112 Stat.", "title": "Harmful Algal Bloom and Hypoxia Research and Control Amendments Act of 2025", "date": null}, {"senator": "John Rutherford", "party": "Republican", "sentence": "Coast Guard stop two alleged drug smuggling operations in the Caribbean  Sea.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}]