[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Pharma spent on lobbying, or are we going to  stand with the American people? We will know that answer based on how  many cosponsors we get for my legislation that simply codifies Donald  Trump's executive order.                    Opposing Medicaid and NIH Budget Cuts\n\nMr. KHANNA. Mr. Speaker, I rise today to oppose the cruel budget cuts  on Medicaid…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…ownership rule recognized that and created a pathway for  them to access some entrepreneurial assistance, but only as a minority  partner with a permanent resident.\n\nThis rule codifies the new rule that 100 percent of the business must  now be owned by a U.S. citizen or permanent resident. That might sound  reasonable until you hear the real-world consequences.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…concerned that this NDAA will enable the Trump  administration's continued misuse of the National Guard and active-duty  military for domestic law enforcement purposes. The bill codifies  portions of several of President Trump's executive orders regarding  U.S. military activity on the Southern Border, including the  administration's establishment of new National…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…bodies. The resolution only established the Government of the PRC as a  representative for China at the U.N. It did nothing to define or  determine a role for Taiwan.\n\nThis bill codifies what has long been the United States' position;  that is, to oppose Beijing's actions to misinterpret and distort U.N.  Resolution 2758 and enable the United States to empower…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…goals. The bill authorizes the  existing  Office of Policy Analysis and Development at the NTIA and renames it  the Office of Policy Development and Cybersecurity. It also codifies  the responsibilities of NTIA in administering parts of the Secure and  Trusted Communications Networks Act and requires the office to  coordinate and develop policy initiatives…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693495/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…the Capital Markets Subcommittee, that being the  gentlewoman from Missouri (Mrs. Wagner). I commend her for her bill and  her work in general on these issues.\n\nThis bill codifies an SEC rule that allows any issuer to submit a  confidential draft of the registration statement for review by the SEC  staff. In doing so, it allows companies seeking to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692736/encouraging-public-offerings-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Under the present law, the retirement plan fiduciary is required to  make prudent investment decisions in the best interests of plan  participants and beneficiaries. The bill codifies two rules from the  first Trump administration that impose first-of-their-kind restrictions  on plan fiduciaries' abilities to consider what are called  environmental, social,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…when they have just increased  it? They are not addressing the cost of living in this country, the  single biggest issue. They are making it worse.\n\nMs. DeLAURO. This bill codifies the right of the Trump administration  to steal from vulnerable American communities, children, and the global  poor for the sake of handing even more money to billionaires.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…through the reallocation of spectrum,  spectrum like 6G, and its work on technical standards vis-a-vis China  and other international players.\n\nMoreover, this legislation codifies its international office to work  on tech issues raised in international venues, such as the EU and ITU,  public wireless supply chains, and national competitiveness issues.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…COURTNEY. Mr. Speaker, tomorrow the House of Representatives will  be taking up H.R. 4275, the Coast Guard Reauthorization Act of 2025.  That is legislation that updates and codifies changes and reforms to  America's oldest continuous maritime service, the Coast Guard. It is  actually called the first fleet because technically, actually the Coast  Guard…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…years. It authorizes automatic Selective Service System  registration for eligible men, making the system more fair and  efficient.\n\nI am especially proud that this legislation codifies the Women's  Initiatives Teams across all services. Women serve and lead in every  domain of our military. We cannot let Secretary Hegseth sideline them.  Making WITs permanent…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…critical care  for some of our most medically vulnerable constituents isn't just the  right thing to do. It is the smart thing to do.\n\nThe Chronic Disease Flexible Coverage Act codifies IRS guidance to  expand the safe harbor for high deductible health plans offering  predeductible care for chronic conditions. It lets employers offer  first-dollar access…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…lunacy is not going to end well.\n\nThat brings us to this bill to reduce the regulatory burdens that the  left has imposed upon our Nation's ability to prosper and advance. It  codifies President Trump's executive orders that identify the resources  that we can develop and calls forth the powers of prosperity that those  resources promise.\n\nIt restores freedom…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699690/critical-mineral-dominance-act"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…today  furthers this administration's goals of undoing the damage caused by  the previous administration, starting with the border. This funds the  President's priorities, codifies reductions and efficiencies, and  operationalizes border security and immigration enforcement investments  in the reconciliation process.\n\nMr. Speaker, let's start with ICE.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…day-to-day operations.\n\nThe Red Tape Hotline was created by following President Trump's  executive order, ``Unleashing Prosperity Through Deregulation.'' The  DUMP Red Tape Act codifies the executive order and ensures that small  businesses always have a reliable channel to be heard.\n\nThis bill strengthens Office of Advocacy's ability to deliver small  business…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…organizations that provide a real alternative to abortion.\n\nDemocrats say choice, choice, choice over and over, but they try to  deny women the choice to choose life.\n\nH.R. 6945 codifies the operations of TANF to ensure this funding  stream remains focused on its mission, helping needy families and  children, rather than serving as a tool for ideological gatekeeping.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…planned projects  under the existing continuity safe harbor and the beginning of  construction guidance in effect at the time of the law's enactment.\n\nThe statute expressly codifies what it means to ``begin  construction.'' Congress consciously elected to set the provisions  effective date by reference to ``beginning of construction'' because of  its…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…requirements, which will reduce costs without weakening  environmental protections.\n\nFinally, the Improving Water Quality Certifications and American  Energy Infrastructure Act codifies the historic nationwide permit  process under section 404, extends permit validity to 10 years, and  clarifies jurisdiction over dredge-and-fill discharges, providing  predictability…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…table to highlight the prohibitive red tape  regulations from across Federal agencies that hurt their ability to  grow and compete.\n\nMy bill takes that progress further. It codifies the hotline into law  and requires annual reports to Congress so that we know exactly which  rules are holding back growth and what steps are being taken to fix  them.\n\nI…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…administration. It  is critical that we get the capital necessary for U.S.-owned small  businesses to ensure they have everything they need to expand and grow.\n\nThis bill codifies both President Trump's executive order to end  taxpayer subsidization of open borders and Administrator Loeffler's SBA  7(a) program guardrails put in place earlier this year.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…work being done by  America's farmers and ranchers, ultimately strengthening our  agricultural production.\n\nThis bill before us today is a smart, bipartisan legislation that  codifies the partnership between DOE and USDA, ensuring that they can  continue to work together on these interindustry challenges.\n\nI thank Ms. Lofgren for working with me these past…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688981/doe-and-usda-interagency-research-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…states face when       attempting to assume their own permitting program.\n\nA key feature of Section 404 permitting is the Waters of       the United States rule. This bill codifies long-established       exclusions such as ephemeral features, groundwater, and prior       converted cropland that have been included as part of WOTUS       regulations over…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…freshman class president, and a very good friend.\n\nMr. Speaker, the rule further provides for consideration of H.R.  4090, the Critical Mineral Dominance Act, legislation that codifies  certain provisions of three executive orders by President Trump  relating to domestic mining and hardrock mineral resources.\n\nDuring our last election, voters across our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…illegal aliens.\n\nThe Trump administration has instituted a policy requiring SBA loan  applications to include citizenship verification provisions. It is  common sense. This bill codifies these Trump-era safeguards into law so  that no future administration can turn Federal relief into a global  giveaway.\n\nThis is about ensuring we have the validation mechanisms…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Act of 2025, introduced by my friend, Congresswoman Radewagen  from American Samoa.\n\nThis legislation, which was adopted by voice vote in the House in the  118th Congress, codifies updates to the South Pacific Tuna Treaty that  were first agreed to in 2016 and later adopted by the United States  Senate in 2022.\n\nThe United States first entered into this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…needs  for today's needs. It elevates the head of the NTIA to an  Undersecretary of Commerce to reflect the important role that NTIA  plays. It eliminates unnecessary reports, codifies two critical  offices, and authorizes NTIA for 2 years.\n\nMr. Speaker, I urge my colleagues to support H.R. 2482, and I reserve  the balance of my time.\n\nMr. BILIRAKIS. Mr.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…think this bill  is a very commonsense answer: Ask the people who are most affected. The  whole point of the red tape hotline that President Trump set up and  that this bill codifies and makes permanent is to allow the people in  the small business world who are affected by regulatory decisions made  in this town, our Nation's Capital, to tell somebody…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}]