[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…the Justice for  America's Veterans and Survivors Act, which I co-led with the gentleman  from North Carolina (Mr. Edwards). Our bipartisan bill will improve the  VA's data collection efforts on the prevailing causes of death among  veterans.\n\nAs a physician myself, I can tell you firsthand that thorough and  accurate data is critical to delivering the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…water managers and users have the information that they need to make  informed decisions and support the continued collaboration between  agencies and expanding snowpack data collection and forecasting  capabilities.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this bill, and I  yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697626/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…maximize our innovation potential. I want to  strengthen our commercialization efforts through allowing direct to  phase II authority for all Agencies, as well as better data collection,  better training, and specifically designated commercialization  officers. I want to increase the number of new entrants by  reauthorizing and codifying new programs that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…and pass my bill, the Purchased and Referred Care Improvement  Act.\n\nThis bill works to correct an all-too-common occurrence, which is  that Tribal members are referred to collection agencies because the  Indian Health Service failed to pay its bills.\n\nSometimes Tribal members utilizing the Indian Health Service will be  referred to an outside specialist…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690949/medical-debts-of-tribal-members"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…various       bills, but when his credit card number changed, some of the       automatic payments he had arranged for did not go through,       and the bills ended up in collection before he even knew he       was behind.\n\nPrior to the fire, he had always had a stellar credit       rating, but since this medical debt, it has gone down. In his…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…year.\n\nAdditionally, the new FPS tracking system has not worked well enough  to replace the old paper-based system, as my colleague has just  described. By improving FPS data collection and analysis and  implementing the findings on these security tests, the agency will be  able to better ensure the safety and security of Federal buildings,  employees, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…enhance liberty for the American people.\n\nOne of the things that I am deeply concerned about--and I am not sure  if this is the same database you are referring to--is a collection of  voter registration databases--is that the same? Yes--from across the  country.\n\nMr. MERKLEY. Yes, I will yield for a question.\n\nMr. MERKLEY. I appreciate that clarification…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…These coins crossed oceans, witnessed empires  rise and fall, and marked the turning points of human history, and they  rested largely unseen.\n\nIn New York, this priceless collection had few visitors, little  space, and no real home, but now these treasures are coming to  northwest Ohio to the world-class Toledo Museum of Art.\n\nThe American Numismatic…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the annual threat  assessment, which states the following: ``Russia's advanced cyber  capabilities, its repeated success compromising sensitive targets for  intelligence collection, and its past attempts to pre-position access  on U.S. critical infrastructure make it a persistent  counterintelligence and cyberattack threat. Moscow's unique strength…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…MATSUI. Mr. Speaker, I rise today to celebrate International  Plasma Awareness Week, an annual campaign dedicated to raising  awareness about the importance of source plasma collection, recognizing  the valued contributions of donors, and increasing understanding about  plasma protein therapies and the rare diseases they treat.\n\nAs co-chair of the Congressional…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696010/recognizing-international-plasma-awareness-week-2025"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…collecting data on gender  identity.\n\nData is not just numbers. Data is a story and reflection of those  lived realities of real people, and this amendment is to stop data  collection. It is clear that it is an attempt to erase the existence of  transgender servicemembers at the Department of Defense.\n\nWithout data collection, the Department of Defense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695230/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and even a few Republicans have a  solution: Extend the Affordable Care Act enhanced premium tax credits.\n\nMr. Speaker, what do House Republicans propose instead?\n\nIt is a collection of failed policies that would raise prices,  leaving an additional 100,000 people without insurance and restricting  access to abortion care, setting the stage for a national…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…on police  officers, aggression against police officers, and on officer mental  health.\n\nI salute Mr. Fry, a freshman to this body, for his stewardship of  this bill. The collection of this information is important and useful,  but the mere passive gathering of data does little or nothing to  actually improve officer effectiveness or public safety.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…equitable access to its  contracts for SDBs and businesses owned by minorities and women. GAO's  findings demonstrate that there is still much progress to be made.\n\nThe regular collection of information on federal advertising  contracts with SDBs and businesses owned by women and minorities is  essential to bridging the gap between what current statistics…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Mayo Peter Bartlett was an outstanding basketball player who played  in Europe and loved coaching young people in basketball. He was a jazz  enthusiast with an extensive collection of LPs. He has been a good  friend to many. For over 50 years, he and his wife, Ernestine ``Tina''  Conner, were parents of three children and five grandchildren.\n\nMr. Speaker,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…component thereof within a       State having jurisdiction over matters at a county,       municipal, or other local government level.\n\n(10) Sector.--The term ``sector'' means a collection of       assets, systems, networks, entities, or organizations that       provide or enable a common function for national security       (including national defense and…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…At that  point the debt gets so hard to manage. The Federal Reserve last week  took us from a 2.1 GDP down to 1.7. Just that movement is almost $200  billion a year in tax collection. Just that GDP reduction the Federal  Reserve calculated for the next 3 years, taking that out to 10, that is  more money than everything in our budget reconciliation.\n\nThe…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Youngblood was a strong advocate for bringing…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690716/recognizing-glen-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Hoffland was a strong advocate for bringing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Tyrone was a strong advocate for bringing in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…From pay raises for servicemembers to furthering innovation, slashing  bureaucratic red tape to doubling down on President Trump's America  First posture by authorizing the collection of funds to offset the cost  of U.S. forces in Eastern Europe, this legislation meets the mark and  then some.\n\nIt also makes ironclad commitments to deter aggression from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695112/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our community in  the aftermath of Hurricane Milton. In addition to providing countless  hours of direct support to neighbors and flood victims, she helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Ms. Mankotya was a strong advocate for bringing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690691/recognizing-jennifer-mankotya"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Arnold was a strong advocate for bringing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691077/recognizing-kristina-arnold"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…recognized utility that  exemplifies innovation, resilience, and exceptionalism in public  service.\n\nThe district supplies quality drinking water and provides reliable  wastewater collection, treatment, and export services to over 14,000  residents and 660 commercial and government sites. Their services play  a significant role in the function of the region and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…time to claim funds or credits that they  previously missed out upon.\n\nAdditionally, H.R. 1491 contains another provision that would prevent  disaster victims from receiving collection notices indicating that they  owe the IRS funds despite a postponement of tax filing.\n\nWhen someone suffers from a natural disaster, the last thing on their  minds is their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…section--''; and\n\n(C) by adding at the end the following new paragraphs:\n\n``(1) in the case of an educational institution or training       establishment with a time stamp database collection feature,       not fewer than 10, and not more than 15, business days of       notice; and\n\n``(2) in the case of any other educational institution or       training establishment,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…everything. It is more than just  the money we spend.\n\nMr. Speaker, we had months last year when we had to borrow money to  pay for our borrowing. That is partially because the tax collection  cycle goes up and down, but we raise your credit card. We raise your  car. We raise everything. When we screw up U.S. sovereigns, we make  bond markets nervous. They go…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "John Thune", "party": "Republican", "sentence": "…universities and institutions; and\n\n``(6) use cost effective methods in carrying out this       section.\n\n``(b) Integrated Coastal and Ocean Observation System.--The       collection of monitoring and observing data under this       section shall comply with all data standards and protocols       developed pursuant to the Integrated Coastal and Ocean…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Frazier was a strong advocate for bringing…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "French Hill", "party": "Republican", "sentence": "…rules and  pass the bill (H.R. 3351) to amend the Securities Exchange Act of 1934  to specify that actions of the Advocate for Small Business Capital  Formation are not a collection of information under the Paperwork  Reduction Act, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693954/improving-access-to-small-business-information-act"}]