[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…on a future Silicon Valley Bank, the  stablecoin issuers have a superior claim over every single person in  this room who has a legitimate deposit in that bank.\n\nMy colleagues have said that this has a one-to-one requirement,  except that it is not audited. There is only an audit requirement for  companies over $50 billion in assets, which is only two…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693832/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…relied upon by everyday  Americans in contravention of congressionally appropriated spending  bills, and the waging of a tariff war against the entire planet.\n\nAnd as my colleagues have said, it is a tariff war that gets  announced and then suspended and then delayed and then announced again  and then exceptions might be granted if we like you or not. It…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that  are subject to the legislative filibuster and debate and amendments  will all of a sudden be expedited procedurally--no amendments allowed,  very limited debate.\n\nColleagues, as I said here yesterday, it is not just the ``why''  Republicans are willing to endanger the health of Californians, it is  also the ``how'' they are doing it that is threatening.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…them differently. We  would like to negotiate.\n\nI am completely open to that, but I do think we ought to try to fix  them.\n\nI am heartened that a number of Republican colleagues have said: You  are right. We should do that.\n\nI have said to my Republican colleagues: Coming up with a fix, even  if both sides want a fix, I know this is not going to be a…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…in our communities.\n\nWhat did we hear from our colleagues across the aisle?\n\nDid they stand up to DOGE and object to this defunding of the police?\n\nNo, Mr. Speaker. Our colleagues said absolutely nothing, and I mean  that literally.\n\nDuring the Judiciary Committee markup of the reconciliation bill,  Democrats offered a simple amendment to immediately…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, many of my colleagues have said  that this bill, the SAVE America Act, and the constant attempts by  Republicans to clamp down on voter fraud solves a problem that doesn't  exist. I couldn't disagree…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…later pled  guilty to attacking officers, including Mr. Tate, with bear spray and a  metal whip.\n\nYou heard a moment ago that our President and some of our Republican  colleagues said that this was a tourist event, but I know not many  tourists bring bear spray and whips to the Capitol. The man who  attacked him was also a fugitive from justice at the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…concern of  health insurance premiums doubling or tripling so that millions of  people could lose coverage; under this thing called the Big Beautiful  Bill, my Republican colleagues here said: Well, we are going to have  the largest cut in Medicaid funding since the program has been created.\n\nIn addition to that, how about my Republican colleagues saying:…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…an attack on religious  organizations doing what they feel compelled by their faith to do.\n\nIt is my prayer that the entire rescission bill fail for the reasons  my colleagues have said--a deal is a deal, and we shouldn't backtrack  on it. But if we can't defeat the entire rescission bill, it is my hope  that we will allow organizations like Catholic…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…tried to defund the police.\n\nOn the other hand, my good friend, I believe, participated in--and if  he didn't, I am happy to stand corrected, but I know a bunch of his  colleagues said they wanted to defund the FBI, just like those who want  to defund the ATF and shut it down right now, so that is a reality.\n\nIn any event, why don't we talk about what…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…for Public Broadcasting, which is PBS, NPR, and local public television  and radio.\n\nThis is not just an attack, though, on PBS and NPR, as so many of my  Republican colleagues have said. The majority knows full well that more  than 70 percent of this cut will be felt by the local radio and  television stations in their own communities and across the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Let's not vote at all. Let's overturn the  congressional and constitutional history that says we only go to war  with Congress and try to hide in the grass.\n\nMany of my colleagues have said things about Iran and how bad Iran  is. None of them have ever introduced an authorization for war against  Iran. If Iran is so bad, do that.\n\nPeople in this body would…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…number because the Federal criminal laws would be organized around  certain  specific principles forbidding criminal conduct that is clearly harmful  to everyone. As my colleagues have said, what we have seen is the  endless proliferation of criminal offenses, some of them statutory,  some of them regulatory, oftentimes in a kind of political reaction to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…filibuster-free pathway for one  purpose, and that is to reduce deficits--only to reduce deficits.\n\nAnd then my colleagues, 22 years later, across the aisle--my  Republican colleagues--said: Well, you know, we want a filibuster-free  pathway to do tax cuts which will increase the deficit. And they  brought in a new Parliamentarian in order to get a ruling…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…and Related Agencies  Appropriation Act, all of which help make the United States of America  more viable when it comes to energy and makes those electric prices  that my colleagues said was one of the bigger concerns that she heard  when touring around the Commonwealth--the cost of those energy prices  will go down if we pass this rule and pass the underlying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…they can  refuse an illegal order; Members of the Senate and House investigated  for seditious behavior, which our President claims is punishable by  death.\n\nMany of my colleagues have said: Pay no attention to what the  President says; pay attention to what he does.\n\nI will say: I am paying attention to what he is doing because, in  addition to a steady…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…of Social Security, nothing. In fact, President  Trump has over and over again said that he will not touch the sanctity  of Social Security. I have said that, and our colleagues have said  that. We have done nothing.\n\nPutting out false information to the American people is really  unfortunate because it does frighten people. However, we have the facts…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…know the truth. The Biden-Harris  administration was a relentless assault on our economy, our national  security, and our energy independence.\n\nToday in Rules, one of our colleagues said they are always left to  clean up Republicans' mess. No. It is the Republicans who have to clean  up the Democrats' mess.\n\nUnder the Biden-Harris administration, they…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…multitrillion-dollar tax increase on the American people.\n\nNow, there have been a lot of crazy allegations made about what the  budget actually did or did not do, while some of our colleagues have  said that the American people don't want to see their tax cuts  extended, which is false, and I don't know who they are talking to. And  then they claim that the extension…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "Mr. PALMER. Mr. Speaker, I want to address some of the things my  Democratic colleagues have said. They are really high on China. They  look at China as a model for America. Apparently, they like how they do  their economy. They like their energy production.\n\nI would…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…again, how excluding the value of an employer-sponsored childcare  subsidy in the calculation of an employee's regular rate will result in  lower take-home pay as my colleagues have said on the other side.\n\nThe issue this legislation attempts to fix is that in many cases,  employers are currently unable to offer childcare to employees due to  the prohibitively…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…population. Yet, they are  dictating in many ways to the rest of the country because of the  oversized import of the California economy, et cetera.\n\nThe bottom line is that my colleagues have said in the last few  minutes that this is somehow a States' rights issues. This is not a  States' rights issue. This is the creation of a superstate: California.  We have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…students to know the rights given to them under Title IX  without creating excessive regulations or requirements for colleges and  universities.\n\nDespite what some of my colleagues have said today, the Pregnant  Students' Rights Act doesn't promote a certain viewpoint or ideology.  It simply affirms a basic principle, and that principle is that  pregnant…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Republicans  propose.\n\nEver since the Big Beautiful Bill was signed into law, and even when  lawmakers were working hard to make it over the finish line, our  Democratic colleagues said that they found political gold in this bill  and that this would be the pathway for them to win back the majority in  the House of Representatives in 2026. And, of course,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…enter into a  colloquy with the gentleman from Mississippi (Mr. Kelly).\n\nIs the gentleman trying to tell the American people that it is only a  minor rule, as one of our colleagues said, it is only a minor rule if  it doesn't apply to you?\n\nI yield to the gentleman from Mississippi (Mr. Kelly) for a response.\n\nMr. GRIFFITH. Also, if it doesn't take your…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}]