[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…businesses to sell  to the Federal Government.\n\nOur bill makes commonsense fixes that we can all support on both  sides of the aisle. I look forward to working with my colleagues to  pass this bill that will save American taxpayers money, support small  businesses, and spur economic innovation.                        Recognizing Loudoun Wildlife Conservancy…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…coverage cliff  because, on January 30, Medicare telehealth coverage will end, and many  patients will have to see their doctors in person only.\n\nThat is why I am urging my colleagues to pass the CONNECT for Health  Act and make telehealth coverage permanent. This is common sense. It  lowers costs, and it means less emergency room visits. Everyone wins.\n\nWe…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…logistical  challenges to both NPS and Forest Service; therefore, both Agencies, as  well as local stakeholders, support this land exchange.\n\nI look forward to working with my colleagues to pass this  straightforward legislation to better manage the land in and around  Ackerson Meadow.                               By Mr. DURBIN:\n\nS. 2889. A bill to promote minimum…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…authorization.\n\nThis body should not sit idly by while the President makes a mockery  of our Constitution and our laws. We--only we--have the power to  declare war. I urge my colleagues to pass our bipartisan amendment and  repeal these outdated AUMFs.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…important that this program and others that are included in  this bill actually reach the communities that desperately need the  assistance. That is why I urge my colleagues to not only pass this  bipartisan legislation but also to continue to advocate for its  implementation.\n\nJust a few weeks ago, I visited a federally qualified health center  in my…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, I rise today to urge my colleagues to pass  this legislation to prevent families' healthcare costs from  skyrocketing.\n\nI will share just a few messages from my hardworking constituents who  will be impacted.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698787/breaking-the-gridlock-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…people right now. We should be  building on that progress by  making improvements to these programs, not making them harder.\n\nSo we are all calling on our Republican colleagues to pass our bill.  And if they can bring themselves do that, or at least to sit in a room  and negotiate and actually get this done--the President prides himself  in the ``art…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…in  the race for cutting-edge technology, driving down costs and empowering  smaller carriers to build stronger, more resilient networks.\n\nMr. Speaker, I encourage my colleagues to pass the Open RAN Outreach  Act.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…shouldn't  be picking out some departments and not others.\n\nThis is just simply making sure that this is a bipartisan effort to  fund local police officers.\n\nSo I ask my colleagues to pass these bills as I amend them so that we  can refocus on the urgent work of reopening the government and then  providing all law enforcement agencies with the resources…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…in my  district.\n\nRepublicans were willing to let this happen to Americans across the  country, regardless of political affiliation.\n\nI am proud to have voted with my colleagues to pass Leader Jeffries'  bill to extend the ACA tax credits and protect healthcare, but our work  is not done. The Senate needs to take up this bill immediately so that  Americans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "Mr. LUJAN. Mr. President, I rise today to ask my colleagues to pass  my Keep SNAP and WIC Funded Act of 2025, which has the backing of the  entire Democratic caucus--the Democratic Members of this Senate.\n\nNow, we all know access to food…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…depend solely  on geography or jurisdiction.\n\nThe protection of our children from monstrous crimes transcends  political television. I call on each and every one of my colleagues to  pass this legislation and send a very clear and strong message that the  exploitation of children will be met with the full, unyielding,  inescapable force of justice. This…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698896/child-predators-accountability-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…for their work on this  logical legislation that supports our students and our economy. This  bill passed the House in the 117th and 118th Congresses, and I urge my  colleagues to pass it again today.\n\nMr. BABIN. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, as teachers prepare the next generation of American…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…China's atrocities. I thank the  gentleman from Texas (Mr. Moran) for his leadership.\n\nWe must pass this bill and say with one voice: Not one more dollar.\n\nI urge my colleagues to pass this bill, and I yield back the balance  of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…California to continue its abuse of its  standing in the Clean Air Act to limit consumer freedom. It is time  that we overturn this dangerous rule.\n\nMr. Speaker, I urge my colleagues to pass this legislation to protect  our auto industry, to protect our autoworkers, and, most importantly,  to protect the freedoms of all of America.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…daddy died. I am very close to Steve. Even  though our political allegiances are about as far apart as they can  get, he is still my good friend.\n\nMr. Speaker, I urge my colleagues to pass this bipartisan bill and  restore public trust in TVA.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…am  almost at $11,000 with my mutual fund. Mainly, I trade baseball cards  and comic books on eBay, and that is currently my portfolio.\n\nPresident Trump said that if my colleagues pass the bill banning  stock trading for Members of Congress, he would sign it. Let's see if  we have the guts to stand up and do what is right.\n\nWhen I was mayor of Knox County,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…government to act with a shred of  discipline. This is about more than numbers. It is about trust. It is  about respect. And it is about time.\n\nMr. Speaker, I urge my colleagues to pass this bill and prove that  Congress can still do the right thing.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692549/rescissions-act-of-2025"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…American intelligence agencies  any and all financial investment data so we can ensure they remain free  of the exploitation of hostile foreign influences.\n\nI urge my colleagues to pass this bill, not just because it makes  sense, but because it will put our adversaries on notice that we are  watching them. Most importantly, it will protect our Nation's…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689030/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…rise today to celebrate $181 million  in rural healthcare funding for the State of Washington.\n\nNot long ago, right here in this Chamber, I joined my House  Republican colleagues to pass the Working Families Tax Cut Act, the  largest tax cut in American history.\n\nWhen we voted for this, we also voted for a new rural healthcare  fund, and $181 million…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the death and destruction of the American  people, should we not also guarantee the integrity of our elections by  passing yet again the SAVE Act, pushing our Senate colleagues to pass  the SAVE Act, and send it to the President's desk, which would simply  guarantee that only American citizens vote in American elections?\n\nIt is that simple. Shouldn't…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…everyone else.\n\nMr. WALBERG. The Rescissions Act would prioritize the needs of  American people instead of funding far-left foreign initiatives.\n\nMr. Speaker, I urge my colleagues to pass this bill, which represents  a vital step in reining in wasteful spending and Big Government abuse  of the taxpayer.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693709/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…conservative reforms in  modern history, and that is exactly what we are doing.\n\nThis isn't our moment, Mr. Speaker. This is the American people's  moment.\n\nI urge my colleagues to pass this bill and open up that gateway to a  new golden age of America.\n\nGod bless America. Go west Texas.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…enforcement with the clarity,  consistency, and tools necessary to hold offenders accountable and  prevent future harm.\n\nIn closing, Mr. Speaker, I encourage all of my colleagues to pass  H.R. 6719, the Combating Online Predators Act, and I yield back the  balance of my time.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…yields back his time.\n\nMr. BAUMGARTNER. Mr. Speaker, I thank Representative Meeks for this  fine piece of legislation and appreciate his bipartisan spirit.\n\nI urge my colleagues to pass the Haiti Criminal Collusion  Transparency Act and make clear that the United States will expose and  hold accountable those who fund, enable, and profit from gang violence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and  General Government; Labor, Health and Human Services, and Education;  National Security; Department of Defense; Transportation, Housing and  Urban Development.\n\nColleagues, when we pass this package and when it is signed into law  on top of the previous packages, we will have funded 96 percent of all  of government.\n\n(Applause.)\n\nMr. President, the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…sewer blockages.\n\nI appreciate Chairperson McClain's efforts to advance the WIPPES Act,  along with Senator Merkley and Representative Mullin.\n\nMr. Speaker, I urge my colleagues to pass this bill, H.R. 2269, and I  reserve the balance of my time.\n\nMr. BILIRAKIS. Mr. Speaker, I have no additional speakers, and I  reserve the balance of my time.\n\nMr. BILIRAKIS.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}]