[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…an important assurance  and guarantee.\n\nMr. Speaker, I urge support for this bill, and I reserve the balance  of my time.\n\nMs. RANDALL. Mr. Speaker, I urge my colleagues to support this  important legislation, and I yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…us for this important piece of  legislation. Again, I thank Representative Cammack for being such a  great bipartisan partner.\n\nMr. Speaker, I urge all of my colleagues to support this important  bill.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692715/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…risk of wildfires, this is an important step. I am glad to be able to  work with my colleagues across the aisle to get this done.\n\nMr. Speaker, I urge all my colleagues to support this important piece  of legislation.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…tireless advocacy, H.R. 842 is the most cosponsored  bill in the 119th Congress with 339 cosponsors in the House and 68  cosponsors in the Senate.\n\nI ask my colleagues to support this important legislation. Rest in  power, my sweet mother. We will beat cancer.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…future generations about the importance of preserving these plants for  the benefit of our Nation's biodiversity and cultural heritage.\n\nI encourage all my colleagues to support this important initiative.  Mr. Speaker, I ask for your cosponsorship of this resolution and for  your partnership in raising awareness about the conservation and  appreciation…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Van Drew  from New Jersey and Congresswoman Goodlander from New Hampshire, for  working with me to improve SBA's Office of Advocacy.\n\nMr. Speaker, I urge my colleagues to support this important  bipartisan bill.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687956/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…advanced a War Powers  Resolution to rein in President Trump's unauthorized military actions  in Venezuela. This week, we will vote on final passage. I urge my  colleagues to support it.\n\nIt is important to recall how we arrived here. What happened on  January 3--the military raid in Caracas, the capture of Nicolas Maduro,  and the President's declaration…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…ownership.\n\nThis bipartisan bill, which I have introduced with my colleague  Congressman Robert Bresnahan, will help empower small businesses  nationwide. I urge my colleagues to support this important initiative  that will make employee ownership more accessible, foster stronger  communities and keep business wealth where it belongs--locally.\n\nMahalo.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690133/introduction-of-the-esop-funding-for-sba-position-act-of-2025"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…workforce by 43 percent will impede  the SBA's ability to recover the improper and illegally obtained  payments.\n\nMr. Speaker, having said that, I urge all of my colleagues to support  this very important legislation. I thank my colleague, Representative  Downing, for allowing me to lead this important piece of legislation  with him.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…role of Native Hawaiian organizations, many of  which possess traditional ecological knowledge that is vital for  successful conservation outcomes.\n\nI urge my colleagues to support this important bill that will help  secure the future of Hawaii's native species for generations to come.  By working together, we can protect one of the world's most exceptional…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…bipartisan and commonsense solution to help our small businesses more  successfully navigate the Federal contracting process.\n\nMr. Speaker, I urge all of my colleagues here to support this  important bill.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…compromise the systems that support our way of life.\n\nWe cannot let a bureaucracy stand in the way of defending our  Nation's cybersecurity. I strongly urge my colleagues to support this  important legislation.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…increase accountability across the  Federal workforce. Public funds should serve the American people, not  private union interests.\n\nMr. Speaker, I strongly urge my colleagues to support this important  bill.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…infrastructure, it is  about protecting our economy, safeguarding national security, and  ensuring American ports remain under American control.\n\nMr. Speaker, I urge my colleagues to support this very important  piece of legislation.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the people that  we are honored to represent.\n\nAgain, my thanks to the leadership and to the committee members and,  of course, to our great staff. I urge my colleagues to support this  important package.                              Vote on H.R. 7148", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…entrepreneurs. The SPUR Act will provide  transparency and accountability, ensuring that the Federal Government  is doing its part to support small businesses. I urge my colleagues to  support this important legislation.\n\nMr. Speaker, you are from the great State of New York. Forty-five  years ago tonight, Team USA, led by Herb Brooks and 12 Minnesotans,  beat Finland…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…families.\n\nIn closing, I thank my colleague Judge Carter for crafting a bill  that keeps our promises to the veterans and our troops.\n\nMr. Chair, I urge all of my colleagues to support this important  bill.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I yield 2 minutes to the  gentlewoman from Texas (Ms. Escobar), a new member of the  Appropriations Committee.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692941/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…H.R.\n\nMr. COMER.  Mace), the chairman of the Cybersecurity,  Information Technology, and Government Innovation Subcommittee.\n\nMr. COMER. Mr. Speaker, I urge my colleagues to support this  important legislation, which will streamline cybersecurity  vulnerability disclosure to protect Federal IT systems.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the House  companion bill and leading the charge in this Chamber. I encourage my  colleagues to once again support S. 160.\n\nMr. COMER. Mr. Speaker, I urge my colleagues to support this  important legislation, which will protect our brave aerial firefighters  across the country.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…critical element of job creation and economic  opportunity here in the United States. Congress must not cede its  responsibility.\n\nMr. Speaker, I urge all of my colleagues to support this important  legislation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693769/digital-asset-market-clarity-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…commonsense way to gather input directly  from the people most harmed by overregulation to allow Congress to take  meaningful action.\n\nMr. Speaker, I urge all of my colleagues to support this important  piece of legislation and stand with America's small businesses.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…global energy  arena. H.R. 1949 ensures that American energy remains affordable and  accessible, keeping it unmatched on the world stage.\n\nMr. Speaker, I urge my colleagues to support this important piece of  legislation.\n\nMr. GUTHRIE. Mr. Speaker, I should have introduced my good friend  from Texas (Mr. Babin) as a colleague and fellow chairman, the chairman…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…law is a dangerous policy. Only American  citizens should be permitted to vote in this country, especially right  here in the Nation's Capital city.\n\nI urge my colleagues to support this important legislation to  prohibit those who are not citizens of the United States from voting in  elections in the District of Columbia.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692313/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…energy security.\n\nMr. Speaker, did I mention that we can build the pipelines that keep  energy available and affordable for Americans?\n\nMr. Speaker, I urge my colleagues to support this important  legislation.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…discrepancies.\n\nLike other areas of the law, citizens will be able to use  combinations of existing identification documents in order to register  to vote. I urge my colleagues to support this important legislation.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…that is the good that overcomes evil.\n\nMy thoughts and prayers go out to the Hortman and Hoffman families  during this time of tragedy.\n\nMr. Speaker, I urge my colleagues to support this important  resolution.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}]