[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…on behalf of the Congressional Asian Pacific  American Caucus, I rise in strong opposition to H.R. 881. This bill  would block Department of Homeland Security funding from colleges and  universities with a Confucius Institute, which is known to have CCP  ties, but it expands the prohibition to any institution that has a  relationship with a Chinese entity…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…products and distributing  them to people in need around the globe. If Republicans pass this bill,  those farmers will lose.\n\nFeed the Future also partners with universities and colleges across  the United States to operate innovation labs that draw on their  expertise to tackle the world's biggest challenges to food security.\n\nInstitutions like Michigan State…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…focused their philanthropic work on anonymously providing grants to  priorities such as cancer research, the Red Cross, and a pioneering  project to assist historically Black colleges. Over the years, this  institution has evolved into a much more expansive enterprise, allowing  flexibility to engage in a variety of community issues and inform the  public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…students, many from middle-class  families. Cuts to programs like Head Start, Title I, and after-school  STEM enrichment don't just hurt, they derail students' futures.\n\nTexas colleges and universities share one of the largest enrollments  compared to almost any other State. Yet, under Trump's budget, millions  of them would lose access to workstudy jobs…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…today. The current protections  against Chinese intellectual property theft through Confucius  Institutes have worked, and Congress should not place additional  burdens on our colleges, universities, and their students.\n\nMr. Speaker, instead of addressing the harms of the President's on- again-off-again tariffs, or working to address rising costs for  American…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Education. I don't know about you, but I have young  people in my family who are excited about going to college, and they  are also scared because they don't even know if the colleges are going  to stay open.\n\nI am not just talking about elite Ivy League institutions. I am  talking about community colleges; I am talking about state colleges. I  am talking…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…when I thank him for the lasting impact he made on  higher education in Colorado throughout his career.\n\nChancellor Garcia oversees a higher education system encompassing 13  colleges, over 35 campus locations, and more than 124,000 students.  During his tenure, he launched Bridge to Bachelor's, a statewide  transfer program guaranteeing a direct pathway…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692493/congratulating-chancellor-joe-garcia-on-his-retirement"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…service came at great risk. The plane we see there, he  liked to fly privately also and would wear a scarf around his neck. He  was a great teacher, and he managed community colleges after his  service.\n\nDuring one of his many missions, his plane was shot down in battle,  and he was captured as a prisoner of war. Even in captivity, Harold  never wavered…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…understaffed VR&E program and will also allow  the future expansion of the VSOC program, which has been limited by the  availability of VR&E counselors.\n\nMr. Speaker, many colleges and universities and Members of Congress  are asking for VSOC staff on their campuses and in their district  because they have seen firsthand the impact a VSOC can have. By…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…it and get closer to  death than they thought, many have actually died in those  circumstances.\n\nLegislators voted for those laws. We have to note that we should not  allow colleges to withhold information that could save women's lives.\n\nMr. SCOTT of Virginia.  Bonamici).\n\nMr. Speaker, in closing, since the Supreme Court overturned Roe v.  Wade, State…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…education system. We  have Silicon Valley, the entertainment industry, and huge biotech  industries. Those are all fueled by the education that our UC system  and our private colleges provide. However, because of this budget, so  many young people who today are able to achieve that education and  power our economy in California, which powers the United…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…science and plastic engineering. Partners in the Tech Hub  are also investing in industry-led workforce training programs in  collaboration with universities and community colleges.\n\nStrong coordination with the labor units through the Tri-County Labor  Council within the region ensures the creation of good-quality jobs for  workers from all educational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…consequences.\n\nBy investing in policies that protect Jewish students, like fully  funding the Education Department's Office for Civil Rights to fund  investigations and hold colleges and universities--and, quite frankly,  schools across the country and secondary schools--tolerating anti- Semitism accountable, we can support all students' ability to live…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…financially destabilizing and having a disproportionate       impact on those who provide care to underserved and rural       communities.\n\nAssociation of American Medical Colleges, AAMC:\n\nWe remain extremely concerned that the budget resolution's       reconciliation instructions would result in unsustainable       cuts to Federal healthcare programs--specifically…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…groundwork to  eliminate the entire Agency.\n\nAnd on Valentine's Day, President Trump's Department of Education  threatened to cut Federal funding from public schools, as well as  colleges and universities, if they did not eliminate any program that  the Trump administration deems as promoting diversity, equity, and  inclusion.\n\nDuring her confirmation hearing,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "James Risch", "party": "Republican", "sentence": "…infiltrate  the United States. Most people in America have no understanding about  the tremendous amount and the millions of dollars that the Chinese  Government pumps into our colleges and universities here in the United  States. I myself and others have long been trying to put a stop to  this. No foreign government can come into our political system and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…every week. I did his shows often. I  did his show 2 days before the assassination. We talked about that he  was going to be going to another college to visit. I have gone to  colleges to visit, and it is uplifting. But Charlie would go, and he  would take anybody's question and have a conversation with them. He  just was the most wonderful person to talk…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695709/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…used our own universities to  advance agendas that hurt American security.\n\nAside from the state of Qatar, there is probably no other country in  the world that finances U.S. colleges and universities more than the  People's Republic of China. They use this all-access pass to steal our  intellectual property, abuse our student visa programs, and prop up…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…may have gone home to be with the Lord, but his work here on  Earth won't stop.\n\nI am glad to see that Turning Point has had more than 54,000 requests  for new chapters at colleges and high schools across the country.\n\nI have a granddaughter Rosie Gracie, and I will absolutely encourage  her to get involved in Turning Point when she is just a little…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Service, and for similar Agencies.\n\nI think we did really good work within the bill to advance some of  the public safety and justice initiatives. We strengthened Tribal  colleges and universities. We addressed the scourge of missing and  murdered indigenous women and children. A focus on ensuring the safety  of our Native peoples was a priority--but,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…four centers in  Cochise County and is known for its affordable tuition, small class  size, and programs that lead to real-world success. Cochise College  embraces what all colleges should strive to be in this amazing country.\n\nA product of community college myself, I know firsthand that Cochise  College remains committed to helping students create bright…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…support.  Some even fear punishment and a loss of scholarships simply for  carrying their baby to full term while taking classes.\n\nThe Pregnant Students' Rights Act requires colleges and universities  to inform pregnant women of their rights and protections. This includes  information on modified class schedules or excused absences.\n\nThis bill also requires…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699318/pregnant-students-rights-act"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…the student but vital to ensuring a strong future  for her child, for our next generation.\n\nThe Pregnant Students' Rights Act amends the Higher Education Act to  require our colleges and universities to clearly distribute information  about pregnant students' rights and available resources through student  handbooks, emails, websites, and orientations,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…college campuses but across our K-12 schools, as well. This is not only  an attack on education and academic integrity, it is a threat to our  national security.\n\nAcross U.S. colleges, the CCP established Confucius Institutes to  push false narratives, whitewash history, and endear American students  to the CCP while obscuring its brutal human rights abuses.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Mr. Speaker, as you have heard from my colleagues, the CCP has also  systematically expanded its influence throughout Confucius Institutes  and affiliate programs on U.S. colleges and campuses. These programs,  often cloaked in the promises of language and cultural exchange, have  served as vehicles for espionage, intellectual property theft, and  transnational…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…repression, and  influence academic institutions to the benefit of the CCP.\n\nAt their peak, the United States hosted approximately 118 Confucius  Institutes, primarily at colleges and universities. Now, there are  fewer than 14 active Confucius Institutes today, but the danger still  remains. Many of these programs have rebranded themselves within…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…MESSMER. Mr. Chair, I rise today in support of the DETERRENT Act.\n\nThis important legislation will bring vital transparency and  accountability to gift reporting requirements for colleges and  universities.\n\nFor decades, the Chinese Communist Party, Iran, and Russia have  targeted America's college systems by pushing dangerous propaganda  aimed at influencing…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689030/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…modernize at the speed of  warfare. He also helped enact an important law to grant military  recruiters the same physical access to high school campuses in the same  manner as colleges and industries, which allowed our Nation's Armed  Forces to adequately address its recruiting crisis. I would like to  thank Rob for his continued selfless service and contributions…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…democracy and  liberty, their tuition dollars may be funding governments that stand  against these very ideals.\n\nThis isn't hypothetical. This is happening. Since 2013, U.S. colleges  and universities have received over $1 billion from Chinese Communist  Party-affiliated sources. In return, we have seen professors silenced,  student groups threatened,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…branch of government.\n\nThis should be concerning for all of us.\n\nI would like to commend efforts in my home State of Iowa to promote  civic education and participation in our colleges and universities.  These include Cyclone Civics at Iowa State University, Hawk the Vote at  the University of Iowa, and the Center for Civic Education at the  University of…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693285/civic-education"}]