[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…health and wellness.  It is full of examples, stories, and research.\n\nFor today's children and young adults who will be tomorrow's leaders,  I urge all of my colleagues on both sides of the aisle to support the  bipartisan Arts Education for All bill. For those keeping track, it is  H.R. 2485, and to fully fund the Every Student Succeeds Act, especially…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…incredible honor, integrity.\n\nAnd even at this challenging moment in this country's history, we  need this body to be able to come together.\n\nSo I call on all of my colleagues on both sides of the aisle to  condemn this action, to stand united with one voice, standing up for  ourselves. Otherwise, we will just cast ourselves to the margins of  irrelevance in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…with reluctant conviction. That  reluctance is because I am deeply concerned that this House is not  living up to the Founders' goals.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  examine their conscience, renew their courage, and carry out the  responsibilities that the first Article of the Constitution demands.  Only in that way…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…data.\n\nWhile this bill will have a modest but meaningful improvement to  Social Security's customer service to the victims of identity theft,  and I urge my colleagues on both sides of the aisle to vote for this  legislation, I want them to think more deeply about what we need to do  in the atmosphere that we are in now to protect Americans' Social…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Representative Moulton for his leadership on this issue and  encourage my colleagues to support this legislation.\n\nMrs. DINGELL. Mr. Speaker, I strongly recommend my colleagues on both  sides of the aisle support H.R. 859, the Informing Consumers About  Smart Devices Act, and protect Americans' privacy.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Steny.\n\nMr. Speaker, his deep knowledge of the institution, respect for its  traditions, and commitment to public service have earned him the  admiration of colleagues on both sides of the aisle.\n\nPersonally, Steny has not only been a trusted partner in leadership  but a dear friend. He mentioned the Presidency of John F. Kennedy. When  President Kennedy…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…read it later--about John McCain in the prison camps.\n\nI wasn't here when we had this moment. But when I got here weeks  after this moment, Mr. Leader, all my colleagues on both sides of the  aisle talked about a special conference in the Old Senate Chamber. I  was not there, but the Democrats and Republicans--it actually changed  our behavior in here.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…NIH's medical       research budget, year after year, we'll light up the       scoreboard.\n\nSo I took that message and went back to Congress. With the help of  colleagues on both sides of the aisle--Republican Senator Roy Blunt,  Republican Senator Lamar Alexander, and Democratic Senator Patty  Murray--we increased NIH funding from $30 billion to $48 billion…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…not just  possible, but it is necessary. The choices that we make in the coming  months will shape global security for decades to come, so I urge all of  my colleagues on both sides of the aisle to recommit to arms control,  to verification, and to the hard work of reducing nuclear risk.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…like the Wilmington PAL remind us that public safety  and public opportunity go hand in hand. I am proud to stand with them,  and I will keep working with my colleagues on both sides of the aisle  to expand the resources that make their mission possible.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692994/wilmington-police-athletic-league"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…against the sabotage of our democracy, and uniting at  rallies, townhalls, and every other forum available to make your voice  known.\n\nI will be reaching out to colleagues on both sides of the aisle and  coming to the floor and reaching out to the American people. Just as we  threw off the yoke of monarchy 2\\1/2\\ centuries ago, the American  people still…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…families in the United States.\n\nThat is the path that I am taking. It is the path that I know my  colleague, Congressman Deluzio, is taking, and I hope that my  colleagues on both sides of the aisle will join us in this effort.\n\nMr. Speaker, I thank the gentleman for organizing this effort.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…extend the credits, which will again lower  the costs for millions.\n\nI hope that we can get a similar type of compromise through in the  Senate. I know there are colleagues on both sides of the aisle working  hard on that issue right now.\n\nWhile the credits have taken up most of the space around the debate,  what I rise today on--the CRA that will be voted…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…healthy and safe by this research.\n\nThis does not have to be partisan. This does not have to be  controversial in any way. Mr. Speaker, I call on all of my colleagues  on both sides of the aisle to stand up for science, research, and  innovation because standing up for science means standing up for the  health, safety, and prosperity of every American.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…body over decades will be  continued. It needs to be strengthened. It has frayed, but  bipartisanship has always characterized support for Israel.\n\nI hope my colleagues on both sides of the aisle will treat this day  not only with the solemnity and seriousness that it deserves but also  with a renewed commitment to make this cause bipartisan, the pursuit…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…businesses the confidence to enter  the public markets and helping them reach new investors, expand  operations, and create jobs across our country.\n\nI thank my colleagues on both sides of the aisle and my Democratic  cosponsor, Mr. Meeks, for supporting these efforts to modernize our  capital markets.\n\nMrs. WAGNER. Mr. Speaker, I am prepared to close,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…thank the great members and staff of the Small  Business Committee for working with me in bringing this bill to the  House floor today.\n\nMr. Speaker, I ask my colleagues on both sides of the aisle to vote  ``yes'' on this practical and sensible piece of legislation.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692066/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…It thanks them and affirms  that their sacrifices are worthy of our continued support.\n\nThis resolution has strong bipartisan backing, and I thank all of my  colleagues on both sides of the aisle who have joined as cosponsors.\n\nDuring National Police Week, let me say this to every police officer,  firefighter, EMT, dispatcher, and emergency responder:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…provisions permanent and stops payments to deceased individuals moving  forward.\n\nMadam Speaker, this bill is a big step toward accountability, and I  urge my colleagues on all sides of the aisle to join me in supporting  this vital antifraud, antiwaste, antiabuse legislation.\n\nAs the saying goes: You can't take it with you, so let's stop writing  checks…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…private sector and allowing individuals with boots-on-the- ground experience to inform law enforcement's efforts and strategies.\n\nBecause of that, I urge all my colleagues on both sides of the aisle  to join me in supporting this good bill, and I reserve the balance of  my time.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…heartland, in my home State of Iowa. It is creating American jobs while  protecting American troops.\n\nI thank Chairman Calvert for his leadership and urge my colleagues on  both sides of the aisle to support these amendments.\n\nLet us give our servicemembers the tools they need to succeed and  honor their sacrifice by defending them on the front line as…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693653/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I sincerely thank my colleagues on both sides  of the aisle for their work on this piece of legislation.\n\nMr. Speaker, I rise today in support of my bill, H.R. 3497, the Medal  of Sacrifice Act. Its purpose is singular.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…retain their talent, experience, and  expertise.\n\nMr. Speaker, the Ways and Means Committee approved this legislation  with unanimous consent, and I encourage my colleagues on both sides of  the aisle in the House to do the same.\n\nMr. SMITH of Missouri. Mr. Speaker, on that I demand the yeas and  nays.\n\nThe yeas and nays were ordered.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…hope and healing by putting a stop to drug  overdose and poisoning.\n\nMr. Chair, I thank Chairman Guthrie for his work on this important  issue, and I urge my colleagues on both sides of the aisle to support  this legislation.\n\nMr. Chairman, let's pass this bill. Let's secure our borders. Let's  stem the tide of the growing fentanyl crisis, and let's…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691872/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…for something more important now, which is freedom of  speech, a constitutional privilege that our Nation will fight  vigorously to protect.\n\nI join with my colleagues on both sides of the aisle to shun and  eschew violence and to pursue freedom of speech through the rest of my  days.\n\nGod bless America, Charlie Kirk, and his widow as we move forward.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695808/what-i-learned-from-charlie-kirk"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…workers and American soldiers and American public servants out  of work. We let them do their job on behalf of the American people.\n\nMr. Speaker, I urge all of my colleagues on both sides of the aisle  to support what is genuinely a bicameral and bipartisan product and one  that the President will sign and has urged us to pass.\n\nMr. Speaker, again, I urge…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…workforce and public sector unions, they  should at the very least not roll back existing progress made under  this administration.\n\nI, therefore, call on my colleagues on both sides of the aisle to  stand with the American taxpayer by supporting the administration's  efforts to bring accountability to the executive branch's workforce and  oppose H.R.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…to support the Maintaining American  Superiority by Improving Export Control Transparency Act, and I reserve  the balance of my time.\n\nMr. Speaker, I thank my colleagues on both sides of the aisle for  working to improve transparency and congressional oversight of U.S.  export controls. It is vital. That can't be overstated enough. It is  vital.\n\nI urge…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Labor, Health and Human Services, Education, and Related Agencies  provide robust funding for AmeriCorps in the coming fiscal year.\n\nMr. Speaker, I am urging my colleagues on both sides of the aisle to  come together in support of TFA and these other critical programs.                     Our Public Education System is Failing\n\nMr. KILEY of California.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…its Federal support for victims of violent  crime, gone. This is unacceptable.\n\nMr. Speaker, I got to work, and over the past 2 years, I have worked  with my colleagues on both sides of the aisle, with law enforcement,  with prosecutors, and with victim advocacy groups to craft this  legislation and build an overwhelming coalition of support.\n\nToday,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}]