[{"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Speaker, as many of my colleagues in the Congressional  Black Caucus have laid out, Donald Trump has failed the American  people. That is why I am grateful to my colleagues, Representatives  Kamlager-Dove and Brown,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…give to the most wealthy, like  Elon Musk and his allies. We have got to reverse that process.\n\nI want to commend the gentlewoman for pulling this together, my  colleagues with the Congressional Black Caucus, my colleagues in the  Democratic Caucus, and, hopefully, my colleagues in the Republican  caucus who will stand up and say: We can't do this. We…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Brooklyn, New York.\n\nI thank my colleague, Congresswoman Jennifer McClellan, for anchoring  this Congressional Black Caucus Special Order hour.\n\nI rise tonight with my colleagues of the Congressional Black Caucus  to bring awareness to the fast-approaching ACA tax credit funding  deadline, 30 days to go, and to give voice to everyday Americans who  will be…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Mr. HORSFORD. Mr. Speaker, I rise today with my colleagues in the  Congressional Black Caucus to honor my history--our history--American  history . . .\n\nI'm here to honor Black history during Black History Month.\n\nThis is a time to honor our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Mr. OLSZEWSKI. Mr. Speaker, I thank my colleagues of the  Congressional Black Caucus for their remarks on an issue that is  pressing and timely for all of us. I really appreciate the ways in  which so many of you have lifted your voices…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…and Congressman Shomari Figures  from the great State of Alabama for co-anchoring tonight's  Congressional Black Caucus Special Order hour.\n\nI rise today with my colleagues of the Congressional Black Caucus to  commemorate Black History Month and to reflect on the innumerable  contributions to our country that Black Americans have made throughout  our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…issue of great importance to the  Congressional Black Caucus, Congress, the constituents we represent,  and all Americans.\n\nMr. Speaker, I rise along with several colleagues of the  Congressional Black Caucus, who Members will hear from tonight. We are  here to discuss the timely issue of health disparities as we approach  the end of 2025 Minority Health…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…wealthiest Americans in exchange for cuts in vital,  essential programs for working- and middle-class families.\n\nMr. Speaker, I am proud to stand here with my colleagues from the  Congressional Hispanic Caucus to call out the partisan Republican  budget resolution that passed last night for what it is. It is a rip- off of the American people. Their budget…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…Virginia for  yielding to me and for putting this together. I appreciate the fact  that she took the leadership and initiative to bring this forward. I  also thank my colleagues in the Congressional Black Caucus, as well,  for taking a stand on this issue and the House Democratic Caucus  overall.\n\nThis is the issue that we fought about with respect to the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Speaker, I rise tonight to join with my colleagues  in the Congressional Black Caucus to pay homage to the Black men and  women of our Armed Forces whose service and sacrifices have far too  often gone unrecognized and underappreciated.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…their wallets will pay with their lives.\n\nMr. Speaker, there is still time to act. We must extend the  healthcare tax credits, and we must do so now.\n\nI thank my colleagues of the Congressional Black Caucus for this  Special Order hour where we can tell the stories of our constituents.\n\nThis gentleman in Wilcox County, Alabama, who pays $188 today will…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I want to thank my colleagues in  the Congressional Black Caucus (CBC) for organizing this Special Order.\n\nAs we get ready for Thanksgiving, families across our Nation are  coming together. It's a time to celebrate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…colleague once again, Congresswoman Jennifer McClellan,  for anchoring this Congressional Black Caucus Special Order hour.\n\nI rise tonight, Mr. Speaker, with my colleagues of the Congressional  Black Caucus to bring awareness to the fast approaching ACA tax credit  funding deadline and to give voice to everyday Americans who will be  harmed by the Republican-led…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Clyburn of South Carolina  and Congressman Steny Hoyer of Maryland, for co-anchoring this  Congressional Black Caucus Special Order hour.\n\nI rise tonight with my colleagues of the Congressional Black Caucus  and the House Democratic Caucus to reflect on the solemn anniversary of  the January 6 attack on the United States Capitol.\n\nThe deadly insurrection…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Again, I know earlier this year we were all thrown into a panic when  the Trump administration recklessly decided to cut off the Federal  funding. I led 23 of my colleagues with the Congressional Mamas Caucus  in a letter to President Trump. We demanded he take immediate action to  restore the Head Start funding, many of them, again, months and weeks…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}]