[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…of funding from a pool of investors  more reflective of the community so that these founders can turn their  vision into jobs and economic growth.\n\nI urge all my colleagues to vote in favor of this commonsense,  bipartisan legislation today. I thank Representative Flood, Chair Hill,  and Ranking Member Waters for their leadership.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…behalf of the more than 56,000 veterans in North Carolina's First  Congressional District, which I am proud to represent, and so many  across our country, I urge my colleagues to vote in favor of this  commonsense legislation.\n\nI thank the gentleman from Arizona (Mr. Ciscomani), who co-led the  bill. I also thank the House Committee on Veterans' Affair…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693934/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…not support.\n\nIt is time for every Member of Congress to go on record and stand  with the Constitution instead of President Trump's executive overreach.  I urge my colleagues to vote in favor of these two war power  resolutions.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…for America to continue to expand its trade relationships  with Africa than reauthorizing this very important piece of  legislation.\n\nMadam Speaker, I again ask my colleagues to vote in favor of this  reauthorization and extend a warm and hearty thank you to Chairman  Smith for making sure that this remains a bipartisan effort and we are  getting it across…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…6G. The race to 6G is not just about faster phones; it  is about national security, the economy, and America's standing on the  world stage.\n\nMr. Speaker, I urge my colleagues to vote in favor of suspending the  rules and passing this important legislation.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690227/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…say, in the interests of modernization, saving important  taxpayer dollars, and making sure that we are more responsive to the  American people, I urge all of my colleagues to vote in favor of this  legislation. I thank Mrs. Bice again for her bipartisanship, and I  yield back the balance of my time.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689323/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…there is a lot of work ahead.\n\nToday, we must pass this legislation to empower NTIA to keep the  United States as the leader of global tech.\n\nMr. Speaker, I urge my colleagues to vote in favor of this  legislation.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…helping move this bill forward. I  also thank my colleague from Pennsylvania (Mr. Joyce) for joining me in  this bipartisan effort.\n\nMr. Speaker, I urge all of my colleagues to vote in favor of the  bill.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…into law. Maybe we were waiting all along for President Donald  J. Trump's signature on this bill.\n\nI thank Chairman Comer for his support of this, and I urge my  colleagues to vote in favor of H.R. 3095.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…his partnership on this critical issue, and I thank Chairman Smith for  his support and efforts to help provide relief to disaster victims.\n\nI encourage all of my colleagues to vote in favor of this bill so we  can offer relief to all disaster victims, especially those in western  North Carolina.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…we will vote on. It is President Trump's agenda, and it is what we all  told the people back home we would do.\n\nNow the House must get it done. I urge all of my colleagues to vote  in favor of this rule. Let's choose our country over comfort and get  the One Big Beautiful Bill Act to the President's desk.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…programs that help  rural communities, not leave them behind.\n\nI thank my friend and colleague, Representative Figures, for joining  me in this effort, and I urge my colleagues to vote in favor of this  legislation to help communities across the United States receive the  assistance they need to obtain water infrastructure.\n\nMr. Speaker, I urge support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…for all the  work that has been put in on this legislation. I also thank my  colleagues in the Senate for their work on this important bill.\n\nMr. Speaker, I urge my colleagues to vote in favor of today's veto  override to ensure my bill, H.R. 131, becomes law.\n\nIn December of last year, this commonsense, bipartisan, and bicameral  bill passed both the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…businesses that it represents.\n\nMr. Speaker, I thank again Representative Wied and Chairman Williams  for their leadership on this important issue, and I urge my colleagues  to vote in favor.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…offenses, this is a needed step to accompany the legitimate  approach that the President has been implementing over the past few  years.\n\nMadam Speaker, I urge my colleagues to vote in favor of this  legislation.\n\nMadam Speaker, I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…clarity  that they absolutely deserve.\n\nMr. COMER. Madam Speaker, I yield 3 minutes to the gentlewoman from  California (Mrs. Kim).\n\nMr. COMER. Madam Speaker, I urge my colleagues to vote in favor of  the Boebert bill. I urge its passage, and I yield back the balance of  my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…As we instill election integrity in our system, we will see  more people participating because they will have faith in our  elections.\n\nMr. Speaker, I encourage my colleagues to vote in favor of S.\n\nMr. STEIL.  Tenney), the founder and chair of the Election Integrity  Caucus.\n\nMr. STEIL. Mr. Speaker, may I inquire as to the time remaining.\n\nMr. STEIL.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…It is time to send the TAKE IT DOWN Act to the  President's desk so we can give survivors and law enforcement the tools  they need to combat this crisis. I urge my colleagues to vote in favor  of this legislation.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…agencies that we are  the primary policymaking branch of government and that we will hold the  agencies responsible for bad, unlawful regulations.\n\nI urge all of my colleagues to vote in favor of H.J. Res. 130.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…rulemakings is at zero to ensure that only necessary regulations are in  place. We must support Main Street, starting with our work here in D.C.\n\nMr. Speaker, I urge my colleagues to vote in favor of this  legislation, and I yield back the balance of my time.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…oil and gas.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time. I am  prepared to close, and I continue to reserve the balance of my time.\n\nI urge my colleagues to vote in favor of S.J. Res. 11. I thank my  colleagues across the aisle for actually making our point on why this  regulation that was put in place by the Biden administration…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…work with the congressional leadership to implement  the capsule.\n\nMr. Speaker, I am pleased to have worked with Ranking Member Morelle  on these efforts. I urge my colleagues to vote in favor of H.R.\n\nMr. STEIL. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I thank the gentleman from New York (Mr. Morelle),…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Investigation about veterans without a judge's consent.\n\nIt also prohibits the VA from processing medical care claims for  illegal aliens.\n\nMr. Chair, I urge my colleagues to vote in favor of this bipartisan  en bloc and for this critical piece of legislation. Our veterans are  the living embodiment of duty, honor, and sacrifice. They have stood on…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692951/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]