[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…worked together  on several issues in this Congress. Both sides worked in good faith to  get this bill done last Congress and again here today.\n\nMr. Speaker, I encourage my colleagues to support this measure, and I  reserve the balance of my time.\n\nAs I have indicated, I support this bill because sanctions have a  role in curbing the opioid crisis, but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Trump may think that testing will make the country safer,  but in reality, it puts the whole world in jeopardy and makes Nevadans  sicker in the process. I urge all of my colleagues to join me and  cosponsor my RESTRAIN Act.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, many of my colleagues have said  that this bill, the SAVE America Act, and the constant attempts by  Republicans to clamp down on voter fraud solves a problem that doesn't  exist. I couldn't disagree…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…likely to take on any of these actions that  I suggested because they refuse to take on President Trump, even when  he is breaking the law. It is clear that my Republican colleagues do  not have their priorities in order. In fact, it seems to me their only  priority is securing giant tax breaks for their billionaire buddies at  the expense of American…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…family of firefighters, one of whom just got diagnosed  with Parkinson's after spending months at the World Trade Center.\n\nThe fact of the matter is, on 9/11 my Republican colleagues will fall  all over themselves to thank firefighters and say how they will never  forget. I will tell you something, we are going to never forget the  deafening silence and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690904/protections-for-firefighters"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the Deal First Aid Squad. Notably, they have served in key  mutual aid roles and frequent interagency cooperation across Monmouth  County.\n\nMr Speaker, I sincerely hope my colleagues will join me in marking  the 75th Anniversary of the Deal First Aid Squad and celebrating its  rich impact on the Borough of Deal and greater Monmouth County.", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…was  omitted from legislation creating coins for the states. It is long  overdue to display the D.C. seal with the seals of the states in the  Main Reading Room.\n\nI urge my colleagues to support this bill.", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…from Virginia for  yielding to me and for putting this together. I appreciate the fact  that she took the leadership and initiative to bring this forward. I  also thank my colleagues in the Congressional Black Caucus, as well,  for taking a stand on this issue and the House Democratic Caucus  overall.\n\nThis is the issue that we fought about with respect…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…would be  investing in our students, not causing chaos and confusion by cutting  resources and making our schools less safe and underfunded.\n\nI will continue to work with my colleagues, and I hope this can be  bipartisan, to push back on these cuts to education.                           Combating the Rise in Hate\n\nMr. SUBRAMANYAM. Madam Speaker, hate has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…surging, driving up costs even more.\n\nEveryone in this body talks a good game about lowering costs; but  when the time came to actually do something about costs, my House  colleagues voted to put Big Oil CEOs over the American people.\n\nI urge my friends in the Senate to fix this mess and actually lower  energy prices for the American people.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…title 2, Code of Federal Regulations, shall be reinstated by       such agency or entity under its previous terms and       conditions.\n\nMs. BUDZINSKI. Mr. Chair, I hope my colleagues will join me in voting  for the motion to recommit.                    Amendment No. 31 Offered by Mr. Perry.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Republicans voted to support Ukraine. I am really glad that  Representative Bacon is speaking out about President Trump's actions,  but I wonder where are the rest of his colleagues?\n\nI hope that the other 100 Members who supported aid to Ukraine in  April will be as brave as Representative Bacon and speak out against  this administration's ridiculous…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Davids), the main sponsor of the bill.\n\nMs. VELAZQUEZ. Mr. Speaker, I applaud Ms. Davids, Mr. Alford, and Mr.  Conaway for their commitment to our Nation's veterans. I urge my  colleagues to support H.R. 828, and I yield back the balance of my  time.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687886/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…background.\n\nHe, perhaps, represented if not the, one of the largest congressional  districts by geography in California, a lot of northern and eastern  California. A lot of my colleagues when they think about California  they think of Los Angeles or the Bay Area, but we have parts of  California where the communities are a white spot in the middle of a  major…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…vote your conscience today and face an angry tweet than  have your legacy be one of equivocation and cowardice.\n\n``By their deeds you will know them.''\n\nI urge all of my colleagues to oppose debt, death, and hunger. Oppose  this cruel legislation.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693187/one-big-beautiful-bill-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Wichita. These churches embody the deep spiritual connection  that Kansans share with the Ecumenical Patriarchate and Orthodox  Christians around the world.\n\nI now ask my colleagues to join me in recognizing this historic visit  and in honoring His All-Holiness Ecumenical Patriarch Bartholomew for  his unwavering commitment to faith and the common good.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Federal estate.\n\nMr. Speaker, I thank Representative Bentz for his leadership on this  issue and for his steadfast work on behalf of his constituents.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMr. HURD of Colorado. Mr. Speaker, this legislation will eliminate  the City's need to reapply for a special use permit to access land  within…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…that is most  important. The chairman has done a fabulous job at that, so this NDAA  will continue to prioritize servicemembers and their families.\n\nMadam Chair, I urge my colleagues to support the bill.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695131/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…political system needs most: trust--trust that the process is secure;  trust that the rules are followed; and trust that every legal vote  counts.\n\nMr. Speaker, I urge my colleagues to join me. Let us unify around the  democratic principles that built this Republic. Let us pass the SAVE  America Act to keep our elections exclusively in the hands of the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699946/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…happy to get back to actually addressing the  rules and the bills that are before us, instead of listening to  Democrat talking points over and over.\n\nI have listened to my colleagues on the other side of the aisle  during this debate. It seems that they are once again choosing to  prioritize Federal bureaucracy and woke social agendas over the actual…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…committee on such a bipartisan basis. I  thank Chairman Smith for his commitment to strengthening fairness and  accountability within our tax system.\n\nMr. Speaker, I urge my colleagues to support the bill.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…standard that even an intelligent investor could  not pass it.\n\nThis bill is a commonsense, bipartisan product that will expand  opportunity in our capital markets. I urge my colleagues to support  this bill.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693887/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "John Boozman", "party": "Republican", "sentence": "Mr. BOOZMAN. Mr. President, I am proud to join my colleagues in  emphasizing the importance of whole milk in a healthy school lunch and  taking Senate action to ensure a balanced diet for school-age children.\n\nI rise today in support…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…taxpayer's dime. That is coming from a former broadcaster.\n\nI thank President Trump for exposing this waste and working to  protect Americans' hard-earned dollars. I urge my colleagues to join me  in passing this bill.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692520/rescissions-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…individual effort for a team result. Their hard work and dedication,  both on and off the track, in achieving this accomplishment should be  commended.\n\nMr. Speaker, I ask my colleagues to join me in honoring the Oberlin  High School Girls 4x200 Meter Relay team. On behalf of the people of  the Fifth District of Ohio, I am proud to recognize this great…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693428/special-recognition-of-oberlin-high-schools-girls-4x200-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…instructional materials or personnel tied to the Chinese  Government.\n\nAmerican education should teach American values, not communist  propaganda.\n\nMr. Speaker, I urge my colleagues to support this bill and take a  firm stand against foreign influence in our children's education.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…agencies. I thank Representative Obernolte for leading this  legislation again in the 119th Congress and Representative Foster for  cosponsoring it.\n\nMr. Speaker, I urge all my colleagues to join me in support of this  bill, and I yield back the balance of my time.\n\nMr. BABIN. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688929/cost-share-accountability-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…1383,  the SAVE America Act, which I am proud to cosponsor and hope will pass  the House floor today.\n\nI also note that I think it is shockingly racist and sexist for my  colleagues on the other side to believe that we are not smart enough to  figure out how to get IDs. I can assure my colleagues that we are, even  if we get married.\n\nThe SAVE America…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…bill, it was obviously not  germane, they wanted to rename the planet, planet Trump. That is how  serious they are in their debate.\n\nI left out one of the other amendments my colleagues across the aisle  filed. They wanted to rename the Gulf the gulf of ignorance. Now, I  don't know where they came up with that one. I know they oppose  offshore oil and gas…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…opine at length about the wins that Republicans  have secured in this bill, wins that we have been highlighting to the  American people for months. Meanwhile, our Democratic colleagues have  resorted to fear-mongering and wailing from their bully pulpits in the  hopes of deceiving the American people.\n\nFor months, we have heard Democrats claim that the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}]