[{"senator": "Ami Bera", "party": "Democrat", "sentence": "…has continued to be preserved  and honored. On this day, the Society celebrates their 50th Anniversary  alongside Fair Oaks' 130th Anniversary.\n\nI ask that my colleagues join me in recognizing this day as Fair  Oaks' 130th Anniversary and commend this community's beautiful history.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696704/recognizing-the-130th-anniversary-of-fair-oaks"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Wishnev for their incredible achievement  and for inspiring all of us who strive to push past limits and see what  lies on the other side.\n\nMr. Speaker, I ask my colleagues to join me in recognizing their  achievement.", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696210/recognizing-dr-lynn-kowalski-and-dr-stephanie-wishnev-for-completing-the-transamerica-route"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…others to continue in his footsteps for years and decades to  come, serving our Nation and the military families of the central  coast.\n\nMr. Speaker, I ask my colleagues to join me in recognizing and  thanking General Lopez for his exemplary service to our country by  passing my bill to name the South Patterson Avenue post office in his  honor.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…facilities through  many challenges. They continue to provide exceptional recreation  experiences and will continue to do so for many years to come.\n\nI ask that my colleagues join me in recognizing this day as the  Carmichael Recreation and Park District's 80th Anniversary and thank  them for their dedication to their community and its residents.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696717/recognizing-the-80th-anniversary-of-carmichael-recreation-and-park-district"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise today to ask that my colleagues  join me in recognizing October as National Spine Health Awareness  Month.\n\nIn the U.S., 100 million people suffer from neck or back conditions  every year according to the CDC. Back…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…generations. Her contributions have not only elevated the standards in  her field, but have also opened doors for countless others.\n\nMr. Speaker, I ask that you and my colleagues join me in recognizing.  Dr. Shamira A. Brown for her outstanding achievements and unwavering  commitment to science and education. She is a true asset to our  community and to our…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694732/recognizing-the-exceptional-environmental-research-of-dr-shamira-brown"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…and the Make-A-Wish Foundation. Her work has made a profound  and lasting impact, and she exemplifies the true spirit of community  and compassion.\n\nI ask my colleagues to join me in recognizing Corey Rose and her  Wishes & Heroes Benefit Concert for their outstanding contributions and  wishing her all the best in her future endeavors.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…wife, mother, sister, grandmother, and friend.  She embodied the true meaning of public service and made a lasting  impact on her community and state. I ask my colleagues to join me in  recognizing the inspiring life and service of Phyllis Fulton.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Castor, Ethan Dastrup, Christian Earl, Jackson Hedin,  Nixon Hunt, Jack Hyer, Issac Koval, Seth Leedom, Michael Norton, and  Luke Robison. Mr. Speaker, I ask my colleagues to join me in  recognizing their achievement.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697395/recognizing-the-eleven-newest-eagle-scouts-from-troop-407"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…traffic control. As they prepare  for commercial flights in 2026, they will continue to be a role model  for perseverance and leading with purpose.\n\nI ask that my colleagues join me in recognizing and commemorating the  efforts of the Manassas Air Traffic Control Tower team.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697601/recognizing-manassas-regional-airports-air-traffic-control"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…including cosponsoring H.R. 1143, the Medicare IVIG Access Enhancement  Act, that will facilitate home infusion for the treatment of CIDP and  MMN.\n\nI call on my colleagues to join me in recognizing May as GBS|CIDP  Awareness Month and in supporting this important legislation by  becoming a cosponsor of H.R. 1143 that will help promote therapy  adherence,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…others. We are  deeply grateful for her service. The world could use a few more Kathy  Quigleys.\n\nMr. Speaker, I am proud to honor Kathy Quigley, and I ask that my  colleagues join me in recognizing her extraordinary career and thanking  her for her years of service to the Quincy and South Shore community.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…District. Their presence in our community reflects the important role  this profession plays in strengthening access to justice nationwide.\n\nMr. Speaker, I urge my colleagues to join me in recognizing Court  Reporting and Captioning Week and in thanking these professionals for  their indispensable service to our court system and the rule of law.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Willie Mays Park will undergo major improvements and will now serve  generations of aspiring young baseball players in Jefferson County.\n\nMr. Speaker, I ask my colleagues to join me in recognizing Major  League Baseball for their continued investment in Alabama's Seventh  Congressional District. We look forward to welcoming them back to the  Magic City.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…responsibility, carrying forward the  Fraternity's mission with purposeful action and a steadfast dedication  to community advancement.\n\nMr. Speaker, I ask that my colleagues join me in recognizing the 10th  Anniversary of the Epsilon Sigma Boule of Sigma Pi Phi Fraternity and  in celebrating the tremendous work this organization continues to do to  strengthen…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692968/recognizing-epsilon-sigmas-10th-anniversary"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Peak.\n\nHeather and I thank Terry for his years of service, and we wish him  and his family well as they enter this well-earned next stage of life.  I ask my colleagues to join me in recognizing Terry Fahy and  celebrating his retirement.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691791/recognizing-the-service-of-mr-terry-fahy-on-the-occasion-of-his-retirement"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and numerous nonprofit groups.  She lives in the Meadow Woods section of Warminster with her two  grandchildren, who attend Willowdale.\n\nMr. Speaker, I ask my colleagues to join me in recognizing Ms. Judy  Hoover. Today, we honor her in return for all she has done for the  community. Warminster Township, Bucks County, and the Commonwealth of  Pennsylvania…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…we owe a great debt to those who served, and the Dole  VA and the city of Wichita are setting the standard for how that debt  should be paid. I now ask that my colleagues join me in recognizing the  Robert J. Dole VA Medical Center and the city of Wichita for these  exceptional achievements. Furthermore, I ask that my colleagues join me  in thanking…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690253/recognizing-the-robert-j-dole-va-medical-center-and-the-city-of-wichita"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…These churches embody the deep spiritual connection  that Kansans share with the Ecumenical Patriarchate and Orthodox  Christians around the world.\n\nI now ask my colleagues to join me in recognizing this historic visit  and in honoring His All-Holiness Ecumenical Patriarch Bartholomew for  his unwavering commitment to faith and the common good.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Mr. Speaker, on behalf of Ranking Member Morelle and  myself, I kindly ask my colleagues to join me in recognizing Noah Wofsy  on his retirement as Deputy Legislative Counsel after 39 years of  service to the House of Representatives. Noah joined the House Office  of Legislative…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Mr. Speaker, I kindly ask my colleagues to join me in  recognizing Derek N. Harley for his 25 years of service in the U.S.  House of Representatives.\n\nDerek began his career on Capitol Hill as a Legislative Assistant  with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…to me personally, Marshall has  been a friend, a sounding board, and an unwavering supporter--qualities  for which I am sincerely grateful.\n\nToday, I ask my colleagues to join me in recognizing Marshall  Brachman for his enduring contributions to civic life, his generous  spirit, and his invaluable friendship. I extend my warmest wishes to  him and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…deeply appreciate her years of service, and we wish her and her  family well as she enters this next stage of her already eventful and  purposeful life. I ask my colleagues to join me in recognizing  Councilwoman Debra Jones and celebrating her retirement.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…has brought great honor to Jax State, the Marching  Southerners and the State of Alabama.\n\nMr. Speaker, on behalf of the Jax State fans and family, I ask my  colleagues to join me in recognizing and celebrating the extraordinary  career of Dr. Kenneth G. ``Ken'' Bodiford.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…regard President  Uribe as the Abraham Lincoln of Colombia, a unifying figure who  preserved his nation's democracy and restored hope to millions.\n\nI ask my colleagues to join me in recognizing President Alvaro Uribe  Velez for his historic contributions to the people of Colombia and to  the cause of freedom and democracy.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…The Family Christmas Extravaganza  reflects those values and highlights what is possible when a community  comes together in the service of others. I ask my colleagues to join me  in recognizing and commending the volunteers, faith leaders,  businesses, and community partners who have worked tirelessly to make  the Seventeenth Annual Family Christmas…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}]