[{"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…going to start dismantling and, indeed, working herself out  of a job.\n\nOn behalf of students, teachers, and families in Hawaii and all  across our country, I urge my colleagues to think about it and to  oppose this nomination.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…He, perhaps, represented if not the, one of the largest congressional  districts by geography in California, a lot of northern and eastern  California. A lot of my colleagues when they think about California  they think of Los Angeles or the Bay Area, but we have parts of  California where the communities are a white spot in the middle of a  major highway…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…corporations that are screwing  us over and the big banks that don't give a damn about us.\n\nI urge my colleagues to keep all of these things in mind.\n\nMs. BALINT. I want my colleagues to think about the totality of this  man's life and what he has done in service not just to Illinois but to  the people of this country. I urge my colleagues to keep this in…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696774/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…it. What would we  have done without that discovery? That is what the proper education is  all about.\n\nI mentioned here last week Charity Adams and Arthur Gregg. Now my  colleagues think Arthur Gregg was from Virginia because that is where  he retired, but he was from Florence, South Carolina. Charity Adams,  Columbia, South Carolina, Fort Gregg-Adams.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…there now, what precedent does that set for  the people that are sent there next?\n\nMr. President, I have been speaking for a while and posed a lot of  questions. I hope my colleagues think about this carefully. I am going  to wrap it up, but I want to end with just one more. Where will  Republicans draw the line because we are well past the bounds of law,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…insurance, you are not eligible for the tax credit.  People on CHIP are not eligible for the tax credit. People on Medicaid  are not eligible for the tax credit. If my colleagues think that  expanding this tax credit is going to fix the problem, let me just give  you a couple of examples from my personal life.\n\nI am covered under the Affordable Care…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…working in my district, working as a Member of Congress and  representing my constituents but making sure that I was not traveling  across the country with my son.\n\nDo my colleagues think that there would be one Republican here today  who would stand on my behalf and vote ``present'' on the bills coming  forward this week?\n\nI don't think so. This is why…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…45 Democrats in the California  delegation.\n\nMr. RASKIN.\n\nMr. Speaker, I am moved by the comments of the distinguished  gentleman from California, and I wonder what our colleagues think the  value is other than of a purely political nature to a resolution that  purports to be honoring law enforcement when it is set up on a  completely partisan basis.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…middle school as a  tool to create revenge porn. We have seen it used against women in  public life, on both sides of the aisle, including our own colleagues.\n\nNone of my colleagues think this is acceptable, and it is a crisis  that demands immediate action. We have a responsibility to act now and  not tomorrow, not next year, not after more damage is done.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690184/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…honest, likely Medicare. I am sorry the gentlewoman doesn't think that  that is in the interest of the American people, but my colleagues on  the Democratic side do. My colleagues think when Republicans are taking  away people's healthcare in this country, it is a big deal.\n\nThis bill, this tax scam bill, would literally take food out of the  mouths of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…need to be part of the  solution. This is a chance to stand up for our constituents, who  deserve to know that their elected Representatives really work for  them.\n\nIf my colleagues think these sweeping tariffs are such a good idea,  then vote for it, but stop hiding. We are not elected to dodge  important issues just because we are afraid of the President.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699902/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…doesn't have to be this way. If just a few of my  colleagues on the other side of the aisle take a stand today, we can  stop this from happening.\n\nI implore my Republican colleagues to think about the harm, the  devastating harm that will be done to their communities if this budget  resolution is adopted. Stand up. I urge my colleagues to think twice  and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688050/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…parallels to what is going on right  now. I am going to focus at this moment on New Testament Scripture, the  Gospels.\n\nI think it was mentioned earlier by one of my colleagues. I think   Don Beyer mentioned earlier Matthew 25:35-40 earlier. I think it is  important that at this time in this moment and in this debate, before I  leave the floor of the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Federal Government to target political opponents with  political enforcers. Instead of serving the American people, he is  focused on carrying out the Trump agenda.\n\nIf my colleagues think that this blatant partisanship is going to  stop if he is confirmed as an independent inspector general, they are  betting on the wrong horse. When Mr. Bell came before…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…State or some other town  into your home to ask them about your important family decisions. Yet,  somehow in America, my friends on the other side of the aisle, my  colleagues over there, think that that is what we should do.\n\nThey should put a vote up in the Senate to show the American people  who stands with them and who stands with letting those people…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…national security threat.\n\nThe northern border, for whom this emergency exists, is acknowledging  that there is an emergency, a national security threat, but I guess my  colleagues think that they know better.\n\nMr. Speaker, take the Chinese-run fentanyl lab that I mentioned being  shut down, or one of them being shut down, of many. There was over 800…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…elsewhere. Let me  highlight a couple of points that we have heard over the recent few  minutes.\n\nLet's talk about lowering prescription drug costs. I wonder what my  colleagues think about our truck drivers and how their lifesaving drugs  get to their constituents. I wonder if they just appear out of thin  air, or maybe the trucks that carry these…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]