[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Sally Ormsby Environmental Stewardship Award,  named in honor of a local champion of environmental education and  protection; and the Harold L. Strickland Partnership and Collaboration  Award, named for the former Sully District representative on the Park  Authority Board. In addition, a special recognition will be given to  Park Authority volunteers,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…advocates.\n\nMany of these rare disease patients were looking forward to attending  the rare disease event that was supposed to be today. And this year it  was going to be a collaboration between NIH and the FDA because of all  that integral work that goes on with drugs being approved for people  with rare diseases, but that annual event was canceled because…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…government, and other key stakeholders. The Council is also now co- chaired by a representative from the Cybersecurity and Infrastructure  Security Agency to help foster collaboration between our Nation's  leading cybersecurity experts across the government.\n\nHowever, given the important objectives of CSRIC, we should not leave  it to the FCC's discretion…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…remarkable growth and strengthened its role as an  indispensable resource for our region.\n\nHer leadership has been defined by a deep commitment to social  justice, equity, and collaboration. She played an instrumental role in  expanding access to affordable housing, advancing supportive services,  and forging strategic partnerships that empower individuals…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…communities\n\nContrary to fear-based narratives, reforms that require       accountability do not undermine law enforcement; they help       restore public confidence and encourage collaboration between       police and the communities they serve. As the District's       Attorney General has explained, ``the Comprehensive Policing       and Justice Reform Amendment…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…services.\n\nFor decades MACV has been unwavering in their commitment to end  Veteran homelessness in Minnesota. This project is only one example of  the way their work and collaboration can change lives. I want to extend  my deep appreciation to Hennepin County, the Minnesota Department of  Veterans Affairs, and the many community organizations that helped…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694978/recognizing-the-minnesota-assistance-council-for-veterans"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…lifestyles and reduce their  ecological footprint.\n\nThe All-America City award from the National Civic League recognizes  outstanding communities that leverage civic engagement, collaboration,  inclusiveness, and innovation to address local issues. It is because of  the collective efforts of communities like the City of Lakewood that we  can hope for a greener…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694723/recognizing-the-city-of-lakewood"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. Speaker, I support H.R. 3424, the Shared Property Agency  Collaboration and Engagement Act of 2025, the SPACE Act.\n\nThis bill requires the Administrator of the GSA to develop new  criteria to help expand the use of office space sharing for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695011/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…4th  Fridays Art Event at The Dole, which brings together photography, art,  and music to enrich the local cultural landscape. Held ten times a  year, this program fosters collaboration among a diverse range of  artists and provides a vibrant social space that celebrates creative  expression. Through her vision, Ms. Merkling has significantly  contributed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…act.\n\nFirst, I thank Ranking Member DeLauro for yielding me the time, but  also for her leadership and perseverance in this challenging time.\n\nI thank Mr. Simpson for his collaboration and partnership in this  committee, and I also thank Chairman Cole for the work he has done on  this committee.\n\nMr. Speaker, I will give the most applause and great thanks…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…that serves as a hub  for inclusive, justice-centered ministry in North County San Diego.\n\nTheir work extends far beyond the church walls through ecumenical and  interfaith collaboration, nonprofit leadership, education, and  community organizing, and is grounded in a fully LGBTQ-affirming faith  that prioritizes dignity, equity, and belonging. Through…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699856/recognizing-reverend-jason-coker-and-reverend-jenell-coker-as-my-december-2025-co-constituents-of-the-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Appropriations Committee. And he said: I worked so closely with Dan  Inouye of Hawaii, and I worked so closely with Patty Murray of  Washington. What has happened to that collaboration?\n\nThat was several years ago. But as we have watched, over time, some  significant things are happening that we should understand as Senators.  In the not so distant past,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…expanding access to housing and opportunity. Over the  past decade, Milford has become a model for what small town  revitalization should look like, driven by public-private collaboration  and a clear focus on inclusive growth.\n\nMilford's motto: Art Town, River Town, Home Town, is more than a  slogan. It is a reflection of a community that is rooted in creativity…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…work       ethic to help take AUKUS where it is today. He has helped to       strengthen the bilateral relationship between our countries       and advance our Alliance collaboration at a critical       strategic moment. He is a much-valued friend of Australia.\n\nH.E. Dr. Kevin Rudd AC, Australia's Ambassador to the       United States.\n\nAs Phil departs,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Dangerously, this administration halted bird flu monitoring in nearly  50 countries and imposed a gag order on Federal health agencies,  limiting vital communication and collaboration with farmers. If that  weren't bad enough, the very people we rely on to protect our ag  industry and combat the spread of bird flu have been fired from the  USDA.\n\nThis…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Authority, the San Bernardino Council of Governments, and the Victor  Valley Wastewater Reclamation Authority. Her service on these bodies  has been marked by professionalism, collaboration, and a deep  commitment to transparency and good governance.\n\nDebra's accomplishments would not have been possible without the  support of her family. Her husband, Gene,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Bureau.\n\nShe continues to help inspire students to create their own  philanthropic projects, developing future community leaders. Her  efforts focus on fostering leadership, collaboration, and a sense of  community in the young minds she educates.\n\nAs an alumna of the University of Georgia--Go Dogs--she has received  several accolades, including the Outstanding…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692403/recognizing-rachel-kinsaul"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…today to commemorate  World Intellectual Property Day and the creation of the Congressional  Inventions Caucus.\n\nThe newly created caucus will work to foster education,  collaboration, and legislative action on intellectually property issues  in Congress. I would like to thank Rep. Deborah Ross for leading this  caucus with me in the House, as well as…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691132/world-ip-day-and-inventions-caucus"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Institutes in  Arizona, Colorado, and New Mexico by finally extending this important  program to Utah.\n\nEstablishing a SWERI in Utah will expand wildlife research,  strengthen collaboration with land managers, and provide new tools to  improve forest health and reduce catastrophic wildfires. I urge my  colleagues to support Representative Kennedy's bill.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…as determined by the Director of CISA,       shall establish a joint interagency task force (in this       section referred to as the ``task force'') to facilitate       collaboration and coordination among the Sector Risk       Management Agencies assigned a Federal role or responsibility       in National Security Memorandum-22, issued April 30, 2024…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…strong leadership, and a sustained commitment to safety  and quality.\n\nAchieving the gold-level designation reflects Stead Family's success  in fostering an environment where collaboration, evidence-based  practice, and compassionate care thrive.\n\nThe University of Iowa Health Care system has also maintained Magnet  designation for nursing excellence in 2008,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696467/recognizing-stead-family-childrens-hospital"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…United States and Turkiye have  worked together to promote regional stability, strengthen transatlantic  security, and advance the values of freedom and democracy. Our  collaboration continues to play a vital role in addressing global  challenges--from counterterrorism and defense cooperation to  humanitarian efforts and energy security.\n\nOur bilateral…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…answering the big questions about  our place in the universe and the potential for future generations to  reach the stars.\n\nUtah is developing a future built on innovation and collaboration.  The State is becoming a hub for aerospace innovation, with new startups  and established companies like Northrop joining the effort to advance  technologies that will…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…technology necessary for the       transmission to the Earth's surface of solar energy collected       in space.\n\n(H) Other areas of potential research and development       collaboration the Secretary and the Administrator determine       important to achieving agency missions and objectives.\n\n(2) Develop methods to accommodate large voluntary data…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…across the finish line in the Senate, and I am hopeful  our colleagues in the House can build on this momentum.\n\nAgain, thank you, guys, so much for all of your work, your  collaboration. This is how this place ought to work, and you are a  great example of that.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…eliminate adversarial access to the key  technologies used in undersea cables. This strengthens our export  controls, requires transparency and public reporting, and promotes  collaboration with our allies abroad to ensure our standards and  infrastructure are secure.\n\nMr. Speaker, I thank Chairman Mast of the House Foreign Affairs  Committee for authoring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694821/undersea-cable-control-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…efforts, including managing FEMA allocations and emergency  shelter coordination. Beyond programmatic and financial  accomplishments, Charles leaves a cultural legacy of collaboration,  compassion, and forward-thinking leadership. He empowered staff and  volunteers to innovate and excel, instilled a strong sense of mission  throughout the organization,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Speaker, I rise in strong support of my bill, H.R. 4233, the  AUKUS Reform for Military Optimization and Review Act, or the ARMOR  Act.\n\nThe ARMOR Act strengthens defense collaboration and trade among  Australia, the United Kingdom, and the United States, which make up the  AUKUS trilateral security partnership.\n\nSince its inception in 2021, AUKUS has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…communities with access to the essential services they need       to thrive. We thank you for your leadership on this important       resolution and look forward to continued collaboration to       ensure that federal policies in the NPR-A reflect both       national priorities and the needs of the people who call the       Arctic home.            Sincerely,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…biological, computational,       and environmental science and engineering, including advanced       crop science, crop protection, breeding, and biological pest       control, in collaboration with the program authorized under       section 306 of the Department of Energy Research and       Innovation Act (42 U.S.C. 18644).\n\n(C) Integrated natural resources and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}]