[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…literally. You all know the rules. We can't go  back. The FCC may not adopt a similar rule in the future. This is an  irreversible, self-inflicted wound. So I urge my colleagues to reject  this misguided, wrong-headed resolution. It would be a disgrace if we  deprive those students and their families of this vast resource, of  literally life-changing…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…public knows exactly who is  responsible when services disappear, when costs go up as a result of  these crazy tariffs, and when families are left behind.\n\nI urge my colleagues to reject these bills, to reject the politics of  distraction, and start doing the hard work the American people sent us  here to do. People want us to fight for them. They want…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the Representative of  western New York, where so many people in my community, like others  across the country, are already struggling to afford healthcare, I urge  my colleagues to reject this disgraceful bill.\n\nAs an occupational therapist, I know exactly who these cuts will  hurt. I have heard from so many who are desperate for a lifeline, like  Iris,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…working dads will be  turned down  and turned away all because of a vote taken here today.\n\nThis mandate isn't just unfunded. It is unfathomable.\n\nMr. Speaker, I urge my colleagues to reject this provision, reject  this rule, and reject this betrayal. Don't reward the rich on the backs  of hungry Americans.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…stars.  What message are we sending them right now?\n\nWe should be investing in their future, not pulling the rug out from  underneath them.\n\nMadam Speaker, I urge my colleagues to reject these cuts, reject this  anti-science, anti-veteran agenda. Let us fight for the truth for our  researchers, for our vets, and for the country we still have a chance…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…OHDACA's budget is  modest, but its impact is huge. It yields massive returns in lives  saved, crises stabilized, and partnerships strengthened.\n\nMr. Chair, I urge my colleagues to reject this amendment.\n\nMs. JACOBS. Mr. Chairman, these AUMFs were literally voted on when I  was 2 years old and 13 years old, respectively, and now I am old enough  to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…regulatory framework for crypto that will  promote the responsible development of these digital assets while  protecting American consumers and investors. I urge my colleagues to  reject H.R. 3633, S. 1582, and H.R. 1919.", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…do nothing to support the  economic growth of this Nation. It will benefit the wealthiest at the  expense of those who make this country work.\n\nMadam Chair, I urge my colleagues to reject it, and I reserve the  balance of my time.\n\nMr. BEYER. Madam Chair, while we are doing math, when I divide $2  trillion in savings and cuts over 10 years, I get $200…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Our educators deserve meaningful support, not  legislative gestures that create more problems than they solve.\n\nFor these reasons, I will be voting ``no'' and urge my colleagues to  reject this measure and refocus our efforts on policies that will  actually strengthen our public schools.\n\nMr. SCOTT of Virginia. Mr. Speaker, on that I demand the yeas and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Head Start  program, and thinking about the small businesses who tell me that the  Trump on-again, off-again global tariffs are crushing them.\n\nMr. Speaker, I urge my colleagues to reject this reckless budget.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689916/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…judicial  overreach. This bill a scheme to give more power to the President,  making it easier for him to carry out his illegal actions without  consequence.\n\nI urge my colleagues to reject this bill.", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…our  environment and ensuring national defense are not opposing goals. They  are shared responsibilities that we must uphold together.\n\nMadam Chair, I strongly urge my colleagues to reject this amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…explicitly said that Congress  cannot use this process to overturn California's waivers with the EPA,  and we should not pretend otherwise.\n\nMadam Speaker, I urge my colleagues to reject this effort. Let's  stand up for clean air, State rights, and for the health of the  American people.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690436/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Connecticut, Alaska,  Hawaii, or anywhere. It should not matter where you live or what kind  of deal your Senator made. Everybody deserves to eat.\n\nMr. Speaker, I urge my colleagues to reject this irresponsible  legislation.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693232/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…lines on 61st Avenue as  families wait for the food bank to open. My community is hurting, and  this cruel policy is a betrayal of our most vulnerable.\n\nI urge my Senate colleagues to reject this harmful legislation.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692186/slashes-to-snap-benefits"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Federal taxpayer--when I say Federal taxpayer, I mean you and me and  everybody watching and everyone in the Gallery--let's steward that  money correctly. I urge my colleagues to reject this resolution and  continue with bipartisan, important work to make healthcare more  affordable.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Madam President, I rise today to urge my colleagues to  reject the Biden administration's sweeping plan to lock down nearly  half of the National Petroleum Reserve in Alaska to responsible oil and  gas development in contradiction…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…on today I  believe is not needed, and I most certainly will oppose it. If passed,  it would prevent the President from protecting us in the future. I urge  all of my colleagues to reject it.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Exploration and Mining Association, Citizens for Responsible Energy  Solutions, the Resource Development Council for Alaska, as well as the  Trump administration.\n\nI urge my colleagues to reject unlawful regulatory overreach,  reinforce American mineral and energy security, and uphold Federal law  and Alaska Native land rights by supporting the Alaska delegation…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…principled process in Congress  in my time here.\n\nI ran for office pledging to restore fiscal responsibility and  Congress is embracing it.\n\nFor years, I have urged my colleagues to reject the Washington  presumption that nothing can be cut from the budget in order to fund  priorities without increasing the deficit.\n\nMr. Speaker, by the end of this week,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699307/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I rise today to urge my colleagues to  reject the Biden administration's unlawful attempt to stifle Alaska's  congressionally mandated oil and gas leasing program in the Coastal  Plain of the Arctic National Wildlife…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}]