[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "My oldest is 19 years old and is in the second year of       college.", "title": "Constituent Testimony During the Congressional Field Hearing on Haitian Tps Termination", "date": "2026-02-04"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "With the help of a Pell grant, he was the first member in his family  to graduate from college.", "title": "Welcoming the Honorable Christian D. Menefee to the House of Representatives", "date": "2026-02-02"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "These grants would  have funded battery storage for a more stable grid, modernized  transmission lines, and funded a battery recycling education program at  Macalester College.", "title": "Opposition to Permitting Bills", "date": "2025-12-12"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "In addition, El Centro is home to the Echo Park Family  Source Center, providing financial counseling, tax preparation,  tutoring and college prep classes and other critical services to  Angelenos.", "title": "Recognizing the Achievements of Sandra Figueroa-Villa", "date": "2025-10-06"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "She further pursued her  education at Tarrant County College before beginning a distinguished  career that spanned several decades.", "title": "Recognizing Sharon Lavonne Harris Rischer", "date": "2025-02-25"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Pranoy is driven by his dream of attending college, but that dream is  at great risk.", "title": "I Stand with the Disability Community", "date": "2025-05-15"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Anonymous--East Haddam\n\nI am a widow who resides with my 23-year-old son who just       graduated from college in May '24.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "It is because they also defend his lie  that he won the 2020 Presidential election, which he lost by more than  7 million votes, 306 to 232 in the electoral college.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "I remember thinking about this in personal terms during the era of  the Vietnam war when I was a college student, thinking about the fact  that there had not been any formal declaration of war in Vietnam, and  yet over 40,000 of my brothers and sisters gave their lives in that  conflict.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "He has  previously chaired the Police Athletic League and Temple University's  Klein College Board of Advisors.", "title": "Recognizing Bernie Prazenica's Retirement As President and General Manager of Wpvi-Tv", "date": "2026-01-13"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Speaker, I rise today to congratulate Joe Garcia,  Chancellor of the Colorado Community College System, on his retirement  after more than 35 years of public service.", "title": "Congratulating Chancellor Joe Garcia on His Retirement", "date": "2025-06-12"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Our constituents' 401(k)'s, pensions, and kids'  college funds have all taken a huge hit.", "title": "Put Hardworking American Families First", "date": "2025-04-30"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "The recent college grad in Tamarac who makes enough  money only to pay rent is counting on us.", "title": "We Must Extend Aca Tax Credits", "date": "2025-12-17"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "To that end, we'll also reintroduce the Lowering  Obstacles to Achievement Now (LOAN) Act, which would lower the cost of  college for current and future student borrowers and their families by  making critical reforms to the student aid system, including doubling  the Pell Grant, improving the Public Service Loan Forgiveness program,  and making loans more affordable and accessible.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "It has jeopardized jobs and  retirement savings and college funds all across this country.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "Over the past week, I have enjoyed seeing many, many, many videos of  Charlie's debates with college students all over our great country.", "title": "Expressing Support for the Designation of October As the ``National Day of Remembrance for Charlie Kirk''", "date": null}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "The rule before us today provides Congress with another opportunity  to take a stand for consumer choice in America and take a stand against  our Nation's foreign adversaries who continue to infiltrate colleges  and universities across the Nation.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-freezers''; Providing for Consideration of H.R. Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "A proud Eagle Scout, a graduate of Tappan Zee High School and of  Rockland Community College, Pieter dedicated his life to serving  others.", "title": "Recognizing Jim Monaghan", "date": "2026-01-08"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "We have seen Hamas sympathizers take over  college campuses and instill fear in Jewish students.", "title": "Recognizing the Significance of Jewish American Heritage Month and Calling on Elected Officials and Civil Society Leaders to Counter Antisemitism", "date": "2025-05-22"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "By the way, fact number five, in some States, in a complete affront  to citizens, illegal aliens can get mortgages, bank loans, insurance,  driver's licenses, in-State college tuition, and free healthcare.", "title": "Outrageous Government-Funded Incentives", "date": "2025-05-06"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Olaf College and graduated with honors.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": "2025-10-08"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "One study found that only 3 percent of  government contracts are written in a way that someone without a  college degree could understand.", "title": "Plain Language in Contracting Act", "date": "2025-06-03"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "One more  time, we have an example of foreigners who come here from other places  who seem to appreciate America more than the native born and certainly  appreciate America more than the average college professor.", "title": "Educating Young People", "date": "2025-03-26"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "She went off to college at Brown, where she was studying French,  mathematics, economics, and was obviously very, very smart.", "title": "Unanimous Consent Requests--The Calendar", "date": "2025-12-17"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "He has served Alabama's fire service for eight years with dedication  and insight as a member of the Personnel Standards & Education  Commission with the Alabama Fire College.", "title": "Recognizing the Retirement of Chief Gary Sparks As Fire Chief for the City of Oxford, Alabama", "date": "2025-12-11"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Born in Texarkana, Texas, Gary attended school in the Texarkana and  Liberty-Eylau districts before pursuing higher education at Texarkana  College, Texas A&M Commerce, and Texas A&M--Texarkana, where he earned  a Bachelor of Science in Business with a minor in computer science.", "title": "Recognizing Congressional Patriot Award Recipient Gary Singleton", "date": "2025-11-18"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "After graduating from Savannah State College and Georgia Southern  University, Ms.", "title": "Mourning the Loss of John Reginald Murphy", "date": "2025-02-25"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Kappa Alpha Order was founded  on December 21, 1865, in a small room at Washington College, now  Washington and Lee University, in Lexington, Virginia.", "title": "Recognizing Kappa Alpha Order's 81st Convention", "date": "2025-07-02"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "It is also  used to get a marriage license, purchase firearms or ammunition, check  in for jury duty, or enroll in a college or university.", "title": "Providing for Consideration of S. Veterans Accessibility Advisory Committee Act of Providing for Consideration of H.R. Law- Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of and Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}]