[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…to the suffrage rights movement, to Nancy Pelosi's  historic speakership, women have been trailblazers and have made  history.\n\nThat is why I am proud to work with colleagues on both sides of the  aisle to pass our bill, the Smithsonian American Women's History Museum  Act, to make sure that the Women's History Museum gets its rightful  spot on The National…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689368/womens-history-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Congress.\n\nWe must ensure that the Executive Branch follows the law and ensures  Appropriated and obligated funds are used for their intended purpose.\n\nI urge our colleagues on both sides of the aisle to support this  commonsense legislation.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…Washington gridlock and partisanship to block a bill without a  fight. That is why we are going to pass it today, taking matters into  my own hands, with the support of my colleagues on both sides of the  aisle, to pass our bipartisan No Tax on Tips Act by unanimous consent.\n\n129  and the Senate proceed to its immediate consideration.\n\nMs. ROSEN. Madam President,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Representative Moulton for his leadership on this issue and  encourage my colleagues to support this legislation.\n\nMrs. DINGELL. Mr. Speaker, I strongly recommend my colleagues on both  sides of the aisle support H.R. 859, the Informing Consumers About  Smart Devices Act, and protect Americans' privacy.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Commuting Fairness Act to make it clear that we value the critical  work of our transportation security workers.\n\nMr. Speaker, I thank Congressman Garbarino and my colleagues on both  sides of the aisle for working with me to develop this legislation.\n\nMr. Speaker, given the recent attacks against our Federal workers, we  must seek innovative ways to…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…incredible honor, integrity.\n\nAnd even at this challenging moment in this country's history, we  need this body to be able to come together.\n\nSo I call on all of my colleagues on both sides of the aisle to  condemn this action, to stand united with one voice, standing up for  ourselves. Otherwise, we will just cast ourselves to the margins of  irrelevance…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…unite against the sabotage of our democracy, and uniting at  rallies, townhalls, and every other forum available to make your voice  known.\n\nI will be reaching out to colleagues on both sides of the aisle and  coming to the floor and reaching out to the American people. Just as we  threw off the yoke of monarchy 2\\1/2\\ centuries ago, the American  people…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…and FirstNet.\n\nI commend the committee for this much-needed network, and I ask my  colleagues to join me in support.\n\nMrs. DINGELL. Mr. Speaker, I strongly urge our colleagues on both  sides of the aisle to support H.R. 2482, and I yield back the balance  of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…will read it later--about John McCain in the prison camps.\n\nI wasn't here when we had this moment. But when I got here weeks  after this moment, Mr. Leader, all my colleagues on both sides of the  aisle talked about a special conference in the Old Senate Chamber. I  was not there, but the Democrats and Republicans--it actually changed  our behavior in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…that  this little bill is seeing the light today.''\n\nMr. Speaker, this bill passed the Committee on Ways and Means with  overwhelming bipartisan support. I urge my colleagues on both sides of  the aisle to support this commonsense legislation.\n\nMr. Speaker, I think this is a commonsense bill, and I am so happy  that our colleagues thought it appropriate…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697233/claiming-age-clarity-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…ensure that, regardless of the political climate,  science remains at the forefront of our Nation's progress and  innovation.\n\nSo, Mr. Speaker, I urge my sensible colleagues on both sides of the  aisle to support efforts that increase the resiliency of our Federal  science agencies in the face of these growing threats from the  administration, and to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…to the United States, and we have seen that too often in  the past.\n\nAs ranking member of the Senate Foreign Relations Committee, I am  committed to working with my colleagues on both sides of the aisle here  in Congress as well as folks in the Trump administration because we  must hold these groups accountable for their war crimes. We must  support them…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…Cemetery.\n\nAs ranking member of the subcommittee, I was pleased to work closely  with Chairman Boozman to build a strong bipartisan bill that reflects  input from colleagues on both sides of the aisle, not just on the  Appropriations Committee but across the entire Senate. And I thank  Senator Boozman for his collaboration and for his bipartisan work…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…programs, the Trump administration is trying to send us backward  in time, harming millions of women in the process.\n\nMr. Speaker, I am not going back. I encourage my colleagues on both  sides of the aisle to stand with me in support of the Women's Bureau  and the crucial opportunities and protections it provides for women in  the workforce.        Congratulations…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…bill also raises $117 million  over the next 10 years. This bill passed the Committee on Ways and  Means with overwhelming bipartisan support.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this very important clarification bill.\n\nMr. Speaker, H.R. 5346 is a commonsense bill that will help taxpayers  and the courts. I urge my…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697250/fair-and-accountable-irs-reviews-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…growing businesses the confidence to enter  the public markets and helping them reach new investors, expand  operations, and create jobs across our country.\n\nI thank my colleagues on both sides of the aisle and my Democratic  cosponsor, Mr. Meeks, for supporting these efforts to modernize our  capital markets.\n\nMrs. WAGNER. Mr. Speaker, I am prepared to close,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…two resolutions.\n\nIn December, this body overwhelmingly opposed similar resolutions in  a bipartisan fashion. I hope we can do that again today. As such, I ask  my colleagues on both sides of the aisle to vote no on these two  resolutions.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689526/motions-to-discharge-sj-res-33-and-sj-res-26"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I sincerely thank my colleagues on both sides  of the aisle for their work on this piece of legislation.\n\nMr. Speaker, I rise today in support of my bill, H.R. 3497, the Medal  of Sacrifice Act. Its purpose is…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…temporary  provisions permanent and stops payments to deceased individuals moving  forward.\n\nMadam Speaker, this bill is a big step toward accountability, and I  urge my colleagues on all sides of the aisle to join me in supporting  this vital antifraud, antiwaste, antiabuse legislation.\n\nAs the saying goes: You can't take it with you, so let's stop writing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…and  it is about protecting our American interests and ensuring that our  technological edge continues to serve the people, our values, and our  future.\n\nI urge my colleagues on both sides of the aisle to join me in  supporting this commonsense legislation. Together, we can keep America  at the forefront of innovation and ensure that our digital future…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…provides critical  funding that they need because they have a large amount of Federal land  and don't have a large tax base.\n\nI am calling on House leadership and my colleagues on both sides of  the aisle to act with urgency to get this measure passed and make sure  that these communities receive the funding that they need and that they  rely upon.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…limiting access to these resources.\n\nBy adjusting current regulations and language, we are protecting our  children, our families, and our communities. I encourage my colleagues  on both sides of the aisle to save lives and support this amendment.\n\nMr. BRESNAHAN. Mr. Chair, in closing, I urge my colleagues to vote  ``yes'' on this amendment, and I yield…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691881/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…adversaries, and  voting to prevent taxpayer dollars from funding abortion travel.\n\nMr. Chair, for their sake, for our sake, for the sake of our great  Nation, I urge my colleagues on both sides of the aisle to support this  bill, to deliver on our America First agenda with President Trump and  to stand firm in our commitment to peace through strength.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Fortune 500 company.\n\nI am proud of this legislation and how it advanced out of committee  with strong bipartisan support. I appreciate the strong backing from  our colleagues on both sides of the aisle who recognize that innovation  and small business growth should never be partisan issues.\n\nAt the end of the day, when Main Street succeeds, America succeeds.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Ernest  Peltz Accrued Veterans Benefits Act. We have worked closely with the  Peltz family, veterans service organizations, the Department of  Veterans Affairs, and my colleagues on both sides of the aisle,  including the lead Democrat sponsor, Congressman Ro Khanna, to craft  this legislation to correct this moral wrong.\n\nThis bill eliminates the burden…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…workers and American soldiers and American public servants out  of work. We let them do their job on behalf of the American people.\n\nMr. Speaker, I urge all of my colleagues on both sides of the aisle  to support what is genuinely a bicameral and bipartisan product and one  that the President will sign and has urged us to pass.\n\nMr. Speaker, again,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…and the better off our small businesses will be.\n\nMr. Speaker, I thank Representative Gottheimer for working with me on  this commonsense legislation, and I urge my colleagues from both sides  of the aisle to support H.R. 3351.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…families. It thanks them and affirms  that their sacrifices are worthy of our continued support.\n\nThis resolution has strong bipartisan backing, and I thank all of my  colleagues on both sides of the aisle who have joined as cosponsors.\n\nDuring National Police Week, let me say this to every police officer,  firefighter, EMT, dispatcher, and emergency responder:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…restoring hope and healing by putting a stop to drug  overdose and poisoning.\n\nMr. Chair, I thank Chairman Guthrie for his work on this important  issue, and I urge my colleagues on both sides of the aisle to support  this legislation.\n\nMr. Chairman, let's pass this bill. Let's secure our borders. Let's  stem the tide of the growing fentanyl crisis, and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691872/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…stands for something more important now, which is freedom of  speech, a constitutional privilege that our Nation will fight  vigorously to protect.\n\nI join with my colleagues on both sides of the aisle to shun and  eschew violence and to pursue freedom of speech through the rest of my  days.\n\nGod bless America, Charlie Kirk, and his widow as we move…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695808/what-i-learned-from-charlie-kirk"}]