[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…veterans to make sure that they can access these  therapies upon approval.\n\nEvery day we lose nearly 20 veterans to suicide. One suicide is way  too many. I urge my colleagues to support this amendment to make sure  that our veterans have the best care they need as soon as possible.\n\nMr. Chairman, I yield back the balance of my time.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692952/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…honoring those who have truly served with  integrity, and it is about making clear, 5 years later, that we will  not rewrite the history of January 6.\n\nI urge my colleagues to support this amendment and to remember the  men and women who have defended this country honorably--those who  upheld their oaths, who protected our democracy--and those who continue…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…global democracy.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Chair, I yield 1\\1/2\\ minutes to the  gentleman from Nebraska (Mr. Bacon).\n\nMr. BELL. Mr. Chair, I urge my colleagues to support the amendment,  and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…implemented, when it is  appropriate, and cost-effective so we can secure the grid without  burdening ratepayers with unnecessary investments.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  yield back the balance of my time.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Continued research on innovative battery coatings will heighten  military readiness, improve energy efficiency, and benefit the American  people.\n\nI urge my colleagues to support this amendment.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693897/department-of-defense-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…more childcare development centers, construct more State  extended-care facilities, expediting claims processing, and many  others.\n\nMr. Chair, I encourage my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMs. WASSERMAN SCHULTZ. Mr. Chair, I yield to the gentleman from New  Jersey (Mr. Gottheimer), a fearless defender of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…modernize our layered defenses and assess our  potential pulse layer capabilities. I greatly appreciate the inclusion  of my amendment in the en bloc. I ask my colleagues to support my  amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695156/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…our veterans more than research. We owe them results. We  owe them implementation. This amendment moves us one step closer to  delivering.\n\nI urge all of my colleagues to support this amendment, and I yield  back the balance of my time.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…strengthens  transparency, fortifies national security, and ensures Congress remains  fully informed about potential threats to the grid.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMr. GOSAR. Mr. Chair, I think the gentleman is suffering from power  phobia, but this is a report. That is all it is,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697892/electric-supply-chain-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…American citizens are struggling themselves?\n\nWe will never get inflation under control and interest rates down  until we balance the Federal budget. I ask my colleagues to support my  amendment to stop wasteful spending and wasteful earmarks.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699432/consolidated-appropriations-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…will increase the availability of credits and  provide alternatives to ensure that a lack of credits doesn't hamstring  new developments.\n\nMr. Chair, I urge my colleagues to support my amendment to H.R.\n\nMr. CRAWFORD. Mr. Chair, I am very pleased to recognize that my  friends on the other side of the aisle do recognize that we have a real  big problem…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…not appease the desires of the Communist Chinese  leadership by pretending that it is. Our maps should accurately reflect  this reality.\n\nMadam Chair, I urge my colleagues to support the amendment, and I  yield back the balance of my time.\n\nMr. CALVERT. Madam Chair, I move that the Committee do now rise.\n\nThe motion was agreed to.\n\nAccordingly, the Committee…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Lumbee Act.\n\nToday, Congress can take a major step forward to end the unfair and  unjust treatment of the Lumbee Tribe once and for all.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMr. ROUZER. Mr. Chair, I yield 1 minute to the gentleman from North  Carolina (Mr. Harris).\n\nMr. HARRIS of North Carolina.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…will define the next  century and ensures the United States remains the world leader in  artificial intelligence. This is a commonsense idea, and I encourage my  colleagues to support the amendment.\n\nMr. McGUIRE. Mr. Chair, talking about DOGE is a thinly veiled attempt  to score political points by changing the topic of the conversation  from this amendment,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Chair, I rise today to urge you and all of our  colleagues to support amendment No. 57 to the FY 2026 Department of  Defense appropriations bill.\n\nThis amendment strikes section 8072, a misguided rider that prohibits  the Navy from decommissioning…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…retention of Indiana's finest soldiers. This amendment serves to equip  our next generation of guardsmen to protect our homeland both at home  and abroad.\n\nI urge my colleagues to support this amendment, and I yield back the  balance of my time.                    Amendment No. 8 Offered by Mr. Correa", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692960/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…the United States, not validate identity politics. It makes sure  TRICARE serves the mission of protecting health, not undermining it.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMs. MACE. Mr. Chair, may I inquire as to the time remaining.\n\nMs. MACE. Mr. Chair, if not wanting to castrate kids is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…technology is the best chance for  America to beat China in the very important nuclear power race and  secure our Nation's future energy security.\n\nI urge my colleagues to support this amendment.\n\nGod bless west Texas, and go Wildcats.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694865/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]