[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…premises liability, products liability, and workers'  compensation defense.\n\nHis athletic legacy continues to be recognized. In 2021, Mr. Younger  was named to the Southern Collegiate Athletic Conference (SCAC) 30th  Anniversary Football Team and inducted into the Vicksburg Warren School  District's Athletics Hall of Fame. Now, in 2025, Millsaps College…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…Smith-McDonald became ESPN.com's  first-ever regular women's basketball columnist in the 1990's. Over her  distinguished career, she has covered women's professional and  collegiate sports for some of the Nation's most prominent outlets,  including ESPN, the San Francisco Chronicle, AOL Fanhouse, and espnW.  Her dedication to elevating women's sports…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…women in her recruiting class of 84, after receiving a  bachelor of business administration in 1988 from Freed-Hardeman  University in Henderson, Tennessee, where she played collegiate  basketball. After joining the department, she continued her education  by receiving a bachelor's of professional studies in fire  administration in 2000 and a master's of…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…threats through this budget and through this administration, to  college, to your kids' ability to access higher education, and to the  very institutions that make up our collegiate system in the United  States.\n\nMs. FRIEDMAN. Yes. Besides being a mom, I am a breast cancer  survivor. After I was diagnosed, I found out that one of the treatments  that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Record the following  proclamation:\n\nWhereas, Delta Sigma Theta Sorority, Incorporated was       founded in 1913 on the campus of Howard University by 22       visionary collegiate women committed to public service with a       primary focus on the Black community;\n\nWhereas, for over 100 years, Delta Sigma Theta has       championed the causes of economic…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, I began this week in my  district at Penn State Abington's new Collegiate Recovery Program with  students in recovery for drug or alcohol addiction or who have been  affected by others with addiction.\n\nIt is a place for students to be in community…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698085/healthcare-and-affordability"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…graduates of Dominion High School's class of 2025.\n\nIn their time as Titans, they have excelled across a wide range of  fields. Six will continue their athletic pursuits at the collegiate  level.\n\nMembers of the class made their mark at this year's Loudoun Now's  2025 Excellence in High School Journalism Awards ceremony. Others were  National Merit Scholarship…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Bands at my alma  mater, Jacksonville State University. During his 32-year tenure, he  transformed the Marching Southerners into one of the most respected and  accomplished collegiate marching programs in the Nation.\n\nUnder Dr. Bodiford's leadership, the Marching Southerners expanded  from approximately 140 members to more than 500, becoming one of the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Yancey, Myakka City Elementary School; Kimberly Thomas,       Willis Elementary School; Suzanne Theiss, Southeast High       School; Dilcia Navarro, State College of Florida Collegiate       school.\n\nTeacher Award: Laura Redeker, Anna Maria Elementary School;       Susan Nova, Harvey Elementary School; Katharine Kimbrell,       Braden River Middle School;…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…I rise to honor Christendom College,  which has, once again, shown that excellence on the field can go hand  in hand with achievement in the classroom.\n\nThe United States Collegiate Athletic Association named Christendom  the winner of the 2025 President's Cup, recognizing the Nation's top  academic-performing athletic department. I commend Director…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…members of  the 1980 U.S. Olympic Men's Ice Hockey Team, in recognition of their  extraordinary achievement at the 1980 Winter Olympics where, being  comprised of amateur collegiate players, they defeated the dominant  Soviet hockey team in the historic ``Miracle on Ice'', revitalizing  American morale at the height of the Cold War, inspiring generations…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…first reception and first  touchdown of his NFL career. Frank's touchdown is the result of an  unwavering work ethic and a commitment to excellence.\n\nFollowing a commendable collegiate career at the University of  Wyoming, Frank went undrafted in the 2024 draft, but he did not let  that deter him. He signed with the Denver Broncos as an undrafted free…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699338/congratulating-frank-crum"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…seconds, setting a national high school women's  and national women's 1-mile record for those under 20 years old of 4  minutes 23.5 seconds, only 0.04 seconds over the women's collegiate  mile record. Just 3 days later, she broke her own national high school  2-mile record by 17 seconds. She has also set national records for high  school women in the 2K,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692882/congratulating-jane-hedengren"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…alma mater, the University of Northern Iowa, competed earlier this  month in Philadelphia.\n\nI want to congratulate two teams from my home State who won their  respective collegiate championships this month. In the NCAA Division  III wrestling national championship, the Knights from Wartburg College  returned from Rhode Island as cochampions and with…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…his own right, is now a  wonderful man.\n\nProfessionally, Richard has worked at some of the world's leading  companies, and for decades he has taught at the high school and  collegiate level.\n\nDespite his many professional accomplishments, what truly sets  Richard apart in my life and in the lives of many others is his  faithful service to his Lord and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…degree, specified       coursework, or other form of educational attainment awarded       by a junior or community college, college, or university that       is accredited as a collegiate institution by a recognized       accrediting agency or approved by the appropriate State       education authority under State law (or the appropriate       education authority…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700121/skills-based-federal-contracting-act-of-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…education, developing a wide  network of fans, friends and business partners across our Commonwealth.\n\nIn Kentucky, basketball royalty is a highly coveted currency at the  collegiate level, something that Wayne Martin obtained at multiple  institutions. As head coach of the men's basketball team at his alma  mater Morehead State University (MSU) from…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…wonderful United States  of America. Today, I rise to recognize one of those wonderful things,  the Eastern Washington University Adaptive Athletics Program, home of  the first collegiate National Wheelchair Basketball Association team in  the Western United States.\n\nFounded in 2019, this program embodies the values of leadership,  teamwork, positivity, and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…members of the 1980 U.S. Olympic Men's  Ice Hockey Team, in recognition of their extraordinary achievement at  the 1980 Winter Olympics where, being comprised of amateur collegiate  players, they defeated the dominant Soviet hockey team in the historic  ``Miracle on Ice'', revitalizing American morale at the height of the  Cold War, inspiring generations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize the University of  Cincinnati Clermont women's volleyball team. The Cougars defeated Kent  State Tuscarawas to win the United States Collegiate Athletic  Association Division II championship. This is UC Clermont volleyball  team's second title in its history. What makes this title even sweeter  is that Kent State…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…members have embodied  the values of scholarship, philanthropy, and character development-- setting a powerful example of what it means to lead with integrity and  purpose.\n\nCollegiate organizations like Gamma Nu play a vital role in shaping  the next generation of leaders, offering young women opportunities to  build confidence, develop skills, and form…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695796/recognizing-100-years-of-the-gamma-nu-chapter-of-kappa-kappa-gamma"}]