[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…rise today to celebrate Orange County's  grandmother, Cristina Prada, who is 94 years old.\n\nCristina's story is a very familiar story to us in Orange County. She  came from Colombia in 1973 and worked at two or three jobs at the same  time to make ends meet. She worked as a housekeeper at a nearby resort  and cleaned houses for wealthy movie stars.\n\nCristina…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "Mr. LEVIN. Madam Speaker, I rise today to speak for my constituents,  Gladys and Nelson Gonzalez.\n\nThirty-five years ago, they came to the United States from Colombia  in search of a better life. They tried to file for asylum but received  bad legal advice from a now-disbarred attorney.\n\nNelson and Gladys Gonzalez raised three daughters…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690924/recognizing-gladys-and-nelson-gonzalez"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…American people, there is no  telling and no stopping what comes next because the administration has  made it clear that Venezuela is the opening salvo. Will it be Cuba next  or Colombia or Mexico or Greenland, for crying out loud?\n\nThis is the moment when we need to stand up and exercise our powers  as part of the government that is closest to the people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that have trade  surpluses with America.\n\nI recently heard from a Vermonter who imports coffee and has a niche  business that has become extremely successful. The tariffs on Colombia  have resulted in this: A container that cost $700 last month--that  container now costs $13,000. How do you deal with that? A hit to the  margin is--no business can absorb…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…What will this unending occupation cost the American people?  Why did the administration, led by Secretary Rubio, lie about regime  change? Which is next: Greenland? Cuba? Colombia? Mexico?\n\nBut one answer is perfectly clear: the answer to the question of why  Trump and Rubio did this. It is obvious. This is not a war for the  Venezuelan people. It is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…has made clear that this is a war  for oil and that he will work with any pawn that will get it to him,  even those who are launching a new wave of repression in Venezuela.\n\nColombia, Mexico, Greenland--he is handing Putin a gift by dividing  NATO. Our allies had to meet yesterday to defend Denmark on Greenland  from this bully in chief.\n\nSo many conflicts…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698602/war-for-oil"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…seems President Trump is drunk on this hubris. We have  now seen Stephen Miller saying that the United States has the right to  take Greenland. Secretary Rubio threatened Colombia and Cuba. It  appears that President Trump thinks that reverting back to an era of  imperialism or ``spheres of influence'' is the best way to demonstrate  power, that just…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…shape, or form.\n\nBut let me just underscore the perils of what we are discussing  today. Now, this is an article that just came out. I haven't had the  chance to vet it: ``Colombia president claims U.S. bombed Colombian  boat in strike off Venezuela.''\n\nSo I don't know whether we have now struck a Colombian ship or what  the circumstances were or who…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, I thank the gentlewoman for  yielding. This has been a week. We invaded Venezuela; threatened to  invade Greenland; put Cuba, Mexico, and Colombia on notice that they  could be next; had the administration and many of my  colleagues, who know better because they were here, try and rewrite the  history of what happened…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to end Donald Trump's destructive tariffs. We  need to help families afford daycare. These are the things that  Americans care about, not invading Venezuela, not attacking Colombia,  or dreaming of invading Greenland.\n\nThe Democrats are focused on the things that matter to the American  people, and we will focus on these like a laser--the high cost of…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…unfortunately, has not stood up to his despotic actions.\n\nHe is not listening to Congress or to the American people. He has  threatened military action against Greenland, Colombia, Cuba, Mexico,  and Panama; and he has threatened to keep sidestepping Congress if you  will let him.\n\nAt a time when Americans are struggling to pay for rent, groceries,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…future military strikes against the country if they don't  comply with his will.\n\nDespite what the President claimed on the campaign trail, war and  threats of future wars with Colombia, with Cuba, with Mexico, and even  our NATO ally Denmark, when it comes to Greenland, are now animating  features of his foreign policy.\n\nThe President's team claims their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…President's friends? That is what is going on here.\n\nThere is no limit. Within hours of Maduro's capture, President Trump  was threatening Greenland; they have minerals. Colombia, they have  resources as well. Cuba and Mexico. Is this the world that will work  for us or the world that we want where rather than acting as a  defender--actually the leader--in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…conflict and from a conflict into an  all-out war.\n\nWhile Trump tries to claim their targets are boats from Venezuela, in  reality, reports show strikes have hit boats from Colombia and  apparently those carrying citizens from other neighboring countries.\n\nThe administration has even admitted they don't know each individual  identity of those targeted.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…United States owes its deepest       gratitude to these officers of the United States Capitol       Police and the Metropolitan Police Department of the District       of Colombia, as well as officers from other Federal, State,       and local law enforcement agencies and protective entities       who valiantly protected the United States Capitol, Members…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…when we don't know who they are. But once we pick them up, we don't  summarily kill them. We don't even try them.\n\nThe United States has now repatriated two survivors to Colombia and  Ecuador. If, as we are told, these groups constitute a threat to our  security equal to al-Qaida, that they are somehow narcoterrorists, then  why are we allowing these…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…naturalized from:  One, Mexico; two, India; three, Philippines; four, Dominican Republic;  five, Cuba; six, Vietnam; seven, China; eight, El Salvador; nine,  Jamaica; and ten, Colombia.\n\nDo you notice anything about those ten countries? Not one of those  countries are sending us immigrants who are primarily European in  nature. I should maybe qualify that.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…canceling some of the most egregious Biden-era waste, fraud, and abuse.\n\nHere is just some of the funding that we are canceling today: $4  million for sedentary migrants in Colombia; $3 million for  circumcision, vasectomies, and condoms in Zambia; $5.1 million to  strengthen the resilience of lesbian, gay, bisexual, transgender,  intersex, and queer…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692532/rescissions-act-of-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Mr. GIMENEZ. Mr. Speaker, I rise today to recognize and honor the  former President of the Republic of Colombia, Alvaro Uribe Velez, for  his extraordinary leadership, steadfast defense of democracy, and  unwavering commitment to the safety and prosperity of the Colombian  people.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…and abuse in foreign aid spending. It boggles the mind  to think that some in Congress defend spending $2 million on sex  changes in Guatemala, thousands on an LGBT opera in Colombia, and  thousands on a trans comic book in Peru. This is the low-hanging fruit.  If Congress can't vote to cut this egregious, crazy, leftwing lunacy,  will Congress ever have…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688899/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…interests.\n\nPeople ask about ``America First.'' What does it mean?\n\nHere is what I think it means: ``America First'' means that we are  not going to tolerate--in Venezuela, Colombia, Cuba--countries in our  backyard that are run by international drug cartel leaders, who are not  legitimate in terms of being elected, to poison this country; that we  are…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…stability in a critical part of our hemisphere. As we see this  administration prioritize our hemisphere and focus on the challenges  throughout, in Venezuela, in Cuba, and in Colombia, it is imperative to  have a strong partnership with Haiti.\n\nThis legislation comes at a critical moment. I was proud to cosponsor  this, and I was proud to support Dr. Murphy…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…million of taxpayer money. I might want to use the $3 million on  homeless vets.\n\nHow about we take some of that cash back.\n\nMr. Speaker, $4 million for sedentary migrants in Colombia. That  seems like an oxymoron.\n\nThere is $2.5 million for teaching young children, get this, how to  make environmentally friendly reproductive health decisions. I scratch…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…chance to prove that we still remember who we work for here in  Washington.\n\nWe are cutting $2.5 million for electric vehicles in Vietnam, $47,000  for transgender surgeries in Colombia, and nearly $10 billion for NPR,  PBS, and other bloated liberal pet projects that have no place in a  responsible budget.\n\nWashington acts like taxpayer dollars are theirs…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692549/rescissions-act-of-2025"}]