[{"senator": "Blake Moore", "party": "Republican", "sentence": "I represent Hill Air Force Base, and he  represents the Colorado Springs area, which we all know is where the  Air Force Academy is located.", "title": "Events This Week", "date": "2025-05-14"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "The third one is going  to go to the Olympic Training Center in Colorado Springs.", "title": "Miracle on Ice Congressional Gold Medal Act", "date": "2025-04-28"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, I rise today to welcome the Swire Coca-Cola  manufacturing plant to Colorado Springs.", "title": "Welcoming Swire Coca-Cola to Colorado Springs", "date": "2025-12-12"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "Olympic and Paralympic Committee headquarters in Colorado  Springs.", "title": "Recognizing Olympians From Colorado", "date": "2026-02-04"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, I am here today to support the pregnancy centers across  America, including Life Network in my home of Colorado Springs,  Colorado.", "title": "Providing for Consideration of H.R. Supporting Pregnant and Parenting Women and Families Act; Providing for Consideration of H.R. Pregnant Students' Rights Act; and Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, I rise today to thank the Colorado Springs  Chamber of Commerce for hosting the chamber fly-in to Washington, D.C.,  this week.", "title": "2025 Colorado Springs Chamber of Commerce D.C. Fly-In", "date": null}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Northern Command and Cheyenne  Mountain in my district in Colorado Springs for detecting missile  launches and helping pass on that intelligence.", "title": "Congratulating the United States Military", "date": "2025-06-25"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, over the weekend, the Colorado Springs Police  Department, the El Paso County Sheriff's Office, and the Drug  Enforcement Administration worked hard to do a raid in my hometown of  Colorado Springs, Colorado.", "title": "Raid in Colorado Springs", "date": "2025-04-28"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "The United States Olympic &  Paralympic Museum in Colorado Springs will have a Congressional Gold  Medal.", "title": "Miracle on Ice Congressional Gold Medal Act", "date": null}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, I rise today to recognize Sergeant Olav  Chaney, of the Colorado Springs Police Department, for his 35 years of  service to our community.", "title": "Recognizing Sergeant Olav Chaney", "date": "2025-05-15"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, I rise today to recognize the contributions  of Pastor Stewart McWilliams and numerous churches in the Pikes Peak  region in organizing and participating in the citywide prayer across  Colorado Springs as part of the National Day of Prayer events earlier  this year.", "title": "Recognizing Pastor Stewart McWilliams", "date": null}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "I will just give one example near Colorado Springs.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, I rise today to recognize and celebrate the  25th anniversary of the extraordinary impact that Parents Challenge has  made in Colorado Springs, Colorado.", "title": "Recognizing Parents Challenge", "date": null}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Olympic and       Paralympic Museum in Colorado Springs, CO, where it shall be       displayed as appropriate and made available for research.", "title": "Miracle on Ice Congressional Gold Medal Act", "date": "2025-04-28"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, I rise today to recognize Colonel Ric  Trimillos for his extraordinary dedication and service as Scoutmaster  of Troop 66 in Colorado Springs.", "title": "Recognizing Colonel Ric Trimillos", "date": "2025-11-18"}]