[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…need to ensure equal access for all Americans  to educational opportunities of high quality, and such educational  opportunities should not be denied because of race, creed, color,  natural origin, or sex.''\n\nMr. Speaker, I am reminded that one of the Department's most  important responsibilities has been to enforce various civil rights  laws that prohibit…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…from voting, but it is already illegal for them to vote, and  it is extremely rare.\n\nIn reality, the SAVE Act makes it harder for Americans, especially  women and people of color, to participate in our elections. We have  seen these tactics before, creating barriers to the ballot box to  suppress the vote, and yet Republicans continue to find ways to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690014/safeguard-american-voter-eligibility-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Still I rise, Mr. Speaker, in mourning for the  lives that have been lost at the hands and the color of law.\n\nMr. Speaker, Mr. Pretti and Ms. Good should not have lost their lives  as they did. Yes, I stand for impeachment of Ms. Noem, the Secretary,  but that is not enough.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699601/mourning-the-lost-lives-in-minnesota"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…high. When I talk to  Republicans, Democrats, and Independents--rural, urban, and suburban-- no matter where they were born, no matter what language they speak, no  matter the color of their skin, no matter who they love, no matter how  they worship, they want three things: They want to know they live in a  thriving and healthy community. They want to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…must refuse the default Republican Social Security ``reform''  of raising the retirement age to 70 given that it would  disproportionately harm Black men and communities of color who have  lower life expectances. Systematic inequalities in socioeconomic  status, education, food security, and access to healthcare play an  intricate role in life expectancy.…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "Mr. CASTRO of Texas. Americans are living in a time of viciousness.  Under Donald Trump, we are living in America the brutal, a Nation where  the wrong skin color, the wrong accent, the wrong language makes you a  suspect, puts you in danger, threatens your life. Masked agents without  warrants and long guns are barging into people's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699656/horrific-ice-abuses"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…fraud solves a problem that doesn't  exist. I couldn't disagree more.\n\nThe problem is that Republicans are losing at the ballot box. They  are losing young voters, voters of color, and women. So there is a  problem, that no one is buying into Republican ideas and policies and  the only solution is for Republicans to engage in a coordinated effort  to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…years, in the wake of the Citizens United  decision, we should be honest with ourselves: Our politics were never  truly fair. Voters were marginalized or excluded because of the color  of their skin. Machines and bosses took advantage of everyday people.  The powerful thought they could decide for the rest of us.\n\nBut we made progress. We took steps forward.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699106/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…debt of gratitude to Shoreline  Publishing, which serves the people of southern Westchester with five  community newspapers; a countywide Jewish monthly newspaper; and a  full-color quarterly magazine, Westchester Women.\n\nUnder the leadership of president and publisher Edward Shapiro,  Shoreline provides an information lifeline across our towns with the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Academy's first  African-American female brigade commander,  earned that honor not even 5 years ago, in 2020.\n\nI share these names and stories because these are women and women of  color who are an integral part of the rich history of the United States  Naval Academy that I have the privilege of representing. It is not just  the Naval Academy. They represent…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Lake.\n\nThe Crystal Lake Strikers are a drumline that seamlessly integrates  the arts and education. They perform year-round and offer a wide range  of programs in percussion, color guard, and other performing arts  disciplines. Their mission is twofold: to provide high-quality  entertainment to the community and to build confidence in students. By  expanding…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…red- blooded American to hear about them, read about them, and learn about  them in the same manner that we learn about others whose contributions  were similar, but their skin color made them more worthy.\n\nWhen we hear stories of the American Revolution, we don't often hear  of Crispus Attucks, a Black man who became the first casualty of the  American…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…communities, and Minnesotans have paid the  price.\n\nThrough President Trump and Kristi Noem's reckless and lawless ICE  operations, the administration has targeted communities of color,  ripped families apart, detained U.S. citizens, and made it harder for  law enforcement to do their jobs. As a result, it has endangered every  single Minnesotan.\n\nEarlier…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699323/consolidated-appropriations-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…inclusion.  Including a National Women's History Museum on The National Mall in  Washington would ensure that we are including everyone--women, those  with disabilities, and women of color--into our national fabric and  that we are not forgetting that their contributions are important to  this country. They should not be forgotten because we are a part of  this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…weapons. They are swarming  businesses and parks to indiscriminately stop, arrest, or detain  immigrants and U.S. citizens.\n\nPeople are being stopped and detained because of the color of their  skin. These are not violent criminals. The majority of the people have  no criminal record.\n\nThey are taking the parents, and they are leaving the kids stranded.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…voices of actual Americans in our democratic  process.\n\nThis past week and today, all we hear are the Democrats sharing their  concerns that rural Americans, women, and people of color are not  capable of getting an ID. This is insulting and condescending and an  untrue argument.\n\nYou need an ID for most everything else in daily life. Maybe if the  Democrats…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…horribly  racist country, I think it would be odd for a racist country to let the  ten most common nationalities to come here, all what our leftwing  friends would call people of color.\n\nIn any event, we have to ask ourselves: How do we handle this huge  influx of people coming into the country? If people come here and lie  and say that they are coming here…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…destroyed.\n\nI wish that were true. This isn't a one-State problem; it is a one- nation problem. All 50 States have National Flood Insurance Program  policyholders. The darker the color, the more likely the flooding.  Missouri is in a dark color. New York State--minimal coastline--is in a  dark color. Pennsylvania is in a dark color.\n\nThis is called river…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Fond du Lac, Wisconsin, there are maybe 400 different  landlords. The landlords compete for the rental dollar.\n\nI have the ability to buy my own house, paint my house whatever color  I want, and maintain my lawn in whatever fashion I want. That is  something we do in a free-market economy.\n\nIn a socialist economy, the government runs everything. If I want…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…truth. Today  was about performance for some of them, but today for us is about  results--a result that improves the lives of Americans regardless of  their race, religion, color, or creed. It does not matter.\n\nI tell you what Ronald Reagan used to remind us, you can always trust  the American people. We do trust the American people. They can discern…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…gentleman for yielding.\n\nMr. Speaker, I rise in support of H.J. Res. 88, but I will clarify  one thing for my colleague on the other side of the aisle and add a  little bit more color or correct the truth with the other half of the  truth. That is, yes, Trump is trying to claw back some money for the  infrastructure of building these charging stations. Why…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…around, and you can see California and Hawaii--all with  this issue. Now, 44 States have had at least $50 million worth of  claims, and those would be in the kind of mustard color.\n\nSo here you see again inland States--not coastal but inland--having  problems with flooding. When we say a ``problem with flooding,'' we  mean there is a family that has…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Marine of the Year.\n\nChase Muchmore is a current student at Manor Middle School and is a  Corporal with the Young Marines of Lancaster County. As a member of the  organization's color guard, he has spoken and posted the colors for  events such as graduations, sporting events, and a Cold War Veteran  Recognition Ceremony that I held in November 2025. He has…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699827/recognizing-young-marine-corporal-chase-muchmore-on-being-named-the-pennsylvania-regiment-junior-young-marine-of-the-year"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…spending. It is the promises we have  made that we have got to keep but we have got to figure out a way to  finance it.\n\nWhat this chart is showing is we see this slightly darker color here.  That is the primary deficit. That is actually programs that we are  spending more money than we have coming in. All of this lighter purple  is the interest we owe.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…the United States, not  just Louisiana. Again, $500 billion in damage that we have to pay after  the fact versus investing a few million now to prevent.\n\nNow, the darker the color, the more the recent flooding. So you can  say, although I have been speaking about Louisiana, you can see that,  across our Nation, floods have been destroying homes and neighborhoods;…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…well, for  personal inspection, physical fitness team, armed drill team  regulation, and unarmed drill team exhibition. They placed second for  unarmed drill team regulation and color guard. They placed third for  academic team and armed drill team exhibition.\n\nAdditionally, Madelyn Michael won the individual award for most sit- ups for girls, completing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697431/congratulating-salpointe-catholic-high-schools-girls-flag-football-team"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…satisfy trends in the corporate  boardrooms.\n\nIn addition, the bill strengthens fairness and nondiscrimination in  the selection of service providers. It states clearly that race, color,  religion, sex, or national origin may not be considered when selecting  fiduciaries, counsel, employees, or service providers for ERISA plans.  Retirement plan service providers…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…it had a picture of the flooded areas of the  Midwest. And the blue that shows up where the water is was almost as  blue in the Midwest that was flooded along with the same color of the  Great Lakes.\n\nFlooded tributaries at this time of the 1993 flood overtopped levees,  devastating communities, businesses, and the livelihoods connected to  those businesses.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…it, Dan Sullivan. This is a great bill, and I just  want to come here and speak out on behalf of it.\n\nYou know, a lot of the Democrats talk about indigenous people, people  of color, how much they care about minority communities. When it comes  to my State, these guys target Alaska Natives. I have seen it my whole  career. I mean, geez, the minority leader--the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…founding  promise of life, liberty, and the pursuit of happiness is preserved  only through the sacrifice of our heroes.\n\nThe American flag flies in red, white, and blue--each color rich with  meaning. Blue stands for vigilance and justice, a call to remain  steadfast in our values. White reflects our Nation's ideals and purity  of purpose. Red honors…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691585/recognizing-the-service-of-those-who-gave-the-ultimate-sacrifice-memorial-day-2025"}]