[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…Samuel Kirton; Dr. Stephanie  Buxhoeveden; Katharina Hopp; Jerrod Kerr; Dr. Terry Watnick; Scott  Howe, Marine Corps retired; Van Stewart, United States Navy; Reid  Novotny, colonel, Air National Guard; Alex and Lesley; Chip and  Kristin; Gregg and Molly from Denver.\n\nWilliam Tuttle, United States Navy:\n\nAfter my son's birth and diagnosis, I was diagnosed…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to congratulate Lieutenant  Colonel Chaplain Reverend Dr. A'Shellarien Addison on her recent  promotion at the Delaware Army National Guard.\n\nEarlier this month, I was honored to attend her promotion ceremony…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…been a member of the Military Order of the  World Wars for over 20 years. He was elected the 90th National  Commander-in-Chief for the MOWW in 2020 and serves as the local Colonel  George C. Woolsey Chapter commander.\n\nGeneral Lopez's service is beyond worthy of recognition by Congress.  He represents the best of our servicemembers, and his leadership…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, I rise today to congratulate Colonel Dominic V.  Dinh on his retirement from the United States Army Reserve.\n\nColonel Dinh immigrated to the United States as a Vietnamese refugee  in April 1975 and joined the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, today I rise to honor a lifetime of  service of one of my constituents, Colonel William Woodard Butler, the  2025 Veteran of the Year for Virginia's Fourth Congressional District.\n\nWith over 38 years of service between Active Duty and the Reserves,  Colonel…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise today to honor Lt. Colonel Jabar  Shabazz, who is retiring after 31 years of faithful service to our  Nation, culminating in his service as lieutenant colonel, the highest  rank in the Sheriff's Office,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Black servicemembers was an act  of patriotism and putting country over hate.\n\nThat leads me to someone who lived much of her life until she died in  my hometown, Lieutenant Colonel Charity Adams Earley, whom I finally  called Aunt Charity. She mentored me and taught me much of what I know  today. She always reminded me of barriers and challenges, but…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…decided that was not taxing enough  and proceeded to earn a master's of law in taxation from George  Washington School of Law.\n\nGerry was a man who wore many hats, from Air Force colonel to lawyer,  but it was his role as a community leader where he truly found his  calling. He may have been known as Mr. Pothole, but his impact on the  community was anything…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…respect to the end of an era. One of the most improbable,  inspiring, and truly remarkable chapters in American history quietly  closed during our most recent break.\n\nLieutenant Colonel George Hardy, a veteran of Vietnam, Korea, and  World War II, passed away.\n\nThis is not a name most of us know in isolation, but we all know the  story of the Black men who…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696982/tuskegee-airmen-moment-of-silence"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "Mr. LICCARDO. Madam Speaker, I rise today to recognize the  extraordinary life of Colonel Vu Van Loc, a South Vietnamese Army  veteran and beloved community member and leader in San Jose, for his  selfless dedication to Vietnamese refugees and to cultural  preservation.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…close.\n\nWhile he never made it overseas, Mr. Lang rose to the rank of master  sergeant at the Army Air Corps, received three medals for his service,  and served directly under Colonel Noel Parrish, the commander of the  Tuskegee program.\n\nMr. Lang didn't open up about his military service until his son,  Brad, showed an interest in aviation in the 1970s.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Hovenier, US       Ambassador, retired; Vicki Huddleston, US Ambassador,       retired; Robert Hutchings, Former Chairman, National       Intelligence Council; Charles Ikins, Colonel, US Marine       Corps, retired.\n\nRobert Jackson, US Ambassador, retired, Former Principal       Deputy Assistant Secretary; Susan Jacobs, US Ambassador,       retired; Ali…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…analysis. Indeed, Mr. Speaker,  former Israeli security officials have been speaking out. Last week,  two former Israeli Air Force pilots, Brigadier General Asaf Agmon and  Colonel Uri Arad, published a letter in Hebrew in the Israeli newspaper  Haaretz. They wrote: ``As the war in Gaza dragged on, it became clear  that it was losing its strategic and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…legislation will close the gap in coverage and  ensure that these servicemembers receive the care and benefits they  deserve.\n\nThis bill is named after retired Air Force Lieutenant Colonel Susan  Lukas, a constituent from Gainesville, who returned to work in the  Pentagon the day after 9/11 and still suffers to this day chronic  health issues as a result.\n\nThese…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695328/remember"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…General (Retired) R. Scott       Dingle, U.S. Army\n\nTrailblazer Award: The Honorable Robert R. Rigsby,       Associate Judge, District of Columbia Superior Court and       Colonel (Retired), Judge Advocate, U.S. Army Reserves\n\nHigh School Essay Contest First Place Winner: Gabriella E.       Celestine, James W. Robinson, Jr. Secondary School\n\nBrigadier…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I stand before you, along with my colleague,  Representative Keith Self of the Texas Third Congressional District, to  honor Colonel Chuck DeBellevue, United States Air Force retired, an  American patriot whose extraordinary courage, leadership, and lifetime  of service reflect the highest ideals of our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I rise to recognize Cadet Lieutenant Colonel  Mikhail Karnaukh who was named as a recipient of the General Ira C.  Eaker Award. This award is the second most prestigious honor in the  Civil Air Patrol Cadet Program.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689068/recognizing-cadet-of-the-year-recipient-cadet-lieutenant-colonel-mikhail-karnaukh"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…strengthened Georgia for generations.\n\nMr. Speaker, Dr. Adams has left an enduring legacy that will forever  touch the soul of our beloved State.                 Honoring Colonel Stephen ``Tracker'' Thomas\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Colonel  Stephen ``Tracker'' Thomas, who is retiring from command of Georgia's  Combat…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…of Virginia. Mr. Speaker, I rise today to speak on my  bill designating the United States Postal Service facility located at  1225 Kempsville Road in Virginia Beach as the Colonel Edward Shames  Post Office Building.\n\nColonel Shames was a proud Virginian and a member of Easy Company,  101st Airborne Division, notably featured in the hit HBO documentary…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699640/colonel-edward-shames-post-office-building"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Mr. SESSIONS. Mr. Speaker, I am honored to present a Congressional  Veteran Commendation to a member of our greatest generation, retired  USAF Lieutenant Colonel Charles H. Wagamon, of Huntsville, Texas. Lt.  Colonel Wagamon served as a Captain, Bombadier and Navigator flying in  B-25 Mitchell Bombers with the U.S. Army Air Corps during…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, today, I recognize and honor seven  remarkable Americans whose military service embodies the very best of  our Nation.\n\nColonel Mark R. Baaden, Colonel John W. Mansur, Sergeant Raymond L.  Burkard, Chief Warrant Officer Thomas W. Thompson, Sergeant Jeff  William Patterson, Specialist Pascuale F. Coniglio,…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…College, where he graduated with honors. He held a series of  command positions and earned numerous service awards and medals. He was  discharged honorably as a Lieutenant Colonel.\n\nFollowing his military service, Mr. Ziegenfuss started an  environmental company, which he subsequently sold, was vice president  of operations for Creative Printing and…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690124/recognizing-hollister-city-administrator-rick-ziegenfuss"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise to recognize Lieutenant Colonel Kyle  Frazer's exemplary and distinguished record of service to our Nation. A  native of Minneapolis, Minnesota, Kyle was commissioned as an Infantry  Officer in 2008 through…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…ensure that there is trusted medical research  available to pave the way for toxic-exposed military pilots and aircrew  to access their VA disability compensation benefits.\n\nColonel Andrew Shurtleff, who testified before the House Committee on  Veterans' Affairs in March, was one of these veterans. He served our  country as an Air Force fighter pilot…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…equine-assisted services to  more than one thousand veterans, offering healing and support to those  who have served our Nation.\n\nThe program began as a collaboration between Lt. Colonel Scott Schule  of the 1st Cavalry Division Horse Detachment at Fort Cavazos (formerly  Fort Hood) and ROCK, with the goal of supporting wounded veterans  recovering at Brooke…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689420/recognizing-the-contributions-of-ride-on-center-for-kids-rock"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, it is my privilege to present a  Congressional Veteran Commendation to Lieutenant Colonel Barbara  MacMillan, U.S. Army, Retired. Her life and career reflect hard work,  selfless service, and dedication to her Nation and Central Texas.\n\nLTC MacMillan served from…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Field and on Tuskegee Army Air Field in  Tuskegee, Alabama, and later formed units like the 99th Fighter  Squadron and the 332nd Fighter Group. They were under the command of  Colonel Benjamin Oliver Davis, Jr., who was born right here in  Washington, D.C.\n\nWhen the pilots of the 332nd Fighter Group painted the tails of their  P-47s red, the nickname ``Red…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696983/tuskegee-airmen-moment-of-silence"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, it is with great pride and honor  that I present Lieutenant Colonel Spencer Hutson Smith, U.S. Marine  Corps (Ret.), with a Congressional Veteran Commendation. His life and  career are a testament to his exceptional character and unwavering…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to recognize Colonel Ric  Trimillos for his extraordinary dedication and service as Scoutmaster  of Troop 66 in Colorado Springs.\n\nFor years, Ric has served as a mentor and a role model to the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696825/recognizing-colonel-ric-trimillos"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…recognize the  great work being done at Letterkenny Army Depot in Chambersburg,  Pennsylvania.\n\nRecently, on a visit there with Senator Dave McCormick and Depot  Commander Colonel Lewis, I was able to see firsthand how the Army depot  works every day to support our warfighters.\n\nSince assuming command in July, Colonel Lewis has overseen more than  1,500…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}]