[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…of Maine, a district  represented by Congressman Jared Golden. I am thankful for Congressman  Golden's service. He served his Nation with distinction overseas and  has come back home to serve this Nation in the United States Congress.\n\nKasey writes as a single mom of two young children and nonprofit  professional in rural Maine, Kasey and her children…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…crying out for the basic right to live  safe from unnecessary gun violence. Americans want to send their  children to school or to the mall without wondering if they will ever  come home.\n\nThese egregious Trump administration cuts are a slap in the face to  every family and every survivor of gun violence. In many cases, these  rollbacks also make it more…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…traumatized that if they have not already  been kidnapped, they are fearful that they will be.\n\nChildren crying in their teachers' arms are afraid that they are  going to come home and their parents will be gone. There are elders  carrying all of their medications with them in their comings and goings  for fear of being abducted and sent somewhere without…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…of war and peace based on how tough I want to look on Truth Social.\n\nAs I celebrate my Alive Day next week, I am going to do my damnedest  to make sure other troops get to come home to their families too. It is  just one small way I can honor those buddies who saved my life, every  other veteran, and all those still in the uniform of our great Nation…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…worried about when I went to school was  whether I would eat the lunch that they served. Do you know what it is  like to put your child on a bus and wonder if they are going to come  home?\n\nDo you know what it is like to go to a park to celebrate a birthday,  and your child doesn't come home? Too many people do. Too many Black  people do. Too many people in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Speaker, costs are out of control.\n\nEvery time I go to make a purchase, these companies keep charging me  fee after fee after fee. So whether it is booking travel for my son to  come home for the holidays or buying tickets for my daughter as a  Christmas gift, these fees are driving up the cost of everything.\n\nYou get to the checkout page, and suddenly the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697629/junk-fees"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…President. They are willing to lie  to the American people because they fear the tweet of a President more  than they fear the wrath of the voters at the ballot box. This will  come home to roost because 17 million people are going to lose their  healthcare.\n\nIn Texas, we are one of the largest creators of clean energy jobs.  Texas is the energy State. I…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693208/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…disagreements with Prime Minister Netanyahu's  government.\n\nIsrael totally had the right to defend itself after the heinous  attacks on October 7, and all the hostages should come home.\n\nThe Israeli military campaign has been an absolute tragedy for the  people of Palestine. The people of Gaza are in desperate need of more  humanitarian relief, which I…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…ICE enters my school and takes someone, what will the  school do? If ICE takes my classmate, what should I do? Where does ICE  take people? And what do I do if my friends come home to an empty house  because their family got deported?\n\n``I wish I did not have to worry about these things, and I wish even  more that my friends, classmates, and neighbors…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…that they deserve our thanks every day. We also  need to thank the spouses and the children of our law enforcement who  deal with the risk of their loved ones who may not come home.\n\nFinally, we remember the family members who made the ultimate  sacrifice for our safety. Serving in the people's House means we  support law enforcement. I am proud to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691333/thanking-our-law-enforcement-officers-and-their-families"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…right now would likely weaken the rules that prohibit  children from working in particularly dangerous jobs.\n\nAll workers deserve to be paid fairly, earn good benefits, and come  home safely at the end of the day. If we truly want to prioritize  workers, then we  must strengthen the laws, including regulations that protect workers'  health and safety on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…on the  swim team. He could be anyone's son.\n\nAfter being kidnapped by Hamas terrorists on October 7 and held for  584 days, I am thrilled to announce that Edan has finally come home.\n\nThrough it all, the strength of the Alexander family and the New  Jersey community has been a guiding light in an incredibly dark period.  The family never gave up hope…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693449/welcoming-home-edan-alexander"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…been advocated by one group after another across  this country to make our streets safer and to have parents, when they  send their children off to school, know they will come home and won't  have to spend all their time fearing the kind of violence that we saw  in Uvalde, Texas, that led to the deaths of so many little children.\n\nThese are things that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…kids' school?\n\nMy heart breaks for the two students who continue to fight for their  lives in the hospital, the parents who are at their bedside not knowing  if they will ever come home again, and for the kids and the educators  who will carry this trauma forever.\n\nThroughout the day, as I went back and forth thinking about the two  tragedies, the one in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…services that help her improve and       progress. Also, to help her stay active and social, she gets       speech therapy, occupational and physical therapy. People       come to our home to help her as well. If Medicaid cuts       happen, she will stop all the services she receives, and her       life will be threatened. Please, she must keep her Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…ceases as troops salute  her raising and lowering. In battle, our forces carry her, wearing them  proudly on their sleeves. She serves as the final blanket for soldiers  who come home, having given and paid the last full measure.\n\nThe 2024 NDAA rightly addressed this issue by codifying an  appropriate list of approved flags that uphold the honor and dignity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…all people--Floridians, every veteran--to be able to access  cannabis if, in fact, it is necessary and prescribed by a doctor and if  it helps them treat whatever they have come home with?\n\nMy father was wounded and left for dead in World War II, and he came  home. I know what it takes for these people and the hurt that they have  gone through on behalf…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692949/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…meeting people where they are, not understanding the  pain that they are feeling in their lives and their families at their  kitchen tables when they get up go to work and come home exhausted at  night.\n\nDemocrats need to learn from their mistakes. This moment is not  ideological. It is about who fights for the people and who fights for  the elites.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…to urge support for my bill, the  Modernizing All Veterans and Survivors Claims Processing Act.\n\nOur veterans put their lives on the line to defend this country. When  they come home, they shouldn't have to fight another battle just to get  the benefits that they deserve.\n\nUnfortunately, outdated systems at the VA are causing unnecessary  delays that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and far too  often those who pay the ultimate sacrifice like Deputy Reckling.\n\nEvery day, brave men and women put on their uniform and go to work  and they know they may not come home. We owe these people a lot more  than just a thank you. We owe them respect, admiration, and our  unwavering support.\n\nMr. Speaker, I encourage my colleagues to do the same…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691379/recognizing-the-life-and-service-of-deputy-sheriff-bradley-j-reckling"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Without a plan to turn findings into frontline care, we risk failing  the very people this research is meant to help: our veterans.\n\nWe know the stakes. Too many servicemembers come home bearing  invisible wounds. While traditional treatments work for some, far too  many are left cycling through ineffective medications, suffering in  silence, or worse, giving…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]