[{"senator": "George Latimer", "party": "Democrat", "sentence": "…enforcement has had a negative impact on their business. Many small  businesses have lost revenue or had to modify their operations because  employees and customers are afraid to come to work or to patronize  their business.\n\nWhen masked ICE agents in full tactical gear inflict violence against  American citizens and then show up at businesses without identifying…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699617/small-businesses-bear-brunt-of-immigration-enforcement-abuses"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…a space, and       some are buying backup spots for $200 a month nearby. As       morale has cratered, some employees have stopped wearing       business clothes and now come to work in jeans and a T-shirt       because, as they tell colleagues, they no longer take pride       in their work, the employee said.                               `OFF THE CHARTS'…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…State  and visit. We want you to invest in our State. We want you to start  businesses in our State. We want you to send your kids to school in our  State. We want people to come and work in our State because we have  shown the country and the world what we are all about.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…violence,  voter suppression, and tyranny where we pit one group against another  to stay in power?\n\nThat is one choice.\n\nDr. King gave his life for community where we come together, where we  work together, and where we uplift each other. We care for one another,  we love one another, and we live up to the ideal upon which this  country was founded.\n\nHe died…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…about making it less safe for the people of Washington, D.C., who  live here, who work here every day of their lives and, frankly, who  take care of the rest of us who come here to work on behalf of our  people.\n\nThis is not about public safety. This is about taking away vital  reforms. It is about taking away home rule of Washington, D.C., and it  is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…them the source of these  workers, but they are also creating an attitude in other adjoining  countries that have served us in the past that it is too dangerous to  try to come and work in the United States. That is the reality.\n\nNationwide, for example, the costs of a lot of basics just keep going  up. Orange juice is up 29 percent compared to last year.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…one thing about this bill  that is lacking is simply this: We don't talk about the big magnet.  What is the big magnet for people coming into this country? Jobs.\n\nPeople come to work. We need the workers. Wisconsin dairy farmers, up  to 90 percent of those dairy workers at those Wisconsin dairies are  undocumented. Undocumented workers are in manufacturing.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695362/stop-illegal-entry-act-of-2025"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…summarily firing nearly half of  the Department's workforce. He did this in one fell swoop. These  committed people at the Department of Education were told: You don't  have to come to work tomorrow. So this followed the plan laid out,  basically, for President Trump and Project 2025. Then, just this week,  his Secretary of Education laid out plans to slash…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…there are five of these bills which are not  controversial. I urge my colleagues to vote for them to keep the  government operating, to make sure that our Federal employees come to  work and do their job for the American people and get paid for it.\n\nThere is one bill in this package that is very controversial. There  is one bill in this package that the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…bipartisan way. Those cuts would be bigger and probably have  a lot more staying power than what they are doing, which is ready,  fire, aim, and then having to beg people to come back to work because  they fired FAA people or nuclear regulators or what have you.\n\nBut this is the bigger point that you are making that really is  getting me: So you know this.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, my father-in-law was a teacher and he  talked about how in the morning when he would come into work, he could  tell the kids that hadn't eaten at home and for them often the first  meal they would get was the free or reduced breakfast and lunch.\n\nHe would say: You can't…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…all of my colleagues to advocate for this bill.\n\nOne-third of the Virginia population is a resident of the DC metro  area and enjoys this Capital, and 150,000 Virginians come to work in DC  every day. They want DC police and services to be well funded. Please  support this bill. Thank you.                                Vote on S.1077", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688852/district-of-columbia-local-funds-act-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and holding  social media companies accountable for peddling fentanyl to our kids.  Getting fentanyl off the streets is a herculean task that will require  us all to come together and work across the aisle to make this country  a healthier, safer place to live. I hope this bill is a sign that all  of my Senate colleagues are willing to continue working…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…dismissed. Now, over 25,000 families are waiting for justice on their  complaints.\n\nThe Trump administration just requested that some of these attorneys  temporarily come back to work this week to clean up the mess that the  administration caused, but students and their families have already  paid the price.\n\nThe dismantling of the Department of Education…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698108/dismantling-department-of-education-is-not-reform"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…airport. I was embarrassed coming here and seeing the people sitting in  front of us here, the people guarding the doors of the Capitol  building, with no respect, having them come to work without respect and  paying them. That was extremely frustrating to me. It is just beyond  pale that that happened.\n\nOn the Epstein files, the Speaker tried to come and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…view.\n\nI thank the other members of our leadership: Leader Scalise, Whip  Emmer, and Conference Chair McClain. They all worked really hard to  make sure that we could come together and work across the lines. They  gave us the freedom and flexibility that we needed, but they also  provided the persuasion that is necessary both within our own ranks and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…sneaking into this country. We don't talk about the fact that over  800,000 people every year become new citizens.\n\nIn addition to that 800,000 new citizens, 500,000 people come here on  work visas. Another 500,000 come here on student visas. People being  what they are, many of these people on visas stay in the United States  anyway.\n\nIn addition to that,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and deserve.\n\nAnd we will also be able to celebrate on Veterans Day tomorrow the  fact that we have passed the appropriations bill for the VA.\n\nThis would not have come about without the work of so many people-- too numerous to mention. But I do want to thank my fellow  appropriators, particularly the chairs of the three committees--Senator  Boozman,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…the country, but it is to us in Oklahoma; it is to the good  folks in Greenwood. And it is not a bad thing for us to remember,  during this time period, how far we have come and the work that is  still yet to come.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691673/historic-greenwood-district-black-wall-street-national-monument-establishment-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Being in this country is a privilege,  not a right. If you are an immigrant coming to this country, you need  to leave your old way of life and the traditions behind and come here  and work with us.\n\nUnfortunately, many of the Islamists who are here are not doing that.  They are doing whatever they can to turn our country into the Third  World hell hole…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}]