[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…require accountability. It would enable use of  the military in the event of a claimed rebellion or insurrection for a  limited amount of time, require the President then to come to Congress  and make the case, and Congress to approve a set of reforms that would  protect the American people against misuse of the military in the event  that he could not deploy…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…lot of time in  public schools myself, as a parent volunteer, serving on committees,  and advocating for education over the years.\n\nLittle did I ever dream that I would come to Congress and have to  fight for the actual existence of the Department of Education. We are  watching--and I condemn in the strongest terms--this illegal and  unconstitutional…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…free nor prosperous during his corrupt regime.\n\nHere is another truth, Mr. Speaker, that in no way conflicts with  this first one: The President of the United States must come to  Congress before ordering a military engagement against any country.\n\nMr. Speaker, you cannot uphold the rule of law by breaking it. You  cannot protect or abide by the Constitution…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Presidents to drag us into  reckless foreign wars. The American people do not want those wars, and  Congress has not yet authorized those wars, nor will it. They will have  to come to Congress for that power.\n\nI am honored to take the baton from former Congresswoman Barbara Lee  in  carrying this legislation forward. I thank the lead across the aisle,  Representative…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…flouts the  constitutional protections implemented by the Founders to avoid  improper influence, he violates one of the core principles of our  Constitution. He has never come to Congress asking for any permission  for any of these deals; that is for sure. His willingness to use the  privileges of his office to enrich himself and his family seems to know…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Donald Trump is abducting American children. He is detaining judges.  He is disappearing people into foreign prisons. This is  authoritarianism in full view.\n\nI didn't come to Congress to sit back while democracy is dismantled.  To the contrary, I will use every tool at my disposal to protect our  democracy.\n\nWhen the people of Gresham, Hood River, and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690555/stand-for-justice-bring-detainees-home"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…even existed that could be dropped on the United States or our  soldiers in the region.\n\nSo it was required--it is required under the Constitution--that the  President come to Congress. If the President doesn't need to come to  Congress to attack another Nation preemptively, preventively, absent an  imminent threat, then that provision of the Constitution…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…ones who suffer the most.\n\nI see that our colleagues have arrived.\n\nLet me just add one thing. People ask me: What is your why? Why did  you ever decide to leave home and come to Congress? I have five  children. The idea that one in five children in America lives in  poverty and goes to sleep hungry at night in the greatest country that  ever existed in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…DEXTER. Mr. Speaker, I rise today in strong opposition to the GOP  higher healthcare costs for worse coverage act.\n\nI did not spend 20 years as an ICU doctor saving lives to come to  Congress and sit back while Republicans strip healthcare coverage from  millions. No. I came to Congress to fight for affordable, accessible  healthcare for all.\n\nThis bill does…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698396/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…White House truly believed that  these are terrorist organizations and the Defense Secretary truly  thinks Tren de Aragua compares to al-Qaida, the administration should  come to Congress and request a AUMF. The fact that they haven't is  revealing.\n\nWhen the legal justification keeps changing, it means that there is  no clear mission to begin with. And…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…close. These are actions you take  before you consider launching a major military operation against  another country, and that authority--the Constitution is clear--must  come from Congress.\n\nNobody here denies the Maduro regime is horrific and undemocratic,  and we also agree drug traffickers and organized criminals who poison  Americans ought to be tracked…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…War Powers Resolution before us does not tie the President's  hands in responding to genuine threats; it simply requires him to do  what every Commander in Chief should: come to Congress, present the  facts, and seek authorization from the people's representatives before  initiating hostilities. That is not weakness. That is constitutional  strength. It…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…American  people? We, as Members of Congress, should be demanding that the  administration be accountable to the American people, and the best way  to do that is for them to come to Congress because that is our job.\n\nUltimately, I am saying we should do our jobs as Members of Congress  and not give away our power to someone who would like to just be an  authoritarian.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Speaker, you can call someone a name on  social media, and the next thing you know, you are shot dead. We need  to do something to address that gun violence.\n\nI was proud to come to Congress to try to continue to work on that,  but in April, the Trump administration terminated nearly 400 grants  from the Department of Justice's Office of Justice Programs that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…people who are adherent to sharia law  and want to undermine Western civilization and create mayhem and be  against our way of life.\n\nChoose the path of leadership. Come here as a Congress and bind  together. Don't sit around complaining about having a two- or three- or  four-seat majority.\n\nLead, act, and go.\n\nThat is why we are here. That is why that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…world.\n\nNow, we are seeing it all play out again. History doesn't repeat, but  it certainly rhymes. We in this room had the Secretary of Defense and  the Secretary of State come to Congress before the end of this calendar  year and blatantly lie to our faces and, more importantly, lie to the  American people. Why? Because they know it isn't right or popular.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699360/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Madam Speaker, I had some prepared  remarks, but as I have talked about this and looked at it even more,  this is probably one of the most commonsense bills that will come  before this Congress.\n\nThis bill simply says if someone reenters or if someone commits a  felony, that this law applies. These comments from the other side to  try to confuse this issue,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Congress  originally intended. If an administration, any future administration,  wants to change policy, rather than that coming from the bureaucrats,  it should come before Congress. Congress set the efficiency standards  in 1975, and if Congress wants to address those, that is Congress'  prerogative, not some unelected, unaccountable bureaucrat in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…fact, there are now funds out  there that follow and trade along with the congressional Members of  Congress to see what they are trading. That is ridiculous.\n\nYou should come to Congress. You should take your assets and move  them into widely held index funds. It should be able to be done on a  tax basis. Come in here. Clean the decks. Go represent your…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…and I  would like to give my belief about what we are doing here--my opinion.\n\nSenator Kaine has introduced a resolution that basically requires  President Trump to come to the Congress before any other military  actions can be taken against the Islamic Republic of Iran. I think that  would be a disaster for the country. You can only have one Commander…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the University of Texas in 2003, the  national debt was somewhere in the $6 trillion range, $6.5 trillion  dollars. When I came to Congress, when I was campaigning to come to  Congress, it was just over $20 trillion. That was 2018. Today, we are  pushing $37 trillion. Is that roughly correct?\n\nMr. ROY. Correct.\n\nMr. ROY. Now, I bring that up because…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…tax--plain and simple--on the American people.\n\nBut one person can't do that. Our Founding Fathers said: No, that  would be illegal for one person to raise taxes. It has to come to  Congress. It has to originate in the House. This has gone on for 200- and-some-odd years.\n\nYou can't simply declare an emergency and say: Well, the  constitutional Republic was…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]