[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Mr. Chair, in the spirit of bipartisanship, I rise to speak in  support of my colleague from Georgia's amendment to authorize the  Baltic Security Initiative.\n\nThis amendment comes up at a crucial time. Just last week, the  administration announced the U.S. would be pulling out of all security  assistance programs for Europe, including the BSI.\n\nI have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695263/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…am  so angry. I am so enraged with the treatment that I witnessed today of  my colleague Senator Padilla. This is not the America--this is not the  America--that each of us comes here each day to stand on behalf of.\n\nThere are some who are saying they don't recognize this America, and  I want to ring the bell today for all who are watching, for all…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692441/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…organization is the  Association for the Study of African-American Life and History.\n\nThis is the preeminent organization of its kind. It is the leader of  the pack when it comes to Black history, and I am proud to be  associated with them and proud to tell you that this year, for our  Black History Month, there is a theme: A Century of Black History…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Minneapolis, Minnesota. Her  name was Renee Nicole Good. She was a concerned citizen and a mother.  The loss of her life was entirely preventable.\n\nThis tragic loss of life comes the same week that we remember what  occurred here 5 years ago on January 6. On that day, violent  insurrectionists attacked police officers, many of whom sustained  serious…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698775/holding-ice-accountable"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…tried to impose our will on a foreign  country through military intervention or the threat of military  intervention. But what they are proposing to do is exactly that.\n\nIt comes in a slightly different form than what we did in Afghanistan  and Iraq, but it is from the same playbook. Here is their plan: They  are going to seize control of Venezuelan…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…assassination and attempted murders of  multiple State legislators in Minnesota.\n\nWhat we witnessed last weekend was an unspeakable act. This is a  scary time for our country, and it comes at a time of increasing  political violence. There have been assassination attempts, kidnapping  plots, arson, and insurrection.\n\nAs elected Representatives for the people…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692862/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…we begin Hispanic Heritage  Month, I want to honor the millions of Latinos and Latinas who make  this country strong. We celebrate our culture and sacrifices.\n\nThis year, it comes with urgency because we are under attack. Last  week, the Department of Homeland Security attacked me on X, insisting  they deport only criminals. If you walk the streets of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…generation or transmission facilities.\n\nNow, I agree with the gentleman that our electric system needs to be  secure, but I do not agree with him that every electrical engineer who  comes to this country for a better life needs to live in fear of ICE  and DOE showing up and harassing them at their place of work.\n\nThere are enough real threats to our grid. Congress…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to be followed by another  distinguished member of that same committee and to focus on these first  100 days.\n\nThe focus on the first 100 days of an administration, I think, comes  from  the time of Franklin Roosevelt and his 100 days in the midst of deep  depression, despondency, and despair on the part of the American  people, and the whirlwind of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…meet the needs of all  of our communities.\n\nBut Donald Trump wants to throw these bills out the window so he can  pick which communities win and which communities lose when it comes to  Federal resources.\n\nFunding laws are still laws, and Congress passed these laws with  bipartisan support to direct resources to these programs. No President  gets unilateral…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…like this, why  don't we work together and bring to the floor a bill that will  strengthen Social Security? That would be a help to our neighbors back  home.\n\nI think what it comes down to is Republicans in Congress are out of  touch with hardworking people. They are out of touch with their  struggles. They want lower costs. They don't want bills like…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…people saying  that it is not allowed.\n\nPresident Trump found $40 billion in U.S. taxpayer dollars to send to  his political allies in Argentina just last week. But when it comes to  feeding our own--our own people here in the United States of America-- he refuses to act.\n\nBack home in New Mexico, one in five people rely on SNAP. They aren't  strangers.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…promise we make to our Nation's  children that every student, no matter who they are or how they learn,  deserves equal access to a quality education.\n\nYet, this anniversary comes at a time when the Trump administration  continues its systematic efforts to eliminate the Department of  Education, gut the Office of Special Education Programs, and undermine…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…killed in episodes of gun violence.  That was really important to hundreds of families out there who knew  that their loved ones' names were part of that wall. Now the wall comes  down. For what? Just to send another signal that the administration  doesn't care about attacking gun violence.\n\nBut I really wanted to come to the floor today to talk about…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…a singular figure in Virginia and  in this body, who showed us what principled leadership looks like. His  legacy will guide me every day.\n\nWith that gratitude, Mr. Speaker, comes responsibility to speak  honestly about the challenges my community faces. In Virginia, we are  on the leading edge of President Trump's economy. In my district,  everyone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695221/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…increase.\n\nThis rule that the Biden administration made is not about an all-of- the-above energy approach. It is not about producing more energy, more  clean reliable energy that comes from America. It is about attacking an  industry.\n\nIf you don't believe that, just look at the rule itself. We produce  more than one kind of energy offshore. We produce oil…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…America, we can use that coal cleaner  than ever before.\n\nWyoming's Powder River Basin produces the cleanest burning coal in  the world. Nearly half of all coal produced in America comes from the  Powder River Basin in Wyoming and our neighboring State of Montana.  Wyoming's energy warriors will lead the way.\n\nFor years, Democrats have held coal captive with…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…holidays is about generosity, service,  and time spent with loved ones. The Family Christmas Extravaganza  reflects those values and highlights what is possible when a community  comes together in the service of others. I ask my colleagues to join me  in recognizing and commending the volunteers, faith leaders,  businesses, and community partners who have…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…mental health outcomes across the board.\n\nSo I would encourage my Republican colleagues to join me in  strengthening work requirements across means-tested programs when the  time comes to identify these savings within our committees.\n\nThe American people voted overwhelmingly for President Trump, and now  it is our turn to deliver the ``America First'' agenda…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…she was originally going to carry this bill.  Mr. Speaker, she let me carry it.\n\nAfter a conversation with her, I said: Elise, Minnesota is the State  of Hockey. Herb Brooks comes from the State of Hockey. There were 12  Minnesotans. There was Duluth hometown hero Phil Verchota. There was  Mark Pavelich, John Harrington, Buzz Schneider, and Bill Baker.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…in 1975, and for over 30 years  that was the national standard.\n\nEven the American Association for Mechanical Engineers, this is their  definition that is in this bill. Along comes the Obama administration,  and rather than take the very simple, easy-to-understand,  congressionally mandated standard of what a showerhead is, the Obama  administration,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…completely preventable. So were the deaths of  nine other patients who have passed away from TB since 2021 because of  inadequate oversight of tissue material suppliers.\n\nWhen it comes to tissue donations, the FDA requires screening for  diseases like hepatitis, syphilis, and HIV. This bipartisan bill will  require screening for tuberculosis, as well, and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692764/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Epstein files and will give the public all the necessary information.\n\nThis vote will show the American people we are committed to full  transparency and cooperation when it comes to Jeffrey Epstein and the  investigation thereof.\n\nLastly, this rule is standing up a new select committee to continue  investigation of the events surrounding January 6.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…to be  acquired through the Airport Improvement Program, AIP, funds.\n\nUnder the current structure, AIP funds can be used to acquire  aircraft deicing equipment, and when it comes to the storage facilities  that house that very same equipment, airports are forced to utilize  alternative and less reliable funding mechanisms. If you can use AIP  funds…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695010/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…percent.\n\nIn order for prices to actually go down, we would have to have  deflation--not disinflation but deflation. We have to be careful what  we wish for because deflation comes with some pretty severe  consequences. We can get prices down through deflation, if we go into a  recession, if you raise unemployment, allow unemployment to rise to  about…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…businesses, manufacturers, home and road builders, and  many other permit holders.\n\nMy colleagues across the aisle continue to promote the fallacy that  improving permitting processes comes at the expense of the environment.  Congress can continue to be good stewards of our environment while also  removing regulations and processes that do not protect the environment…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698025/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…changed in Washington, DC, in  the last 6 weeks. That is an understatement, perhaps. But one of the  things that President Trump has done is shifted the Overton window when  it comes to the People's Republic of China.\n\nYears ago, when the Clinton administration invited China to join the  World Trade Organization, the idea behind that was that somehow  communist…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…redesignating subparagraphs (C) through (E) as       subparagraphs (F) through (H), respectively; and\n\n(3) by inserting after subparagraph (B) the following:\n\n``(C) substantial evidence comes to light that, during the       commissioned service of the officer, the officer failed to       carry out applicable laws, with an intent to deceive or       defraud;\n\n``(D)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…family owned and  operated. As the fifth generation to grow up on my family farm and  feedyard in western Kansas, I understand the immense sense of pride and  gratitude that comes with growing up around a family business. It is  much more than a 9 to 5; it is a personal investment of endless hours  to see a dream come to life. When that dream gets off…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "John Thune", "party": "Republican", "sentence": "…nothing more than petty politics-- because as we see with Venezuela and as we have seen with Presidential  nominations, Democrats are incapable of fairness or nuance when it  comes to President Trump. They can't deal with the fact that he was  elected President, and so they reflexively oppose anything he does or  says, even when it is something they might…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]