[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…again. We owe it to the parents who  must bury their child or their children or their loved one, such as I  have. We owe it to the countless silent sufferers who have yet to come  forward but who must know that help will be there when they need it.\n\nThis is a commonsense solution that will ensure victims have access  to the services that they need to heal,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "John Hickenlooper", "party": "Democrat", "sentence": "…people that  will either lose their healthcare or have dramatically significant  increases in the cost of their premiums if we do nothing.\n\nSo I hope that we can come together and move forward with this clean  CR with the extension of the subsidized tax credit for the ACA.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696606/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…funding is  unconstitutional and flatly unlawful.\n\nThough undocumented families and small businesses were explicitly  encouraged for decades by government and legal counsel to come forward  out of the darkness and pay their taxes through their ITIN number, the  Trump administration is now trying to target this data to carry out his  mass deportation plan.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…minor misconduct issues where both the victim and the  perpetrator are involved, and that risk of being punished for those  minor misconduct has really inhibited people to come forward and report  sexual assault. This is an issue which was the subject of exhaustive  hearings at the Oversight and Government Reform Committee over the last  8 years. Our dear,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…treadmill of litigation and uncertainty, sending us back  theoretically to a plan that was already adjudicated to be illegal.  Maybe Republicans are waiting for a new plan to come forward from the  Trump administration, I guess, hoping that a future court will decide  that it is not substantially similar to the ones that have been thrown  out with your CRA.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…These are critical roles that  veterans rely on. Behind these numbers are real people, real  consequences, and real veterans waiting longer for care.\n\nVA employees have come forward anonymously, warning that these job  cuts are affecting veterans' care and leading to many errors. Some of  the people let go were even working on the veterans suicide crisis…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…capable of doing my job, but because I am a woman and because I chose  to have a baby, I have been prevented from doing so.\n\nMr. Speaker, I thank all of the people who have come forward on both  sides of the aisle in support of this effort, and I know that our fight  is far from over. We are not going to back down. We stand with the  people from across…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…nothing to do with public safety. In fact, what  is going on in Minnesota is hurting public safety. As Senator Klobuchar  said, police chiefs of suburban communities have come forward and said:  This is not sustainable. This is dangerous.\n\nA police chief told the story about how one of his own officers, who  was off duty, was stopped for no reason by…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…different reasons and for different kinds of illnesses. A lot of  people in the country reject that and oppose that, and perhaps the vast  majority do.\n\nDoes that mean we should come forward with a bill to the United  States Congress to say that we are going to put in jail any parents who  don't vaccinate their children because we think they are making the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…body.\n\nLeader Jeffries has a discharge petition open right now to extend the  tax credits, and we just need four Republicans to join us in signing  it.\n\nHouse Democrats have come forward with a plan. Senate Democrats have  come forward with a plan. Senate Republicans have come forward with a  plan. The administration still doesn't seem to have a concept…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Catholic church and the bishops for their  courageous, unwavering support for the immigrant community in our  country. I ask all other religions and leaders of faith to come  forward.\n\nWhy are you silent in this shameful moment?\n\nWe should hear your voices as it is commanded in Leviticus very  clearly. Leviticus 19:33-34 says: ``When a foreigner resides…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697447/fighting-dhs-immigration-raids"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…communities across the  country, and one young person, a midnight computer hacker from DOGE,  Elon Musk's emissary, destroyed all of it, more than 300 grants.\n\nNow they come forward with a budget for next year that would cut more  than $1 billion out of law enforcement: FBI, Department of Justice, and  ATF, you name it, Mr. Speaker, right down the line.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Mr.  Epstein's detention or death.\n\nIt makes one exception, and that exception is deleting the names of  the victims involved. They should only be named if they choose to come  forward.\n\nLet me quote from what this bill requires:\n\nNo record should be withheld, delayed, or redacted on the       basis of any of the following: embarrassment, reputational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…that it is Congress that appropriates money, not the President. So, for  instance, in Venezuela, if you don't want any American boots on the  ground, I think you could come forward and pass through the  appropriations process a prohibition of funds to be used to have  American ground forces in Venezuela. If you don't like the seizing of  the oil for…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…as young as 14 years old. It was taken from  them, and they have never gotten it back.\n\nI am also wearing white today to recognize the courage that it takes  for women to come forward, the sacrifices of them personally,  professionally, and financially. There is embarrassment, humiliation,  and shame that we still deliver on the backs of women who have…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696901/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…share with you today is  that this absolutely matters to them. Being able to turn the page on  their past is not easy. It is not easy for a victim of human  trafficking to come forward. There is shame sometimes in doing so.  There is extreme guilt. When they get that chance to do that, this is  an incredibly important step.\n\nHere is the caveat that I think…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}]