[{"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…those shutdowns, I do  not want our government to run out of money. But if my Republican  colleagues want my vote on that bill, they are going to need to act  like adults and come talk to me about it.\n\nAnd what I will say to the State that I am representing, as well as  to my colleagues, is that if you want that vote, you are going to have  to talk to me…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…by Washington  Republicans just talking to us, but Donald Trump and Washington  Republicans chose to, once again, put politics ahead of the American  people. They won't come and talk to us.\n\nAfter slashing Medicaid and taking healthcare away from families who  need it the most, Donald Trump and Washington Republicans are now  shutting down the government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…another.\n\nIn the Gospel of Matthew it says: I was hungry, and you gave me  something to eat. . . . I was a stranger, and you invited me in.\n\nHowever, Republicans never come here to talk about poverty or hunger  or the sick. It is always about tax cuts, the rich, and the  billionaires.\n\nTonight I rise for one of the Houston families they are attempting…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691445/snap-and-medicaid"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I have come to the floor tonight to talk  about a few issues. Literally, I thought I was going to come and talk  about healthcare and the need for us to come together to help reduce  healthcare costs and to continue to fight to make sure Americans are  covered because covering them…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697849/national-weather-service"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "Mr. BENNET. Mr. President, I wanted to come down here and talk a  little bit about energy with my colleagues in the Senate today, and  part of the reason why is that as you know, Mr. President, and others  know, the President…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…raise the question.\n\nInstead of my colleagues taking this time to talk about how we were  the cause of the shutdown, when my colleagues know they were, don't  deflect it. Come on. Let's talk about socialism. Let's talk about the  commissaries. Let's talk about our Social Security. Let's talk about  the PPP program and how some of my colleagues got money…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…rid of that. That would come back 100 percent, and all of those  people in the middle class would see a massive tax hike.\n\nThink about small businesses. People love to come here and talk about  small businesses. We should do everything we can to help the creation  of more small businesses and to help the growth of our existing small  businesses.\n\nMr.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…are working to do that and, of course, they are  in a tizzy, Mr. Speaker, because they are finally being exposed for  covering it up for 4 years.\n\nLet them continue to come up and talk about all the deficit spending  that they created while they cite and talk about the One Big Beautiful  Bill Act. If you look at our scorekeeper here in the House, Mr.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…through those  States--Mississippi, Louisiana, Alabama, sadly, New Mexico, Missouri,  Arkansas, South Carolina. See a little trend there? It is actually  Republicans. Don't come and talk to us about that. It is dangerous to  live and work in many Republican-led States.\n\nLet's get back to what we do to honor and respect law enforcement on  this Police Week.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, normally, when you come up to talk about a  bill, you raise the podium here and put your papers down. Mr. Speaker,  when you talk about the 1980 Olympic game, I don't need any notes. I  don't need any recollection.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…not the  financing of healthcare but things that could disrupt the cost of  healthcare? We had one gentleman from one of the biggest life insurance  companies in America come in and talk about it saying that here are the  things we do to keep our insured population alive and healthier.\n\nWe do things. We reward them for doing these data rings, or putting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you don't do them, that loss of consumption in those  populations actually really hurts us economically.\n\nI am going to reserve in a moment, and then, we are going to come  back and talk about some of the other provisions that are just, once  again, Madam Chair, trying to create the capacity so we can actually  have the more elegant debate of what should…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…vindictive prosecution is wrong, period.\n\nWhat we are on the brink of with respect to the Chair of the Federal  Reserve is the pot calling the kettle black. We can't come here and  talk appropriately about the Arctic Frost investigation, we can't talk  about the various prosecutions under the Obama era and the Biden era as  being bad if we actually…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…is a national standard and an even  playing field for universities across the country. Accordingly, I urge  passage of this rule.\n\nMr. Speaker, isn't it amazing that we come here to talk about these  six bills and a significant portion of the debate from the other side  of the aisle deals with bills that we are not addressing? They talk  about some of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…Managers Association; the  Federal Law Enforcement Officers Association; the National Air Traffic  Controllers Association--and we are going to have the Senator from  Texas come down and talk about what is happening with air travel as we  speak; the International Association of Firefighters; and the  Association of Flight Attendants. These are public sector…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…skip around a little bit--to contributions to the proposed Medicare  Advantage payment update. If there happens to be a lobbyist out there  representing Medicare Advantage, come talk to me. This is what I think  CMS is actually proposing to you, saying we are going to change the  compensation. We are going to change your risk scoring. You are  basically…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…flip up, taser, taser, taser.\n\nThis is a good bill, and my colleagues on the other sides of the  aisle know it  is a good bill. In fact, one of the cosponsors won't even come and talk  about it because his majority, Mr. Speaker, doesn't want it. This is  the extension of defund the police. I have had it.\n\nWe need to protect law enforcement. We are the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}]