[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…some  sadness that our great leader, Steny Hoyer, has announced his  retirement from Congress.\n\nHe still has another year. He still has another year, and I know a  lot will come.\n\nI join the gentleman in saluting Elaine, Stefany, Susan, Anne, and  Judy. Judy--we loved Judy when she was here, and now we rejoice in the  gentleman's happiness with Elaine.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…fact, in one candid moment, President Trump conceded that the  shutdown cost him many votes in last night's election across the board,  and he is right. The American people have come to understand what this  government shutdown is all about. It is about their bottom line, their  home budget, their healthcare, their insurance costs.\n\nIn my State--typical--people…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…is not a gang member. He is not a terrorist. He is a threat to  no one. He is a son, a brother, a makeup artist, and a hairdresser. He  is a man who fled his home country to come to the United States because  he feared for his life because he is gay.\n\nWe are being lied to. These kinds of cruel tactics are not necessary  to keep us safe. This is about…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689646/protect-due-process"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…cartels and holding  social media companies accountable for peddling fentanyl to our kids.  Getting fentanyl off the streets is a herculean task that will require  us all to come together and work across the aisle to make this country  a healthier, safer place to live. I hope this bill is a sign that all  of my Senate colleagues are willing to continue…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…Speaker, it is an honor to be here on behalf of the Congressional  Black Caucus to address and speak to these issues because they are so  timely.\n\nThere are new developments that come every day that keep us guessing  as to what the Trump administration is going to do from one moment to  the next. I am going to talk about this plane from Qatar toward the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…precisely the  purpose of the legislation that was rejected at the end of 2024 on  toughening up the border. We should go back and do that rather than  having people continually come back in.\n\nMadam Speaker, I yield 3 minutes to the distinguished gentleman from  California (Mr. Correa).\n\nMr. RASKIN. Madam Speaker, I yield an additional 1 minute to the  gentleman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…them. This is about us fighting  an epidemic. It is an epidemic that is literally killing our community.\n\nToday, I said to my colleagues across the aisle, do not look away.  Come to the table. Work with us. The cost of inaction is measured in  lives lost in our neighborhoods, in our classrooms, and in our  communities across the country.\n\nTo my Republican…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…right now would likely weaken the rules that prohibit  children from working in particularly dangerous jobs.\n\nAll workers deserve to be paid fairly, earn good benefits, and come  home safely at the end of the day. If we truly want to prioritize  workers, then we  must strengthen the laws, including regulations that protect workers'  health and safety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…borders of the United States.\n\nIt allows Congress to support the President's decision to extend the  deployment through a joint resolution of approval, but it requires that  he come to Congress for approval after a certain period of time. It  requires the Attorney General to certify that alternatives are  insufficient and for the Joint Chiefs of Staff to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…childcare  providers after the pandemic. We lost 15 percent, or 1,135, home-based  childcare providers, and that further pressured the market and limited  options for families.\n\nI come to this floor with good news. I am proud to share that, in our  State, education and nonprofit leaders are working to find innovative  solutions to help families afford childcare…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…privatization of immigration  detention centers once and for all, and we can finally reject the lie  that Trumpian cruelty is security because in America, our safety should  never come second to a billion dollar corporation's profit.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697457/fighting-dhs-immigration-raids"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…scientists researching new forever  chemicals, terminated grants for PFAS studies, and approved pesticides  known to have PFAS.\n\nAcross the political spectrum, legislators have come together to  protect our children from dangerous PFAS chemicals. Now this  administration is allowing them to be used on cereal grains, peas,  beans, tomatoes, oranges, almonds,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697919/making-americans-less-healthy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enough meteorologists to warn communities about tornadoes and  hurricanes.\n\nDOGE was a total, complete failure, and now Republicans want to lock  their disastrous cuts into law?\n\nCome on. That is insane. That is crazy.\n\nMr. Speaker, look at what these cuts are targeting: funding for  global health, clean water, food security, and democracy programs;  funding…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…first  vote is not always the victorious vote, it is not always the final  vote. It can be a foundational vote. It can be the vote that can lay  the predicate for things to come.\n\nI have filed and will make H. Res. 415, the Articles of Impeachment,  available to the press, the public, and all who would desire to know  what is contained herein.\n\nI will…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I am joined tonight by a bipartisan group  of Members who have come together to take to the floor tonight to call  for Members of Congress to be banned from trading stocks.\n\nThis is a reform that is long overdue. When people elect us to  office,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…disasters of the prior administration,  the prior administration, as I opened up, that was the most anti-oil,  gas, and mining administration in the history of this country. I come  from a rich mining State; biggest untapped copper-nickel find in the  world.\n\nThe Biden administration banned mining in northeastern Minnesota. He  took the mineral leases…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…snacks, stuffing bags, and distributing them to the homeless and less  fortunate teens. His compassion and dedication will have a positive  impact on our community for years to come.\n\nOn behalf of the 17th Congressional District of Florida, I  congratulate Wyatt Dickinson for achieving the highest distinction in  Scouting, the rank of Eagle Scout. We thank…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…players on a season to  remember. Their run inspired fans across the Nation and reminded us why  we love this game. We look forward to their continued success in the  years to come. Chants Up.                     Honoring Robert Franklin Childs III\n\nMr. FRY. Mr. Speaker, I rise today to honor the life and legacy of a  dear friend of mine and a fixture…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "French Hill", "party": "Republican", "sentence": "…both Democratic leadership  with Ms. Waters and Republican leadership to research this, talk about  it, think about it, and have hearings about it for over 5 years now. We  come to the House floor today with a bill before us that, while not  perfect, is a good bill, as has been evidenced by our speakers on the  floor.\n\nS. 1582, the GENIUS Act, is a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Athens State University.\n\nRetirement marks the close of one chapter and the beginning of  another, but the impact of Dale Greer's work will continue to be felt  for decades to come. His leadership, service, and devotion to Cullman  County have left an enduring legacy that will benefit families,  businesses, and future generations.\n\nMr. Speaker, I would…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…country, and  that is not a war. This is a real question.\n\nSo we have been given a legal opinion by the current administration,  and we had one of their assistant attorneys general come and explain to  us why this is not a war. You have to realize this is an important part  of the debate because, if it is a drug bust, it is not a war. So they  told us this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…because socialized medicine warehouses people  until they have time to get to them. That is not what our system does  nor should it.\n\nFurther, I would say that the Democrats come here today, and it is  their healthcare system. They created it. When they created the  Affordable Care Act, there were no Republican votes. When they extended  it or changed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…their priority list energy security and national security. When we  block off millions of acres of land from any kind of energy  development, that is something that should come right up to the top of  priorities.\n\nI heard mention of balance. To think that there was balance in the  RMP that the Biden administration put out, especially on this land in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…under consideration the bill (H.R. 2483) to  reauthorize certain programs that provide for opioid use disorder  prevention, treatment, and recovery, and for other purposes, had come  to no resolution thereon.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691875/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…hub for new and emerging technologies, including the Energy  Sciences Center and the Grid Storage Launchpad, that will contribute to  research and innovation for decades to come.\n\nMr. Speaker, I thank Dr. Ashby for his willingness to work with  myself and members of the Washington Congressional Delegation. We built  a strong relationship over the years…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696092/congratulating-dr-steven-ashby-on-his-retirement"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…D.C.\n\nMembers of Congress have had their cars stolen. We have had Members  of Congress who were assaulted. We have had staff members of this body  who were killed. People who come to this town from across the United  States want, need, and expect that Washington, D.C. does not become or  continue to be a work-free drug zone.\n\nWashington, D.C. should be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…is not  sustainable, and they are looking to us--they are looking to Congress-- for solutions.\n\nAs a physician, as a doctor, I have seen it firsthand. I have seen  patients come to see me with insurance, but they could not afford their  deductibles. I have seen people who could not afford their insurance  and who therefore take the risk that they will…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…not it  at all. We are here today to say these are important to us. If there  are discussions on what is important and what is not important, the  first thing we need to do is come together as a House and say these  issues are important to us as a House. Let's get this bill to the  Senate and put it on the President's desk.\n\nI strongly believe the President…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…athletes everywhere.\n\nI applaud the SLCC Cross Country Program for their extraordinary  accomplishments, and I look forward to seeing their continued success  in the years to come. Their hard work, resilience, and sportsmanship  embody the best of what it means to be a Bruin.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the minority leader is not wanting to  face opposition from the left there in New York, and because of that,  of course, what we are seeing is that our Nation's business has come to  a halt.\n\nLast night and then again today, all but three of the Members of the  Democratic conference voted against a stopgap funding measure, our  clean CR, that would have…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}]