[{"senator": "Richard Neal", "party": "Democrat", "sentence": "…Institutes of Health. They have cut  back on the Centers for Disease Control and billions of dollars for  Medicaid for a tax cut for the wealthy. Wait till you see what is  coming to America's hospitals after the next election. It is so  contrived they waited until after the election to implement it.\n\nMr. Speaker, 24 million people are likely to lose…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696736/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…questions of Members of Congress on what  they are doing and why they are doing it?\n\nThat is our job. That is our responsibility.\n\nHave we had one hearing on Venezuela on drugs coming in? Not a one.  Have we brought anybody in from the administration?\n\nThat is our job.\n\nWhy don't we do our job?\n\nThat is why we were elected. I would hope that the chairman…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…on January 6 investigations.  Instead of our FBI agents focusing on terrorism or organized crime,  they have to look over their shoulders because they know the President  is coming after them.\n\nHe has the Department of Justice weaponized not to go after the  criminals but to go after career FBI agents who have done nothing but  serve the public and fight…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…we are not for ``all of the above''; you know that thing we said about  whatever is cheap and plentiful and available every time we were trying  to prevent clean energy from coming on the grid? Do you remember that  thing we used to say? Now, really, what we meant is, we quite hate  solar energy, particularly. We hate solar energy. Again, I think that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…serve in this very  Chamber, Mr. Speaker. He was a respected individual and is still  referenced often by colleagues from both sides of the aisle. In fact, I  will never forget coming to Congress in 2019 in the 116th session of  Congress. It was my first term. I got sworn in on January 3, as we do.\n\nMr. Speaker, I said to my good colleague, Congresswoman…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…the  aisle being violently handled by law enforcement.\n\nThis is wrong. This is not putting our country first. And I have to  say, I hope we can turn things around here in the coming weeks. But in  my lifetime, and certainly in my time in public office and in my time  serving this country, I have never seen anything like I have seen this  week.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this majority is not  fighting for you--but we are.\n\nDemocrats are on your side, and we will fight with you every step of  the way against the corruption, the lies, and the BS coming out of this  administration. We will not back this so-called deal. It is not a real  solution, and it is certainly not a clean CR. This CR leaves families  twisting in the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…happened in the U.S. Capitol yesterday. It wasn't a floor speech. It  wasn't a formal committee meeting or a hearing. It wasn't a press  conference. It was five everyday Americans coming to the Capitol to  tell their stories about the brutality and violence they suffered at  the hands of their own government--everyday Americans just like all of  us coming here…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…the  University of North Carolina at Chapel Hill, Duke University, North  Carolina Central University, Durham and Wake Technical Community  Colleges, and so many new up-and-coming industry leaders in STEM.\n\nHowever, in total, the Trump administration has canceled nearly $20  million in NSF research grants to North Carolina as a whole.\n\nTake, for instance,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691388/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…side of the aisle. This President's tantrums are causing economic  global panic. The House must be able to debate and vote on these  tariffs. You have the same farmers I do coming through your offices  right now to tell you it is not just the tariffs; it is the uncertainty  of the tariffs and the disappearing markets. Doing nothing allows  American families…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…high cost of  living.\n\nPresident Trump promised costs would go down on day one. Costs aren't  going down. They are going up. Inflation is going up. Consumer  confidence is coming down.\n\nThese reckless policies, including the Trump tariffs, are driving us  toward a  recession. On top of it all, Republicans are presenting a budget that  is going to make…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…into  conflict on a whim.\n\nInstead, what have we witnessed? We have witnessed a dangerous,  aggressive build-up of U.S. military power in the Caribbean.\n\nWhere is the money coming from to do that? What is it being taken  from? Lethal strikes against vessels off the coast of Venezuela are  increasing. Then the Secretary of Defense allegedly gave an order…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697914/venezuelan-strikes-and-congressional-war-powers"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, I want to thank the Senator from New  Mexico for coming out here and making it very clear who we are fighting  for. And it really is Americans across this country, who are seeing  their costs skyrocket across the board. And, as…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…put more work on the backs of those  that are left and ignore the fact that there is not a sufficient  workforce to do any of the work that we have in these bills that keep  coming to the floor. It is lunacy, and we need to get back to reality.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Executive Bruce Blakeman setting up systems  on the border between Nassau County and neighboring New York City,  ostensibly to protect Nassau residents from the criminal element coming  from their city neighbors.\n\nThat is one way for a suburb to act toward the city next door,  although it may make it more difficult for the Long Island Mets fans to  get to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…cases are quickly and efficiently  administered. While bankruptcy filings in recent years have slowed,  early data suggests that bankruptcy filings will likely increase in the  coming years. Maintaining these temporary bankruptcy judgeships for the  next 5 years will ensure that the bankruptcy system can continue to  operate at full capacity if necessary.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…trying to open up the debate  on illegal immigration. Fortunately, this body has taken action, along  with our President, to secure the border and to stop gang members from  coming into this country.\n\nYet, someone who was in this country who shouldn't have even been  here attacked and ambushed a Wake County deputy and killed him. These  stories happen…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…One thing he is trying to accomplish is increased cooperation between  local law enforcement and ICE. That is another thing the Democrats  should be willing to address in the coming days.\n\nIt is notable how much more peaceful things have been in cities where  local law enforcement has been authorized to cooperate with ICE. It is  time to bring an end to…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…you had costs rising dramatically.\n\nThis bill tackles each of those issues. We are tackling illegal  immigration. We are tackling the interest rate issue, which is finally  coming down. Finally, the regulatory burden will be reduced so that we  will liberate folks once again from this high regulation, Big  Government debacle.\n\nMr. Speaker, I thank each…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…change the price of  healthcare? Instead, we do these debates because everything in  Washington is about the money.\n\nThe people marching up and down our hallways here are not coming to  our office to say: David, adopt technology. Lower the price of living.  Lower the price of healthcare.\n\nIt is: We want more money, or we want you to build a barrier to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…balance the  Federal budget.\n\nThis year, the United States will spend $6.7 trillion while bringing  in about $4.7 trillion. That is $2 trillion more being spent than what  is coming in. A deficit of this magnitude should be concerning enough  even on its own merits. But to add insult to injury, Congress passed a  budget just 5 months ago which set a spending…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…sure this aid goes to those who need  it.\n\nI also thank my colleagues on the other side of the aisle for working  with us closely on this important piece of legislation and coming up  with a bill that works for both parties. My Democratic friends agree  that it is time to stop funding terrorist organizations in Afghanistan  and across the Middle East.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…titled  as follows: ``Imposing Duties to Address the Flow of Illicit Drugs  Across Our Northern Border.''\n\nThe national emergency declared by the President was about fentanyl  coming into the United States from Canada. We can debate whether or not  that was truly an emergency at the time that it was declared, given  that a tiny fraction of the fentanyl…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…response is healthcare. That is the only  default position they have is the default to healthcare. The fact is,  it is because they broke the system so badly that they are now coming  and asking us to have the Treasury print money to then give out in  order to enrich insurance companies with massive subsidies. That is the  actual fact.\n\nThe American people…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the Russians. We  beat the Russians,'' because it was on tape delay.\n\nMr. Speaker, I am so proud for this body to pass this. As my  colleague, Mr. Sherman, said, it is also coming from the Senate. It  came from the Senate.\n\nThe fact of the matter is, as Chairman Williams says, it was more  than a hockey game. It was the height of the Cold War. The United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…information. We have engaged in  that effort. I certainly have. For over 600 days in the 116th and 117th  Congresses, ROIs, these resolutions of inquiry, were blocked from  coming to the floor by the Democratic majority. That is, of course, the  ``you did it, so we will do it'' argument--not particularly satisfying  if you want to have an open body.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…security, and ensure our children learn what is right, not  what our adversaries dictate.\n\nMr. WALBERG.  I say that as a gentleman from  Michigan.\n\nMr. WALBERG.  As a Member coming from the  Wolverine State, I congratulate him on Saturday's victory.\n\nMr. Speaker, H.R. 1005, the CLASS Act, is a critical step in limiting  foreign influence in our classrooms.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…inflation and prices high and inputs for everybody who makes  anything in America or grows anything, for that matter.\n\nSo while we tackle the 40-year high inflation rate--and it is coming  down, thankfully--these steps we have taken in the Working Families Tax  Cut Act I think will help us nudge the economy where it matters most-- which is at the kitchen table--in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, over the last few days, the  country has been shocked by the horrifying images coming out of Los  Angeles, but what is also shocking are the brazenly false statements  made by the Governor of California.\n\nGovernor Newsom has asked us not to believe our eyes,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692292/controlling-riots-in-california"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…not  only are we leading in the Nation in people wanting to move to our  State for protection, the people who are doing that protection, our law  enforcement officers, are coming from all over this Nation, uprooting  their families, to be Florida heroes because they know we have their  back. We need to do that for all of our heroes across this Nation,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}]