[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…aisle being violently handled by law enforcement.\n\nThis is wrong. This is not putting our country first. And I have to  say, I hope we can turn things around here in the coming weeks. But in  my lifetime, and certainly in my time in public office and in my time  serving this country, I have never seen anything like I have seen this  week.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…days--the 6 legislative days--and beyond, if  need be.\n\nI strongly encourage my colleagues to support this bill today and  continue to fight to protect our communities in the coming weeks.\n\nMs. DeLAURO. Madam Speaker, I yield 4 minutes to the gentleman from  Maryland (Mr. Hoyer), the distinguished ranking member of the Financial  Services and General Government…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Sergeant-at-Arms, in coordination with the Capitol Police; and second,  we will see real funding to support enhanced Senate security; and  finally, that we will see more progress in the coming weeks.\n\nI look forward to continuing to work on a bipartisan basis to get  that done.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the President signed into law on July 4. There are many  things to say about that legislation, and I will continue to daylight  concerning provisions buried in it over the coming weeks.\n\nBut today, I want to focus on section 60002 of the so-called ``One  Big Beautiful Bill Act,'' which repealed and rescinded all unobligated  funds from the Greenhouse Gas…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the Senate steps and join in one voice  with our House counterparts to decry the ways this President has  already--already--only 100 days in, failed our country.\n\nIn the coming weeks, we will continue to oppose deeply unqualified  nominees who have no business serving in government. We have seen that  already, for instance, with the antics of Mr. Hegseth.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…epidemic that has destroyed families and  devastated communities all across our country.\n\nOur country faces many challenges, and I am sure we will continue to  debate in the coming weeks how to address those, but today we will  advance, on a bipartisan basis, lifesaving legislation that we know is  working to combat fentanyl.\n\nNew data from earlier this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695792/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Everybody in my  State knows that this has nothing to do with their interests.\n\nLives are going to be lost in this country when millions of people  lose their insurance in the coming weeks. There are kids who are going  hungry, who are being fed lunch and dinner but not breakfast or just  dinner and not  lunch and breakfast because of the nutrition cuts that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…believe that the Trump Administration  will implement the reforms necessary to protect the safety of the  people of Minnesota.\n\nI will vote no today on H.R. 7148. In the coming weeks, my vote will  depend on what controls we can put in place for ICE and Border Patrol.  We must see an end to the surge in Minnesota, and a guarantee of  independent investigations…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…ask for this; Chicago did not ask for this; our  servicemembers did not ask for this.\n\nI am relieved to announce that just moments ago I secured a Senate  hearing in the coming weeks with witnesses from the Trump  administration where I will ask tough questions and demand answers on  these unjustifiable actions because I refuse to stay silent as our…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…it will  only grow in intensity over the year.\n\nBut, as everyone knows, healthcare is not the only part of the story  when it comes to lowering the cost of living. In the coming weeks and  months, Democrats will lay out cleanly and comprehensively how we can  lower costs for the American people on a number of different topics-- from health to housing,…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…and Ranking Member Lofgren, for keeping this vital source of  capital for our Nation's most promising innovators alive. I look  forward to continuing discussions in the coming weeks and months to  reach a bipartisan agreement.\n\nAllowing this program to lapse is simply not an option. I encourage  all of my colleagues to support this commonsense measure.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…these are the issues that will  be our focus.\n\nSenate Democrats will focus on these five issues like a laser. We  will come back to them again and again and again, in the coming weeks,  just like we came back to healthcare, over and over and over again,  this fall. And the American people know who is on their side when it  comes to healthcare costs.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…over and over again.\n\nSo as we are working in a bipartisan way in the Senate Judiciary  Committee with the understanding that the temporary scheduling may  expire in the coming weeks--in order to remove that pressure and allow  us to work in a bipartisan fashion, I have come to the floor today to  ask for unanimous consent that we continue that temporary…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…affect our tax revenues to the government  but, more importantly, affect the tax bill you receive.\n\nLet me stipulate for the record that when I am attacked a lot in the  coming weeks for saying, allegedly, I want to have taxes go up, I am  emphatically for cutting taxes. I would like to zero out the tax code,  eliminate the income tax, and get rid of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…this kind of hate-fueled  violence have no place in our country, no place in the world.\n\nI encourage you all to join me in keeping these families in your  prayers in the coming weeks. I am proud to stand in support of Israel  during this time.                                  GENIUS Act\n\nMr. President, now I will switch to the GENIUS Act.\n\nThe GENIUS…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…this critical juncture. The  administration has shared that serious negotiations are proceeding with  18 countries at a minimum now and with more to follow shortly.\n\nIn the coming weeks, the U.S. Trade Representative will meet with the  Senate advisory group on negotiations and the Finance Committee to  discuss these negotiations in detail. I encourage…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690537/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually trying to  build models right now on trying to see what is coming in in custom  duties. That is the tariffs. What is that offsetting? You will see me  over the coming weeks with a couple of charts and start saying: Okay,  here is what we have to plug into our models. For everyone who has been  whining around here, here is your math problem.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…we can find consensus.\n\nI want to commend NTSB Chair Jennifer Homendy and her team on their  thorough investigation of the crash. Their report will guide Congress  in the coming weeks in our efforts to ensure safety in the skies.\n\nIn addition to passing and implementing the ROTOR Act, Congress will  soon hold a hearing--after the NTSB releases its final…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…reconciliation, and I say these  are connected because we are going to make large policy decisions here  in the House, in the Senate, and with the President over the course of  the coming weeks that are going to have huge implications for all of  those small businesses on our Main Streets and all of those individuals  who work in them and rely on them for their…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…computer programmers       as well' '' he recounted.\n\nBut Psaki swatted away the criticism and made a vague       promise that Biden would put a jobs plan forward in the       coming weeks.\n\n``He has every plan to share more details on that plan in       the weeks ahead,'' she said when asked how Biden would       support workers left jobless by the decision.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}]