[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the problem. Now, maybe this is real and maybe  it isn't, but the fact that we don't know, the fact that the Executive  asserts the authority to blow up ships without coming to Congress for  the authorization of that kind of force could invariably lead to  mistakes, could also lead, inadvertently, to war with another country.\n\nThis resolution says: If…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Let me pause for a moment and say this: Those who are antithetical to  my views like to say that I--Al Green has gone rogue. It was in the  papers today. Al Green is coming before Congress, and he has his cane,  and he is just waving his cane.\n\nThat is what they say. They would have me become a person who is just  another person from some dark place who…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…this very  Chamber, Mr. Speaker. He was a respected individual and is still  referenced often by colleagues from both sides of the aisle. In fact, I  will never forget coming to Congress in 2019 in the 116th session of  Congress. It was my first term. I got sworn in on January 3, as we do.\n\nMr. Speaker, I said to my good colleague, Congresswoman Dingell:…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…culpability, hide from accountability, hide from  responsibility.\n\nIf you vote against S.J. Res. 59, what you are saying is this  President should be able to wage war without coming to Congress. If you  think the President should have to come to Congress, whether you are  for or against the war in Iran, you will support S.J. Res. 59. You will  support the Constitution…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…colleagues to  do the same.\n\nMr. McGARVEY. Mr. Speaker,\n\nMr. Speaker, I thank Mr. Pfluger for bringing this bill to the floor,  for his service to our country before coming to Congress, and for  acting on behalf of all of our aviators who have taken off the uniform  and are now fighting a different battle.\n\nMr. Speaker, this bill is important for everyone…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…strengthen that standard. It simply assumes that a  handful of paternalistic legislators know more about the interests of  America's businessowners than they do.\n\nBefore coming to Congress, I was a CEO of an energy company. We  raised a couple hundred million dollars to build that business, and I  was understandably accountable to a board appointed by those…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…any further illegal impoundments.\n\nThe power of the purse rests solely with Congress. If the President  seeks to cut funding, he must do so through proper channels: by coming  to Congress and requesting a lawful change.\n\nLet's be sure to remember that in the days ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…their healthcare and  their benefits. They were promised healthcare, and they were promised  benefits. And now this administration is breaking those promises, not  by coming to Congress and asking for a rescission or changing the PACT  Act, which we passed in a bipartisan way, but simply by firing the  people who were supposed to approve those claims…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…because the American people are  looking at this administration's actions in Venezuela and asking: What  is the plan? As someone who worked in national security before coming  to Congress, I have been in the situation room for discussions about  military operations. I worked on and in both Afghanistan and Iraq,  where our country has seen the risk of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I rise today to share how my office has been  hard at work for the people of Oregon's Third Congressional District.\n\nSince coming to Congress, our office has helped constituents recover  more than one-half million dollars owed to them by the Federal  Government through our casework services.\n\nThat is one-half…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697289/oregons-third-district-constituent-services"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…asking him a basic series of questions: Give us the  evidence that these boats were actually carrying narcotics. Give us the  legal rationale for striking them without coming to Congress. If you  knew where they were enough to strike them, you could have interdicted  them. Why did you choose to strike them and not interdict them? We hear  that drugs are…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Congresswoman Stevens and  Congressman Subramanyam for organizing this on such an important topic.\n\nAs Congress' sole Ph.D. physicist, I spent 25 years of my life,  before coming to Congress, working at the Department of Energy Office  of Science supported laboratory. We were smashing protons and  antiprotons together to make particles that have not been…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…our  colleague, a life well lived, a Member of the House of Representatives  who did such a good job on behalf of his constituents who he  represented faithfully since coming to Congress in 2013.\n\nDoug and I knew each other before then. We had interactions on a  number of issues that we were mutually passionate about beginning with  rural California and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…healthcare, House Republicans  are wasting time on ridiculous resolutions that do nothing to lower  costs for working families and, instead, threaten our public health.\n\nBefore coming to Congress, I spent over two decades as a pulmonary  and critical care physician. Every day, I saw firsthand how climate  change impacts people and how poor air quality leads to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688525/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…put in place.\n\nAfter we do the CRA and we prevent this administration or future  administrations from putting a similar resource management plan in  place without it coming back to Congress, then maybe the current  administration and Secretary Burgum can write a new resource management  plan that actually makes sense, that actually takes into account…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…think the world's financial markets are going to  finance our debt? We have Ray Dalio, the multibillionaire hedge fund  manager, who is now retired, has actually been coming here to Congress  saying: Warning, warning. The entire world's capital markets--because  China is borrowing, Japan is borrowing, and now Germany is going back  into the debt markets--there…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "Mr. McCORMICK. Mr. Speaker, I rise in strong opposition to this  resolution. I am an ER doctor who served many years just before coming  to Congress, which was not that long ago, where I saw multiple  overdoses every single night during a time where we had over 100,000  deaths per year in the United States, far more…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…with a PEO to grow two  times faster, have employee turnover that is 12 percent lower and a  higher business survival rate.\n\nI know the value that PEOs provide. Before coming to Congress, I  worked for a PEO, and I saw firsthand the positive impact they had on  small businesses in my home state of Indiana.\n\nMr. Speaker, I would like to congratulate the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…transportation barriers, doctor  shortages, and hospital closures. These challenges don't just affect  individuals; they affect entire families and communities.\n\nBefore coming to Congress, I spent nearly 30 years in the nonprofit  healthcare field, assisting those with life-changing diseases and  disabilities.\n\nMost of my congressional district is rural,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696840/national-rural-health-day"}, {"senator": "French Hill", "party": "Republican", "sentence": "…fully present.  Consumers opt in to it, and the competition is intense to retain those  customers.\n\nMr. Rose was the Commissioner of Agriculture in  Tennessee before coming to Congress. He is a very active member of both  the House Financial Services Committee and the Agriculture Committee.  He has rural Tennesseans and their financial success at heart.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}]