[{"senator": "Al Green", "party": "Democrat", "sentence": "…authority to impose  these taxes.\n\nHe has got lawyers who are supposed to be advising him if he doesn't  know.  Most people assume that if you are going to tax something coming into  the country, into the hands of a person who is in this country and you  put a tax on it--they call it a tariff, but when you put this tariff  tax on it, that this person is either…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…First, it is that, in 2024, CBP, or Customs and Border Protection,  seized about 43 pounds of fentanyl along our northern border--about 1  percent of the fentanyl coming into this country. Now, it has long been  known that fentanyl is not coming from Canada, and that hard drugs and  firearms flow north from the United States into Canada.\n\nIn fact, on…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…these goods, so they have to pay this tariff. This tariff has to  be paid that the President would add to the goods. Let's say you have  something that costs $40,000 coming into the country, a tariff of 10  percent, so that is going to give you an additional $4,000. This  additional $4,000 is collected at the point of entry, and the person  importing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…strikes and  then changing his mind on it. But, you know what, he is also asserting  what there is--that we all share as a real concern--and that is, any  kind of drugs coming into this country, we are all appalled by it and  want to do everything that we can to stop it.\n\nBut what is at stake here is the Constitution and the constitutional  provision that…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the 11 million undocumented people in the  United States coming forward and registering with this government who  they are, where they live, and they pay a fine for coming to this  country without documentation. They then don't automatically become  citizens, but they are allowed to work. They wouldn't be deported, and  they can live a normal life, paying…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…not the answer to this mental health crisis. It is  not the answer. The answer is to provide adequate treatment, and  education. It is also to prevent the drugs from coming into the country  but not just to put people in jail and throw away the key.\n\nMr. Speaker, I think House Republicans know that we can't simply  schedule our way out of this crisis,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…explain what I am talking about. On April 2, President  Trump imposed a 10-percent tariff on pretty much the whole world. In  other words, a 10-percent tax on anything coming into the country--10  percent.\n\nHe also imposed an additional--called reciprocal tariff--on April 2  as well. And those tariffs, for example, were an additional 20 percent  on the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…you should be fried, period. The one thing about this bill  that is lacking is simply this: We don't talk about the big magnet.  What is the big magnet for people coming into this country? Jobs.\n\nPeople come to work. We need the workers. Wisconsin dairy farmers, up  to 90 percent of those dairy workers at those Wisconsin dairies are  undocumented. Undocumented…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695362/stop-illegal-entry-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…who are tired  of being placed behind illegal aliens. When illegal aliens are given  benefits like Medicaid and Social Security by the thousands, then they  will keep coming into our country, burdening the American taxpayer, and  exacerbating the crime in our cities.\n\nThis is why it is so important that this Congress act now with a  budget reconciliation,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…January 20 of 2025.\n\nWe, the people, demand to know what is the data of so-called special  interest aliens. These are suspicious-travel-pattern, illegal  immigrants coming into our country. We want to know: Where did they  come from? How did they get here? Where were they before? We want to  know all the data that we allegedly collected. Congress has…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…America for us to be able  to focus on illegal activity coming across our border. When those  numbers drop, we are able to go more after what is the worst of the  worst coming into our country.\n\nI am grateful to see the work that is happening on our southern  border. We all should go see it.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…open up the debate  on illegal immigration. Fortunately, this body has taken action, along  with our President, to secure the border and to stop gang members from  coming into this country.\n\nYet, someone who was in this country who shouldn't have even been  here attacked and ambushed a Wake County deputy and killed him. These  stories happen around the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…I am so proud of this administration for keeping those campaign  promises and working swiftly and in a smart way to deport those folks  who broke the law, not just coming to this country but once here in  this country.\n\nFor a change, I think a lot of people are finally saying that the  government is working for them instead of against them. Let's send…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…cuts? None. They didn't say  anything. They didn't stand up for the American people. They were  silent.\n\nWhere were our good friends with the 15 to 20 million illegals coming  into this country, with the drugs flowing in, with the children that  were trafficked? Where were they? They were quiet. They didn't say a  thing. Mr. Speaker, it is anti-American.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to recognize that the population we are  dealing with, the individuals in Afghanistan--many of them are  functionally illiterate. And, of course, many of them are coming from  this country that was war-torn and literally run by the Taliban, which  is an international terrorist organization. Consequently, many of these  aliens have likely committed acts…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…the other side is: Where were they  the last 4 years? Where were they? We have got a steady diet of high  inflation. We have got a steady diet of 15 million illegals coming into  this country, using every public school, every hospital, not being a  citizen, draining the payroll, and draining the economy of America.\n\nWhat about the empathy for the poor,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…country. That was a policy decision and a  series of expansion of that policy over the course of 4 years that led  to millions upon millions upon millions of illegals coming into our  country.\n\nIn many cases, they themselves were victims of the lies that the  former executive branch put forth into the entire cartel pipeline, deep  into South American and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…answer the question of my friend from Maryland (Mr.  Raskin) about what is the question when it comes to agriculture. Here  is what the law says. The law says that coming into this country  without authorization is categorically illegal.\n\nThen it is within the discretion of the executive branch how to  prioritize deportations. Across party lines, there…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…to assimilate with our culture and to contribute to our  society. That is what we want. Being in this country is a privilege,  not a right. If you are an immigrant coming to this country, you need  to leave your old way of life and the traditions behind and come here  and work with us.\n\nUnfortunately, many of the Islamists who are here are not doing…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…nationalities to come here, all what our leftwing  friends would call people of color.\n\nIn any event, we have to ask ourselves: How do we handle this huge  influx of people coming into the country? If people come here and lie  and say that they are coming here for asylum, it seems to me that the  only alternative is to remove them, or we have no immigration…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "James Risch", "party": "Republican", "sentence": "…President, for  what you are doing, and I want to thank you on behalf of the parents  who will not have to early bury one of their children because of the  drugs that were coming into this country. Instead those drugs are lying  at the bottom of the ocean.\n\nThank you, Mr. President, for what you did. Keep up the good work.  Continue to stem the flow of these…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…wrong to believe that  sanctuary policy is bad for our country.\n\nNo. You are wrong. You are wrong to have turned your back on the 15  million, 10 million, 20 million coming into our country for 4 years.  You are wrong to sit by and watch these States obliterate the law.  There are 25,000 people that local governments and State governments  refuse to turn…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…off this work to continue to address  the illicit fentanyl crisis in our country.\n\nAccording to a 2021 GAO report, there was a 90 percent decrease in  these analogues coming into our country the year they were placed  temporarily into schedule I.\n\nThis bill is a critical step in combating the opioid crisis in our  country because China and Mexico are heavily…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}]