[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…deportation, because they don't  trust the system anymore. How is anyone supposed to follow the legal  steps if even those are now a risk?\n\nRepublicans claim over and over again in committees that this is only  about illegal immigration. It is not. If that were the case, then they  would be just as outraged as I am that people are being snatched  outside of their…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…previous seizures of cargo.\n\nMeanwhile, the nation's founding fathers exchanged fervent       messages about the Gaspee's burning and the British response,       setting up the committees of correspondence that helped them       coordinate strategies in the years to come.\n\nAdams, particularly, warned that Britain's determination to       pursue the Gaspee…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Rosario; Stephanie Woods, who chairs the Youth and Education Committee;  and board members Janine Thomas, Stefani Hazell, and Maritza Fludd.\n\nThe board has vibrant citizen committees engaged in every aspect of  neighborhood life: economic development, housing and zoning, municipal  services, parks and recreation, planning and budget, youth services,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Intelligence Committee when I chaired the committee, he should well  know that Members of Congress actually don't hold clearances that can  be revoked; we either serve on certain committees or we don't.\n\nBut more to the point, in listening to my colleague address this  motion to release the video to the American people, I have heard very  little of the basis…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…legislation to gut the National Environmental Policy  Act. In our markup the same week, Republicans led the charge to  eviscerate the Endangered Species Act. Separately, in other committees,  they are going after the Clean Water Act.\n\nEvery one of these safeguards that we are told will be a backstop  against anything going wrong in the Boundary Waters is under…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…like DOD.\n\nIt is with that context in mind that I have serious concerns about  the INNOVATE Act as currently proposed by the Chairs of the House and  Senate Small Business Committees. Even DOD itself has flagged  significant concerns. I do support a long-term comprehensive  reauthorization of the program, and I am committed to taking a serious  look at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…urge the House to reject       spending cuts to nutrition programs in the budget       reconciliation process and support the work the House and       Senate agriculture committees are doing to create a strong,       bipartisan farm bill.\n\nThe Federal AIDS Policy Partnership:\n\nWe are writing on behalf of 95 national, regional, and       local organizations…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…worked directly on the Judiciary Committee and the  Ways and Means Committee and has worked with Members who served on the  Budget, Oversight, and Education and the Workforce committees. It is  truly rare to find someone with his breadth and depth of experience  working in the House for as long as Daniel has. That is a testament to  his commitment to public…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…there are elements in it  that need to be changed.\n\nWe look forward to not only extending these tax credits but also a  meaningful, bipartisan gathering in the appropriate committees to talk  about changes in the Affordable Care Act.\n\nNow, there are some people who want to see changes that are  politically volatile. To go into the issue of abortion now…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…eliminate waste, not with a meat-ax  but with a scalpel.\n\nI wish my colleagues had been in the hearing today, the joint hearing  of the House and Senate Veterans' Affairs Committees, to hear Commander  Al Lipphardt of the Veterans of Foreign Wars, the VFW--a really heroic  Vietnam veteran, injured there, with shrapnel in his arm. As he told  us, the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…recognized by a variety of organizations such as the United Nations,  UNESCO, and the World Economic Forum. He has also dedicated his time  serving on the Executive and Central Committees and Faith and Order  Commission of the World Council of Churches.\n\nPatriarch Bartholomew has a focus on creating advocacy for  environmental issues and in his time launched…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695458/welcoming-the-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…contributions to       super PACs in each of the previous three elections. (For the       purposes of this analysis, the term super PACs includes       groups called Carey committees or hybrid PACs that have both       an independent expenditure arm and an arm that takes limited       contributions.)                            Television Ad Spending…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…But now  Republicans in both Chambers must follow through. We need congressional  hearings. We need full and transparent briefings from the Pentagon.  Most importantly, the committees should continue to demand that  Secretary Hegseth release--release--the tapes.\n\nThis is such a serious matter that Secretary Hegseth himself should  come before the Congress…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697173/secretary-hegseth"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…bill.\n\nMadam Speaker, I am extremely proud to lead the Main Street Parity  Act with Chair Williams. As members of the Small Business Committee,  one of the most bipartisan committees in the 119th Congress, we hear  the same messages repeated every single day: Small businesses don't  need special treatment. In fact, they are just asking for a fair shot…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Customs and Border Protection was using migrant care funds to  buy ATVs while children died in custody.\n\nMembers of Congress from both parties and across all congressional  committees have benefited from Mr. Dodaro's dedication to  accountability, efficiency, and management reform. He testified before  Congress more than 200 times and helped Congress steer…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…respect to such agreement.\n\n(B) Report; briefings.--If the Secretary fails to satisfy       the requirement under subparagraph (A), the Secretary shall--\n\n(i) submit to the Committees on Veterans' Affairs of the       House of Representatives and the Senate a report that       includes--\n\n(I) an explanation of the reasons the Secretary failed to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…on the third rail and do the moral thing to actually  take these on? Hell, no.\n\nMr. Speaker, I have talked to so many people on the Committee on Ways  and Means and other committees who basically look at me in terror and  run out of the room.\n\nThe political consultants care more about the power of the politics  than the fact that in 7 years, Medicare…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Options for Building Accountability, Resilience,       and Independence Act'' or the ``MEGOBARI Act''.       SEC. 2. DEFINITIONS.\n\nIn this Act:\n\n(1) Appropriate congressional committees.--The term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Foreign Relations of the Senate;\n\n(B) the Committee on Appropriations of the Senate;…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Islands has crossed the threshold of reasonable suspicion and,  therefore, she should be investigated by Ethics, by DOJ, and I would  recommend by the Oversight and Judiciary Committees. Meanwhile,  she should absolutely be removed from the House Permanent Select  Committee on Intelligence. This, Mr. Speaker, is my position. I present  it without note for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…of Staff, and eventually my Chief of Staff,  Bryan was essential in helping me become a leader on the House Armed  Services, Intelligence, Foreign Affairs, and Agriculture Committees.\n\nHis accomplishments continue to be recognized by his alma mater,  receiving the 2024 Houston Christian University Emerging Leader Award,  an honor bestowed upon alumni…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…(B) not later than 30 days after granting a waiver, submits       a notification and justification (including information about       the duration of the waiver) to the Committees on Armed       Services of the House of Representatives and the Senate.\n\n(f) Definitions.--In this section:\n\n(1) The term ``agency'' has the meaning given the term in…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…resolution, as follows:                                H. Res. 600\n\nResolved, That the following named Members be, and are       hereby, elected to the following standing committees of the       House of Representatives:\n\nCommittee on Foreign Affairs: Mr. Fine.\n\nCommittee on Homeland Security: Mr. Garbarino, Chair.\n\nMr. HERN of Oklahoma (during the reading).…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694034/electing-members-to-certain-standing-committees-of-the-house-of-representatives"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…requiring burdensome archaeological reports on energy producers.\n\nThere will be ample opportunities to debate, amend, and provide  suggestions when the appropriate authorizing committees move forward  when we begin our work on spending reforms in a budget reconciliation  package. We should focus on the legislation before us this week.\n\nI encourage my colleagues…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…five       years, the Secretary of Homeland Security, in consultation       with the Director of National Intelligence, shall submit to       the appropriate congressional committees an assessment of       terrorism threats to the United States posed by the use of       generative artificial intelligence for terrorism.\n\n(2) Contents.--Each terrorism threat…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Republicans. As reported in Punchbowl, it is  their once-in-a-lifetime opportunity to cut Medicaid.\n\nThis week in the dead of night while America was sleeping, Republican  committees took a sledgehammer to lifesaving programs like Medicaid.  Mr. Speaker, let me tell you what is happening. Democrats fought all  night to save 8.6 million Americans from…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…has in place any agreement with a foreign country       of concern.\n\n(d) Report.--Not later than the last day of each fiscal       year, the Commission shall submit to the Committees on       Foreign Relations and Appropriations of the Senate and the       Committees on Transportation and Infrastructure and       Appropriations of the House of Representatives…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692167/international-boundary-and-water-commission-authority"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for a reconciliation package  that will almost certainly guarantee $1.5 trillion to $2 trillion of  deficit spending because I am getting certain crumbs in cuts in certain  committees, and the only reason that I have gotten said crumbs was  because we threatened to stop the extension of the tax cuts in order to  force the question on spending?\n\nLook, I…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the next important step to passing  President Trump's ``America First'' agenda.\n\nThe budget will go back--and has gone back--to the House, and then it  will be time for the committees to do really the hard work. This was  the easy part, passing the framework, but now we have to write the  bills to implement not only the continuation of the current tax…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…anymore.\n\nIt is significant what we have accomplished. The Energy and Commerce  Committee just finished up, and the House Ways and Means Committee  earlier. We have got 11 or so committees that have contributed to the  one big, beautiful bill, the reconciliation package. We want to see  this thing get advanced as we continue to make it into law as the  process…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…transfer, or remote access''.       SEC. 3. CONSULTATION WITH CONGRESS.\n\n(a) In General.--The Secretary of Commerce shall ensure       that the appropriate congressional committees are kept fully       and       currently informed of any anticipated promulgation of       regulations to control the remote access of items under the       Export Control…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}]