[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "\"We're now seeing leaders of the Chinese Communist Party - in the midst of a public health crisis they allowed to go global and endanger millions - threaten to withhold life-saving medical supplies and medications from the United States."}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Madam Chair, I rise today as the ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party, the CCP, to express serious  concerns about the proposed cuts in the Republicans' budget resolution."}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "From my vantage point of serving on the Science, Space, and  Technology Committee and the Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party,  I certainly understand the risks."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "It comes with a price of subservience and dependency on the  Chinese Communist Party."}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Are we supposed to call the Chinese Communist Party and ask them to  go and get these batteries and start making these batteries?"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "That is why I would like to submit for the  Record a report by Rutgers University entitled ``A Tik-Tok-ing  Timebomb: How TikTok's Global Platform Anomalies Align with the Chinese  Communist Party's Geostrategic Objectives,'' which can be found online  at https://networkcontagion.us/wp-content/uploads/A-Tik-Tok-ing- Timebomb__12.21.23.pdf."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "\"By virtue of being the first to emerge on the other side of this pandemic, the Chinese Communist Party is working hard to use the crisis to its advantage by extending influence over the global economy,\" said Senator Young."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "\"As the Chinese government and Communist Party continues to systematically repress its citizens as well as Uyghurs, Tibetans, and actively undermines Hong Kong's autonomy, the United States remains committed to honoring the memories of those who perished and keeping their legacy alive.\" \n\n\"On this 31st anniversary of the Tiananmen Square massacre, we affirm the importance of standing with those who stand for freedom and for the right to peacefully protest,\" said Merkley."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "116--76) issued the following statements as Chinese lawmakers are expected to propose a national security law in Hong Kong: \n\n\"By proposing national security laws for Hong Kong, the Chinese government and Communist Party will push Hong Kong's autonomy to the breaking point,\" Rubio said."}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "We must ensure that the  United States remains at the forefront of this industry, especially as  the Chinese Communist Party is advancing in the remote sensing sector."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "In November 2019, the Chinese Communist Party (CCP) nominated a candidate to head this global organization, which was created to \"promote the protection of intellectual property among states.\" Given China's persistent violations of IP protections, including through trade secret theft, corporate espionage, and forced transfer of technology, the United States and its allies must stand firmly against such a move."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Secretary: \n\nWe write with deep concern over recent developments in Hong Kong, where the Chinese government and Communist Party (CCP) continue to accelerate efforts to undermine Hong Kong's autonomy and the rule of law."}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "They say the  Chinese Communist Party can have a digital yuan, the bitcoin bros can  have a digital currency, but America is limited to 1776 technology."}, {"senator": "Robert Menendez", "party": "Democrat", "sentence": "Tsetkova has been placed on house arrest and faces years of  imprisonment for her creative work at a youth amateur theater which the  state has labeled ``homosexual propaganda,'' for drawings described as  criminal ``pornography'' and for administrating two LGBT-themed groups  on social media deemed'' gay propaganda.') \n\n  The Chinese Communist Party has waged a powerful campaign to suppress  vibrant ethnic minority communities and political dissent."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "I have gained a little bit of knowledge  not just from the Energy and Commerce Committee, but I serve on the  bipartisan Select Committee on the Strategic Competition Between the  United States and the Chinese Communist Party."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "\"This would have been an important subject even if the coronavirus had been contained in China, but unfortunately, China's failure to contain it -- and the Chinese Communist Party's willful attempts to cover up its existence -- means the vulnerability of America's supply chain is of even graver consequence."}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "The U.S government and responsible industry leaders must take strong action to cut off the Chinese Communist Party's access to technology that it uses to build a network of surveillance and repression around the world.\""}, {"senator": "Rick Scott", "party": "Republican", "sentence": "As Cotton said, \"The United States shouldn't be sharing valuable intelligence information with countries that allow an intelligence-gathering arm of the Chinese Communist Party to operate freely within their borders.\"\n\nHuawei and the Chinese Communist Party are one and the same."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "This past Saturday, the people of Taiwan poured some additional salt  on Beijing's wounds by delivering a stunning electoral rebuke against  the Communist Party."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Furthermore, the Chinese Communist Party  Government tried to hide its actions by denying there were any export  restrictions."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "Li Wenliang's courage and professionalism make him a champion of the Chinese people and an enemy of the Chinese Communist Party."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "\"Aviation infrastructure is critical to national security -- and for that reason, China's Communist Party proxy companies are targeting our commercial airports."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "federal employees from conducting official business on platforms run by Tencent, Huawei, ZTE, and other companies the State Department determines cooperate with the Chinese Communist Party (CCP)."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "We know a lot about  the one discovered in Reedley because I requested a report from the  House of Representatives, an investigation which resulted in a report  by the House Select Committee on the Chinese Communist Party."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "The Chinese Communist Party is trying to crush freedom in Hong Kong and they're looking at Taiwan next."}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Continuing to use our taxpayer  dollars to give the Chinese Communist Party a seat in the front row of  our universities' classrooms and research labs would be a catastrophic  mistake."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "companies, the People's Republic of China and the  Chinese Communist Party can obtain access to intellectual property and  know-how."}, {"senator": "Brian Babin", "party": "Republican", "sentence": "It  should go without saying that it is a big problem to be at the whims of  the Chinese Communist Party when it comes to materials that are  absolutely critical to our national defense, economic security, and our  energy independence."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "Senator Marco Rubio\n\n\"China Wants to Help the World Fight Coronavirus\" (op-ed, May 13) by China's Foreign Ministry Commissioner Xie Feng is the latest attempt in the Communist Party's blatant effort to sow chaos through conspiracy theories, spread propaganda and rewrite history amid a global crisis."}]