[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "While the Republicans scale  back their ambitions for American leadership in energy technology,  Communist China is racing into the future."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "This impulsive decision  is a direct blow to family-owned businesses and American entrepreneurs  competing against Communist China, Mexico, and every other low-wage  haven in the world."}, {"senator": "Al Green", "party": "Democrat", "sentence": "The only time I saw anything similar to this  was when I was in Communist China and I was with a group of very young  children, babies who were maybe 5 or 6 years old at most, and they were  all seated in a line."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "The next bill that we are going to consider  is all about giving more LNG to China, to Beijing, to Communist China."}, {"senator": "Doug Jones", "party": "Democrat", "sentence": "This resolution follows Senator Scott's continued calls on the IOC to stand for freedom and urge Communist China to stop violating human rights, or find a new home for the 2022 Olympic Games."}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "What is not fair is seeing American workers undercut by governments  like Communist China that use the power of the state to dump  artificially cheap products on our markets."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "Huawei is being used as a tool for Communist China to commit espionage on foreign nations, their own citizens and anyone they see as a threat."}, {"senator": "Robert Menendez", "party": "Democrat", "sentence": "\"This isn't Castro's Cuba, Putin's Russia, Maduro's Venezuela or communist China where strongmen have routinely used force to quell dissent and stifle a free press."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "I am proud that Florida's Space Coast continues to be America's gateway to the stars, including this past weekend when NASA and SpaceX successfully launched the first American astronauts from American soil on an American rocket to the International Space Station in almost a decade.\" \"Our nation is competing against known adversaries like Communist China and Russia in the space launch industry, and we must put American interests and national security first,\" Scott said."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Yet, they are going to allow with this bill unlimited exports to  Communist China."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Department of Energy  has ceded ground to global competitors like Communist China."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "945, the Holding Foreign Companies Accountable Act:\n\n\"Communist China routinely flouts congressionally established requirements for participating in US stock exchanges."}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "It is bad enough that his statements have sent an unmistakable  message to the world, in particular, Communist China, that aggression  pays."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "As we saw last year, the repressive behavior of Communist China  backfired on officials in Beijing."}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "We have seen what that looks like in  Communist China where the CCP uses it to track, monitor, and control  their people, but not here, Mr."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Communist China was  buying half a million barrels a day of oil from Venezuela--day after  day, after day."}, {"senator": "Martha McSally", "party": "Republican", "sentence": "I have been studying communist China my whole life in the military."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Rick Scott (R-Fl.) to introduce a bipartisan resolution calling on the International Olympic Committee (IOC) to move the 2022 Winter Olympics out of Communist China and rebid it to a country that respects human rights."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "Richard Pollack:\n\nWe write to you today with grave concern about the threat American research and development programs face from Communist China."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Like many of my colleagues in the United States Senate, I question Communist China's ability and willingness to coordinate in a transparent manner with international bodies when it comes to combating the threat of the coronavirus.\" In his letter, Grassley also pressed the WHO on its treatment of Taiwan and the potential consequences for global public health."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Today, Senator Rick Scott spoke at the Hudson Institute on Communist China's threat to the United States' national security and economic stability, and how the international community must stand united against Communist China and fight for human rights."}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Our adversaries in Communist China are doing what?"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "Reports indicate the software used in these  cranes can be exploited for espionage, potentially transmitting  sensitive data such as the location and movement of cargo back to  Communist China."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Malpass,\n\nThank you for taking the time to discuss with me the many important issues facing the World Bank, particularly as it relates to lending to Communist China."}, {"senator": "Martha McSally", "party": "Republican", "sentence": "Senator Martha McSally (R-AZ) on Thursday introduced legislation to prohibit the use of federal funding to purchase drones manufactured in communist China or by Chinese state-owned companies."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Today, Senator Rick Scott released the below statement following his letter to Florida university presidents requesting information on the steps they have taken to safeguard technology and intellectual property from the influence of foreign adversaries, including Communist China."}, {"senator": "Martha McSally", "party": "Republican", "sentence": "McSally sent a letter to the WHO requesting information ahead of a congressional hearing to investigate the WHO's role in helping Communist China cover up information regarding the threat of the coronavirus.On April 1, Sen."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Today, Senator Rick Scott released the below statement following reports that Communist China delayed the release of the genetic map, or genome, of the coronavirus, stalling the recognition of its spread to other countries, as well as with the global development of tests, drugs and vaccines."}]