[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…cannot support the confirmation of any additional members to  the FTC until Commissioner Slaughter and Commissioner Bedoya are  reinstated. President Trump's dismissal of Commissioners Slaughter and  Bedoya is not only illegal; it hurts consumers and small businesses by  undermining the independence of the Agency that Congress established to  protect…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…advocacy by the Atomic Energy  Commission. No evidence was ever produced that Oppenheimer was a  security risk or that he was anything other than a loyal American, and  the Commissioners acknowledged as much. Nevertheless, the physicist who  just 9 years before had been heralded as a hero for his role in ending  the war in the Pacific had his security clearance…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that out-of- pocket premiums for a single person would more than double on average  next year if the enhanced premium tax credits expire.\n\nThat is, we have had insurance commissioners and various offices  across various States trying to make guesstimates about this, but  increasing from $880 a year to $1,900 a year in 2026 just shows you how  dramatic…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…are not just limited to education. It prompted a purge of  federal agencies of employees who supported DEI initiatives,  culminating in the unprecedented firing of EEOC Commissioners. Without  their presence, the EEOC actually lacks a quorum and is essentially  unable to protect the rights of workers whose rights under Title VII of  the Civil Rights…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…several others under consideration this afternoon, is compromised  by the Trump administration and the President's illegal political  attempt to fire the two Democratic commissioners.\n\nThis unlawful decision undermines the legitimacy and transparency of  the agency's decisions, sending a message that no commissioner,  regardless of party, is safe, and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…instead work in partnership with states to strengthen and preserve the  program for the future.'' That is the Louisiana State house  Republicans.\n\nThe Houghton County Board of Commissioners in Michigan voted to  oppose Medicaid cuts. Mr. President, 52 organizations in Alabama,  including the Alabama Cancer Society, the Leukemia & Lymphoma Society,  churches…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…and I thank my colleagues on the other  side of the aisle who worked tirelessly to bring this legislation to  the finish line. I also thank the local leaders, our county  commissioners, school superintendents, teachers, parents, and  firefighters, just like these folks here in Fence Lake, who raised  their voices and never let this issue slip from their…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…views on the issue, know is a key fiscal concern on its current track.\n\nThe commission's final recommendations would be due to Congress by no  later than one year after the Commissioners are appointed. If the  proposal is supported by at least twelve members of the committee,  including at least four members of each party, it would receive  expedited consideration…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…celebrate Lisa Janicki's service as a County Commissioner for Skagit  County, Washington.\n\nCommissioner Janicki was first elected to the Skagit County Board of  County Commissioners in November 2014, following a career of more than  thirty years as the Chief Financial Officer for Janicki family  businesses.\n\nDuring her eleven years in office, Commissioner…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Navajo Code Talkers. Republicans even want to delete  a picture of  the Enola Gay airplane because it contains the word ``gay'' in it.\n\nWe have seen the termination of the Commissioners of the Equal  Employment Opportunity Commission and a memo from the Department of  Justice that would investigate, eliminate, and penalize those who  engage, both in the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…public service with a community-based housing  initiative.\n\nSince his time as a member of the Chicago City Council, the Illinois  State Senate, and Cook County Board of Commissioners, Congressman Chuy  Garcia has served his community, the Congress, and our country with  great distinction.\n\nAs it relates to the matter under consideration, in nearly every…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…America's Workforce Act.\n\nSince day one, President Trump has worked to dismantle the  institutions that protect workers and weaken the power of organized  labor. He dismissed commissioners from the Federal agency responsible  for enforcing workforce civil rights, and he stripped the National  Labor Relations Board of its quorum.\n\nThen in March, he moved to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697980/protect-americas-workforce-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have continued to remain silent on President Trump's  willingness to risk the safety of American children and families by  attempting to unlawfully remove Democratic CPSC commissioners and  planning to eliminate the CPSC altogether.\n\nI am pleased a district court recently upheld the law and reinstated  the Democratic commissioners to their posts, but…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…community as an appointed or elected leader  since he was 21 years old. He served on the City Council from 1985 to  1991 and the First Fire Taxation District's Board of Fire Commissioners  from 1980 to 2004. As a member of the Connecticut House, Steve  represented West Haven's 115th District from 1991 to 2017. For 20  years, he was a co-chair of the General…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…crisis--wiped.\n\nNo. 65, called for the firing of judges who have disagreed with him,  which clearly would violate the U.S. Constitution.\n\nNo. 66, illegally fired the Democratic Commissioners at the Federal  Trade Commission.\n\nNo. 67, cut off legal representation for unaccompanied children in  immigration proceedings.\n\nNo. 68, cut funding to fight the opioid…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Award, and the Celina Varsity  Cheer Parent of the Year Award. He has also been recognized by the  Celina Fire Department and received a proclamation from the Collin  County Commissioners Court for the State of Texas. Sean's leadership  and community advocacy have made a profound impact on the City of  Celina and the North Texas region. I am pleased to recognize…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…bicameral, bipartisan  $2.50 for America's 250th Act in partnership with Congresswoman and  fellow U.S. Semiquincentennial Commissioner Bonnie Watson Coleman, as  well as Commissioners Congresswoman Maria Salazar and Congressman  Dwight Evans.\n\nI thank the chair and ranking member of the Financial Services  Committee for their support for this piece of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…disturbing that  such a dramatic change to the current land use plan would solicit such  little engagement during the public comment period. Campbell and  Johnson County commissioners who represent the local communities  affected by this plan stated that whatever information they provided to  the BLM in this process was ignored by the Federal agency.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…in public service  continued as the first African American President of AFSCME Council No.  13, the first African American President of the Susquehanna Township  Board of Commissioners, and the first African American Chairman of the  Dauphin County Republican Committee. In 1986, Stan stood alongside  Governor Dick Thornburgh for the signing of House Bill…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…its global  influence campaign.\n\nConcern over the threat posed by Confucius Classrooms is not new. In  2020, Secretaries DeVos and Pompeo sent a letter to State education  commissioners, outlining their concern with these types of programs and  urging schools to consider the threat they may pose to academic  freedom. The State Department found that approval…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…stable, reliable funding to rural counties that host Federal  forests by reauthorizing the Secure Rural Schools program through  fiscal year 2026.\n\nThat means that our county commissioners and local leaders can plan  with confidence, knowing that the Federal Government will keep its  promise to pay predictable-share forest revenues to the school  districts…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "French Hill", "party": "Republican", "sentence": "…residential heirs properties;\n\n(3) describes the objectives and requirements of the       Uniform Partition of Heirs Property Act as approved by the       National Conference of Commissioners on Uniform State Laws in       2010;\n\n(4) details the various resources that may be available to       the owners of residential heirs properties, including housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…benefited from timber sales.  With the majority of Utah's land federally managed, our counties cannot  simply tax their way out of budgeting shortfalls.\n\nThe elected county commissioners in my district spend a lot of time  getting creative and stretching the dollars they have as far as they  can, and that includes working to get Congress to fund SRS. Kane…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697663/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I rise to commend the Rockingham County  government and Kevin Berger, chairman of the Rockingham County  Commissioners Board, in the planning and implementation of the  Rockingham County Veterans Treatment Court.\n\nIn October of last year, the Rockingham County government received a  $900,000…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692311/recognizing-rockingham-county-veterans-treatment-court"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…continue  to support the American farmer by bringing down costs, securing new  trade deals, and prioritizing American crop production.    Honoring Franklin County Board of Commissioners and Agricultural Land                             Preservation Board\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor the  Franklin County Board of Commissioners…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…serving as an Auburn Common  Councilman.\n\nIn December, before his passing, Mike received the distinguished  County Commissioner of the Year award from the Indiana County  Commissioners Association.\n\nMike was the architect of many projects that bettered our region such  as having the Auburn Waterloo Trail become part of the Poka-Bache  Connector trail…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689233/recognizing-the-life-of-dekalb-county-commissioner-mike-watson"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…they announced the closures after they actually did it.\n\nThanks to the efforts of myself, Congressman Clyde, and our amazing  local officials, State legislators, and county commissioners, we were  able to reverse most of these closures and keep almost all of our parks  open under the control of our local governments.\n\nCongressman Clyde and I also introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and lead the industry.\n\nI hosted my annual listening session, where I was able to take  questions directly from producers and consumers. The crowd also  included county commissioners, Farm Bureau leaders, State senators,  representatives from Penn State, Delaware Valley, as well as lots of 4- H'ers, dairy princesses, and FFA members.\n\nAs the House Committee…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…their mission. It had nothing to do with maintaining  the beauty of the California coast, one of the most beautiful places in  the world, which is their mission.\n\nNo. The commissioners explicitly said during their meeting that the  reason they were going to stop these launches, which the Air Force said  are in the national security interests of the United…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]