[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…particular problems, nor       command the States' officers, or those of their political       subdivisions, to administer or enforce a federal regulatory       program . . . such commands are fundamentally incompatible       with our constitutional system of dual sovereignty.\n\nThat sure doesn't sound like anyone is defying any Federal law to me.  And nobody…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Medicaid with a greater degree of precision. He says: ``But there is  another tradition that we share today. It calls upon us never to be  indifferent toward despair. It commands us never to turn away from  helplessness. It directs us never to ignore or to spurn those who  suffer untended in a land that is bursting with abundance.''\n\nThis is not just…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…clearer, he said poorly and unclearly--but let me say  again--have to be much clearer about what we stand for, which is for a  transition that makes sense and that science commands and for the  respect of people that are working in the energy industry no matter  what part of the industry they are working in.\n\nAnd the fact that Donald Trump--even when…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Orthodox Christians living across the  globe, including many in Rhode Island. He is an accomplished scholar, a  devoted environmentalist, advocate for peace, and a leader who commands  great respect around the world.\n\nOver the past three decades, Ecumenical Patriarch Bartholomew has  used his position to establish himself as a leading voice on many  important…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695453/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…mission-ready. Under Gene's leadership, the Regional Defense  Partnership has served as Ventura County's community-based organization  supporting our military installations and commands as essential assets  to our national security and key contributors to our local economy.\n\nDuring periods of uncertainty and significant challenges, including  threats of base…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…right. And that is why the Founders designed the  Constitution with a separation of powers. Congress has the  responsibility to decide if we go to war, and then the President  commands our military to go to war.\n\nArticle I gives Congress the power to declare a war and article II  gives the President the power to be the Commander in Chief to execute  the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…because their independence is  essential.\n\nAny of us who had economics in college or beyond knows that  independence of the Fed is essential to the respect that our country  commands in terms of our own economy throughout the world. The Chairman  of the Fed is the Chair of the central bank and serves as the Chair of  the central banks globally. It can't…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…economic  sanctions, as the President is doing against the regime in a renewed  boycott of Iran.\n\nMr. Speaker, decisive turning points in history do not come often.  When history commands, we must answer. That answer will follow us far  into the future.\n\nThis time and in this hour, let the United States take a stand with  the people of Iran and, by so doing,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…the Tactical Surveillance, Reconnaissance,  and Tracking program as a formal program of record to provide badly  needed space products from commercial providers to combatant commands.  We also provide tools to sustain the growth and development of United  States Space Force guardians to ensure we have the highly skilled and  technical proficient acquisition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…responded to a call for assistance after a woman had  been stabbed. Upon entering the apartment, they encountered the suspect  holding a knife to his father's neck. After repeated commands in both  English and Spanish were ignored and the suspect began to cut his  father's throat, Officer Lynch fired at the suspect, striking him once,  saving the father's life.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691108/recognizing-nypd-detective-fabio-l-gonzalez"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Guard;\n\n``(D) carrying out the functions of the Coast Guard so as       to fulfill the current and future operational requirements of       the unified and specified combatant commands;\n\n``(E) effective cooperation and coordination between the       Coast Guard and the other military departments and agencies       of the Department of Defense with regards…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Achievement Medals  and two Navy Commendation Medals. His duty stations include USS  O'Bannon (DD-987), USS Lexington (CVT-16), USS Dwight D. Eisenhower  (CVN-69), and various Shore Commands.\n\nHis final duty station was Naval Air Station Jacksonville, Detachment  Astor, located in the Ocala National Forest. He served as an operations  officer where he conducted…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…President at the White House and with the leadership of both Houses  of Congress from both parties. We recognize that His All-Holiness is  among the very few world leaders who commands such high-level access to  the leadership of our Nation.\n\nThe U.S. Congress expressed its profound respect and admiration for  His All-Holiness in 1997 when it awarded him…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Chief of Staff at Ft. Novosel, U.S. Army Aviation  Center of Excellence.\n\nColonel Tucker has served our Nation throughout a remarkable career  spanning multiple continents, commands, and combat zones. He is highly  decorated for valor and meritorious service, and his leadership has  been instrumental across a wide array of assignments, from commanding…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, Mr. Green deliberately disrupted  Congress' proceedings during a joint session yesterday.\n\nThis was an affront to the Constitution, which commands that the  President report to the Congress from time to time. It was an insult to  the Presidency, and it was a disgrace to this body.\n\nIt was perpetrated not by some lunatic…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688497/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…with dignity, courage, and an unyielding  commitment to our Nation. He brought his entire team home, every single  one of them.\n\nThat is the mark of a leader who not only commands respect but  inspires it. He embodied the warrior spirit, the never-quit attitude,  and the deep sense of duty that defines the very best of our Armed  Forces in this country.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…today produce appliances that connect to software  applications that can be set, managed, and monitored through one's  computing device. They are designed to capture voice commands from  around the vicinity, recording information to adapt to the way  individuals give commands. They are also often equipped with cameras to  capture QR codes or other specific…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Georgetown Law School and was admitted to the bar in both  New Jersey and the District of Columbia. He served for three years as a  legal officer in the Marine Corps, advising commands both in the U.S.  and in Vietnam. In 1966, while still on active duty, John married his  wife, Mary. After completing his service, he founded the law firm now  known as Post…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691600/recognizing-john-post"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…later  than September 30, 2033.\n\nIt accelerates the sea-launched nuclear cruise missile program. And  it expands experimentation and prototyping authority to all combatant  commands, including U.S. Strategic Command at Offutt Air Force Base in  my home State of Nebraska.\n\nThis is exactly the kind of strategic deterrence that makes our  adversaries think…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Public Affairs Specialist, Mr.  Woodward has been a tremendous source of expertise for the United  States Air Force. Mr. Woodward has served in a number of critical roles  and commands, including the 927th Air Refueling Wing at MacDill Air  Force Base, Florida and European Regional Medical Command at Sembach  Air Base, Germany. Mr. Woodward subsequently…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}]