[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…location was secured.  In 1989, the two churches united, forming what we now know as Trinity  Faith United Methodist Church. Over these 35 years, they've shown a  deep commitment to serving others--whether through their food pantry  that nourishes those in need or through their dedication to spiritual  learning and growth.\n\nThe 12th Congressional District…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…inspired by Joseph Newton  Pew's vision, stands as a testament to this organization's enduring  impact on our city.\n\nMr. Speaker, in recognition of their unwavering commitment to serving  others, we honor The Pew Charitable Trust.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today to recognize and honor Chief  Brian Tholen for his distinguished career in law enforcement and his  lifelong commitment to serving the people of Minnesota through  education, volunteerism, and public safety advocacy.\n\nFor over 25 years, Chief Tholen served with dedication and integrity  as a police…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Program  and Special Event Award for the creation of the Kingpins drumline, an  educational program designed specifically for children with special  needs.\n\nThe Strikers' commitment to serving the Crystal Lake community  extends beyond the classroom. They actively support aspiring performers  through college scholarships, fundraisers, and by providing a platform…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…2025.\n\nIn their time as Eagles, the graduates have accomplished so much.  From inspiring performances on the stage to hard-fought victories on  the field and a true commitment to serving our community, they embody  what it means to be a Freedom Eagle.\n\nTheir passion for change and dedication to making a difference is  clear, especially through the efforts…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise today to recognize Neabsco Baptist  Church located in Woodbridge, Virginia for their extraordinary  commitment to serving families in need.\n\nDuring the height of pandemic, the church created the Food Giveaway  Program to help members from the congregation put food on their tables.  As…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696800/recognizing-the-neabsco-baptist-church-for-serving-families-in-need"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today to recognize and honor Chief  Brian Tholen for his distinguished career in law enforcement and his  lifelong commitment to serving the people of Minnesota through  education, volunteerism, and public safety advocacy.\n\nFor over 25 years, Chief Tholen served with dedication and integrity  as a police…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693614/recognizing-brian-tholen"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…greater Newark community  today.\n\nWhile Josephine Barbee passed away on February 1, 2025, her legacy is  carried on by her son, Mark Barbee, who shares his mother's commitment  to serving others, ensuring that her profound impact remains alive and  well in the lives of those she touched. We are fortunate that Mark  continues to carry the torch she lit…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688217/recognizing-josephine-barbee"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…that services were not interrupted for those who need it the  most.\n\nSister Mary Jesus' work reflects steady leadership, resilience in  times of crisis, and a clear commitment to serving others with dignity  and purpose.\n\nI wish Sister Mary Jesus a happy 100th birthday. The San Fernando  Valley is grateful for her dedication to helping our community.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Keith Self", "party": "Republican", "sentence": "Mr. SELF. Mr. Speaker, I rise today to recognize 22 of our Nation's  finest veterans.\n\nThese individuals are exceptional American heroes who demonstrated  selfless commitment to serving our Nation and their communities.\n\nThis is a moment to acknowledge those who have sacrificed much and  devoted all to safeguarding our country. This year, Texas' Third…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…efforts that have uplifted Cass City. Even in the  face of personal health challenges, undergoing both a liver and kidney  transplant, Jim has remained steadfast in his commitment to serving  others. The overwhelming support he received during his health battles  was a testament to the lives he has touched though his generosity and  kindness.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…first female Eagle  Scout in Nassau County, Florida.\n\nFrom Troop 9152 of Scouting America in Yulee, Miley has shown  outstanding dedication, creativity, and a genuine commitment to serving  others, qualities that earned her the rank of Eagle Scout. The  accomplishment, Mr. Speaker, as you know, is impressive for any Scout,  but for Miley's achievement,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698832/congratulating-miley-meredith"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Haverstraw, New York, as the Paul Piperato Post Office  Building. This designation is a meaningful appreciation for his hard  work, his leadership, and his lifelong commitment to serving others.\n\nBy renaming this post office, we ensure that future generations will  know the name of Paul Piperato, not only as a county clerk but as a  visionary public…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697700/paul-piperato-post-office-building"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…to recognize Phillip Barrier  for his 27 years of dedicated public service to Avery County, North  Carolina, as County Manager.\n\nPhillip's career reflects a lifetime commitment to serving his  community with integrity, professionalism, and an unwavering sense of  responsibility. He began his career as Avery County's Tax  Administrator, a role he held…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…was named among the nation's top 10 military-spouse friendly  schools nationwide. This honor places UND in the top 10 percent of  universities across the U.S. for its commitment to serving our  servicemembers, veterans, and their families.\n\nUND's leadership reflects a long tradition of service that dates back  to its founding. This gold recognition marks…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697044/recognizing-university-of-north-dakota-upon-earning-gold-award"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…commemorate their efforts and dedication. Through  the endless passion and dedication of Central Bucks County residents,  this organization demonstrates their unwavering commitment to serving  these communities.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694745/recognizing-bucks-county-americans-for-native-americans"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Those in Need, and the Change for Life Baby Bottle  Project, which supports families in crisis. And yet, these examples  capture only a fraction of Assumption BVM's deep commitment to serving  those in need.\n\nThe parish's Knights of Columbus chapter provides even more  opportunities for parishioners to engage in charitable outreach,  sponsoring events such…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Wichita for these  exceptional achievements. Furthermore, I ask that my colleagues join me  in thanking the dedicated healthcare workforce in Wichita for their  unwavering commitment to serving those who have worn the uniform.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690253/recognizing-the-robert-j-dole-va-medical-center-and-the-city-of-wichita"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…serves. I wish Noah the best for his  well-earned retirement.\n\nOn behalf of my colleagues and the entire House community, I thank  him for his leadership and longstanding commitment to serving the  People's House.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…innovation, improve outcomes, and  strengthen communities.\n\nI commend Pasco County Community Development and all partners  involved for their leadership, vision, and commitment to serving those  most in need. Their work exemplifies the purpose of community  development programs and demonstrates how thoughtful investment  can change lives. It is fitting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Three Police Honor Roll and in honor of National  Police Week 2025, I wish to recognize Deputy Jeff Bilodeau of the  Placer County Sheriff's Office for his unwavering commitment to serving  and protecting the Placer County community.\n\nDeputy Bilodeau serves as the Loomis traffic deputy and is known for  going above and beyond the normal call of duty to…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Veterans' community, his colleagues, and his family. A  true champion for Veterans, his legacy will live on in the work he did  and the countless lives he touched. Walt's commitment to serving his  fellow Veterans, his courage in the face of adversity, and his deep  love for his community will continue to inspire us all. His memory will  forever remind us…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…contributions of Mrs. Dudley Hoskins  Bostic and Mrs. Molly Hoskins Scarbrough. Their enduring legacy is a  testament to the power of family, tradition, and the unwavering  commitment to serving the needs of the community.\n\nAs Hoskins Drug Store enters its 95th year, we recognize and honor  the Hoskins family for their incredible contributions to the community…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}]