[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "The bill in front of us today by Representative Jackson is an  important step toward remedying this problem by calling for the  Commerce Department's Bureau of Industry and Security, BIS, to conduct  greater transparency around license application, information, and  conduct checks for problematic companies in arms-embargoed nations.", "title": "Maintaining American Superiority By Improving Export Control Transparency Act", "date": "2025-05-05"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "In response to political pressure from the very real healthcare  crisis before us, House Republicans have rushed this bill to the floor  without input from House Democrats and without going through the Energy  and Commerce Committee, as it should, or any actual legislative  process.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Whether it was driving a Member as a humble staff  assistant, enhancing the caucus communications, directing  communications on energy policy for a senior Member of Energy and  Commerce or helping a brand new freshman establish her office as chief  of staff, Rikki approached every task with the same commitment--to make  life better for the people we serve.", "title": "Recognizing the Career of Erica ``rikki'' Miller and Her Work on Behalf of Michigan's 3rd Congressional District", "date": "2025-11-12"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Under this bill, the  Assistant Secretary of Commerce for Communications and Information will  be required to engage in outreach and provide technical assistance to  small communications providers concerning the uses, benefits, and  challenges of Open RAN and other open network architectures.", "title": "Open Ran Outreach Act", "date": "2025-07-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "I just want to say that this budget directs the Committee on Energy  and Commerce to come up with at least $880 billion in cuts within their  jurisdiction.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Post Office has provided  essential services that connect Americans, support commerce, and  strengthen the foundations of our democracy.", "title": "250th Anniversary of the United States Postal Service", "date": "2025-12-03"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Last week, Trump's billionaire Commerce Secretary was speaking with  another billionaire about how only fraudsters would complain about  missing a Social Security check.", "title": "Millions Depend on Social Security", "date": "2025-03-27"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "The subject matter of Federal criminal law requires that the conduct  being proscribed be tethered to a particular Federal jurisdictional  nexus, like interference with Federal interstate commerce or assault on  a Federal officer in doing his or her duty, or seditious conspiracy  against the Union, which is why the vast majority of crimes are  prosecuted at the local level like assault, murder, armed robbery,  theft, and so on.", "title": "Count the Crimes to Cut Act", "date": "2025-12-01"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "The Energy and Commerce Committee Republicans included a pay-to-play  scheme to sell out the most vulnerable communities to the highest  bidder.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''", "date": "2025-05-21"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "That is why, last Congress, this bill  passed the Energy and Commerce Committee unanimously before passing it  here on the floor with overwhelming support.", "title": "Youth Poisoning Protection Act", "date": "2025-04-28"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Speaker, this is good news for people like Commerce Secretary  Howard Lutnick, who told viewers during a FOX News interview in March  that they could buy Tesla stock, that they should buy Tesla stock,  again, violating his position, abusing his position, going on national  television to promote a stock aligned with Donald Trump's interests.", "title": "Gross Violations of Law By Trump Administration", "date": "2025-05-07"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "This focus and interest are also what led me to choose to be a member  of the Energy and Water Development and Related Agencies Subcommittee  and the Commerce, Justice, Science, and Related Agencies Subcommittee.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-08"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "According to this nonpartisan Center on Budget and Policy Priorities,  a nonpartisan policy and research institute, this is what they write:\n\nThe House Republican budget would require deep cuts to       Medicaid, and recent statements from House Energy and       Commerce Committee Chair Brett Guthrie suggest the Affordable       Care Act's .", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "6938, Commerce, Justice, Science; Energy and Water  Development; and Interior and Environment Appropriations on rollcall  vote No.", "title": "Vote Explanation", "date": "2026-01-29"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "This legislation includes critical provisions from last Congress'  Supply Chains Act, which I co-led, including a provision to designate  the Assistant Secretary of Commerce to lead a governmentwide supply  chain resilience effort.", "title": "Promoting Resilient Supply Chains Act of 2025", "date": "2025-04-28"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "2444) to establish a critical supply chain resiliency and  crisis response program in the Department of Commerce, and to secure  American leadership in deploying emerging technologies, and for other  purposes.", "title": "Promoting Resilient Supply Chains Act of 2025", "date": "2025-04-28"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "(b) Definitions.--In this section:\n\n(1) Assistant secretary.--The term ``Assistant Secretary''       means the Assistant Secretary of Commerce for Communications       and Information, acting through the head of the Office of       Internet Connectivity and Growth.", "title": "Open Ran Outreach Act", "date": "2025-07-14"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "First, I thank Chairman Guthrie, Chairman Hudson, and the entire  Energy and Commerce Committee for advancing this bill, and Leader  Scalise for bringing it to the floor today.", "title": "Foreign Adversary Communications Transparency Act", "date": "2025-04-28"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Constitution gives this body,  the United States Congress, the ability to regulate interstate  commerce.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low Nox Regulation; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Speaker, I urge all of my colleagues to vote ``yes,'' and I thank  the chairman of the Committee on Energy and Commerce for leading this.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "During a Senate Commerce Committee hearing last  week, I presented evidence to Google's vice president for government  affairs and public policy that his company's AI models have  repeatedly--repeatedly--fabricated malicious stories about conservative  activist Robby Starbuck.", "title": "Government Funding", "date": "2025-11-05"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "The Energy and Commerce  Committee just finished up, and the House Ways and Means Committee  earlier.", "title": "Events This Week", "date": "2025-05-14"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "President, for the Committee on Commerce, Science, and  Transportation I report favorably the following nomination lists which  were printed in the Records on the dates indicated, and ask unanimous  consent, to save the expense of reprinting on the Executive Calendar  that these nominations lie at the Secretary's desk for the information  of Senators.", "title": "Executive Reports of Committee", "date": "2026-02-03"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "This fiscally responsible package includes the Commerce-Justice- Science bill, the Energy and Water Development appropriations, and the  Interior and Environment funding bill.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-15"}, {"senator": "John Carter", "party": "Republican", "sentence": "His contributions also extended to the Greater  Killeen and Harker Heights Chambers of Commerce and as a tri-county  soccer official.", "title": "Saluting the Service of Lieutenant Colonel Spencer Hutson Smith", "date": "2025-03-31"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "This is the exact message that the Committee on Energy and Commerce  has heard in hearings with grid operators, utilities, engineers, and  those charged with protecting the reliability of our grid.", "title": "State Planning for Reliability and Affordability Act", "date": "2025-12-10"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "In lieu of the amendment in the nature of a substitute       recommended by the Committee on Energy and Commerce now       printed in the bill, an amendment in the nature of a       substitute consisting of the text of Rules Committee Print       119-9 shall be considered as adopted.", "title": "Providing for Consideration of H.R. DC Criminal Reforms to Immediately Make Everyone Safe Act; Providing for Consideration of H.R. District of Columbia Policing Protection Act; Providing for Consideration of H.R. Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia; Providing for Consideration of H.R. District of Columbia Judicial Nominations Reform Act; Providing for Consideration of H.R. Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act; Providing for Consideration of H.R. National Coal Council Reestablishment Act; Providing for Consideration of H.R. Promoting Cross-Border Energy Infrastructure Act; and for Other Purposes", "date": null}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Speaker, I rise today to recognize and honor the  Greater Hernando County Chamber of Commerce on the occasion of its  100th anniversary--a remarkable milestone that reflects a century of  steadfast service, economic leadership, and community commitment.", "title": "Recognizing the Greater Hernando County Chamber of Commerce", "date": null}]