[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and I have spent my entire  career trying to help rebuild it in America. Mr. Speaker, I am so proud  to serve with Representative Mrvan because I know he shares that same  commitment. I thank him for coming down to the floor tonight.\n\nAfter Mr. Tonko's presentation, I will turn to Representative Val  Hoyle from Oregon's Fourth District. She is also a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…years. In 2009, he oversaw the  construction of a state-of-the-art, 110,000 square foot digital  broadcasting facility next to the station's previous home. His  unwavering commitment to his work has ensured that throughout his  tenure, the station has remained at the forefront of producing  groundbreaking news, brought into countless homes across the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…service with  our Nation's highest military honor, the Medal of Honor.\n\nFrom the first awardee to the most recent, Medal of Honor recipients  have demonstrated their unwavering commitment to serve above and beyond  the call of duty, even to their own death.\n\nThere have been 43 Kentuckians who were awarded the Medal of Honor. I  will just talk about one, Sergeant…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…announced as above recorded.\n\nA motion to reconsider was laid on the table.\n\nStated against:\n\nMr. GOLDMAN of New York. Mr. Speaker, I was unable to vote today due  to an urgent commitment in my district. Had I been present, I would  have voted NAY on Roll Call No. 70.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Singleton has dedicated decades of service to our  community. From serving in the U.S. Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned him the Meritorious Service Award five times.\n\nFor Mr. Singleton, public service didn't end after the uniform came  off, though. His second mission serving…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…human diversity in which people living with disabilities can take  pride.\n\nIn 1990, the Americans with Disabilities Act was signed into law.  This bipartisan effort made a commitment that our history of  segregating and isolating persons with disabilities would end. In the  law's own words, the purpose of the ADA is to ``provide a clear and  comprehensive…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694026/recognizing-the-22nd-annual-disability-pride-parade"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…its long tradition of philanthropy and  partnership.\n\nBeyond its financial and volunteer contributions, the Junior League  of Arlington's influence is seen in its enduring commitment to service  and empowerment. From its collaboration with Arlington ISD on the  annual Back to School Kick-off at AT&T Stadium, to its many ``Done in a  Day'' projects, JLA…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…consistency our Pacific partners expect from the United States.\n\nThe significance of this legislation extends well beyond economic  benefits. The treaty itself embodies a broader commitment, one rooted  in decades of cooperation, mutual respect and shared responsibility for  the stewardship of ocean resources. By fully implementing the amended  treaty, we not…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…1776, Delawareans laid the groundwork for the single  longest running tradition in our State's history: the Separation Day.  Separation Day serves as a reminder of the fierce commitment at the  heart of the greatest State in the Union. It marks the moment when  Delaware said: ``We can govern ourselves. We can shape our own  future.''\n\nThat commitment to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Program  and Special Event Award for the creation of the Kingpins drumline, an  educational program designed specifically for children with special  needs.\n\nThe Strikers' commitment to serving the Crystal Lake community  extends beyond the classroom. They actively support aspiring performers  through college scholarships, fundraisers, and by providing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…Award from the National Education Association; 2012 Martin  Luther King Jr. Achievement Award from Inter-Civic Council of the  Southern Christian Leadership Council; 1996 Commitment to Excellence  Award from Mid-Florida Chapter of NFBPA; 1992 Summit Award from the  Women's Source Center; and Life Time Achievement Award from the  Metropolitan Orlando…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Jennings was an outstanding associate of  SpartanNash, with  his retirement marking 25 years of incredible professionalism and  service to his coworkers and community. His commitment to excellence in  his role is to be commended, and it is my honor and privilege to  recognize Mr. Jennings here today.\n\nThrough considerable effort, innovation, and persistence,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689251/recognizing-the-retirement-of-robert-jennings"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Mexico continue to lead in  forest conservation, outdoor recreation, wildfire resilience, and  natural resource management. They deserve a Federal partner that  matches their commitment, and today, they are getting that.\n\nMr. Speaker, both New Mexico and I thank my colleagues on the other  side of the aisle who worked tirelessly to bring this legislation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…support for Israel.\n\nI hope my colleagues on both sides of the aisle will treat this day  not only with the solemnity and seriousness that it deserves but also  with a renewed commitment to make this cause bipartisan, the pursuit of  peace, support of Israel, an end to the humanitarian crisis, and a  lasting, stable solution for the Middle East.", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…here, and we just start with the  proposition that whatever it is we do, whatever tax policy we believe  is in the best interest of the American people, we start with the  commitment that however we implement that policy, it will do no harm to  the children in your community and mine, to the folks in nursing homes  in your community and mine. We will…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…rename a  post office in Rockford, Illinois, for Jay P. Larson.\n\nMr. Larson worked as a letter carrier for the U.S. Postal Service for  25 years. Serving with enthusiasm and commitment, known for his joy and  warmheartedness, Jay Larson was tragically killed in a mass stabbing  spree in March 2024 while delivering the mail.\n\nMr. Larson is survived by his…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697604/jay-p-larson-post-office-building"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…common defense.\n\nWe did that in the House bill, but what we did in the House bill that  the Senate fell far short in doing is to have a balanced budget  resolution, to have a commitment to enforceable spending reduction  targets that would bring the debt to GDP down and put our Nation on  good fiscal footing and a sustainable path.\n\nMr. Speaker, I urge my…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…has exemplified the Rotary  motto  of Service Above Self through countless projects supporting local  schools, awarding scholarships, and promoting youth leadership.\n\nTheir commitment to bettering our community is unwavering, and to  mark this milestone, the club has launched a project to construct new,  modern facilities at Shawmut Park.\n\nWith the growing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…KILEY of California. Mr. Speaker, I rise today to honor an  extraordinary American, a man whose life story reflects the very best  of our Nation's character, courage, and commitment to service. Richard  ``Dick'' Burbine represents a generation that answered history's call  with quiet resolve and uncommon bravery.\n\nDick Burbine was born on January 9,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…leadership in getting this bill to the  floor quickly. The Defense Department cannot afford another 1-year CR.\n\nMr. Chair, I also thank Chairman Calvert for his vision and  commitment, and I thank the subcommittee staff, on both sides of the  aisle, for their hard work in crafting this legislation in a very short  time.\n\nThe bill before us today makes…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…prevent--and, even more importantly, what it wasn't.\n\nBack in 1973, the goal was preventing another Vietnam. The idea was  to impose guardrails against the large-scale, indefinite commitment of  U.S. troops abroad. And in shutting that door, the law very  intentionally reaffirmed our Founders' decision to leave another door  open.\n\nThe law grants presidents clear…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…that Josh has all the qualities the very  finest judges exhibit: He is hard-working, courteous, and judicial in  temperament, very smart, and of sterling character, with a commitment  to fairness and the rule of law.\n\nAt his confirmation hearing before the Senate Judiciary Committee,  Josh testified that Mainers are famously independent and that he  suspects…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Hoover, a distinguished member  of the Warminster Township Board of Supervisors who celebrated her  final meeting as Secretary and Supervisor on December 4, 2025. Her six- year commitment to Warminster Township has been marked by leadership,  promise to strengthening local government, and an unwavering focus on  the residents of Warminster Township.\n\nThroughout…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…in congratulating Wyatt Dickinson. Wyatt is a member of Boy Scout Troop  776 and has exemplified extraordinary leadership, innovative problem- solving, and a demonstrated commitment to making a lasting, positive  impact, by earning the most prestigious rank in Scouting--the Eagle  Scout.\n\nEagle Scouts are recognized as trailblazers who are willing to…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…programs, and led the college to consistent recognition by U.S. News as  a top fifteen Midwest baccalaureate institution.\n\nPresident Collins' visionary leadership and unwavering commitment to  Catholic higher education has strengthened the Loras College mission  and impacted thousands of students. His dedication to academic  excellence, innovative partnerships,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…stopped breathing in Clackamas,  Oregon--are the situations for which EMS professionals train and  prepare. But we should also honor the everyday professionalism, skill,  and commitment to doing what is right for the patient that is at the  forefront of everything emergency medical responders do, both on duty  and off. By putting their own lives on the line…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…district. Dr. Sandfort has spent the  last 10 years teaching at Empire Oaks Elementary in Folsom, where she  has become known for her innovative, inclusive approach, and deep  commitment to student growth.\n\nIn her teaching style, Dr. Sandfort emphasizes collaboration,  relationships, and the transformative power of learning. Her tireless  devotion to her…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Service Ribbons, three Good Conduct Medals, and both  the Expert Pistol Medal and Expert Rifle Medal.\n\nFollowing his retirement in July of 2004, Mr. McInnis continued his  commitment to service through education. Using a degree earned while on  active duty, he taught in Wisconsin's prison system and later, as  Education Director, led the introduction…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…recognize and honor the  former President of the Republic of Colombia, Alvaro Uribe Velez, for  his extraordinary leadership, steadfast defense of democracy, and  unwavering commitment to the safety and prosperity of the Colombian  people.\n\nPresident Uribe assumed office in 2002 during one of the most  challenging periods in Colombia's modern history, a…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}]