[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…seek to work at certain places, like getting their car washed or  waiting for the bus.\n\nNothing about these men suggested that they were in the country  illegally or about to commit a crime at the time that they were  stopped.\n\nThey didn't even ask for ID before they were gun-faced and then  handcuffed and taken away. The bottom line is that these men…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…loud?\n\nThis is the moment when we need to stand up and exercise our powers  as part of the government that is closest to the people to make it  clear that no President can commit our military forces absent an attack  on our country or imminent threat of an invasion without the approval  of Congress and certainly not to help industry chase new profits…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…all forms of bigotry and  discrimination against any religious community and to stand up for all  of our communities against injustice.\n\nI think all of us should once again commit to never stay silent in  the face of religious intolerance against the Christian faith, against  the Jewish faith, against the Muslim faith, or other great faiths of  the world.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…constitutional crisis associated with  Articles of Impeachment, although a constitutional crisis can exist  without any crime having been committed.\n\nAn authoritarian does not have to commit a codified statutory offense  to be impeached. I raise this point because there are many people who  are of the opinion that there must be some statutory, criminal law that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…serve  in the Congress of the United States and the Commander in Chief. That  is a profound responsibility that each of us has to debate the question  of whether we should commit this country to war.\n\nSo this resolution is absolutely vital--vital--to the well-being of  this country and to the humility that is required of a country before  it makes the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…have  made the ultimate sacrifice in service to our communities.\n\nEvery day across our country and in my home State, law enforcement  officers wake up, put on the badge, and commit themselves to protecting  our neighbors. It is a calling that demands bravery, sacrifice, and  unwavering dedication.\n\nThis week, we remember those who answered the call and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Speaker, the Uniform Code of Military Justice is  clear. It requires servicemembers to obey lawful orders and to refuse  illegal orders.\n\nWe can't order a servicemember to commit a crime. It is that simple.  If someone is a servicemember, he can't follow an order that requires  him to commit a crime.\n\nRecently, my Democratic colleagues merely reminded…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697546/holding-war-criminals-accountable"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…extreme misconduct.\n\nViolent online groups have emerged on popular platforms geared toward  children and teenagers. These groups, and individuals acting alone,  encourage kids to commit horrifying acts, including cutting themselves,  creating child sex abuse material, sexually exploiting other children,  harming animals, swatting, doxing, and, in the most…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698878/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…of the President  when he pardoned so many of the individuals convicted after January 6.\n\nAt least 13 individuals who have been pardoned by President Trump  have gone on to commit additional crimes, including sexual assault  against a minor and a fatal DUI.\n\nInstead of promoting accountability and rehabilitation, when  possible, in our justice system,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698990/condemning-the-january-6-pardons"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…shaken.\n\nThis was how a teacher in our community was victimized, and it didn't  stop there.\n\nJuan Espinoza Martinez, also from my district, was accused of serious  conspiracy to commit crimes that never happened. ICE made them up and  publicly smeared his name. Those charges were dropped as well because  they were false. There was no apology, no discipline,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…been detained  by ICE are being here without documentation and traffic offenses.\n\nNow, the President has said that his administration wants to remove  and deport people who commit crimes after they illegally enter the  country, but the gentleman's legislation moves in exactly the opposite  direction. If this bill were passed into law, it would imprison…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…that children treated as adults, even when they are  innocent, are denied age-appropriate legal protections for the rest of  their lives.\n\nSociologists find that children who commit crimes are overwhelmingly  influenced by adults and their surroundings, not their own thinking.\n\nOf course, the people of D.C. did not vote for Trump or any  Republican for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…cease-fire, an end to Hamas's threat to Israel.\n\nToday, I stand in solidarity with Israel. I believe in Israel's right  to self-defense against this kind of terror. We should commit ourselves  to take advantage of this window of opportunity. I hope that the peace  plan that is on the table will provide a path, as it should, to  everyone who wants an end…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have to be convicted of a crime.  There doesn't have to be a codified criminal statute that has been  violated. None of that is necessary for impeachment. There is no need  to commit a crime.\n\nThe best example is my colleague who used to sit right over there on  this row at the end of this row. My colleague who sat there, who I was  here with for more than…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, I am beyond outraged that President Trump  would commit such a brazen act of war as he has done in Venezuela with  absolutely no notice, except to the oil companies and newspapers they  leaked it to. No consultation with Congress,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…years ago, the Governor  and I launched this big initiative called the Choose Respect  Initiative. We changed the laws. We made perpetrators really pay if  they were going to commit these heinous crimes in Alaska.\n\nWe got funding for lawyers and resources. We got different services,  and we had ads all over TV in Alaska about choosing respect--real  Alaska…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…fiscal sanity. Yet, Houston, we have a problem. We are  still $37 trillion in debt. This year alone, we will run a $1.7  trillion deficit. With this small step today, let's commit to the giant  leap.\n\nHere is my challenge to the White House: Let's do a rescissions  package every month because America has had enough--enough to wasteful  spending, enough…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693715/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…tough American Heritage squad where  they rallied from a 14-point deficit to win the State title.\n\nLeading the way was Senior Guard Jaida Civil, a University of  Tennessee commit and McDonald's All American, who grabbed 9 rebounds  and scored 20 points.\n\nThe entire team made critical contributions, showing their depth and  the unity of this team. The…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…that is the case, then why would they  oppose this bill? Even more, their claim that this bill is redundant  could not be further from the truth.\n\nAlthough some aliens who commit DUIs, such as those who kill or  injure innocent victims, may be found inadmissible or removable, but  the vast majority of the aliens with DUI convictions escape immigration…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…divided and controlled       by the chair and ranking minority member of the Committee on       Natural Resources or their respective designees; and (2) one       motion to commit.\n\nMr. LANGWORTHY. Mr. Speaker, for the purpose of debate only, I yield  the customary 30 minutes to the gentleman from Colorado (Mr. Neguse),  pending which I yield myself…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…expenses.\n\nRest assured, I will continue fighting to secure the additional  funding in the final FY26 Defense bill.\n\nBefore I withdraw this amendment, I ask Chairman Calvert to commit to  working with me on the continued LC-130 recapitalization project as you  have so graciously in the past.\n\nMadam Chair, I yield such time as he may consume to the gentleman…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…cohesive.\n\nMr. Speaker, 78 percent of Somali immigrants in Minnesota alone  receive welfare benefits, even after being in the United States for 10  years or longer. Somali men commit crimes at rates significantly higher  than Americans, and only about half of Somali immigrants can speak  English very well. Again, that is even after being in our country…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…toll. Instead of  being convinced to sue for peace on Putin's terms, Ukrainians remain  unwavering in their commitment to remain an independent and sovereign  nation. We must commit to share in their resolve. I say that again. We  must commit to share in their resolve and support the Ukrainian people  in their fight for freedom.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Treasury, as       the case may be, pursuant to Executive Order 13224 (50 U.S.C.       1701 note; relating to blocking property and prohibiting       transactions with persons who commit, threaten to commit, or       support terrorism).\n\nMr. GUEST.  1327.\n\nMr. Speaker, I rise in support of H.R. 1327, the Syria Terrorism  Threat Assessment Act.\n\nThis bill requires…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697015/syria-terrorism-threat-assessment-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…you. It imposes strong sanctions, strengthens reporting  requirements, and authorizes the denial or revocation of passports for  convicted traffickers who cross borders to commit these crimes. I would  say that is the least we could be doing.\n\nThe legislation rightly identifies those responsible, including  members of the Chinese Communist Party, who…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…efforts to combat       fraud in a strategic, risk-based manner. As depicted in       figure 2, the framework organizes the leading practices       within four components: (1) Commit, (2) Assess, (3) Design       and Implement, and (4) Evaluate and Adapt.\n\nIn June 2016, the Fraud Reduction and Data Analytics Act of       2015 (FRDAA) required the Office…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…President Biden's open-borders agenda, it is estimated  that at least 10 million illegal aliens entered our country, and on top  of the massive financial cost of the crimes they commit and the jobs  they take away from Americans, a huge chunk of them have been accessing  government benefits like Medicare, Medicaid, and Social Security.\n\nMr. Speaker, this…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Washington, D.C., should be a model  for justice across our great Nation.\n\nIn no way, shape, form, or fashion should we be charging adults as  minors and allowing them to return to commit similar or more violent  crimes. The citizens, tourists, businesspeople, and every other member  of this city deserve safety and security. I urge my colleagues to  support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Cantrell and Assistant  Coaches Daren Lam, John Jenkel, Emma Earhart, Morgan Landes, and  Aleisha Lambert.\n\nSpecial commendation goes to pitcher Lilah Deavers, a Division I  commit and first-team all-State, and to catcher Madalyn Wolfe, also  first-team, All-State, whose leadership anchored the team throughout  the season.\n\nMr. Speaker, I congratulate…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697358/congratulating-parry-mccluer-boys-cross-country-team"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…divided and controlled by the chair       and ranking minority member of the Committee on Financial       Services or their respective designees; and (2) one motion to       commit.\n\nSec. 2.  Upon adoption of this resolution it shall be in       order to consider in the House the joint resolution (S.J.       Res. 28) disapproving the rule submitted by…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]