[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…historic accomplishment for an African-American-owned agribusiness.\n\nPatriotically committed to public service, he became the first  African-American man to run for County Commissioner in Lee County,  Georgia. Although he won the district of Chokee, changes in the rules  requiring county-wide wins prevented him from taking his seat. No  stranger to adversity,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Breaking Down             (By Lisa Rein and Hannah Natanson, Mar. 25, 2025)\n\nA flood of cuts led by Elon Musk has sent the agency into       chaos as a new commissioner prepares to take charge.\n\nThe Social Security Administration website crashed four       times in 10 days this month because the servers were       overloaded, blocking millions…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…leave and launched an  investigation. He may have violated privacy and tax laws.\n\nHere is the stuff you can't make up. President Trump just promoted  him to be the Acting Commissioner of Social Security.\n\nDOGE, which I think stands for destruction of government by Elon, is  reportedly demanding plans to gut the Social Security Administration,  firing…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688267/dismantling-social-security"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Security benefits. However, now he has sent trickster  Elon Musk and his flimflam government agency, DOGE, after the Social  Security database.\n\nMichelle King was the deputy commissioner for operations at the  Social Security Administration for only 28 days before stepping down  because she refused to grant the fraudsters at DOGE access to the  Social Security…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689396/trump-administration-lies-about-social-security"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…firefighters across the country.            Sincerely,                                               Robert S. Tucker,                                                  FDNY Commissioner,      Fire Department, City of New York.                                   ____                                                 Consumer Reports,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Joan &  Sanford I. Weill Medical College of Cornell University and reflects a  deep commitment to public service and health equity. From his early  days as New Jersey's Commissioner of Health to his leadership of NYC  Health+Hospitals and Tampa General Hospital, and later as a professor  and director at The George Washington University, Dr. Siegel has…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696206/recognizing-dr-bruce-siegel"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…recognize and thank the commission chair, Jackie Cushman, who  was essential to this whole process and really was a driving force in  bringing all of us together, as well as Commissioner Major General  Peter Cooke, and Commissioner Richard Houghton for their dedication to  this effort. In addition, I thank my fellow Members of Congress on the  commission,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. LARSEN of Washington. Mr. Speaker, I rise today to recognize and  celebrate Lisa Janicki's service as a County Commissioner for Skagit  County, Washington.\n\nCommissioner Janicki was first elected to the Skagit County Board of  County Commissioners in November 2014, following a career of more…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…first.\n\nLyman Parks, Grand Rapids Mayor: After moving to Grand Rapids to  serve as a pastor of the First Community AME Church in 1968, he was  elected as the first Black commissioner in the city's history.\n\nLyman Parks holds a special place in our history as the first and  only Black mayor of Grand Rapids. His leadership throughout the 1970s  marked…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…markets from the stranglehold of entrenched monopolies and stop  anticompetitive mergers.\n\nBut I cannot support the confirmation of any additional members to  the FTC until Commissioner Slaughter and Commissioner Bedoya are  reinstated. President Trump's dismissal of Commissioners Slaughter and  Bedoya is not only illegal; it hurts consumers and small businesses…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of William  ``Bill'' Cass, Commissioner of the New Hampshire Department of  Transportation (NHDOT), and his retirement after 40 years of service to  our state. As Commissioner of NHDOT, Bill has fostered a supportive…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…brave NCPD officers who have given all in the  line of duty. They will not be forgotten.\n\nAs we look ahead to the next 100 years of the NCPD, I will continue  to work with Commissioner Ryder and our local partners to ensure that  officers have the resources they need and the training they need to  keep Long Islanders safe.\n\nI am proud to stand alongside…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690168/congratulating-nassau-county-police-departments-100-year-anniversary"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…such       assessed and undisputed Federal tax liability (via an       installment agreement, an offer in compromise, or otherwise)       which has been approved by the Commissioner of Internal       Revenue; or\n\n(iii) has applied in good faith to enter into an agreement       to resolve any such assessed and undisputed Federal tax       liability,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…has served as  chairman of the Advisory Board of Directors of Norwalk ACTS, which is a  partnership of civic leaders. He has acted as the president of the  Norwalk NAACP, commissioner of the Judicial Selection Commission, and  when he sees a problem, he uses ministry to solve it.\n\nJust this summer, out of nowhere, he conjured up a summer camp for  150…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693739/welcoming-reverend-dr-lindsay-curtis"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…hungry, young people and seniors, the  homeless, and those in need of mental health services.\n\nPastor Norman serves the city of Yonkers as director of Veteran  Services, commissioner for the city's Human Rights Commission, as a  member of the Yonkers Auxiliary Police, and as a police chaplain for  the Yonkers Police Department.\n\nHe has served with distinction…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696971/recognizing-reverend-william-e-norman-sr"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…CHANGES TO SOCIAL SECURITY TERMINOLOGY.\n\nNot later than the later of the date that is 12 months       after the date of enactment of this Act or January 1, 2027,       the Commissioner of Social Security shall ensure that, in any       rules, regulation, guidance, or other materials of the Social       Security Administration, whether online or in print--…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…temporary COVID extension. The problem is, the price continues to go up  so rapidly that now no one can afford the plan anymore.\n\nIn my State in Oklahoma, we asked our insurance commissioner to take  a 6-year snapshot and tell us what is happening to the Marketplace, the  ObamaCare Marketplace, without the subsidies. If the subsidies went  away, what was the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I rise to address an issue very near and dear  to my heart--industrial hemp.\n\nAs Kentucky's Commissioner of Agriculture, I led the charge to make  Kentucky the very first State to legally grow hemp. Fast forward to  today, hemp is a major crop for our Kentucky farmers, and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698983/industrial-hemp-in-kentucky"}, {"senator": "John Thune", "party": "Republican", "sentence": "…applied for the program and  received a $212 million grant. And that is for 2026 alone. When the  State announced its application, the Office of New York State Mental  Health Commissioner, Dr. Ann Sullivan, stated:\n\nExpanding access to services in underserved communities is       an important part of our effort to strengthen mental health       care statewide.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…paragraph (2)(B)'' and inserting ``the assessments       required under paragraph (1)(A)''.\n\n(b) Guidance.--The Secretary of Health and Human Services,       acting through the Commissioner of Food and Drugs, shall--\n\n(1) not later than 12 months after the date of enactment of       this Act, issue draft guidance on the implementation of the       amendments…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to       implement this section. In developing the regulations, the       Commission may consult with the Administrator of the       Environmental Protection Agency, the Commissioner of Food and       Drugs, the Consumer Product Safety Commission, or any other       agency as appropriate.\n\n(4) Authority preserved.--Nothing in this section may be…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…mentioned, I was privileged to introduce. It is a bicameral, bipartisan  $2.50 for America's 250th Act in partnership with Congresswoman and  fellow U.S. Semiquincentennial Commissioner Bonnie Watson Coleman, as  well as Commissioners Congresswoman Maria Salazar and Congressman  Dwight Evans.\n\nI thank the chair and ranking member of the Financial Services…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…tirelessly to support various local  libraries, including her beloved Coleville Library.\n\nIn addition to her work on the Mono County Board of Education, Kathy  also serves as a commissioner of the Antelope Valley Fire District. As  commissioner, Kathy has personified the district's core values of  professionalism, courtesy, and efficiency. She worked to provide…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Then, you  could go further.\n\nBy the way, the American people get this. They understand that there  are examples of voter fraud. I come from a State where our elections  commissioner went to jail--yes, went to Federal prison--for stealing  elections. We cleaned up our election system in our State. We have seen  an increase in voter participation.\n\nWhy?…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…impeding, and interfering with a Federal officer;\n\nWhereas clause 1 of rule XXIII of the Rules of the House of  Representatives provides, ``A Member, Delegate, Resident Commissioner,  officer, or employee of the House shall behave at all times in a manner  that shall reflect creditably on the House.'';\n\nWhereas such actions of a Member of the House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694802/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…service to his  country did not stop when he returned from World War II. Sam has been  incredibly active in Franklin County, serving as a judge of elections,  Franklin County commissioner, Chambersburg Council president, and mayor  of Chambersburg.\n\nSam Worley's commitment has never slowed down. Sam is still a vibrant  member of our community, bringing so…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "French Hill", "party": "Republican", "sentence": "…smart about it. There is nothing hidden about it. It is fully present.  Consumers opt in to it, and the competition is intense to retain those  customers.\n\nMr. Rose was the Commissioner of Agriculture in  Tennessee before coming to Congress. He is a very active member of both  the House Financial Services Committee and the Agriculture Committee.  He has…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…contracts, and  strengthened the voice of public employees. At the turn of the 21st  century, he continued his service working as a Federal Mediator and  Conciliation Services Commissioner. He helped labor and management find  common ground through respect, communication, and collaboration. His  mediation and training efforts supported fair labor relations,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696858/recognizing-donald-maki-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…politics,  regardless of blue or red, can count on the support it needs to prevent  and respond to acts of terrorism.\n\nLastly, I thank Ranking Member Thompson, Resident Commissioner  Hernandez, and former Congressman and Chairman Mark Green for  cosponsoring this bill. I also extend my gratitude to the Major Cities  Chiefs Association and the International…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, as a former county commissioner, I rise in  strong support of the Secure Rural Schools Reauthorization Act of 2025.\n\nSince the National Forest System was created, nearly 200 million  acres of rural America…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}]