[{"senator": "Al Green", "party": "Democrat", "sentence": "…are going to go up for a good  many people who can't afford them. We are trying to change that, or I  am. I support this.\n\nIt goes on to say: forcing hospitals and community health centers  across the Nation to close. That is no joke. People are starting to see  it. They are starting to express their consternation. They are starting  to let the people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…cancer, Alzheimer's, ALS, heart  disease, diabetes, kidneys, mental health, maternal mortality,  infectious diseases, genetic diseases, and the list goes on and on.\n\nCommunity health centers would receive only partial funding to  provide healthcare services for low-income patients.\n\nFor Head Start, if funding lapses, thousands of low-income children  would…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…shrink the funds available to these  departments and make it impossible for them to keep operating.\n\nThe impact will also be felt in rural areas where hospitals and  community health centers will close because they rely heavily on  Medicaid reimbursements.\n\nWe all know we have sick care in our country, and Medicaid is the  only Band-aid right now to keep…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694018/budget-betrayal"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…as a nurse consultant for the Health Care  Finance Administration.\n\nFor the past thirty years, Tess has led Bi-State Primary Case  Association, which advocates for Community Health Centers in New  Hampshire and Vermont. Community Health Centers play a crucial role in  delivering primary care, especially in areas where medical services are  limited or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…helped  people. It included provisions to lower prescription drug prices, crack  down on junk fees, lower gas prices, ensure our water is safe to drink,  and fund community health centers and teaching health centers. Instead,  Speaker Johnson chose to cave to Elon Musk.\n\nThough it may be delayed, I am pleased to be supporting the passage  today of the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Medicaid. You have heard them talk  about Social Security. You have heard them talk about how their  constituents are living in constant fear.\n\nI will talk to you about community health centers, which also are  incorporated in the Medicaid funding that my colleagues, the  Republicans, want to slash. I will start by saying to you  unapologetically and very…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…1971, began by working in  conjunction with other Health Resources and Services Administration  programs to develop health professionals to staff brick-and-mortar  community health centers across the country. Today, AHECs offer hands- on and  innovative health career curriculums for pre-college level students and  are committed to continuing education,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…hundreds in each  county will lose their jobs.\n\nUp to 14 million Americans are in danger of losing their health  insurance. This bill will shut down rural hospitals, community health  centers, urgent care clinics, and more. But while hospital beds are  closing, Republicans are prioritizing a repeal on tanning bed taxes.\n\nAnd, of course, at the last minute,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…of your fellow Medicaid beneficiaries.\n\nNow before you say, wait a minute, Medicaid is for poor people, and I  am not poor. Here is the thing: If you cut Medicaid, community health  centers shut down, which means that instead of preventative care, folks  go to emergency rooms. If you ever need urgent medical attention, and  there is an ER bed available,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691175/medicaid-benefits-all-of-us"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…increase in the last 6 years. Without the subsidies,  consumers with ACA coverage will see premium increases in the range of  75 percent.\n\nI have visited with hospitals, community health centers, physicians,  and many more who have raised their deep concerns about the impending  cuts in Medicaid.\n\nThe budget bill Republicans passed in July is also threatening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…passes. If it is snowing, there is really nowhere to go  except by Life Flight, and that is not hyperbole. I have sat with the  heads of school-based health clinics and community health centers, with  heads of hospitals, with nursing homes--and, by the way, we have been  referring to rural hospitals, but there are urban hospitals and  suburban hospitals that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…expansion, established on a  bipartisan basis, would end with any decrease in Federal funds, leaving  68,000 Granite Staters uninsured and devastating our hospitals and  community health centers.\n\nI have heard from literally thousands of Granite Staters on this  issue, including a woman who contacted my office and shared her fears  that cuts to Medicaid would…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689237/cuts-to-medicaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Americans.\n\nToday, we are finally considering priorities Democrats fought for,  including authorization of policies and increased funding for important  programs. Community health centers, hospitals that care for underserved  communities, and teaching health centers will all benefit from these  Democratic initiatives in the bill.\n\nThe healthcare package…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699331/consolidated-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…out of the  healthcare system, you are not just taking away health insurance  coverage from millions of Americans, you are also taking revenue away  from hospitals, community health centers, and doctors' practices. The  only way that those healthcare providers can stay in business is to  raise prices on everybody else, and that is exactly what is happening.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…accommodate the       specific needs of the State's patients, providers, and       communities.\n\nThese State-based programs are vital to the patients served       by community health centers, patient-to-direct primary care       providers that serve rural and underserved communities       nationwide.\n\nAs the House and Senate work toward a budget reconciliation…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…communities across the country.\n\nThat is why I reintroduced the bipartisan Helping Ensure Access to  Local TeleHealth Act, or the HEALTH Act, which cuts red tape and allows  community health centers and rural health clinics to provide telehealth  services to their patients. Telehealth makes life simpler for rural and  underserved communities, especially for our…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696840/national-rural-health-day"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…Hampshire who may have some comments  about this too.\n\nMr. MULLIN. I yield to the chairman from Louisiana, Mr. Cassidy.\n\nMr. MULLIN. I, too, want to say I support community health centers.  As I said, they are very important in rural communities, very important  in my hometown of Westville. In fact, it is the only healthcare that is  available. I don't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…750,000 patients nationwide.\n\nAdditionally, Jeffrey acts as the founding co-chair of Hep B United,  a national coalition to unify and enhance local coalitions and  community health centers dedicated to eliminating Hepatitis B virus  infections and its complications. Hep B United was founded in 2013 as a  partnership between the Hepatitis B Foundation…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize Community First  Health Centers, a truly remarkable organization that has spent the last  50 years delivering accessible, high-quality, patient-centered health  care, driven by a team of respectful…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694747/recognizing-community-first-health-centers-on-50-years-of-service-to-the-ninth-congressional-district"}]