[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…earn a master's of law in taxation from George  Washington School of Law.\n\nGerry was a man who wore many hats, from Air Force colonel to lawyer,  but it was his role as a community leader where he truly found his  calling. He may have been known as Mr. Pothole, but his impact on the  community was anything but shallow.\n\nGerry was known for his sharp legal…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…compassion,  resilience, and a deep commitment to educational equity.\n\nWomen in Action Volunteer Award--Fatima Smith: Fatima M. Smith is a  powerful advocate, volunteer, and community leader whose work spans  anti-violence initiatives, racial justice, and philanthropy. With over  15 years of experience, she has championed child advocacy, led major  legislative…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in strong support of H.R. 1461.\n\nBettie Cole was a longstanding community leader in her home State of  Pennsylvania.\n\nBorn in Edgeworth on April 5, 1923, she studied journalism and  communications. Later in 2000, she became known as the historian of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697613/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…I'm  proud to support the work of Mel and so many others who serve our  community. It is an honor to recognize his accomplishments and service  thus far.\n\nMel is a great community leader, author, and musician. His  preservation efforts remind us that, as a community, we benefit from  learning about and celebrating the Indigenous population that has lived…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699866/recognizing-mel-vernon-as-november-2025-constituent-of-the-month"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…angry and so are Vermonters. We are furious because of what happened  yesterday to a Vermonter, a U.S. citizen, as he attempted to return  home.\n\nWilmer Chavarria is a community leader. He is a school superintendent  in my State. He was held and interrogated for hours yesterday in the  Houston airport by CBP agents and given no reason for his detainment.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694000/cbp-turns-houston-airport-into-trap"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize and salute the  exceptional life of M. Christina Selin, known as Chris to all of her  friends, a resident of New Rochelle, and a tremendous community leader.\n\nChris is, by profession, a lawyer with a practice in business and  commercial law. She is an active member of the New Rochelle Bar  Association as part of that commitment…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699164/saluting-a-neighbor-and-friend-m-christina-selin"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to pay tribute to a distinguished community leader from  Rochester, New York, Padron-Morales.\n\nAs co-founder of Hipocampo Children's Bookstore, Henry Padron-Morales  has created a space that celebrates culture, diversity,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to recognize an outstanding business and community  leader from Rochester, New York, Orlando Ortiz.\n\nServing as President, Orlando Ortiz has played a pivotal role in  shaping and leading the Puerto Rican Festival for over 15…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…advance of her fourth anniversary  banquet as Senior Pastor at the Saint James Christian Church on  December 7, 2025. Rev. Dr. Owens-Barber is a dedicated pastor, scholar,  community leader, and advocate for spiritual and social transformation.  Over the past decade, she has played a key role in the nationwide  campaign to advance a powerful moral agenda…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…colleague,  Congresswoman Zoe Lofgren--and I know Congressman Ro Khanna also would  like to be represented--to recognize the life and contributions of U.S.  Army veteran and community leader Alcario ``Al'' Castellano for his  dedication to advancing education, arts, and leadership in San Jose and  the greater Silicon Valley of California. He is not simply…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "Mr. KEATING. Mr. Speaker, I rise today in honor of Kathy Quigley as  she retires from the South Shore YMCA. Kathy is a true community  leader, who has tirelessly advocated for disadvantaged communities in  Quincy and the South Shore throughout her remarkable 30-year career.  Whether during her time with the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…creates division. As we reflect on what it means to  stand up to authoritarianism by defending our neighbors, our  neighborhoods, and our culture, I recognize a longtime community leader  and a public servant, Billy Ocasio.\n\nBilly was born and raised in Humboldt Park in Illinois' Third  Congressional District. Billy's leadership over several decades has…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Illinois' Third Congressional District.\n\n(English translation of the statement made in Spanish by Mrs. Ramirez  is as follows:)\n\nIn honor of Women's Month, I congratulate community leader and  activist Angelica Garcia Santos, my West Chicago constituent.\n\nAngelica began volunteering at IL03's non-profit immigrant advocacy  organization, Casa Michoacan,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…yielding and  the gentleman from Texas (Mr. Gill) for his support.\n\nMr. Speaker, I rise today to ask this Chamber to honor and  memorialize a beloved western Pennsylvania community leader, local  historian, and author by voting ``yes'' on H.R. 1461.\n\nMrs. Mary Elizabeth Cole, fondly called Bettie by those who knew her  and loved her, was born in Edgeworth,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Caribbean American  Heritage Month to pay tribute to a distinguished community leader from  Rochester, New York: Jerome H. Underwood.\n\nAs Chief Executive Officer of Action for a Better Community and a  founding member of the Greater Rochester Black Agenda…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692565/recognizing-jerome-h-underwood"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…local community, best shown through their charitable  donations and workforce development investments.\n\nFor 90 eventful years, Goodhart Sons Inc. has been a business and  community leader in Pennsylvania's 11th District. I am grateful for the  Goodhart family for their positive impact and wish them many more years  of success.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695929/congratulating-goodhart-sons-inc-on-their-90th-anniversary"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Month, may each of us take a  moment to prioritize wellness and reach out to those around us who  might need a helping hand.\n\nI thank each friend, family member, teacher, community leader, or  public servant who has lent their support to someone experiencing  mental health challenges for their service. It is because of people  like them that communities…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…governing board after an incredible 27  years.\n\nSince even before being elected, I have been lucky to have Jane as a  resource, and I have come to deeply respect her role as a community  leader, a tireless advocate for our veterans, and a devoted volunteer.\n\nA fighter and leader by example, Jane's work on behalf of our  veterans is well known across Arizona,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize a community  leader and my good friend, Brian Mathiowetz, who received the 2024  Lifetime Achievement Award from the Associated General Contractors last  Tuesday.\n\nBrian joined the family…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688312/recognizing-brian-mathiowetz"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…to recognize the  life and legacy of Stanley R. Lawson, Sr., a veteran and trailblazer in  Pennsylvania.\n\nBorn and raised in Harrisburg, Stan was a loving father, son,  community leader, and public servant whose life's work was defined by  service to others. He was a proud combat veteran of the United States  Navy, serving in Vietnam from 1960 to 1964.…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Brenda Council has been described as a pure force, a trailblazer, a  fighter, and a leader who has paved the way for so many in Omaha. As a  prominent politician and community leader from North Omaha, she has  established a historic career marked by several firsts for African- American women in Nebraska.\n\nShe was the first African-American woman to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Lloyd Peck\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to recognize the  remarkable life and distinguished legacy of Lloyd Peck, a proud  veteran, a beloved community leader, and a true American patriot who  passed away on March 17.\n\nLloyd Peck served as a first lieutenant in the United States Marine  Corps during the Korean war. In civilian…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…journalism also include multiple books on  Pennsylvania history. Additionally, Arnie and his wife, Linda, are  partners in the McClure Mills Farms.\n\nArnie's wife, Linda, is a community leader in her own right.  Currently, she serves as the president of the Mount Union District  School Board. Together, Arnie and Linda are a powerhouse couple in  Huntingdon County,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…support he received during his health battles  was a testament to the lives he has touched though his generosity and  kindness.\n\nMr. Speaker, James Baker is more than a community leader--he is a  pillar of Cass City, embodying the very best of selfless service,  mentorship, and resilience. It is my great privilege to recognize him  as the Cass City Citizen…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}]