[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Spelling Bee, co-founding the  Santa Barbara Martin Luther King, Jr. Committee, and serving on the  board of the Family Service Agency. She remains a dedicated community  leader through her work with Democratic Women of Santa Barbara County  where she is Treasurer and Tri-Chair of Membership & Community  Engagement, and she represents District 2 as a…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…to honor the memory of Phyllis B.  Fulton, who sadly passed away last week.\n\nA native of Elizabeth City, North Carolina, Phyllis dedicated her  life to serving her community through her work as a social worker.  After graduating from North Carolina Agricultural & Technical State  University in 1969, she began her career with the Wayne County  Department…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…he is an active philanthropist and a homegrown product  of our community. A fellow California State University, Fullerton,  alumni, he shows his dedication to our community through his work with  the Anaheim Family YMCA and Anaheim Police Association.\n\nI call on my colleagues to join me in recognizing Mr. Patel for the  positive change he has helped…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688533/recognizing-mr-bharat-patel-for-his-contributions-to-our-orange-county-community"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…old--taken from us far too soon.\n\nSix individual lives, connected to their coworkers through service,  connected to their families through love, connected to our community  through their work to make our infrastructure stronger--1 year later,  we remember their loss. They are greatly missed. One year later, their  families and communities are still grieving.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…own nightmare in the loss of her son,  Fitz, Bishop Thomas went on to inspire countless others, serving as an  active role model and advocate for her son's friends and community.\n\nHer work continues to uplift those around her, and I congratulate  Bishop Michelle C. Thomas on officially being consecrated to the office  of bishop.            Honoring the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…to do right by my community. As I said earlier, I  am proud to have ensured that $49 million in new infrastructure  authorities were included to be funded in our community. However, this  work cannot get done if we do not appropriate the money to get the  shovels in the ground.\n\nFor this reason and many others, I urge my colleagues to oppose this  bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…pursuit of happiness. Life is number one.\n\nWhen the Federal, State, and local governments work together with the  private sector, our research hospitals, the nonprofit community, when  we work together to identify the reasons for the disparities and put  policies in place that address them, people's lives are saved. When we  strip those policies away, when…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…compassion that he demonstrates has served to  benefit not only his congregation but also society as a whole as his  congregation is made up of dedicated members of our community who work  to spread the Lord's message of good deeds.\n\nThroughout his 50 years of Christian ministry, Reverend Dr. Walker  has displayed a solemn commitment to the Lord which…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688261/recognizing-reverend-dr-curtis-theodore-walker-sr"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…making it a very challenging time for the State of  Washington.\n\nSo we certainly appreciate all the first responders, all the law  enforcement that are working in the community, all the work that the  Governor's office is doing, all the work that we are--a partnership we  are now getting from FEMA, the Army Corps of Engineers, and Homeland  Security to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…her legacy lives on in the hearts  of all who were fortunate enough to know her.\n\nAs we reflect on Krista's life, we recognize the profound impact she  had on her community. From her work with colleagues to her commitment  to helping animals and the countless friendships she fostered, Krista's  influence will continue to resonate. Her leadership, compassion,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cutting-edge approaches to disaster management, have left  an indelible mark on Pasco County.\n\nIt is clear Danielle Bierman has made a profoundly positive impact on  our community with his work as part of the Pasco County Human Services  Team, and I am grateful for her service. May we all strive to serve our  communities with the same dedication and humility.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cutting-edge  approaches to disaster management, have left an indelible mark on Pasco  County.\n\nIt is clear Rebecca Seils has made a profoundly positive impact on  our community through her work as part of the Pasco County Human  Services Team, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…nondisclosure agreements  were noncompliant with the law. Twenty-six IGs said their parent Agency  updated or was in the process of updating these deficient agreements.  The IG community has much work to do, and this Senator won't stop  protecting whistleblowers.\n\nWhistleblower disclosures proved that anti-Trump FBI agent Tim  Thibault was involved in the genesis…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Merlyn Lewis has made to our community through her  work as an exceptional volunteer for Service Dog Alliance, an all- volunteer non-profit, which promotes and supports the rights and  responsibilities of service dog teams,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691758/recognizing-merlyn-lewis"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cutting-edge approaches to disaster management, have  left an indelible mark on Pasco County.\n\nIt is clear Maria Wilkinson has made a profoundly positive impact on  our community through her work as part of the Pasco County Human  Services Team, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Marlene Law has made to our community through  her work over three decades to promote opportunities for youth with the  UF/IFAS Extension Citrus County 4-H program. Her tireless efforts have  been mostly behind the scenes.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Carol Smith has made to our community through her  work with New Beginnings Youth Shelter, which serves homeless kids aged  10-17 who are between foster homes, abandoned, or homeless. The whole  team jumps in to take…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690147/recognizing-carol-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Steven Walker has made to the community through his  work at CREST in Lecanto. Steven created a food drive as a class  project to help local Veterans. This food drive was used to educate the  students about the struggling…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691946/recognizing-steven-walker"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Pricilla Cruz-Seado has made to our community  through her work with New Beginnings Youth Shelter, which serves  homeless kids aged 10 to 17 who are between foster homes, abandoned, or  homeless. The whole team jumps in to take…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691746/recognizing-pricilla-cruz-seado"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Barbara Sprague has made to our community  through her work with the Community Food Bank, leading the charge in  our fight against food insecurity. Since Barbara joined the  organization, her leadership, tenacity, and compassion…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…legacy rooted in hard work  and dedication to the family business. Ms. Woody joined the Kern County  Cattlewomen in 1969 and became deeply involved in the organization's  community work. She organized the fair booth, served on the Cattle  Princess Selection Committee, and brought humor to the High Fever  Follies fundraiser by wearing the group's famous…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cutting-edge  approaches to disaster management, have left an indelible mark on Pasco  County.\n\nIt is clear Fernando Serrano has made a profoundly positive impact on  our community this his work as part of the Pasco County Human Services  Team, and I am grateful for his service. May we all strive to serve our  communities with the same dedication and humility.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…a county in Colorado that  stands for commonsense immigration policies and a community that works  with our law enforcement to give them every tool to protect our  community.\n\nWe must work with our Federal, State, and local law enforcement  professionals and give them every resource to protect our communities  and our country. I am proud to cosponsor…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cutting-edge approaches to disaster management, have  left an indelible mark on Pasco County.\n\nIt is clear Kyle Smith has made a profoundly positive impact on our  community with his work as part of the Pasco County Human Services  Team, and I am grateful for his service. May we all strive to serve our  communities with the same dedication and humility.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}]