[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Spielberg, Vice President Karen  Brew, along with Elaine Weir, Madelaine Eppenstein, and a large cadre  of talented neighbors in key roles, provide a strong base of abilities  all committed to the benefit of Scarsdale.\n\nFrom the floor of the House of Representatives, we salute the men and  women of the Scarsdale Forum who have made the level of voluntary,  active…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…remarkable work of Sewa International, both in Virginia and around the  world.\n\nFounded less than 25 years ago, Sewa International is a global  humanitarian organization committed to serving those in need.\n\nTheir mission focuses on several things, including disaster relief,  rehabilitation, family services, women's empowerment, health, and  education.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…that. Then, as the First Amendment provides, they  peacefully protested against it.\n\nUnfortunately, there were some hooligans and rowdies who infiltrated  that group, and they committed violent acts and vandalism. For that,  they should be prosecuted. They should be brought to justice and  condemned, which we do.\n\nHowever, the resolution really creates a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693144/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…It has been done. I saw it myself. Where do we  stand?\n\nWhere do we stand when, after the President has sent the National  Guard into various places, more turmoil has been committed as a result  of the Guard being there than was being committed before they arrived?  The President is the person who is creating the turmoil so that he can  then say: I am…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…individuals are responsible for war crimes and unlawful  killings even when acting under superior orders. That principle must  apply here as well. A future Administration committed to the rule of  law will have a responsibility to investigate these actions fully and  hold accountable those responsible for unlawful killings carried out in  the name of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…to millions of students  with disabilities. But far too many students with disabilities are  still waiting for their shot at a meaningful education.\n\nThe Federal Government committed to funding 40 percent of the cost to  school districts of implementing the IDEA, but Congress has never fully  funded special education. Right now, the Federal Government…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…why it's so  important that we raise awareness of the importance of plasma-derived  therapies this week, and work to improve access to these unique  biologic products.\n\nI'm committed to working to ensure that every individual, regardless  of how rare their disease may be, has access to the therapies they need  to lead healthier, fuller lives.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696010/recognizing-international-plasma-awareness-week-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…our democracy depends on it.                         Recognizing Frank Coverdale\n\nMs. McBRIDE. Mr. Speaker, I rise today to recognize one of Kent and  Sussex Counties' most committed neighbors, Frank ``Fresh'' Coverdale.\n\nFresh has been described as the ultimate ambassador for the Food Bank  of Delaware, where he spent 22 years delivering food to working…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…undocumented.\n\nMost migrants, of course, are coming due to poverty, insecurity,  violence in their home country, and authoritarianism at home. In fact,  the two most common crimes committed by people who have been detained  by ICE are being here without documentation and traffic offenses.\n\nNow, the President has said that his administration wants to remove…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…from calling for the lynching of people,  aside from having some anti-Semitic commentary on various pieces of  paraphernalia, they had gallows. Aside from these things, they  committed other demeaning and vile acts, such as defecating in various  public places within the Congress, within the buildings.\n\nThese were some very vile and mean-spirited people…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…funding for marine debris  removal efforts through 2029. It keeps programs running, supports long- term planning, and gives communities confidence that Federal partners  are committed to protecting our waters and natural resources.\n\nMr. Speaker, I am proud to support my colleagues who have worked on  this important bipartisan legislation both here in the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…pardoning all January 6 rioters, including the  man who was convicted and imprisoned after targeting me. Since their  release, at least 23 individuals have re-offended and committed crimes  that include plotting the murder of FBI agents, violent assault,  strangulation, possession of child sexual abuse material, and reckless  DUI homicide.\n\nDespite the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…themselves unfit. They have ordered dozens of illegal strikes on  alleged drug boats in the Caribbean without congressional approval.  This week, we have learned they likely committed war crimes by ordering  a second strike targeting and killing survivors.\n\nAt the same time, President Trump is pardoning criminals like Juan  Orlando Hernandez, the former…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697535/venezuela-boat-strikes"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and public speaker for workers' rights movements,  including co-founding the A. Philip Randolph Institute, an organization  for Black trade union members. Rustin remained committed to promoting  social good, and advocating for the disenfranchised, until his death.\n\nI urge my colleagues to support this bill.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…FBI Director  and President shared misinformation. The Vice President suggested that  the politics of one of the victims was the real tragedy. The Republican  Party remained committed to defending the rights of people who think it  is fun to play with things that go bang, bang.\n\nGun violence is still the number one cause of death among actual  American…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698407/gun-violence-tragedies"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…deceptive acts or       practices, including relating to tokens;\n\n(5) the Commission has previously taken action against       unscrupulous companies and individuals that committed unfair       or deceptive acts or practices involving tokens; and\n\n(6) to bolster the Commission's ability to enforce against       unfair or deceptive acts or practices…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…nationally in  overall hospital care quality and holds the eighth shortest wait time  for existing patients seeking primary care. These distinctions reflect  a city deeply committed to ensuring those in need receive the high- quality healthcare necessary.\n\nAs a country, we owe a great debt to those who served, and the Dole  VA and the city of Wichita…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690253/recognizing-the-robert-j-dole-va-medical-center-and-the-city-of-wichita"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…public retail water  agency, and seventh largest wastewater agency, serving nearly 1 million  customers across 682 square miles.\n\nThroughout its history, EMWD has remained committed to delivering  safe, reliable water, wastewater, and recycled water services. It  serves one of California's fastest-growing regions and continues to  balance the needs of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696365/congratulating-the-eastern-municipal-water-district"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Mr. Speaker, I rise today to recognize the life and legacy  of John N. Post--a patriot who was and still is truly committed to  service, community, and country. John moved to Westfield, New Jersey,  at age ten and graduated from Westfield High School in 1958. He  attended St. Peter's College,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691600/recognizing-john-post"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Presidents do  that. Obama deported more people than Trump has, but he went after  people with criminal records.\n\nMr. Speaker, 80 percent of the people in ICE custody have committed  no crime. Hundreds of citizens have been arrested for no crime by ICE,  which has no jurisdiction. Why were they arrested? Is it just because  they look Latino? Is it just…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…is fulfilling his campaign promise of  promises made, promises kept to make America safe again.\n\nAmerica wants peace through strength, and that is what President  Trump is committed to. For far too long, administrations in Washington,  D.C., have created red lines that were crossed without consequence,  agreed to deals with Iran that the regime disregarded,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…universities that  allow hateful anti-Semitic actions on campus that threaten the safety  of Jewish students. He has appointed the most pro-Israel Cabinet ever  assembled. And he is committed to defending Israel, combating  terrorism, and protecting Jewish Americans.\n\nToday, I rise to condemn last night's heinous and anti-Semitic attack  on these innocent people.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…are working with       Congressman Hakeem Jeffries, one of the rising stars of the       New York delegation, sometimes referred to as ``Brooklyn's       Barack.'' Hakeem is committed to electing a Democrat majority       in 2014 and is encouraging his friends to participate in the       DCCC fundraising dinner with President Obama and Hakeem       Jeffries.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…my colleagues on the other side of  the aisle want to help on it, I can say from personal experience that  the folks who are on my side, from President Trump on down, are  committed.\n\nMr. Speaker, are there bad people? Something I often say in Florida-- as my colleagues work with me, they will find this--anti-Semitism  doesn't have a monopoly on either…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…burns, scars.  Some live with paralysis and are confined to wheelchairs. The mental  wounds of war are also present as we remember the more than 30,000  veterans who have committed suicide since Washington's misguided  project to remake the Middle East.\n\nWhile our soldiers carry out their missions with honor, the  Washington establishment consistently…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Lincks Clothing  and Shoes, Brownstown Electric, and Lischkge Motors are strengthening  our communities one investment, one hire, and one customer at a time.\n\nThat is why I am committed to cutting government red tape, lowering  taxes, and fighting for progrowth policies that empower our  entrepreneurs to thrive, not just survive.\n\nMadam Speaker, I thank…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…from my district, Lieutenant William Moffett of the  Buckingham Township Police Department. Today, I proudly commend him on  his well-earned retirement, following decades of committed service to  the people of Bucks County.\n\nLieutenant Moffett's distinguished career in public service began in  1981, when he served as an EMT with the Bucks County Rescue…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…this bill unanimously  today.\n\nI am also pleased to report that the ROTOR Act now has the explicit  backing of the White House on this revised product. The White House is  committed to helping us work with our House colleagues to see that the  ROTOR Act passes in that Chamber. We still have a few small outstanding  issues, but I am optimistic that we…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…threat Iran  poses to the United States and our partners and allies is becoming more  and more entrenched. We need a policy response that is durable and  shows that we are committed, day in and day out, to choking off any  financial support to Iran's malign activities.\n\nThat is why, today, the House is considering the Solidify Iran  Sanctions Act, which…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Administration and the Subcommittee on Modernization  and Innovation.\n\nNoah has served as the Deputy House Legislative Counsel since 2018,  helping lead the office and manage a committed team of experts to  provide the House with impartial and confidential drafting and  counseling services for bills, amendments, resolutions, and laws.\n\nThroughout his career…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}]