[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…TPS holders like myself.\n\nMy name is Jose Urias, and I am a TPS holder from El       Salvador. I am also one of the Co-Coordinators of the       Massachusetts TPS Committee and a member of the National TPS       Alliance.\n\nI have lived in Malden, Massachusetts for over 20 years       with my wife and two U.S. citizen children. I work hard every…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…support for H.R. 4446, the  Focused Assistance and Skills Training for Veterans' Employment and  Transition Success, or FAST VETS Act. Introduced by Veterans' Affairs  Committee member Representative Dexter, the VA Veterans Readiness and  Employment, or VR&E program, is perhaps the greatest resource disabled  veterans have to seek a new career path,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…authority and role  in her caucus to bear in this effort and conversation.\n\nMy colleague from the State of Nevada, not just a member of the  Energy and Natural Resources Committee but a member of the leadership  team on the Democratic side here in the Senate, I appreciate her  willingness to bring her authority and power to bear in advancing this  conversation.…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700284/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…know her.\n\nAs a faithful 73-year member of First African Baptist Church, Mrs.  Booker has held numerous leadership positions, including Deaconess,  Trustee, and Finance Committee Member, where she has demonstrated her  commitment to spiritual growth and community service. Her involvement  in various initiatives showcases her unwavering dedication to improving…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…before us today and for their thoughtful engagement  with Tribal council members, Tribal President Capoeman, when he came  before the committee, and Quinault Business Committee member Tyson  Johnston, who testified to the importance of this legislation earlier  this year.\n\nThis bill, for me, represents the kind of tangible, bipartisan work I  believe…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Madam Chair, I thank my friend, the gentleman from  Virginia, for yielding me time.\n\nI rise today in strong opposition to this budget resolution. As an  Appropriations Committee member, thoughtful consideration of government  spending is a responsibility I don't take lightly. I believe every  hard-earned taxpayer dollar must work for all Americans, not…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to be on par with other  Federal survivors' programs.\n\nWe have Republican Members like Richard Hudson, who has introduced  the Love Lives On Act, with Veterans' Affairs Committee member  Representative Kelly Morrison, that would repeal the ridiculous  penalties survivors face when they choose to remarry.\n\nMy hope is that we can consider those bills soon.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…retiring from the U.S. Army, Mr. Tarr continued to serve his  community, fellow Veterans, and country as a member of numerous Veteran  organizations. Serving as a National Committee Member and Volunteer  Director for Wish for Our Heroes (W4OH) since 2012, he has invested  innumerable hours in helping Servicemembers and Veterans who are facing  financial…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…her dedication to  upholding conservative values never wavered. For many decades, Trinka  served in leadership roles as an Election Judge, Precinct Chairman,  executive committee member of Southern Methodist University, board  member of the Southwestern Medical Foundation, and as President of the  Park Cities Republican Women.\n\nTrinka has continued to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…information.\n\n``(c) Savings Clause.--\n\n``(1) In general.--Nothing in this section shall be       construed to adversely affect the authority of Congress,       including a Committee or Member thereof, to obtain any record       or information.\n\n``(2) No negative implication.--The absence of a provision       similar to paragraph (1) in any other provision…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…filed with the Clerk of the Committee.\n\n1.4. In the case of any meeting of the Committee, other       than a regularly scheduled meeting, the Clerk of the       Committee shall notify every member of the Committee of the       time and place of the meeting and shall give reasonable       notice which, except in extraordinary circumstances, shall be…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "James Risch", "party": "Republican", "sentence": "…of law or government regulations.\n\nA closed meeting or hearing may be opened by a majority       vote of the committee.\n\n(g) Staff Attendance.--A member of the committee may have       one member of his or her personal staff, for whom that member       assumes personal responsibility, accompany and be seated       nearby at committee meetings and hearings.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…will       be allowed in such cases solely for the purpose of recording       a Members position on the question and then only in those       instances when the absentee Committee Member has been       informed of the question and has affirmatively requested that       he or she be recorded. (Paragraph 7(a)(3) of rule XXVI of the       Standing Rules.)…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…involving unmanned or  autonomous vessels. This bill will therefore ensure that drug  traffickers responsible can be charged, tried, and convicted.\n\nMr. Speaker, I thank T&I Committee member, Representative McDowell,  for his leadership on this bipartisan legislation.\n\nMr. Speaker, I urge support of H.R. 2351, and I reserve the balance  of my time.\n\nMr. Speaker,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Commander, and  Finance Officer.\n\nHe is also Secretary for the VFW Post 6464, President of the Howell  Veterans Society, American Legion Department of Michigan Membership  Committee Member, and a Post 141 Past Commanders Committee Member.\n\nTo put it simply, Bobby Brite is a pillar in the veteran community-- offering support, building friendships, and fighting…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690118/recognizing-bobby-brite"}]