[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Office, she  was instrumental in passing the 2008 SLOST Referendum, which enabled  the hiring of 100 police officers in Columbus--a measure that continues  to benefit our community today. Judy left the Mayor's Office in 2010 to  launch her campaign for the Columbus City Council.\n\nElected to the Columbus City Council in 2011, Judy served honorably  for…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…thousands of daily commuters and consumers.  As an advocate for open space, he successfully championed the  conversion of underutilized spaces into public plazas for the  community. Today, the BID corridor is home to four new public plazas  enjoyed by all.\n\nAs a lifetime resident of Ridgewood, Mr. Renz public service extends  beyond the BID. He has served…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…child poverty and support families facing economic hardship.  Congress should never prevent a municipality from using its own locally  raised funds to strengthen their community. Today, I will vote to  defend the rights of the residents of D.C.--as I would my own  constituents--to ensure Republicans do not override these important  budgetary decisions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699844/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…improve socio-economic conditions in the  community. Even after her official retirement in 1985 she continued to  support youth programs that still serve the greater Newark community  today.\n\nWhile Josephine Barbee passed away on February 1, 2025, her legacy is  carried on by her son, Mark Barbee, who shares his mother's commitment  to serving others, ensuring…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688217/recognizing-josephine-barbee"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…died, he told us that he had seen  the Promised Land, that he wouldn't get there with us, but he still  believed in the power of community and the power of the beloved  community.\n\nToday, the Congressional Black Caucus is carrying forward his work.  We are his legacy. We ensure that what he fought for--what John Lewis  fought for, and what millions of…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the  foothills of western Denver. Since then, Evergreen has grown from a  small ranching and logging village only accessible by wagon roads to  the vibrant mountain community that it is today. Originally inhabited  by the Native Ute, Cheyenne, and Arapaho people, the town has grown  alongside the state of  Colorado, boasting a slower lifestyle ``up the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…serves over 2,000 people annually, including  hundreds of young people.\n\nUnder Kathy's leadership, the Neighborhood Center became a beacon of  hope for the Germantown community. Today, the center is home to a food  pantry, music studio, countless youth activities, and women's  empowerment programs.\n\nThroughout her career, Kathy relentlessly pursued…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…friends, and  they are our colleagues.\n\nWake up. This is not about us against them. This is about us fighting  an epidemic. It is an epidemic that is literally killing our community.\n\nToday, I said to my colleagues across the aisle, do not look away.  Come to the table. Work with us. The cost of inaction is measured in  lives lost in our neighborhoods, in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…fentanyl pills, which were  valued at nearly 1.5 million dollars, and nearly $38,000 dollars in  cash.\n\nThose deadly pills would have devastated countless lives in our  community, but today the Isleta Pueblo and New Mexico's communities are  safer because of our law enforcement's hard work and dedication. Thanks  to our officers' intelligence and tireless…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697564/commending-the-isleta-police-department-and-local-law-enforcement"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…resolutions is to unite the Congress, not divide  it. The purpose is to unite us in condemning violent attacks like  these, to make clear that we stand with the Jewish community today and  always and that we will be there for them in the weeks and months  ahead.\n\nMr. Speaker, I encourage you, read the resolution that Mr. Evans  introduced. You will…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…their tables.  As the harmful impacts of the pandemic spread throughout the Prince  William County, the church expanded its mission--opening its doors to  the entire community.\n\nAs of today, volunteers come together once a week to package and  distribute food boxes to families across the community. What started as  a small operation has now grown into…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696800/recognizing-the-neabsco-baptist-church-for-serving-families-in-need"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…violence.\n\nThe scourge of anti-Semitism has metastasized across our country, and  we have to do more now to stop this hatred and violence.\n\nWe continue to stand with the Jewish community today and always and  will be united in supporting the victims and their families in the  weeks and the months ahead.\n\nDavids).", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691842/in-memory-of-recent-gun-violence-victims"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…and  faith, and they shared a passion for the outdoors and horses.\n\nJaci and Alex's bravery in the face of overwhelming odds are helping  to advance science in the ALS community today. Alex's brain tissue was  donated to advance ALS research, and Jaci personally urged lawmakers  and the FDA to fast-track a new personalized drug designed specifically…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Olivers, and many more  have sustained and enriched the life of St. Mary's across decades,  ensuring its continued presence as a spiritual cornerstone of the  Lampasas community.\n\nToday, St. Mary's remains a thriving parish, carrying forward its  mission with more than a dozen families whose membership stretches back  multiple generations, while also…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…workshops, employment opportunities, and  veterans' benefits. His non-profit has successfully helped over 1,500  veterans and continues to make significant contributions to his  community today.\n\nAbove all, Scott is a devoted father to three children-Alaina,  Scottie, and Kai. Together, they share a passion for adventure and the  outdoors, while also valuing…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…character.\n\nThat faith extended far beyond his home. Mr. Brewton was a founder of  the Brownsville Assembly of God in Pensacola, a church that continues  to serve his community today.\n\nThrough his life, he set a shining example--before his children, his  family, all who knew him, and to us--of what it means to honor God and  country.\n\nMay we all strive…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…town of Strong, ME, was incorporated  on January 31, 1801. This 225th anniversary is a time to celebrate the  spirit of determination and resiliency that still guides the community  today.\n\nStrong's incorporation was but one milestone on a long journey of  progress. For thousands of years, the abundant forests and waters of  the region were the hunting…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…battle with Scleroderma, providing unwavering  support and care, in both his personal and professional endeavors, Alan  was a committed man--committed to his family and community.\n\nToday, I commemorate Alan Bleam for his 40 years of remarkable  service for our community. His steadfast dedication to the betterment  of Plumstead Township continues to inspire…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…milestone offers an opportunity to reflect  upon the city's rich history, enduring spirit, and the generations of  citizens who have shaped Brooksville into the vibrant community it is  today. For 170 years, Brooksville has stood as a testament to  resilience, civic pride, and a deep respect for tradition, while  continually embracing progress and growth.…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…municipal watershed for almost all of its supply of drinking water.  Protecting and managing this watershed is vital to the health, safety,  and future of The Dalles community.\n\nToday, that task is complicated by the fact that critical  infrastructure, the Crow Creek Reservoir and the surrounding timbered  area, is located on both City-owned and federally…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…of the City Council, she  has been an integral part of growing Rainbow City into the fastest- growing city in Etowah County. Rainbow City would not be the thriving  community it is today without her leadership. Anita has served on the  Utilities Board since 2013 and served as the chairwoman in 2019.\n\nAnita married Jeff Bedwell on October 22, 1983. They…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696590/recognizing-the-retirement-of-city-councilwoman-anita-bedwell"}]