[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…That includes the nurses, the teachers, the occupational therapists,  and the school staff who work with Natalie. It includes the assistive  technology that Natalie uses to communicate. Federal health and  education funding give Natalie her voice. It also includes the  transportation that Natalie receives to and from school each and every  day.\n\nNatalie's…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…only said we were       ending membership in the WHO, but [that] our agencies could       no longer provide funds immediately to WHO . . . and could no       longer even communicate [with the WHO]. [There are i]ssues       like getting . . . the fall flu vaccine, which depends on a       WHO process that accesses specimens from people in China . .…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…stories in the media, and some still have not received any  formal communication from the Department of Energy.\n\nIf the Department of Energy doesn't even have the capacity to  communicate with grantees who were promised Federal support that has  now been stolen away, one really has to wonder if the Trump DOE would  prioritize staff time for the development…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…getting online--literally from enjoying the vast benefits  and resources of the online world.\n\nToday, students and educators are dependent on broadband to learn and  teach, to communicate with each other, to establish relationships and  communities. Digital education has allowed for more flexible learning  opportunities for all of us, whatever our ages, but…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…million students across the country rely on IDEA  for individualized education plans, services, and due process  protections. These are real students whose ability to learn,  communicate, and thrive depends on fulfilling the promises made in  Federal law.\n\nThose promises are enforced, overseen, and protected by the  Department of Education.\n\nThe Department…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…security and law enforcement efforts. In the Thumb region,  Delta College Public Media hosts transmitters for the FBI and the Coast  Guard to ensure that they can effectively communicate during emergency  situations. Eliminating funding for that partnership, as this bill  would do, is quite literally putting American lives and the homeland at  risk.\n\nAnd…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…catching drugs. These  technologies also help detect victims of human trafficking or  immigrants in need of a rescue. These technologies can also help Border  Patrol agents communicate reliably in remote areas. When an agent gets  ill or injured or runs across an injured individual, the ability to  communicate quickly and effectively can mean the difference…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…increasingly ubiquitous aspect of daily life.\n\nArtificial intelligence is here, and it is reshaping nearly every  aspect of modern life: how we work, how we learn, and how we  communicate.\n\nAI-generated content is becoming more prevalent in healthcare,  housing, education, entertainment, and even public service. If we do  not have a standardized plan to become…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696867/artificial-intelligence-is-here"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…the House has heard with profound sorrow of       the death of the Honorable Raul M. Grijalva, a Representative       from the State of Arizona.\n\nResolved, That the Clerk communicate these resolutions to       the Senate and transmit a copy thereof to the family of the       deceased.\n\nResolved, That when the House adjourns today, it adjourn as…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688946/expressing-the-profound-sorrow-of-the-house-of-representatives-on-the-death-of-the-honorable-raul-m-grijalva"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Covid epidemic period when the fire department was the  lead local agency conducting vaccinations. In my contacts with Chief  Sweat, she was always pleasant. She was easy to communicate with and  she certainly had a professional demeanor, which inspired my belief  that the Fire Department was in good hands. Sweat had ``the most  appropriate name for the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…am  the person who laid the foundation for President Donald John Trump's  impeachment when he was impeached the first time around. I am using a  personal pronoun only to communicate, but the truth is there were other  persons who engaged in this process with me. I will tell you about  these other persons.\n\nI have here something that has been removed…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…nursing homes having to shut down.\n\nWhat I heard from all of those constituents in those three districts  was that they are very disappointed that they were not able to  communicate with their Representatives because their Representatives  were hiding from them because they could not justify their support of  this big, disgusting billionaire bailout.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…didn't see it coming. There is no  way he could have.\n\nBut, for years now, she has survived physically while mentally she  has deteriorated to the point where she cannot communicate with him or  others. It is an expensive undertaking, that type of care facility. He  can afford it, but many people can't.\n\nSo what do they do? What happens when your mother…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…his cell phone. They proceeded to handcuff him, put his  hands behind his back in handcuffs, leaving him no way of  communicating. You need to be able to use your hands to communicate  with sign language. They deprived him of his ability to communicate.\n\nThis young man was a DACA recipient who has been in the United States  since he was 5 years old. He…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…That the House has heard with profound sorrow of       the death of the Honorable Sylvester Turner, a Representative       from the State of Texas.\n\nResolved, That the Clerk communicate these resolutions to       the Senate and transmit a copy thereof to the family of the       deceased.\n\nResolved, That when the House adjourns today, it adjourn as…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688513/expressing-the-profound-sorrow-of-the-house-of-representatives-on-the-death-of-the-honorable-sylvester-turner"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent.\n\nJust that 1 percentage point is $3 trillion of additional interest.  It is more than everything we are talking about trying to cut.\n\nHere is your balance: How do you communicate to the people we borrow  money from that we are a good credit risk? We are going to pay you  back. We are going to pay you back appropriately. We are not going to  say crazy…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the negotiating table. I hope our European friends  will also take the next step to counter Iran's threat to regional and  global security for good. This resolution will communicate with our  European friends that it is the intent of this body to do so.\n\nWith that, I yield back to Senator Ricketts.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…terrorist networks that have convinced my colleagues they are nothing  more than small street gangs.\n\nThey control territory, run armed convoys, use drones for  surveillance, and communicate through encrypted networks like the  military. They terrorize entire countries with extreme violence, and  they terrorize the United States of America and our people. They…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…review the ethics policies and practices of each Mid-      Atlantic River Basin Commission;\n\n(B) review the practices each Mid-Atlantic River Basin       Commission uses to communicate with the general public;\n\n(C) review current Federal responsibilities at each Mid-      Atlantic River Basin Commission, including the types of       actions taken by relevant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Nebraska  law enforcement. Nearly a dozen counties reached out to my office  asking for help replacing outdated systems and gear. With these  upgrades, officers will be able to communicate, and they will be able  to respond faster. And this will improve safety for both our first  responders and also the communities that they serve.\n\nI also worked to secure…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…debt growth is interest and Medicare. There is nothing we can  do about interest. We can do some things to incentivize going out on  the curve so we are not as fragile to communicate  to the bond markets because the bond markets are basically about to run  this country. If you have to sell $6 billion a day, $60,000, $70,000  every second, maybe you need…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…share good news from Pennsylvania's 15th Congressional  District. I spoke 91 days on the House floor in 2025, delivering 120  speeches. I am glad to have had the ability to communicate with my  constituents in this way and to recognize their achievements.\n\nMr. Speaker, I thank the people of the 15th Congressional District  for allowing me the privilege…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…stacked against doing anything, and  that is exactly what has happened. We want to open this up where  American companies can invest in American fiber cables so that we can  communicate across the ocean and we can get away from all of this  consolidation in one area where it is easy to target.\n\nMr. Speaker, the article featured behind me found that adversaries…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…pressured to end their pregnancies or risk academic failure  despite protections that exist now under Federal law.\n\nThe Pregnant Students' Rights Act requires schools to clearly  communicate what accommodations and protections pregnant and parenting  students are entitled to. That includes excused absences for medical  needs, the ability to make up missed work,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…pass the English proficiency test in English and not in any other  language.\n\nThis commonsense measure would help guarantee that all truckdrivers  can read traffic signs, communicate with law enforcement, and  understand directions clearly and safely.\n\nIn addition, I cosponsored Senator Moody's Safer Truckers Act, which  restricts the issuance of CDLs…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and her unwavering commitment to keeping my  constituents back home informed of the day-to-day effort here in  Washington.\n\nIt is often said in Congress that if we do not communicate what we  are doing, then folks back home will assume that we are doing nothing.  With relentless consistency, every bill, letter, hearing, and townhall  meeting has been…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698096/recognizing-emma-hall"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and gas. Europe has affordable, effective  alternatives.\n\nThe United States and our European allies should work through  sanctions and other forms of economic statecraft to communicate firmly  and consistently to large non-European buyers of Russian oil and gas  that the time to act is now.\n\nCongress should act by immediately passing Congressman Zach Nunn's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…heard with profound sorrow of       the death of the Honorable Richard B. Cheney, a former Vice       President of the United States of America.\n\nResolved, That the Clerk communicate these resolutions to       the Senate and transmit a copy thereof to the family of the       deceased.\n\nResolved, That when the House adjourns today, it adjourn as…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696746/expressing-the-profound-sorrow-of-the-house-of-representatives-on-the-death-of-the-honorable-richard-b-cheney"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…steps that keep patients  safe. This initiative's goal is to prevent errors by ensuring that all  members of the surgical team pause before invasive procedures, so they  can communicate as a group and confirm key information about the  patient and the procedure.\n\nI commend perioperative and procedural teams in hospitals across  Texas' 21st Congressional…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692335/recognizing-national-time-out-day"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…immense  pressure and uncertainty, he played a critical role in coordinating  local response efforts and guiding recovery planning. His ability to  bring people together, communicate clearly, and keep the public  informed helped Avery County navigate hardship with resilience and  unity.\n\nPhillip's service has been widely recognized for his leadership…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}]