[{"senator": "Emily Randall", "party": "Democrat", "sentence": "He was finally laid to rest in Arlington National Cemetery  in 2003 and received the Purple Heart and Navy Commendation Medal with  Valor."}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "He received the Rochester Police Department Life Saving  Award, Officer of the Month Award, 17 Excellent Police Service Awards,  and 7 Unit Commendation Awards."}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "His service and commitment to both California and our Nation  are worthy of the highest commendation."}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "APAPA-SOC's continuous efforts to       empower Asian and Pacific Islander Americans by encouraging       civic participation through leadership and mentorship       programs, internships, and scholarships deserve the highest       commendation."}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "His commitments to his family and  our Nation are worthy of the highest commendation."}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "His impact has earned him a number of accolades, such as Meritorious  Service Medals and the Navy and Marine Corps commendation medals."}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "Her commitment to the Inland  Empire and beyond is worthy of the highest commendation."}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "His service has been  recognized with the Joint Service Commendation Medal, the Army  Commendation Medal, the Global War on Terrorism Expeditionary Medal,  and several other awards and decorations."}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, it is my distinct privilege to rise today  to present Christopher Aaron McGowen of Nacogdoches, Texas, as a  recipient of the 2025 Congressional Veteran Commendation in recognition  of his outstanding service to both his country and his community."}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Throughout his distinguished service, Sergeant First Class Leidlein  earned numerous awards, including multiple Army Achievement Medals and  Army Commendation Medals, in recognition of his leadership, technical  expertise, and operational excellence."}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I am honored to present a Congressional  Veteran Commendation to a member of our greatest generation, retired  USAF Lieutenant Colonel Charles H."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "When he  highlighted people who were deserving of commendation, we would stand  and applaud."}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I rise today to honor William ``Bill''  Forest Harris of Cameron, Texas, by presenting him with a Congressional  Veteran Commendation."}, {"senator": "John Carter", "party": "Republican", "sentence": "Speaker, it is my privilege to present a  Congressional Veterans Commendation to Lieutenant Brian M."}, {"senator": "John Carter", "party": "Republican", "sentence": "Army, Retired, with a Congressional Veteran  Commendation."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "This commendation serves as a reminder that entrepreneurship thrives  in small towns and family-owned storefronts across America."}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Throughout his distinguished career, CWO4 McInnis earned numerous  awards, including four Coast Guard Commendation Medals, five Coast  Guard Achievement Medals, the Navy Achievement Medal, the 9/11 Medal,  two Southwest Asia Campaign Medals, the Kuwait Liberation Medal from  Kuwait, six Sea Service Ribbons, three Good Conduct Medals, and both  the Expert Pistol Medal and Expert Rifle Medal."}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Army, earning  numerous military decorations including, but not limited to, the Army  Commendation Medal, Iraq Campaign Medal, NATO Medal, Army Service  Ribbon, and Overseas Service Ribbon."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "He received accolades including:  the Army Commendation Medal of Valor, National Defense Service Medal,  Afghanistan Campaign Medal with campaign star, and Senior Aviation  Badge."}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "During his distinguished career as an officer with the Rochester  Police Department, Officer Mazurkiewicz was the recipient of the  Rochester Police Department Life Saving Award, Officer of the Month  Award, 17 Excellent Police Service Awards, 7 Unit Commendation Awards,  32 Chief's Letters of Commendation, and the Good Conduct Award for 29  years of service without a sustained complaint."}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I rise today to honor Danny Charles Masur,  of Rockdale, Texas, by presenting him with a Congressional Veteran  Commendation."}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Hammond received the Air and Space  Commendation Medal with two oak leaf clusters, the Air and Space  Achievement Medal with one oak leaf cluster, and the Army Achievement  Medal."}]