[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…crafting policies to actually achieve  those goals and implementing those policies and programs. I went on to  serve for 6 years as chair of the California State Senate Committee on  Energy, Utilities and Communications.\n\nSince then, California has continued to lead the Nation with  increasingly ambitious goals for cutting emissions.\n\nIt is a remarkable…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…hurt people.\n\nBy the way, for the record, that is not fear-mongering. It is what is  in the text of this resolution.\n\nI just want to say that this budget directs the Committee on Energy  and Commerce to come up with at least $880 billion in cuts within their  jurisdiction. Republicans want to be able to claim that there is no way  to know at this point…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…leadership on this issue, and I reserve the balance of  my time.\n\nMr. PALLONE.  Castor), who is the Democratic sponsor of the bill and who  is also the ranking member of our committee's Energy Subcommittee.\n\nMr. PALLONE. Mr. Speaker, I urge bipartisan support for this  legislation. It is another consumer protection bill, like the TICKET  Act, that provides…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…president of  the Leukemia & Lymphoma Society:\n\nThe fiscal year 2025 budget resolution would create not       just the opportunity but the obligation for the House       Committee on Energy and Commerce to make dangerous cuts--\n\nDangerous cuts--       to the Medicaid program in the budget reconciliation process       expected in the coming week. The hundreds…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Committee on Armed Services,  Committee on Banking, Housing, and Urban Affairs, Committee on Homeland  Security and Governmental Affairs, Committee on Veterans' Affairs,  Committee on Energy and Natural Resources, Committee on Indian Affairs,  and Committee on Ethics.\n\nThroughout his distinguished career, Senator Akaka was a tireless  advocate for Native…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bills today show that is simply not true. It is not accurate when  they say that. I have to thank Secretary of Energy Chris Wright for  being honest about this. At a Committee on Energy and Commerce hearing  in June, he was very blunt. He said: ``These companies can find ways to  change conduct and take action, frankly, on Kimmel, or there is going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…cut taxes for billionaires at the same time that it cuts healthcare for  working people. The math doesn't lie. This budget plan requires $880  billion of cuts under the Committee on Energy and Commerce.\n\nMr. MAGAZINER. Mr. Speaker, the majority could cut literally every  program under the Committee on Energy and Commerce except for Medicare  and Medicaid…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…health.\n\nWe need to start thinking holistically about public health. We need  to start thinking holistically about healthcare policy not just being  something that the Committee on Energy and Commerce's Subcommittee on  Health looks at but that every policy interconnects so that we are  looking at, studying, and funding research on how, holistically,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the affordability crisis even worse.\n\nMr. PALLONE. Madam Speaker, I yield 5 minutes to the gentlewoman from  Florida (Ms. Castor), who is the ranking member of the Committee on  Energy and Commerce's Subcommittee on Energy.\n\nMr. PALLONE. Madam Speaker, I yield 3 minutes to the gentleman from  Colorado (Mr. Neguse), our assistant Democratic leader.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…illegal activity that we  are seeing from the Trump administration is not business as usual.\n\nThe reality is that 15 of the 16 bills we are considering today from  the Committee on Energy and Commerce, including this one, should  already be law. They were already agreed to last year as part of a  bipartisan, bicameral legislative package that was set…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…ashamed that we are okay not  knowing this. For 4 months, we have been asking questions. Instead of  answers, we have even more concerning questions.\n\nI shared with our Committee on Energy and Commerce chair that, as the  committee that has jurisdiction over SAMHSA, how do we not have these  very important answers? This affects every community in the country,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…communications. He  was always ready to go the extra mile for the team--whether it was  accompanying me to events, moderating my town hall, or heading up the  Party Planning Committee. His energy was contagious, and his commitment  never wavered.\n\nIn 2022, Matt took a leave of absence from my official office to be  boots on the ground in New York City (NYC)…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…out of that bill.\n\nIt was voted down by Members of his own party. The amendment  literally said: To strike the section related to reconciliation  instructions to the Committee on Energy and Commerce of the House of  Representatives to cut $880 billion from Medicaid.\n\nThe Senator's Republican colleagues in the Senate voted it down, so  let's be honest…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I thank the chairman of the Committee on  Energy and Commerce. This is my first time to publicly congratulate him  on the House floor on assuming the chairmanship of the Energy and  Commerce Committee.\n\nWhat I can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…nurses, small business  owners--just got slapped with an average $14,000-increase in their  silver plan premiums.\n\nAs the senior Democrat on the Health Subcommittee of the Committee on  Energy and Commerce, I have been raising this issue, along with my  colleagues, for many months now. Despite the warnings, President Trump  and congressional Republicans did…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker. I wish to include in the Record the  following letters of exchange between the House Committee on Energy and  Commerce and the House Committee on Foreign Affairs with respect to  H.R. 1765, the Promoting United States Wireless Leadership Act of 2025.  By these letters,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693668/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…of our goals: affordable, reliable energy that also helps the  environment.\n\nMr. Speaker, I urge all of my colleagues to vote ``yes,'' and I thank  the chairman of the Committee on Energy and Commerce for leading this.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…finalized amended energy efficiency  standards for commercial refrigeration equipment.\n\nH.J. Res. 75, introduced by Representative Goldman of Texas, a new  member of the Committee on Energy and Commerce, repeals this final  rule.\n\nNew standards for this equipment, which included a variety of  products, became effective just 3 years ago. Yet the Biden  administration…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Kaitlyn Peterson for  her service to the House Committee on Energy and Commerce.\n\nA graduate of the University of Minnesota and native of Massapequa,  Long Island, New York, Kaitlyn began her career in Washington, D.C. as  a Staff Assistant…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697136/recognizing-kaitlyn-peterson"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of the Energy Subcommittee.\n\nMr. GUTHRIE. Mr. Chair, I yield 2 minutes to the gentleman from Texas  (Mr. Weber), the vice chairman of the Energy Subcommittee of the  Committee on Energy and Commerce.\n\nMr. GUTHRIE. Mr. Chair, I yield myself the balance of my time.\n\nMr. Chair, I appreciate my friend bringing up the enhanced or COVID- era premium tax credits…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Joanne Thomas for her  service to the House Committee on Energy and Commerce.\n\nA graduate of Wayland Baptist University, The University of Sydney,  and The Catholic University of America's Columbus School of Law, Joanne  began her…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692136/recognizing-joanne-thomas"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Kate O'Connor Harper  for her service to the House Committee on Energy and Commerce.\n\nA native of Chicago, Illinois and a graduate of the University of  Chicago, Kate began her career as a Staff Assistant for Senator Mark  Kirk (IL) before…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695125/recognizing-kate-oconnor-harper"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…other purposes. All points of order against consideration of       the bill are waived. In lieu of the amendment in the nature       of a substitute recommended by the Committee on Energy and       Commerce now printed in the bill, an amendment in the nature       of a substitute consisting of the text of Rules Committee       Print 119-20 shall be considered…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…after the date of       the enactment of this Act, the Assistant Secretary, in       consultation with the Department of Homeland Security, shall       submit to the Committee on Energy and Commerce of the House       of Representatives and the Committee on Commerce, Science,       and Transportation of the Senate a report examining the       cybersecurity…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Seth Gold for his  service to the House Committee on Energy and Commerce.\n\nA native of Cincinnati, Ohio and graduate of The George Washington  University for both a Bachelor of Science in Public Health and Master  of Public Health--Seth…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…influence of a covered country.\n\n(b) Report to Congress.--Not later than 1 year after the       date of the enactment of this Act, the Secretary shall submit       to the Committee on Energy and Commerce of the House of       Representatives and the Committee on Commerce, Science, and       Transportation of the Senate a report on the results of the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690158/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Secretaries shall submit to the       Committee on Science, Space, and Technology and the Committee       on Agriculture of the House of Representatives, and the       Committee on Energy and Natural Resources and the Committee       on Agriculture, Nutrition, and Forestry of the Senate, a       report detailing the following:\n\n(1) Interagency coordination…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…only to people on the other side of the country  but even to people in other parts of that same State.\n\nThere is a fair amount of legislation that moves through the  Committee on Energy and Natural Resources--a committee that I currently  chair--that fits into each of these categories: controversial bills  where there is a sharp Republican-Democratic…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…section, the Secretary and the       Administrator shall submit to the Committee on Science,       Space, and Technology of the House of Representatives and the       Committee on Energy and Natural Resources and the Committee       on Commerce, Science, and Transportation of the Senate, a       report detailing the following:\n\n(1) Interagency research…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…American Petroleum Institute,                                  Washington, DC, February 26, 2025.      Hon. Brett Guthrie,      Chair, House Committee on Energy and Commerce, Washington,           DC.      Hon. Frank Pallone,      Ranking Member, House Committee on Energy and Commerce,           Washington, DC.\n\nDear Chairman…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]