[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…human trafficking victims to petition  to have their convictions vacated for certain offenses and to expunge  their arrest records for other offenses if the offenses were committed  only as a consequence of their trafficking.\n\nThis bill would also provide an avenue of relief for victims and  survivors facing prosecution for certain Federal offenses…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…It has been done. I saw it myself. Where do we  stand?\n\nWhere do we stand when, after the President has sent the National  Guard into various places, more turmoil has been committed as a result  of the Guard being there than was being committed before they arrived?  The President is the person who is creating the turmoil so that he can  then say: I am…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…funding for marine debris  removal efforts through 2029. It keeps programs running, supports long- term planning, and gives communities confidence that Federal partners  are committed to protecting our waters and natural resources.\n\nMr. Speaker, I am proud to support my colleagues who have worked on  this important bipartisan legislation both here in the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…among those 5  million.\n\nMr. Speaker, I have good news. This Thursday, the Senate will have  two competing plans on the floor for a vote. Yet, Speaker Johnson still  has not committed to allowing a vote on the floor in this body.\n\nLeader Jeffries has a discharge petition open right now to extend the  tax credits, and we just need four Republicans to join…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…him. He played an instrumental role in creating  the Oriental Restaurant Association in 1970, which provided a  healthcare plan for Chinese restaurant workers. He was also a committed  member of Cathay Post No. 186, where he served as Commander and  contributed to fundraising efforts for the Kin On Nursing Home and  youth scholarships. Additionally, Bill…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691351/recognizing-william-bill-leonard-chin-former-cathay-post-no-186-commander-and-world-war-ii-veteran"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Ms. WATERS.  Williams).\n\nMr. Speaker, given the human rights violations committed by the  Burmese leadership, we must ensure that no new funds are disbursed to  the government. In line with longstanding U.S. policy, America should  urge multilateral institutions…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697198/no-new-burma-funds-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…They don't have that luxury. I am going to stand for them and mass  layoffs without any consideration.\n\nI just believe that this level of behavior if it were conducted,  committed, and engaged in by one Barack Hussein Obama when he was  President, if he behaved in this fashion, then he would have been  impeached. He would have been impeached. I will…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…that time, the chairman of the Appropriations Committee, Senator  Shelby, along with other Republicans and in working with Democrats,  vowed to return to regular order and committed to it.\n\nIn May of 2018, President Trump submitted a rescissions package just  like the one we are contending with today. Enough Republicans joined  all of the Democrats in…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…other offense 2 years later. The department is not notified of that, is  not keeping track of it. What does it mean to say a retired person is  in good standing if they have committed a crime in the meantime?\n\nMr. RASKIN. There is nothing that would actually prevent the sale  actually by GSA, right? Who would effectuate the provisions of the  prohibited…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…safely practice their faith  without fear. That is why we need to continue fighting for increased  resources for security at places of worship, like these temples. We  must be committed to doing more to combat the rise in hate that we are  experiencing in the United States to ensure that our communities are  protected.\n\nMadam Speaker, I will continue to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…for  the candidates of their choice. It is not the role of the United States  to pick winners and losers. I hope the elections usher in a new  government of leaders who are committed to strengthening the  institutions of democracy, upholding the rule of law, and improving the  lives and protecting the rights of the Honduran people.", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, I rise in support of H.R. 36, a bipartisan bill  designed to make sure that the United States remains committed to  Georgia's Euro-Atlantic and democratic aspirations.\n\nI thank my friend, the gentleman from South Carolina (Mr. Wilson),  for his tireless efforts on this topic, in addition…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…impeachment is the most consequential tool  Congress to has protect our Nation from a president or other public  official who has betrayed their oath, abused their power, and committed  high crimes and misdemeanors against the American people. Impeachment  necessitates a deliberate process of investigation and a thorough  documentation of crimes committed…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…clearer--would  presumably create confusion among some, resulting in increased call  volume and foot traffic in the field offices and on the national 1-800  number.\n\nI am committed to working with the sponsors of the legislation and  our colleagues on the Committee on Appropriations to ensure that SSA  has the necessary resources to effectively implement…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…single day not  to release the Epstein files, they are pointing fingers at this side of  the aisle.\n\nMr. Speaker, unlike the President, Congresswoman Stacey Plaskett has  committed no crime, violated no rule, and broken no promises.\n\nThere has been no investigation, no due process, no inquiry into  whether the Congresswoman had any connection whatsoever…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…community as volunteers with Hope Services. Ralph and Stephanie have  gone above and beyond to support Hope Services as part of the  organization's Dream Team. They are always committed to helping others  and are a wealth of support to those in need. They give generously of  their time, talents and treasure. Their kindness, generosity, and  tireless efforts…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691801/recognizing-ralph-and-stephanie-stevens"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…visa, under the Biden  administration.\n\nThis can never be allowed to happen again, regardless of which party  controls the executive branch. While we have a President who is  committed to securing our borders, protecting our communities, and  restoring the enforcement of our immigration laws, now is the time to  act.\n\nMr. McCLINTOCK. Madam Speaker, the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…example has helped strengthen public trust in the institutions that  serve our state.\n\nMr. Speaker, I ask my colleagues to join me in thanking Ted Corrigan  for his decades of committed service to the Des Moines community and to  the people of Iowa. We extend our best wishes to him and his family as  he enters this next chapter.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…deceptive acts or       practices, including relating to tokens;\n\n(5) the Commission has previously taken action against       unscrupulous companies and individuals that committed unfair       or deceptive acts or practices involving tokens; and\n\n(6) to bolster the Commission's ability to enforce against       unfair or deceptive acts or practices…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…he set up dozens of corporations to steal valuable  American intellectual property and unlawfully transfer it to China. The  Supreme Court of British Columbia found that he committed fraud on an  epic scale, resulting in a $330 million judgment.\n\nHe then fled to America, assumed an alias, David He, and set up  several more companies, including the one…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…shot at their American Dream, and  his philanthropic work helped support countless organizations.\n\nThanks to Fred Smith, Memphis acquired the NBA's Grizzlies in 2001  when he committed to purchasing the naming rights for the future home  of the basketball team, the FedExForum.\n\nJust 2 years ago, when The University of Memphis was ambitiously  pursuing stadium…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…``literally guarantees us a fate with no economy, no jobs,  reduced subsistence, and no hope for the future of our people.'' In  front of those gathered, Secretary Burgum committed to rectifying this  injustice.\n\nBecause of the opportunities provided by oil and gas operations, this  industry has provided thousands of good-paying jobs to Alaskans, become…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…weapons home with them is the whole  point. Under GSA--\n\nMr. FRY. To answer the gentleman's first question, if you are in good  standing, then that means that you cannot have committed a felony.\n\nMr. FRY. The prohibited purchaser statute would preclude them from  being able to purchase that to begin with.\n\nMr. FRY. GSA comes up with the regulations. That…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…forgotten. We cannot  ignore the reality that Sarah Beckstrom was another victim--an  unnecessary victim--of President Biden's careless immigration policies.\n\nThe man who committed this heinous act was an Afghan national whom  President Biden allowed to enter the country after our disastrous  withdrawal from Afghanistan. Unfortunately, it is too late…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…from my district, Lieutenant William Moffett of the  Buckingham Township Police Department. Today, I proudly commend him on  his well-earned retirement, following decades of committed service to  the people of Bucks County.\n\nLieutenant Moffett's distinguished career in public service began in  1981, when he served as an EMT with the Bucks County Rescue…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…of testimony in the Banking  hearing that I attended. I not only attended that Banking hearing, but  several of my colleagues did too.\n\n. . I do not       believe that he committed a crime during the hearing.''\n\n--Interview with Fox Business, 2/4/26\n\nSenator Mike Crapo:\n\n``I'd like to see this resolved as quickly as possible,''       adding that it's…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…first global independent legal analysis of forced organ harvesting from  prisoners of conscience in China.\n\nSir Geoffrey Nice said that forced organ harvesting has been  committed for years throughout China on a significant scale. He said  the Falun Gong and the Uyghurs in the PRC each qualify as a group for  purposes of the crime of genocide.\n\nRobert…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…also active in their community, participating in educational events and  even hosting a live nativity scene for the public each December.\n\nI am proud to have a family so committed to both responsible  agriculture and their community. It is because of family like theirs  that our rural communities thrive.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693572/congratulating-joe-jensen"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…we did a lot of work with  crime victims, child crime victims, supporting our child advocacy  centers, and prosecuting criminal cases under State law against  offenders who committed terrible crimes against children.\n\nI have often described it to people this way: It is not like on TV in  the crime shows.\n\nWhen the victim is an 8-year-old child or a 7-year-old…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "Mr. MACKENZIE. Mr. Speaker, I rise today to recognize Heather  Davenport, USOA Ms. Pennsylvania, and founder of We Are Strong LLC, a  nonprofit committed to breaking the cycle of domestic abuse and  offering hope to those affected.\n\nSince earning her title in November, she has volunteered at food  banks, supported pediatric…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691003/recognizing-heather-davenport"}]