[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…so little time, so much has changed. In this America, we see  masked agents hiding their faces from the world and even hiding their  identification, terrorizing communities across the Nation, smashing car  windows and dragging mothers and fathers from their vehicles in front  of their kids--in front of their kids--often taking those kids and  separating…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…headquartered in the Twin Cities. Northwest played a central  role in shaping Minnesota's economy, creating tens of thousands of  good-paying jobs, and connecting our communities to the Nation and the  world. Its story is inextricably linked to our state's modern history.\n\nOne of the earliest chapters of that story is written at Holman Field  in Saint Paul,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…hometown--the 270th anniversary of the founding of the City of  Laredo, Texas.\n\nFounded in 1755 along the banks of the Rio Grande, Laredo stands as  one of the oldest communities in our Nation--established even before  the birth of the United States. Originally known as Villa de San  Agustin de Laredo, it was founded by Don Tomas Sanchez de la Barrera.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…million Americans, they are also seeking to make  Americans sicker by giving some of the worst industrial polluters a  free pass to pump dangerous chemicals into communities across the  Nation. With this resolution, Republicans are repealing critical Clean  Air Act safeguards that have been in place for decades.\n\nThe regulatory rule Republicans are trying…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…has decimated and undermined our Federal agencies and  dedicated civil servants who fulfill their missions while also stealing  Federal funds promised to local communities all across the Nation. He  has created constant uncertainty for businesses with the  administration's ever-changing tariff regime.\n\nMr. Chair, as we consider this bill, it is important…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…must speak out. We must remember  our responsibility to act--not just to react--in the best interests of  all the American people. In the face of attacks on minority communities  in a nation where our diversity is truly our strength, it is more  important than ever that we celebrate the progress of this Nation--and  Black history is part of this Nation--of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…FEMA's BRIC program, otherwise  known as the Building Resilient Infrastructure and Communities grants.\n\nTowns like Crisfield in Maryland, Baltimore, and dozens of  communities across this Nation, rely on this funding to ward off the  very real and very devastating effects of flooding.\n\nNot only do these programs save lives, but it is also one of the best…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690467/cuts-to-fema-bric-grants"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…not top down. It is bottom up, and it has been enormously  successful since it has been implemented in the last several years for  both sides of the aisle for communities all over this Nation.\n\nIt is not wasteful, porkbarrel spending, and my friends don't get to  have it both ways.\n\nInstead, it is a thoughtful process of House Members and Senators…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…not determine if you deserve to have your  children's educational needs met.\n\nAs a public school mom, this is deeply personal for me. People in my  community and communities across the Nation are scared.\n\nMy office recently received a letter from Alexander, a special  education and social studies teacher in my district. Alexander is  worried about what…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Department of Energy's Energy Transitions  Initiative Program. Since its inception, this program has partnered  with over 25 Tribal, coastal, remote and island communities across the  Nation to help them secure reliable and affordable energy.\n\nThe Energy Transitions Initiative Partnership Program provides  customized technical and financial assistance…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Order hour.\n\nI rise tonight with my colleagues of the CBC to recognize Gun  Violence Awareness Month and to bring attention to the impact of gun  violence on Black communities around our Nation.\n\nFor decades, gun violence has been an epidemic that has had  disproportionate and devastating impacts on Black communities. In fact,  the facts are sobering and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…year 2025, 4 of whom serve in the United States Senate,  we have continued fighting to dismantle barriers, create opportunities,  and protect the rights of our communities.\n\nThroughout our Nation's history, the Congressional Black Caucus has  been called to confront countless threats to our communities, our  educational attainment, our economic prosperity,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…grandmother and great-grandmother were all tragically killed in a house  fire caused by a lithium-ion battery.\n\nWe are witnessing all of these tragic accidents in communities across  the Nation, yet there is no mandatory Federal standard to ensure  lithium-ion batteries are safe.\n\nAs electric bikes and scooters grow in popularity, we must ensure  that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…closing, it is National Police Week, and we are honoring the brave  men and women in law enforcement who put their lives on the line every  single day to protect our communities and this Nation.\n\nI was proud to vote ``yes'' on this resolution on the House floor  yesterday to express our Nation's gratitude to our law enforcement. I  would also like to thank…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Nothing is doing anything  meaningful about waste, fraud, and abuse.\n\nThe letter continues: ``--it is imperative that we do not slash  programs that support American communities across our Nation. . . . ''\n\nIt then goes on to say: ``The House Budget Resolution proposed $880  billion in cuts to programs under the jurisdiction of the House  Committee on Energy…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…welders,  machinists, and engineers. It means new orders coming into counties  like Anderson, Greenwood, Newberry, and Oconee, and many other  hardworking blue-color communities all across the Nation.\n\nImportantly, it means America's best equipment reaching our allies  faster than ever before.\n\nMr. Speaker, I urge my colleagues to support this bill.\n\nMr. BAUMGARTNER.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…girl and a Holocaust  survivor.\n\nWe know that anti-Semitism is a sickness. It is spreading across the  globe, and world leaders must do more to protect their Jewish  communities.\n\nOur Nation's prayers remain with all of these victims and with their  families and those that experience these tragedies.\n\nWe can all be grateful that, in Donald J. Trump, we…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Tribal, territorial, and private sector stakeholders       is essential to enhance prevention, preparedness, and       response efforts, ensuring the safety of communities across       the nation.       SEC. 3. REPORT ON EMERGING THREATS AND COUNTERMEASURES                     RELATED TO VEHICULAR TERRORISM.\n\n(a) Report.--\n\n(1) In general.--Not later…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ECO-CLEAN  Solutions in the United States House of Representatives. They exemplify  how American innovation can serve as a solution to the issues that are  facing our communities and the Nation at large.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize JB, JT, and ECO-CLEAN Solutions for reaching  this significant…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and FFA members.\n\nAs the House Committee on Agriculture prepares to craft the farm bill  2.0, it is crucial to hear directly from the men and women who feed  their communities and this Nation.\n\nI was glad to be joined by my fellow Pennsylvania Congressmen, Ron  Bresnahan and Dan Meuser. I was also proud to have Russell Redding,  Pennsylvania's Secretary…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…cross-border infrastructure.\n\nCross-border infrastructure, especially oil and natural gas pipelines  and electrical transmission lines, is essential to American communities  across the Nation.\n\nInstead of a clear statutory process, a myriad of executive orders  over decades have provided the legal context for permitting procedures  of cross-border energy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…behind the  creation of a majority of new jobs.\n\nThe entrepreneurs leading these companies are building something new,  taking real risks, and driving growth in communities across the Nation,  but too often, they can't get a fair shot at investment.\n\nRight now, our capital markets suffer from an extreme geographic  imbalance. The data is stark. Nearly…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…are spent.\n\nFor years, the Department of Housing and Urban Development, HUD, has  administered programs that touch millions of families, seniors, and  veterans in communities across our Nation. These programs are critical.  They support affordable housing development, combat homelessness, and  help communities recover after disasters.\n\nUnfortunately,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…areas in this country. These projects will  help fund long-overdue water infrastructure projects and make local  improvements, ultimately driving down costs for communities throughout  the Nation.\n\nMr. Speaker, I recognize Representatives Houchin and Russell Fry, as  well as our Republican leadership and the Appropriations Committee led  by Chairman Cole,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Solutions in the United States House of Representatives. This  organization exemplifies how American innovation can serve as a  solution to the issues that are facing our communities and the Nation  at large.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize JB, JT, and ECO-CLEAN Solutions for reaching  this significant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…business and help       demonstrate energy dominance for the United States. The       ability to develop new energy deposits in NPR-A will benefit       Alaska, local communities, and the nation. Revenues derived       from new production will also help sustain important state       services. Industry activity will provide new job       opportunities for…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…(5) Ocoee, Florida.\n\n(6) Village of Estero, Florida.\n\n(7) Urbandale, Iowa.\n\n(8) Mills, Wyoming.\n\nMr. Speaker, H.R. 672 designates single and unique ZIP Codes for  communities across the Nation. There are currently over 41,000 ZIP  Codes in the United States. In some cases, ZIP Codes are misaligned  with local boundaries. H.R. 672 addresses the concerns…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693860/establishing-new-zip-codes"}]