[{"senator": "Al Green", "party": "Democrat", "sentence": "…suspect. I remember when I was a young man in  the United States of America, and generally speaking, it was thought  among the minds of many, that young persons of color would commit  crimes, that they were criminals, that they would steal, and that you  have to watch them.\n\nWhen you go into a store, Mr. Speaker, people watch you. This is when  I was a younger…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…children treated as adults, even when they are  innocent, are denied age-appropriate legal protections for the rest of  their lives.\n\nSociologists find that children who commit crimes are overwhelmingly  influenced by adults and their surroundings, not their own thinking.\n\nOf course, the people of D.C. did not vote for Trump or any  Republican for that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Israeli Embassy, Yaron and Sarah. May their memories be a blessing.\n\nWe must send the strongest message to those who seek refuge in our  country, only to come here and commit crimes and harm innocent people.  They should know that their actions will not be tolerated, and they  will have no home here.\n\nAs a Member of Congress, I will continue to fight…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691979/condemning-the-boulder-colorado-anti-semitic-attack"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…This was how a teacher in our community was victimized, and it didn't  stop there.\n\nJuan Espinoza Martinez, also from my district, was accused of serious  conspiracy to commit crimes that never happened. ICE made them up and  publicly smeared his name. Those charges were dropped as well because  they were false. There was no apology, no discipline,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and commercial sex through  violence, fear, coercion, and manipulation. While awful, their  exploitation doesn't stop there. Traffickers often force their victims  to commit other crimes, including prostitution, money laundering,  fraud, drug trafficking, robbery, and theft.\n\nThis leads trafficking victims to be arrested and prosecuted without  consideration…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…been detained  by ICE are being here without documentation and traffic offenses.\n\nNow, the President has said that his administration wants to remove  and deport people who commit crimes after they illegally enter the  country, but the gentleman's legislation moves in exactly the opposite  direction. If this bill were passed into law, it would imprison…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…policies on residents who reject  this agenda.\n\nNow, the bill before us right now is the so-called DC CRIMES Act.  This bill will impose longer sentences on young people who commit  crimes.\n\nHow does it do this?\n\nIt eliminates the ability for judges to make the best sentencing  decisions for young adults. It will lead to worse outcomes, more  reoffenders,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…interesting that got raised is  Minnesota. She talked about a couple of immigrants who have been  arrested. We don't have any problem about enforcement and arresting  people who commit crimes. In fact, we have had Democratic Presidents do  that. Obama deported more people than Trump has, but he went after  people with criminal records.\n\nMr. Speaker, 80 percent…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…cohesive.\n\nMr. Speaker, 78 percent of Somali immigrants in Minnesota alone  receive welfare benefits, even after being in the United States for 10  years or longer. Somali men commit crimes at rates significantly higher  than Americans, and only about half of Somali immigrants can speak  English very well. Again, that is even after being in our country for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…eligible to have their case moved up to criminal court and to be tried  as an adult in D.C. This bill lowers that age to 14 years old, making  14- and 15-year-olds who commit violent crimes eligible to be charged  as adults.\n\nViolent crime refers to murder, first-degree sexual abuse, burglary  in the first degree, and robbery while armed, for example.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…cannot  be surprised when it continues to happen.\n\nI rise today in support of H.R. 3486, the Stop Illegal Entry Act,  legislation to increase penalties for aliens who commit serious crimes,  as well as those who enter illegally more than once.\n\nWe all know under the Biden administration, illegal immigrants were  welcomed with open arms. They were given…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and Kamala Harris' San Francisco.\n\nAs a result, you are seeing law enforcement throughout California  that now has a new ability to restore order and arrest people who  commit crimes. We are starting to see real improvements across the  State that we have not seen in a very long time.\n\nFive, when it comes to high-speed rail, the biggest public  infrastructure…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…It imposes strong sanctions, strengthens reporting  requirements, and authorizes the denial or revocation of passports for  convicted traffickers who cross borders to commit these crimes. I would  say that is the least we could be doing.\n\nThe legislation rightly identifies those responsible, including  members of the Chinese Communist Party, who have…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…3486 protects American families, upholds the rule of law, and  keeps our Nation secure by setting real penalties for those who seek to  enter our great Nation illegally to commit crimes. I urge my colleagues  to support this commonsense legislation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…average, have a tougher go of it in life. They are going to struggle  more in school. They are going to be more likely to use drugs. They are  going to be more likely to commit crimes.\n\nIt is kind of interesting when I sit in committee hearings around  here. We had a committee hearing on crime earlier this week. People  look around for the causes, or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…JD Vance carried in the Senate when he was  there.\n\nLaken Riley Act: In March, the Laken Riley Act would ensure Federal  immigration officials detain illegal aliens that commit crimes and  would allow States to sue the Feds. I was proud to introduce, along  with my colleague from North Carolina, Dan Bishop, the SUE for  Immigration Enforcement Act, which…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…communities.\n\nThis legislation gives Federal officials more tools in their tool  belt to prosecute illegal immigrants by requiring significant  imprisonment for illegals who commit crimes.\n\nPresident Trump has worked tirelessly to make our southern borders  secure again. Now it is our job here in Congress to ensure Federal law  enforcement and prosecutors…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}]