[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Whereas the legacy of Amanda Elzy High School lives on       through its alumni-many of whom have remained in Mississippi       and work tirelessly to improve their communities, including       through civic engagement, grassroots organizing, and       philanthropic leadership;\n\nWhereas more than 130 alumni from the graduating classes of       the 1960s,…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694753/recognizing-the-amanda-elzy-high-school-multi-year-reunion"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Hayes) so much for leading this Special Order hour.\n\nMr. Speaker, the Individuals with Disabilities Education Act and the  Department of Education are vital to all communities, including the one  I represent.\n\nNearly one in five students in New Jersey is served under IDEA.  Without this support, almost a quarter-million students would be denied  an…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…detained for days.\n\nAs of November 2025, ICE has detained 65,135 people, and roughly 73.6  percent of them have no criminal conviction.\n\nMany in immigrant and Latino communities, including U.S.-born  individuals, now report fear, reluctance to go to court, to public  services, or even to participate in regular civic life.\n\nThe violent incident at 26 Federal…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…reported by journalists on the ground prove that, and eyewitness and  firsthand accounts prove that.\n\nU.S. citizens, alongside lawful immigrants and members of vibrant  communities, including children as young as 5 years old, are being  targeted by ICE and Border Patrol in the kinds of abuses many of us  never believed would happen in America: indiscriminate…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699352/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…collaborative co-governance  approach to community development could look like and work.\n\nIt is how we resulted in tangible wins and how he was able to bring  those wins to communities, including the development of 100 units of  affordable housing in the heart of Logan Square in the Lucy Gonzalez  Parsons Apartments.\n\nOn behalf of Illinois' Third Congressional…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…shutting their doors.\n\nThis isn't hypothetical. It is happening right now. Let's be clear:  When these providers and hospitals close their doors, everyone in those  communities, including, by the way, some Members of Congress and their  families, will lose their healthcare. It won't bring me or anyone  impacted any comfort or peace to say, ``I told you…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…what  remains of the Voting Rights Act after the court gutted section 5 and  section 4 effectively in the Shelby County v. Holder case.\n\nWe have seen Black and Brown communities, including American  citizens, living in terror as ICE agents show up on streets, door to  door, in our courthouses, and on the way to school, grabbing people and  violating their…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…economy, undermining transparency and accountability. States       and localities have a strong interest in knowing which       businesses are operating in their communities, including       street vendors and other informal enterprises. Instead of       supporting these efforts, the legislation would make it       harder to identify and engage such…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…housing  crisis that has been years in the making.\n\nFrom 2020 to 2024, the cost of a home soared 37 percent. Over that  same period, rents increased 24 percent. Many communities, including  those that I represent in the Lehigh Valley and the Poconos, have seen  even sharper increases. In Allentown, home prices have increased 63  percent in the past 5…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…random DA or judge or,  oh, George Soros funded one election. It is a coordinated effort to put  DAs and judges and other law enforcement officials into places in  communities--including in the communities I represent in Austin and San  Antonio and throughout Texas--purposely to then have organizations like  the Wren Collective, which is now known through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…events. I engaged meaningfully with 1,800  Hoosiers. I reported back on my work in Congress. I listened to their  concerns and priorities.\n\nI met with leaders in our communities, including our Governor, to  discuss how our Federal policies affect their lives. Together, we  explored opportunities to deliver more for all Hoosiers.\n\nI visited hardworking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Resources Committee hearing that:  ``We also felt heard when BLM released an NPR-A Integrated Activity  Plan (IAP) in June 2020 that considered the interests of our  communities, including future community infrastructure needs.''\n\nThe IAP outlining management activities for natural resources  throughout the NPR-A was thoughtfully crafted by the first…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Speaker, I thank the gentleman for yielding.\n\nI rise in strong support of H.R. 3095, which directs the U.S. Postal  Service to designate a unique ZIP Code for certain communities,  including North Tustin in my district.\n\nNorth Tustin has been a pillar of our Orange County community and a  census-designated place. However, its status as an unincorporated…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693903/single-unique-zip-codes-for-certain-communities"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and oil and gas       industries. RDC's membership includes all the land-owning       Alaska Native regional corporations as well as village       corporations, local communities, including the North Slope       Borough, organized labor, and industry support firms. RDC's       purpose is to encourage       a strong, diversified private sector in Alaska…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…careers and civic responsibilities.\n\nMany former FFA members have gone on to serve in Congress, lead  Fortune 500 companies, and contribute meaningfully to their local  communities, including the recently confirmed U.S. Secretary of  Agriculture, Brooke Rollins, the first Secretary of Agriculture to have  served as a State FFA officer.\n\nAs chairman of the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Technical       Assistance initiative (known as ``WaterTA initiative''),       identifies, selects, and partners with technical assistance       providers to support communities, including--\n\n(A) a description of the criteria, evaluation process, and       contracting mechanisms used for selecting such providers;\n\n(B) a description of the extent of coordination…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…2024,  when the world was on fire with our borders flung open to the invasion  of millions of illegal aliens into this country that prompted a crisis  in countless communities, including my own, Americans' top concerns  coming back time and time again, poll after poll, were the economy and  our border. Democrats did no work to address those concerns.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}]