[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, I am so proud  to serve with Representative Mrvan because I know he shares that same  commitment.", "title": "Devastating Harm Caused By Trump Administration", "date": null}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "His  unwavering commitment to his work has ensured that throughout his  tenure, the station has remained at the forefront of producing  groundbreaking news, brought into countless homes across the Delaware  Valley every single day.", "title": "Recognizing Bernie Prazenica's Retirement As President and General Manager of Wpvi-Tv", "date": "2026-01-13"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "From the first awardee to the most recent, Medal of Honor recipients  have demonstrated their unwavering commitment to serve above and beyond  the call of duty, even to their own death.", "title": "Medal of Honor Act", "date": "2025-02-26"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Speaker, I was unable to vote today due  to an urgent commitment in my district.", "title": "Law-Enforcement Innovate to De-Escalate Act", "date": "2026-02-12"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned him the Meritorious Service Award five times.", "title": "Small Business Saturday", "date": "2025-11-19"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "This bipartisan effort made a commitment that our history of  segregating and isolating persons with disabilities would end.", "title": "Recognizing the 22nd Annual Disability Pride Parade", "date": "2025-07-22"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Beyond its financial and volunteer contributions, the Junior League  of Arlington's influence is seen in its enduring commitment to service  and empowerment.", "title": "Recognizing the Junior League of Arlington: Empowering Women, Strengthening Community", "date": "2025-10-28"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "The treaty itself embodies a broader commitment, one rooted  in decades of cooperation, mutual respect and shared responsibility for  the stewardship of ocean resources.", "title": "South Pacific Tuna Treaty Act of 2025", "date": "2025-05-13"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Separation Day serves as a reminder of the fierce commitment at the  heart of the greatest State in the Union.", "title": "Recognizing Milford, Delaware", "date": "2025-06-11"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "The Strikers' commitment to serving the Crystal Lake community  extends beyond the classroom.", "title": "Recognizing the Crystal Lake Strikers for Receiving the Carl E. Wehde Award", "date": "2025-05-08"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "Achievement Award from Inter-Civic Council of the  Southern Christian Leadership Council; 1996 Commitment to Excellence  Award from Mid-Florida Chapter of NFBPA; 1992 Summit Award from the  Women's Source Center; and Life Time Achievement Award from the  Metropolitan Orlando Urban League.", "title": "Recognizing Geraldine F. Thompson's Service to the Great State of Florida", "date": "2025-04-03"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "His commitment to excellence in  his role is to be commended, and it is my honor and privilege to  recognize Mr.", "title": "Recognizing the Retirement of Robert Jennings", "date": "2025-03-27"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "They deserve a Federal partner that  matches their commitment, and today, they are getting that.", "title": "Secure Rural Schools Reauthorization Act of 2025", "date": "2025-12-09"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "I hope my colleagues on both sides of the aisle will treat this day  not only with the solemnity and seriousness that it deserves but also  with a renewed commitment to make this cause bipartisan, the pursuit of  peace, support of Israel, an end to the humanitarian crisis, and a  lasting, stable solution for the Middle East.", "title": "-9999", "date": "2025-10-07"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "I hope we come to our senses here, and we just start with the  proposition that whatever it is we do, whatever tax policy we believe  is in the best interest of the American people, we start with the  commitment that however we implement that policy, it will do no harm to  the children in your community and mine, to the folks in nursing homes  in your community and mine.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Together, we  have taken an important step to live up to our commitment to our  constituents and to the loved ones lost to put them first and to serve  them.", "title": "-9999", "date": "2025-03-14"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Their battle streamers  reflect the best of American valor and commitment.", "title": "Recognizing Washington Army National Guard 1st Battalion, 161st Infantry Regiment", "date": "2025-05-20"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "This very first bill in Congress makes good on that  commitment.", "title": "Clear Communication for Veterans Claims Act", "date": "2025-04-07"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "WTOC's achievement stands as a shining example of professionalism,  collaboration, and a deep commitment to fostering a well-informed  community.", "title": "Recognizing Wtoc-Tv in Savannah, Georgia", "date": "2025-06-26"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "They have fostered a commitment to free enterprise that enables our  local communities to unlock their true economic potential.", "title": "Recognizing Central Pennsylvania Chamber of Commerce", "date": "2025-07-23"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "The National Day of Remembrance for Aborted Children is focused on  helping to humanize our aborted brothers and sisters and deepening the  commitment to ending the injustice of abortion and providing healing to  those who have experienced an abortion.", "title": "Recognizing Pastor Stewart McWilliams", "date": null}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Ellis has shown an unwavering commitment to doing what is best for  his community\n\nDuring his 25 years serving as Chairman of the Smithtown Republican  Committee, Mr.", "title": "Recognizing Mr. Bill Ellis for His Contributions to Long Island", "date": "2025-03-18"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "The idea was  to impose guardrails against the large-scale, indefinite commitment of  U.S.", "title": "Venezuela", "date": "2026-01-08"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Connelly embodies  that calling through his commitment to patient care and medical  education.", "title": "Dr. Tim Connelly Receives 2025 Georgia Physician Hero Award", "date": "2026-01-13"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Speaker, I rise today to highlight the national  security investments in the One Big Beautiful Bill Act, investments  that reaffirm President Trump's commitment to peace through strength.", "title": "Peace Through Strength", "date": "2025-06-25"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Her six- year commitment to Warminster Township has been marked by leadership,  promise to strengthening local government, and an unwavering focus on  the residents of Warminster Township.", "title": "Recognizing Warminster Township Board of Supervisors Judy Hoover", "date": "2025-12-04"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "Despite increasing challenges and adversity, they show up  every day--facing risk and uncertainty--not for the recognition, but  out of a deep commitment to protect and serve their fellow citizens.", "title": "National Police Week 2025", "date": "2025-05-12"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Since assuming this role in  1991, he has earned global respect for his spiritual leadership and  commitment to peace.", "title": "Welcoming Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Their selfless commitment to duty and country deserves the highest  praise from their elected leaders.", "title": "Recognizing Cadet of the Year Recipient Cadet Lieutenant Colonel Mikhail Karnaukh", "date": "2025-03-25"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "3095, united by a shared  commitment to fairness and efficiency.", "title": "Single, Unique Zip Codes for Certain Communities", "date": "2025-07-21"}]