[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…parishioners, celebrated a  touchstone of Rhode Island summers, the Church's 39th annual Cranston  Greek Festival. Thank you for all that you have done for the Cranston  community and the State of Rhode Island.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695489/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…DACA recipients living in Connecticut alone.  They are our friends and neighbors. They are students, nurses. They  have all kinds of jobs that are important to our community and our  State in Connecticut. They are key members of communities, having lived  in the United States for an average of 26 years--that is right, 26  years on average. Ninety-one…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…beyond comprehension. The Twin Cities and all of       Minnesota grieve alongside the victims and their families.       They deserve and have the full support of our community, our       state, and our nation.\n\n``The immediate actions of adults, older children, law       enforcement, EMTs, and medical personnel saved lives. I       commend Governor Walz…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694811/mourning-the-tragic-shooting-at-annunciation-catholic-church-in-minneapolis-minnesota"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…bill passed this week. I encourage  every single Member of Congress, whether they are a Democrat or  Republican to do the same. I say this as someone who represents a  community in the State of Florida, the largest Affordable Care Act  marketplace in the entire country. We have millions of people in the  State of Florida that will be impacted by this, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the Congressional Black Caucus, Congress, and the  constituents who we represent.\n\nMr. Speaker, in the 1880s, my great-grandfather founded a school in  his rural community because the State of Alabama did not provide a good  education to Black children. As explained in his autobiography, he  wanted to teach children, whose parents and grandparents had…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…impose his will on the people.\n\nAnd that is why we have a Senate. That is why we have a House of  Representatives--no taxation without representation--ensuring that each  community, each State, has their own representatives selected in  elections conducted by the voters in that State, by the leaders in that  State.\n\nAnd if the President were to attempt by…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…social work.\n\nPhyllis was a beloved wife, mother, sister, grandmother, and friend.  She embodied the true meaning of public service and made a lasting  impact on her community and state. I ask my colleagues to join me in  recognizing the inspiring life and service of Phyllis Fulton.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Speaker, one of the most important and critical  responsibilities any nation has, any community has, any State has, is  the education of its children.\n\nMr. Speaker, I rise today to highlight the extraordinary work of an  organization from Los Angeles that has lessons for every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, almost 7 years ago, I came to Congress to  serve my community, my State, my fellow veterans, and the country that  I deeply love in a different way than I served it on the battlefield.  When I put the uniform on as a teenager, I swore an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of a glass furnace 8 hours a day in 90 degrees blowing in his face.  That won't happen to people from Harrisburg, largely because they are  more of a middle-class community. They are a State capital. However,  where I come from people work hard for a living. They work in industry  and agriculture every day, and they deserve the attention of the  Government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…efforts of my constituent, Tammy Myers, whose commitment to ensuring  fairness in Michigan's surrogacy laws has brought about meaningful  change for families across our community and state.\n\nTammy Myers was diagnosed with breast cancer in 2015, which resulted  in procedures that left her unable to have children. In 2021, she and  her husband worked with…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691857/recognizing-tammy-myers"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, education is personal to my family. In  the 1880s, my great-grandfather founded a school in a rural community  because the State of Alabama did not think it important to educate  Black children. As he explained in his autobiography, he wanted to  teach the children, whose parents and grandparents…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…deserving of this tremendous honor.\n\nMr. Speaker, I ask my colleagues to join me in congratulating my good  friend, Bobby Brite, on this incredible achievement. Our community, the  state of Michigan, and the United States of America are grateful for  his continued service to our Nation and its heroes.", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690118/recognizing-bobby-brite"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…for the First Circuit.\n\nJosh is an attorney of extraordinary intelligence, extensive  experience, and demonstrated integrity. He is highly respected in the  legal community throughout the State of Maine, and I urge my colleagues  to support his nomination to the First Circuit.\n\nJosh grew up in Vassalboro, ME, and now lives in Scarborough with his  wife…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Bureau of Investigation, who was  honored by the Evans County Sheriff's Office with the 2025 Support  Officer of the Year Award.\n\nSpecial Agent Cephus has served his community and State with  integrity and courage. His work alongside local law enforcement in  Evans County demonstrated steadfast support during critical  investigations and helped to strengthen…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Mr. Speaker, I rise today to recognize and honor Mr.  Dale Greer upon his retirement and to commend him for a lifetime of  service to the Cullman community and the State of Alabama. Over the  course of more than three decades in economic development, Mr. Greer  has helped shape the future of Cullman County through his steady  leadership,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…few suggestions, but our State has absolutely  enormous potential that currently is being dramatically underutilized.  It is truly a sad thing as we see it in every community in this State.  You see your favorite restaurant or another cherished small business  that suddenly closes its doors for good, and you see so many of our  fellow citizens who are…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…northernmost Chabad in  the United States.\n\nIt began with a call from Rabbi Greenberg in Anchorage. He is a great  friend of mine, one of the leaders of our Jewish community throughout  the State. He asked Jay if he could host a young orthodox rabbi and his  wife for a short visit. Of course, Jay, a very generous man, agreed.  ``I think it would be around…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Mr. President, I am down on the Senate floor here to  try to pass two really important pieces of legislation for a great part  of Alaska, and this is the Alaska Native community in my State. These  are incredible, patriotic Americans. By the way, Alaska Natives serve  at higher rates in the military than any other ethnic group in the  country. They are…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…22 earned the rank of Eagle Scout. I had the honor to watch  Colter from a young boy get involved in his community and do things  that mattered, not just for his community but for the State of Montana.\n\nColter hails from Emigrant, Montana, and can now count himself among  the 11 other boys who have achieved the honor since Troop 551 began in  1984.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689243/recognizing-eagle-scout-colter-lumley"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…congratulate the Northwest Florida State  College State championship basketball team on a job very well done.  Their incredible win is inspiring. They have made their community and  the State of Florida very, very proud. God bless. Go Raiders.                    Remembering Captain Allen Colby Brady\n\nMr. PATRONIS. Mr. Speaker, I am privileged to represent…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…leaders across New York.\n\nWhat defines Jerry most, however, is his unwavering loyalty and deep  patriotism. For over four decades, he has worked tirelessly to make his  community, his state, and his country stronger for the generations to  come. In every season--in challenge and in triumph--he has stood firm  in his convictions and committed to the conservative…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692272/recognizing-jerry-sanok-for-forty-years-of-committed-service-and-leadership"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…is not a symbolic vote. It is not messaging. It is not partisan.  This is a test of whether Congress keeps its word not just to  southeastern Colorado but to every community in every State and  district that depends on Federal commitments being honored.\n\nFor those of us who represent the American West, this vote is  personal. In the West, water means…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "…made and soon to be  campaign promises kept.\n\nI spent my entire career in the private sector. I know what those  Trump tax policies did for me and for my business, my community, my  State, and my country.\n\nNow, with this bill, we are going to bring inflation under control,  have energy dominance, make sure that small businesses have certainty  with our…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693155/one-big-beautiful-bill-act"}]