[{"senator": "Josh Harder", "party": "Democrat", "sentence": "…to  succeed.\n\nIn a 2024 interview, she said, ``I've been here. I love this place  because they give a lot of opportunity to everyone.'' Her comments  reflect a clear commitment to making Stockton a place where all  residents--regardless of background--have the chance to thrive.\n\nMr. Speaker, I ask my colleagues to join me in honoring Sovanna  Koeurt…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694721/recognizing-sovanna-koeurt"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…rise in support of this commonsense legislation to  enhance the Office of Rural Affairs at the SBA. I commend  Representatives Goodlander, Wied, and Golden for their commitment to  making this office operate more effectively for rural small businesses.\n\nRural small businesses are powerful drivers of economic growth across  the United States, fueling…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697282/office-of-rural-affairs-enhancement-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Speaker, I congratulate Myesha on her recognition from the  University of Chicago. On behalf of a grateful district and a grateful  nation, I thank her for her service and commitment to making our  Cleveland communities safer.                       Trump's Attacks on Black America\n\nMs. BROWN. Mr. Speaker, there is a saying: When America catches a  cold, Black…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…me  in congratulating several remarkable Girl Scouts from Girl Scouts of  Eastern Missouri for demonstrating extraordinary leadership, refreshing  creativity, and a commitment to making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are trailblazers who address the most pressing  issues…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Adelyn is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4255. She has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…member of Girl Scouts of  Michigan Shore to Shore, Girl Scout Juliette. She has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact by earning  the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693151/recognizing-hannah-davis"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Forte, Ronald  Jackson, and Michael Figures.\n\nBlack history in America is a story of resilience and excellence and  an unshakeable pursuit of justice, an unshakeable commitment to making  this country, as Martin Luther King would say: ``Be true to what you  said on paper,'' for all of us.\n\nFrom the Halls of Congress to the streets of our communities,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…innovation and  empowering families in need, these honorees exemplify the very best of  civic and professional excellence. Each awardee has demonstrated an  unwavering commitment to making a difference--lifting others as they  lead and setting powerful examples for future generations. It is a  privilege to celebrate their accomplishments and recognize…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…need. His work reminds us all that small acts of kindness can have a  profound impact.\n\nI am honored to recognize Steve Martin today. Let's thank him for his  unwavering commitment to making our communities a better place for all.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Paige is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4504. She has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…feedback from the DOJ and the ATF and revised  this bill, but they didn't. The bill before us today poses the same  risk to public safety.\n\nMany of my colleagues share my commitment to making sure law  enforcement has all the tools that they need to keep themselves and our  communities safe. Some of them cosponsored this legislation because  they initially…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…McCrea. Faith is a member of Girl  Scouts of the Sierra Nevada, Troop 1306, and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…colleagues to  join me in congratulating several remarkable Girl Scouts from  Wisconsin's 5th Congressional District for demonstrating leadership,  creativity, and a commitment to making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts help their communities and the world by  identifying…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690499/recognizing-gold-award-girl-scout-recipients"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Victoria is a member of Girl Scouts  of Gulf Coast Florida, Troop 135, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690466/recognizing-victoria-morton-gold-award"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…succeed.\n\nIDEA was an incredible first step in making education possible for  our Nation's students. As we look to the future, we must maintain and  remain steadfast in our commitment to making high-quality, tailored  education possible for every American student.\n\nHere is to another 50 years of IDEA.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697766/50th-anniversary-of-the-individuals-with-disabilities-education-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Cross. Harley is a member of Girl Scouts of  Gulf Coast Florida, Troop 5005, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690443/recognizing-harley-cross-gold-award"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Economic Development  Corporation, the Cross Ell Ranch Corporation, the Permian Basin  Regional Planning  Commission, and the Texas Department of Transportation and their  commitment to making this vision a reality. On behalf of the 19th  Congressional District of Texas, I want to extend a heartfelt thank you  to all involved in this project for their dedication…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692259/recognizing-the-groundbreaking-of-the-crossroads-business-park-in-big-spring-texas"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Graham. Reagan is a member of Girl Scouts of Gulf Coast Florida,  Troop 441 and has exemplified extraordinary leadership, innovative  problem-solving, and a demonstrated commitment to making a lasting,  positive impact, by earning the most prestigious award in Girl  Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…congratulating Wyatt Dickinson. Wyatt is a member of Boy Scout Troop  776 and has exemplified extraordinary leadership, innovative problem- solving, and a demonstrated commitment to making a lasting, positive  impact, by earning the most prestigious rank in Scouting--the Eagle  Scout.\n\nEagle Scouts are recognized as trailblazers who are willing to tackle…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…after all, and I am  grateful for an administration that chooses common sense over caving to  radical, far-left activists.\n\nI thank President Trump for upholding his commitment to making  America safe again and securing our border--promises made, promises  kept.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…an individually registered  member of Girl Scouts of Gulf Coast Florida and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Madisonville and  the Commonwealth of Kentucky.\n\nSelected from nominations all across the State, Mayor Cotton stood  out for his innovative, hands-on approach and tireless commitment to  making a positive difference. He received a record 12 nominations, many  from city staff, who praised his unwavering dedication and lifelong  commitment to the city.\n\nHis…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696906/recognizing-mayor-kevin-cotton"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…spending time outdoors. Dave McMahon is truly a man of strong  character. At every moment, he has continually shown up with integrity,  with professionalism, and with a commitment to making his community  safer. He represents the very best of public service.\n\nOn behalf of the people of South Carolina, I am proud to acknowledge  Dave McMahon for his decades…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Partelow. Dakota is a member of Girl Scouts of  Gulf Coast Florida, Troop 608, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…of Sandy Beaches  Service Unit within Girl Scouts of Southeast Florida, and has  exemplified extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690867/recognizing-hannah-dickinson-gold-award"}]