[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…monstrous  depths?\n\nMr. Speaker, I will tell my colleagues how. We prosecute the murderer  with  the due process he denied Renee and demand accountability up the entire  chain of command. Our job is not to bear their sins. Our job is to make  sure this never ever happens again.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698687/holding-ice-accountable"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…History teaches that unlawful uses of force cannot be excused by  secrecy or by claims of simply following orders. Responsibility does  not vanish up and down the chain of command when the law is violated.  As international tribunals have long made clear, including at  Nuremberg, individuals are responsible for war crimes and unlawful  killings even…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…in my experience in the U.S.  Navy--I spent 25 years in the U.S. Navy--that I have seen during my  career. I am now retired. But during my career, I never saw a President  command the Department of Defense to do things that I felt were outside  the boundaries of what we would consider illegal action against people.\n\nWe have traditionally done this with…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…it.\n\nGeorge Orwell in his famous book ``1984'' wrote of a time when ``The  party told you to reject the evidence of your eyes and ears. It was  their final, most essential command.'' His warning proved pressing  because today the Trump administration asks the American people to  ignore what they see with their own eyes and what they hear with their…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…Whereas, he now prepares to continue his training at the       esteemed Infantry Officer Course, further sharpening his       combat leadership skills and preparing to take command of a       Marine rifle platoon in service to our country; and\n\nWhereas, his achievement marks not only a significant       personal milestone but also a reaffirmation of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…the things he said he was  going to attack, he has ignored. And all the things he has done abroad  are for you to think he is a big tough guy, he is Presidential, he is  in command of something.\n\nI have three brothers. I grew up in a very active household. If you  remember--those of you who got the crap beat out of you the way I did-- when your brothers…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…war, he served as an assistant staff judge advocate  for the 1st Infantry Division, the legendary Big Red One, and later as  a staff judge advocate for the U.S. Army Support Command in Saigon.\n\nIn 1985, he was appointed assistant judge advocate general of the  U.S. Army, capping a distinguished career characterized by integrity,  valor, and commitment…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693452/brigadier-general-donald-wayne-hansen-celebrates-92nd-birthday"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…warplanes over the  Taiwan Strait, encroaching into Taiwanese territory and raising new  concerns about Chinese Government aggression.\n\nThe commander of the U.S. Indo-Pacific Command shared in his April  congressional testimony that the Chinese military pressure on Taiwan  has reached a ``rapid boil.''\n\nMonth after month, the Chinese Communist Party and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…her  exceptional service to our Nation and to the Aurora community.\n\nColonel Dexter has been an outstanding leader during her tenure at  Buckley Space Force Base. Under her command, Buckley has made numerous  advancements in space operations, infrastructure improvements, and  community partnerships. Her dedication to the men and women of Space  Base…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693378/recognizing-colonel-heidi-dexter"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…desk to require the release of video  strikes conducted on September 2, 2025, against designated terrorist  organizations in the area of responsibility of the U.S. Southern  Command; that the bill be considered read three times and passed, and  the motion to reconsider be considered made and laid upon the table.\n\nMr. SCHIFF. Mr. President, first, as my…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…They didn't want  to hear his speaking.\n\nAnd if the internet has got it accurately, the Secretary was there  and delivering her remarks within earshot the whole time. She has  command authority over those agents who are arresting a leader in the  legislative branch.\n\nThis is not something on the internet for us to argue about. We all  know what we saw.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…is political control over  the means of production, welcome to the great socialist state of the  United States of America.\n\nThe other definition, by the way, has to do with command and control.  Those are words we remember from the Communist era, command and  control. Well, holy smokes, there is not a media company, a law firm,  or a university that…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the best interests of the  people of Venezuela, because immediately after the action was taken  against Maduro, the Trump administration lined up behind Maduro's  second in command, who is, as we speak, ramping up the repression of  political speech and political activities in Venezuela. All the bad  actors in the Maduro regime, with the exception of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…professionalism. His genuine care for the well-being of  his personnel has created a strong and cohesive unit, dedicated to the  mission and each other.\n\nUnder Colonel Schmitt's command, Mission Delta 4 has achieved  numerous milestones and advancements, contributing significantly to the  defense of our Nation. His expertise and strategic acumen have been…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693489/recognizing-colonel-ernest-r-bobby-schmitt"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Discovering a passion for  technology transfer and a talent for the intersection of science and  the law, she lent her expertise to the U.S. Army Medical Research and  Materiel Command and the Naval Research Laboratory.\n\nA Marylander to her bones, Maryam prepared for this remarkable career  at the Free State's world class colleges and universities. She's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "James Risch", "party": "Republican", "sentence": "…tracking capability of the missile and causing it to miss the       aircraft.\n\nThe KGV-72 programmable encryption device provides traffic       encryption for Force Battle Command Brigade and Below (FBCB2)       Blue force tracking (BFT) satellite network multicast and       unicast transmission of mapping, short messaging, and       geolocation application…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…has devoted himself to the service of our Nation. It is  appropriate that we honor him today by expressing our gratitude for his  dedication and wishing him well on his new command.\n\nAnd while he may not be able to push the ``abort mission'' button, I  know that when the pressure rises, Commander Russell will rise higher.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "French Hill", "party": "Republican", "sentence": "…systems in the Small Arms Weapons Expert and Squad Designated  Marksmanship programs.\n\nThe Arkansas National Guard is actively working to gain U.S. Army  Training and Doctrine Command (TRADOC) accreditation for the NGMTC.\n\nMy amendment requires the Secretary of the Army to do the following:\n\nDesignate the NGMTC as a TRADOC institution.\n\nMake the Small Arms…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695158/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…a GPS/PPS aided       navigation system provided by SAASM or M-Code.\n\n6. The AN/PRC-160 is a high frequency tactical radio       communications for vehicular and dismounted command and       control operations. The final end-items are L3Harris AN/PRC-      160 multi-channel manpack radios with a Micro Global       Positioning System (GPS) receiver application…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…prior  administration. To put that in context, the entire Federal budget is  about $7 trillion per year.\n\nDo you know what the difference is between a tax and a regulatory  command, Mr. Speaker? With a tax, the Federal Government says to, in  this case, a small business owner: Give me your money, and we will  spend it on priorities that we decide. With…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Sales (FMS) case EN-B-UFJ was below the congressional       notification threshold at $10.18 million ($3.1 million in       MDE) and included twelve (12) Javelin Lightweight Command       Launch Units (LwCLUs); LwCLU Basic Skills Trainers; Javelin       missile simulation rounds; Battery Coolant Units; spare       parts; tool kits and support equipment;…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…what the  Chairman of the Joint Chiefs is--his senior military adviser. The  President needs to feel comfortable with that person. That person is  actually out of the chain of command. We have seen throughout history  that when the President doesn't feel comfortable, he can remove one  general and bring in another one. That is what has happened here.\n\nWe…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…University and completing the  Air Force's Continuous Process Improvement Green Belt Program.\n\nDuring his career, Evan has served with distinction at the Squadron,  Wing, and Major Command levels, both stateside and overseas at Bagram  Air Base, Afghanistan, and RAF Mildenhall, United Kingdom. His previous  assignments include experience as Operations Officer,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…base.\n\nAfter serving in elected office, Steve remained highly integrated in  the Hill community by serving as the vice president of the Utah Defense  Alliance, as air combat command civic leader, and three terms as  honorary commander. In each of these positions, Steve worked directly  with servicemembers and leadership stationed at Hill to better  understand…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…maybe  even buy you the technology, buy you the things to do that, and make a  profit.\n\nWe are right now going to have to make a decision as a body. Are we  going into the command and control and try to starve the beast, or are  we going to build a model that incentivizes doing it better, faster,  cheaper, and in this case, much, much healthier.\n\nWe…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to them for the  benefit of others. Positional authority: titles, credentials, degrees  give only the opportunity to lead but it is the actions in behalf of  others that can command, inspire and motivate change and moral behavior  in others. A servant leader has submitted himself to his higher nature  and asks, `What is wanted of me?'\n\n``A servant leader…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "James Risch", "party": "Republican", "sentence": "…hundred sixteen (116) M1A1 Abrams       Main Battle Tanks; twelve (12) M88A2 HERCULES Combat Recovery       Vehicles; eight (8) M1110 Joint Assault Bridges; six (6)       M577A3 Command Vehicles; twenty-six (26) M1152A1 High       Mobility Multipurpose Wheeled Vehicles (HMMWV); twenty-six       (26) M1279A1 Joint Light Tactical Vehicles (JLTV); one…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…significantly increased in 2023 compared to pre-invasion  levels.\n\nThese semiconductors are critical key aspects to the Russian war  effort, including economic and electronic warfare, command and control,  and targeting. These components allow Russia to terrorize Ukrainian  civilians with ballistic missile strikes, as well.\n\nThe prevalence of U.S. manufacturing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690678/economic-espionage-prevention-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Implementation of this proposed sale will require       approximately five U.S. Government and fifteen contractor       representatives to travel to the United States European       Command to support training and periodic meetings.\n\nThere will be no adverse impact on U.S. defense readiness       as a result of this proposed sale.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694901/arms-sales-notification"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…a civilian  capacity, where he rose through the ranks of Senior Executive Service.  He is currently serving as Executive Director of the 96th Test Wing,  Air Force Materiel Command at Eglin Air Force Base in Florida.\n\nThe position he is nominated for is essential to ensure our military  installations remain strong, our energy policies support mission…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}]