[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…spent  on advertisements praising Donald Trump. How do they justify this? They  aim these at their own base, to tell their own base: Hey, Donald Trump  is great. Here is a commercial to tell us that.\n\nThey claim that these ads are aimed at undocumented immigrants and  that somehow, by watching a 30-second ad, the immigrants are going to  say: Oopsy-daisy,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…childcare and housing. Many have asked me to stop the  scourge of gun violence in our communities.\n\nNot a single person, not one, wrote about loosening regulations on  their commercial walk-in coolers and refrigerators.\n\nWhy, then, are those the bills that Republicans brought to the floor  this  week? Maybe it is because Republicans don't have solutions…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689192/addressing-constituents-most-important-issues"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Deputy Assistant Secretary of       State; Ellen Conway, Senior Foreign Service Officer, retired;       Frances Cook, US Ambassador, retired; Sarah Cook, Senior       Foreign Commercial Service Officer, retired; Thomas       Countryman, Former Assistant Secretary of State; Ruth Davis,       US Ambassador, retired, Former Director General of the US…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…yet it provides  essential services to every citizen in every part of this country.  That's roughly $1.60 per taxpayer. Public media is the country's only  local, no-cost, commercial-free, nonprofit news and information  service, and passing this bill puts this service at great risk. For  stations like Minnesota Public Radio, valued services will be eroded.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…contracts subject to the Federal Acquisition Regulations  System--that is the Department of Defense and Department of Veterans  Affairs. This means that while Medicare and commercial-plan  beneficiaries will be able to access  the drugs captured by the BIOSECURE Act, veterans and service members  could be alienated from treatments and cures that are available…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698004/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…2025.\n\nThis bipartisan legislation reauthorizes funding for the U.S. Coast  Guard through 2029, updates and restructures Coast Guard programs and  policies, and supports the commercial maritime industry. It is the  result of good faith, bipartisan negotiations between Chair Graves and  Chair Ezell, myself, and Ranking Member Carbajal, and it includes  important…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of Westchester County and surrounding counties.\n\nThose to be honored include:\n\nThe Gabelli Leadership Awards will be given to Paul Adler, chief  strategy officer of Rand Commercial; Adam Hammerman, vice president and  CEO of New York Medical College; and Brad Schwartz, a partner at Zarin  & Steinmetz law firm.\n\nThe Friedland Young Leadership Awards…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698121/recognizing-jewish-business-network-awardees"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…and gas industry wanted him to veto it. And  that law ultimately did pass, and it covered 13 major appliances-- kitchen refrigerators, dryers, air conditioners, and, yes, commercial  refrigerators. And since then, the number of appliances has more than  quadrupled.\n\nHere is the way you should think about it. We need big electrical  generating facilities…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…wildfire suppression for 10 years.\n\nThis bill reauthorizes the Secretary of Defense to sell excess  Department of Defense aircraft and aircraft parts, which are acceptable  for commercial sale to persons or entities that contract with the  government for the delivery of fire retardants or water by air to  suppress wildfires. The aircraft and parts could only…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691859/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…our  Nation's blue economy.\n\nWe know that four of the five national marine sanctuaries in  California generate more than $114 million a year and support over  1,800 jobs in commercial fishing alone.\n\nH.R. 261 is a giveaway to megacorporations at the expense of the  American taxpayer, the oceans, and the Great Lakes we have advocated to  protect.\n\nSome…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…economic engine is a hub for land, rail, and air  cargo, driving billions in trade annually and supporting families  across both nations.\n\nBut Laredo is more than just a commercial gateway--it is a cultural  cornerstone. From the Washington's Birthday Celebration, one of the  oldest and largest of its kind in the country, to our strong  educational…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…every day,  whether it is drug interdiction, obviously doing the work in terms of  our coastal, littoral regions of the country, and making sure we have  safe passage of commercial and civilian maritime activity.\n\nIncluded in this bill is a provision to reach out to our great ally  Finland to update and modernize our icebreaker fleet. Our Polar Star…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Great Lakes,  our Nation's third and longest coast, we rely on a strong, capable  American shipping fleet. Our economy depends on it.\n\nMARAD supports 13 public and 50 commercial ports across the Great  Lakes and the St. Lawrence Seaway.\n\nIn my district in northwestern Ohio, the Port of Toledo and Sandusky  Harbor connect us to global markets for…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698300/in-support-of-marad"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…representation in  Congress. I have introduced H.R. 51 to do so.\n\nPursuant to the Admissions Clause and District Clause of the  Constitution, H.R. 51 would admit the residential and commercial areas  of D.C. as a new State. Statehood would not only give D.C. voting  representation in Congress, but it would also give D.C. full local  self-government.\n\nMr. Speaker,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…put an ad up here, which some of you may recognize.\n\nIn 2023, Illinois company AbbVie spent $350 million on TV ads for  Rinvoq, an eczema and arthritis drug. Nowhere in the commercial do they  tell you the cost as publicized and released by the drug company-- $6,100 a month for this drug.\n\nA lot of good news, if you are going to go out canoeing and white…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…joined the local radio  station WJNZ, formerly known as WXTA, as the sales manager in 1969.\n\nIn 1977, Jinsie Bingham became the first woman in Indiana to own and  operate a commercial radio station. She ran WJNZ, which is now known as  WREB and serves Greencastle to this day. In 1996, she received the  Lifetime Achievement Award from the Indiana Chapter…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…``Energy Conservation  Program for Appliance Standards: Certification Requirements, Labeling  Requirements, and Enforcement Provisions for Certain Consumer Products  and Commercial Equipment'', and ask for its immediate consideration.\n\nThe Clerk read the title of the joint resolution.\n\nMr. GRIFFITH.  Res. 42.\n\nMr. GRIFFITH. Mr. Speaker, I am prepared…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…abusing the American surrogacy industry to  obtain U.S. citizenship for their children and traffic infants abroad.  Most of the developed world has already banned international commercial  surrogacy due to the trafficking risks, and this bill is a strong step  in the right direction to prevent bad-faith actors from taking  advantage of U.S. surrogate mothers…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Service contractor when determining which penalty to apply       (if any).\n\n(f) Crash Defined.--In this Act, the term ``crash''--\n\n(1) means an occurrence involving a commercial motor       vehicle operating on a highway in interstate or intrastate       commerce which results in--\n\n(A) a fatality;\n\n(B) bodily injury to a person who, as a result…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Mr. LaHOOD. Mr. Speaker, I rise to enter into a colloquy with the  gentleman from Missouri regarding the termination of the commercial  clean vehicles credit in the One Big Beautiful Bill Act.\n\nIs it your understanding and intent, Chairman Smith, for the purposes  of this provision, vehicles shall be treated…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693196/one-big-beautiful-bill-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the Office of Energy Efficiency and Renewable       Energy, Department of Energy relating to ``Energy       Conservation Program: Energy Conservation Standards for       Commercial Refrigerators, Freezers, and Refrigerator-      Freezers''. All points of order against consideration of the       joint resolution are waived. The joint resolution shall…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to stop the execution of Federal law from being  disrupted.\n\nThe judges looked at the facts on the ground and said when Molotov  cocktails are thrown at officers, when a commercial dumpster is used as  a battering ram in order to break into a Federal office building's  parking lot, when roadways are shut down, this looks a lot like there  is a disruption…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…prevent economic growth. They are blocking the 100- percent expensing of qualified nonresidential manufacturing and  property production and improvements that help fuel such commercial  investment.\n\nFinally, the D.C. Council is blocking the full and immediate  expensing of a business' domestic research and experimental  expenditures. They apparently would…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…technology can  serve humanity.\n\nThe drone delivery was made possible through an extraordinary  collaboration among several visionary partners:\n\nFlirtey, a pioneering startup in commercial drone delivery (including  co-founder and chief executive officer Matthew Sweeny; co-founder and  chief operations officer Tom Bass; advisory board member Shyam  Chidamber);…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Consumer Gas-Fired  Instantaneous Water Heaters, will create a structural imbalance. This  imbalance results from the Biden administration's issuance of an  efficiency rule for commercial tank and tankless water heaters in  October of 2023, as well as residential tank-filled water heaters in  April 2024, neither of which could be overturned by the Congressional…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690091/hj-res-20"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…land, a fact that  reflects positively on the Tribe's stewardship capabilities and deep- felt concern for the land's overall health.\n\nCurrently, the Tribe has no immediate commercial or development plans  for these parcels. Pursuant to the Indian Gaming Regulatory Act, gaming  on these lands is prohibited.\n\nI applaud Mr. McClintock for working with the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Federal agencies to counter, contain,       trace, or defeat unmanned aircraft systems at or near the       borders.   Counterintelligence Threats to United States Civil and Commercial Space                                 Interests\n\nThe Committees are concerned with counterintelligence       threats to the National Aeronautics and Space Administration…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…rule  submitted by the Office of Energy Efficiency and Renewable Energy,  Department of Energy relating to ``Energy Conservation Program: Energy  Conservation Standards for Commercial Refrigerators, Freezers, and  Refrigerator-Freezers'', and ask for its immediate consideration in the  House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. GUTHRIE.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…have to stop.\n\nThis final rule that we will overturn today imposes unnecessary and  duplicative labeling, certifying, and reporting requirements for  various appliances and commercial equipment. This is part of a broken  system that needs major reforms. The American people are done paying  for it with higher costs, created by government bureaucrats, for…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688546/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…decade of strategic planning and  investments, the U.S. Army Corps of Engineers awarded a lease site for  Tony Sloan and his business partner, Tom Allen, to build a new  commercial marina on Lake Cumberland, the first in over 60 years. When  Marina at Rowena opened in 2017, Tony revived the storied life of  Rowena, a once-bustling community located…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}]