[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…GOTTHEIMER. Mr. Speaker, I rise to celebrate the safe return of  New Jersey native Edan Alexander. This was a moment of profound relief  and gratitude for his family, our community, and our Nation.\n\nMy constituent Edan Alexander, from Tenafly, New Jersey, is an all- American kid who graduated from Tenafly High School and swam on the  swim team. He could be…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693449/welcoming-home-edan-alexander"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Military Officers Association of America. Pat has approached her work  as a liaison with immense passion and commitment, exemplifying the  virtues of service to her community and Nation.\n\nPat has continuously shown the highest standard of care to veterans'  surviving spouses, advocating for legislation that supports them,  helping them access healthcare…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…parents, and members of the ice-skating  community. These folks had their whole lives ahead of them. It is a  tragedy that has had a profound and lasting impact on our community and  our Nation.\n\nThis week, the families of the victims are here on Capitol Hill, and  I got to speak with them today. They have one message for us: Pass the  ROTOR Act.\n\nThe ROTOR…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700113/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Thanks to our efforts in recent years, significant improvements have  been made in combating the opioid overdose epidemic that has devastated  families in every community throughout our Nation, but those  improvements are now threatened as the Trump administration guts the  very programs and funding that have helped us turn the corner.\n\nIn the past few…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…colleague, the late  Congressman Gerry Connolly also served on the Adams Commission until  his passing earlier this year. Gerry dedicated his life to serving his  community and our Nation and stood for what was fair and just, as did  our former Presidents John and John Quincy Adams.\n\nCongressman Connolly is deeply missed, and the remaining members of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the 2024  races. That is a sixfold increase in 6 years. That is the rich and  powerful buying their government. It is an absolute travesty.\n\nNo one in the founding community of our Nation who wrote the  Declaration of Independence, who wrote the Constitution, wanted to  design a system where the megarich ran the place as a cabal of elites,  but that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…honoring rick whittington\n\nMr. CORREA. Madam Speaker, I rise today to honor the career of Rick  Whittington and his valuable service to our community and our Nation.\n\nMr. Whittington was a U.S. Navy veteran and served as a member of the  Seabees during the Vietnam war. He made honorable contributions to the  fight as a member…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…keep everyday  Americans safe from the scourge of gun violence, and we will not stop  fighting for proven policies that we know will reduce gun violence in  every community throughout our Nation.\n\nI encourage my colleagues to support the resolution introduced by  Congresswoman Debbie Wasserman Schultz to commemorate the tragic event  that occurred on January…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…that essentially  created Goodwill Industries throughout the country.\n\nPlease join me in thanking Goodwill Industries for 100 years of  service and dedication to our community and to our Nation.             Congratulating Students of Magnolia Science Academy\n\nMr. CORREA. Mr. Speaker, I rise today to congratulate the students of  Magnolia Science Academy…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "John Carter", "party": "Republican", "sentence": "…State programs. Commander Lux is a devoted  husband to his wife, Michelle, and a proud father to their two  children.\n\nI commend Commander Lux's dedication to his community and our Nation.  I join his colleagues, family, and friends, in honoring his career,  saluting his commitment to public service, and celebrating his  outstanding achievements.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…to call him our friend. I ask  my colleagues to join me in wishing Mr. Drinkard a very happy 105th  birthday and in thanking him for a lifetime of service to his community  and to his Nation.\n\nMay God bless Roy Drinkard and his family, and may God bless the  United States of America.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693675/happy-105th-birthday-to-roy-drinkard"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Security benefits, safeguard our food and water,  care for our veterans, and respond whenever a disaster strikes. Their  work is essential, and its impact reaches every community across this  Nation.\n\nMr. Speaker, by restoring their collective bargaining rights, we  strengthen a system that keeps government effective, stable, and  responsive, all without compromising…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697991/protect-americas-workforce-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…advancements for America show that my community will  continue to be a national leader in the aerospace industry.\n\nI again commemorate all of the great work being done in my community.  The Nation thanks you. We have more advancements ahead being developed  in California's aerospace valley. I look forward to a future of growth  and innovation with California's…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "John Carter", "party": "Republican", "sentence": "…of  St. George, underscoring his outstanding contributions to both the Army  and his country.\n\nAfter retirement from the Army, COL Patterson continued serving his  community and the Nation. He leveraged his expertise to improve  efficiency while working with several U.S. Defense Contractors. In  partnership with the University of Texas and the US Army,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…award from the Greater Celina Chamber of Commerce. I am pleased to  recognize him today for a lifetime of public service and continued  commitment to advancing our community and nation.\n\nIt is an honor to bestow Andy with the Patriot Award for his  exceptional service to the people of North Texas.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690707/recognizing-congressional-patriot-award-recipient-andy-hopkins"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…also have learned is that, globally, this has turned into a  $150 billion-a-year business. This is something that we also have  learned affects every town, city, and community in our Nation. It is  pervasive.\n\nIn Tennessee, my home State, there were 1,170 reports of human  trafficking through November of last year, and that is according to the  data we…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…community and a friend to all.\n\nAs Mary prepares to retire from Signature Aviation, I wish her well  in all her endeavors and thank her for her service to the aviation  community and the Nation. I am confident she will continue to be an  influential advocate for General Aviation (GA).", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}]