[{"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…among us.\n\nIt is clear Shawn Woodruff has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…process.\n\nIt is clear that Tyrone Young has made a profoundly positive impact  on our community, and I am grateful for his service. May we all strive  to serve our communities with the same dedication and humility.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…culture.\n\nIt is clear Emily Mazzaro has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hero.\n\nIt is clear John Wajdowicz has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690801/recognizing-john-wajdowicz"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the area.\n\nIt is clear Mika Rotunda has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691741/recognizing-mika-rotunda"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…busy.\n\nIt is clear Jerry Phillips has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…grace.\n\nIt is clear Joanne Gillespie has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Calling.\n\nIt is clear Judy Salvador has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690992/recognizing-judy-salvador"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Eagle.\n\nIt is clear Dean Lancaster has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…It is clear that Barbara Sprague has made a profoundly positive  impact on our community, and I am grateful for her service. May we  all strive to serve our communities with the same dedication and  humility.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…service.\n\nIt is clear Cindy Gandy Mahon has made a profoundly positive impact  on our community, and I am grateful for her service. May we all strive  to serve our communities with the same dedication and humility.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…It is clear that Jennifer Mankotya has made a profoundly positive  impact on our community, and I am grateful for her service. May we all  strive to serve our communities with the same dedication and humility.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690691/recognizing-jennifer-mankotya"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…clear that Kimberly Godding Brooks has made a profoundly  positive impact on our community, and I am grateful for her service.  May we all strive to serve our communities with the same dedication and  humility.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…impact on  our community through her work as part of the Pasco County Human  Services Team, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…process.\n\nIt is clear Ronnie Hutton has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}]