[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Trump has slapped with taxes, there is  already a comprehensive trade deal between the United States and  Canada. It was written with input from the Senate Finance Committee,  and it was bipartisan. USMCA was a trade deal negotiated by Donald  Trump himself, and it got a significant bipartisan vote.\n\nCongress approved the deal, put it into black-letter law,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…recognize the efforts of all of the staff that  were involved in bringing us to this point to get the bill to the  floor: certainly the House Armed Services Committee staff, and the  bipartisan staff, ably led on both sides of the aisle.\n\nThis is a long process. Thousands of amendments are generated,  thousands more ideas that they have to work their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…evade, and perjure herself. What a truly  disgraceful episode.\n\nThis is not a partisan issue. In fact, both the chair and ranking  member of the Senate Armed Services Committee, in a bipartisan manner,  requested that the Pentagon investigate the use of the Signal app to  share classified information.\n\nWe can all agree that no government employee, let alone…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…families who will have to spend more for safe drinking water and access  to water-related recreational areas if such resources are even still  available.\n\nMembers of this committee on a bipartisan basis have supported  predictability in regulating clean water, and there is another way. We  don't have to choose between clean water and a robust economy. We can…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…fentanyl analogue. Kids in your State and my  State think they are taking Adderall, not realizing that this has those  toxic things that can kill.\n\nHere we were in committee, with a bipartisan test strip bill, and my  colleague's partner Senator said: This makes sense to me. And the one  excuse they were using for not doing a bipartisan bill to give us…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I thank Senator Welch and Senator  Marshall and my colleagues who are here today and all the members of  the Senate Agriculture Committee for their bipartisan work on this  legislation.\n\nThis legislation rightfully provides more options for parents,  students, and teachers, which will benefit our children and their  families.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697063/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…reintroducing this  legislation. I am pleased to be an original cosponsor of this bill and  continue working with Congressman Lucas with whom I collaborated on our  Committee's bipartisan work.\n\nH.R. 1325 is a no-nonsense, good government bill that amends existing  statute to conform with updated regulatory guidelines. This legislation  also directs…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688997/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…step toward understanding and improving our  cybersecurity for the safety and protection of all Americans. It passed  overwhelmingly in the Energy and Commerce Committee. This is a  bipartisan bill. I thank the staff on both sides of the Energy and  Commerce Committee, Republican and Democratic, for helping us put this  together.\n\nMr. Speaker, I urge…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693424/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Russia hoax and that assessment, which  this administration continues to disparage, was a coordinated,  unanimous finding by the entire intelligence community. Our committee-- on a bipartisan, unanimous basis--reviewed it and validated it  extensively. Not a single one of my Republican colleagues objected to  its findings, including the current Secretary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the Nation.\n\nThat is why I have also submitted a $1.5 million funding request to  make sure the Sharp gets the upgrades that it needs.\n\nThe ANCHOR Act passed out of committee with bipartisan support, and I  urge my colleagues to vote to get it over the finish line.                            Betraying Our Veterans\n\nMs. McBRIDE. Mr. Speaker, earlier this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…breakthroughs, which  could save you or your loved one from suffering, this administration  has cut them off at the knees.\n\nI am pleased that the Senate Appropriations Committee, on a  bipartisan basis, rejected Trump's proposed cuts and actually provided  an increase for next year. But if the administration ignores Congress's  wish and continues to upend…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…hard-working dairy farmers across Kansas  and across America.\n\nThis summer, the Senate Agriculture Committee worked together to pass  this legislation through the committee on a bipartisan basis. Special  thanks to our chairman and to our ranking member for working on this  with us.\n\nThis bill will allow for whole and reduced milk, as well as  nutritionally…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…good  friend and fellow Arkansan Chairman Westerman for advancing my bill  from the committee to the House floor.\n\nI thank all the members of the Natural Resources Committee for their  bipartisan and unanimous support.\n\nAs noted, my bill seeks to transfer ownership of a vacant Federal  building owned by the U.S. Forest Service at 1069 Fourche Avenue in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…is a philosophy that it is better in our backyard. We do it  better than anybody. Look at the unions that are supporting this piece  of legislation. It came out of committee in a bipartisan fashion. This  is what the American people want, bipartisan work. Here it is.\n\nI look forward to this bipartisan piece of legislation that  strengthens our national…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…provide an avenue for small businesses to engage with  the SBA Office of Advocacy, a voice that is focused on advocating for  Main Street.\n\nThis bill passed out of the committee on a bipartisan basis, and as  chairman, I am committed to getting our Members the information they  need to support Main Street.\n\nUltimately, this information will come as an annual…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…thank Chairman Smith for his leadership on the Committee on Ways  and Means and all of the Members on the other side of the aisle who  helped shoot it out of the committee on such a bipartisan basis. I  thank Chairman Smith for his commitment to strengthening fairness and  accountability within our tax system.\n\nMr. Speaker, I urge my colleagues to support…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Senate floor? Why  have 62 of the 139 civilian nominees the Senate has confirmed so far  been confirmed with Democrat support? Why are Trump nominees emerging  from committee with bipartisan support? Is the Democrat leader  suggesting that his own Members are supporting historically bad  nominees?\n\nOn Monday, the Senate Judiciary Committee chairman came…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Mr. SCOTT of Florida. Mr. President, the nominees I will discuss  today were approved by the Armed Services Committee with bipartisan  support. Republicans and Democrats agreed they are qualified and ready  to serve. President Trump was elected in a landslide, and the American  people expect and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}]