[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "Foushee is very much a leader on the Science, Space, and  Technology Committee, a cutting-edge voice in artificial intelligence,  a ranking member on the Space and Aeronautics Subcommittee, and we are  very grateful for her leadership and acumen here.", "title": "Innovative Mitigation Partnerships for Asphalt and Concrete Technologies Act", "date": "2025-03-24"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "So I was a ``no'' vote in committee.", "title": "Nomination of Frank Bisignano", "date": "2025-05-05"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Balint), a distinguished member of the  House Committee on the Budget.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "As the ranking member of the Committee on Education and Workforce, I  am particularly outraged that Republicans want to partially fund these  tax cuts for corporations and billionaires by making cuts to education  programs and child nutrition programs.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "She served on the Joint  Budget Committee for 6 years, serving as vice chair and later  chairwoman, ensuring that corporate loopholes were closed while still  protecting small businesses.", "title": "Recognizing Colorado State Representative Shannon Bird", "date": "2026-01-08"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "I am the ranking member of the damn Rules Committee, and I have a  question.", "title": "Raising A Question of the Privileges of the House", "date": "2025-03-05"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "As an Air Force veteran and vice ranking member on the Committee on  Veterans' Affairs, I believe it is not only crucial but imperative that  our government support our Nation's veterans in every possible way.", "title": "Successful Entrepreneurship for Reservists and Veterans Act", "date": "2025-02-24"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Earlier this week in the Rules Committee, we heard Republicans  claim that we need to weaken oversight of private crypto because doing  so will help cross-border payments.", "title": "Anti-Cbdc Surveillance State Act", "date": "2025-07-17"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, I want to correct the gentlewoman because last night in  the Rules Committee she said that five of these bills didn't receive  any amendments.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Cleaver, and I am  proud that it includes 20 housing provisions and five banking  provisions championed by committee Democrats.", "title": "Housing for the 21st Century Act", "date": "2026-02-09"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "The Department of Education's RISE Committee is offering a proposal  to downgrade the professional status of various careers that they  think, after many years, don't deserve academic stature and access to  vital funding.", "title": "Bringing Attention to Anti-Education Agenda", "date": "2025-12-04"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "For this reason, at the appropriate time I will offer a motion to  recommit this bill back to committee.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "This package includes two partisan proposals marked up in the  Education and Workforce Committee.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "This is an issue which was the subject of exhaustive  hearings at the Oversight and Government Reform Committee over the last  8 years.", "title": "Supporting Our Coast Guard", "date": "2025-07-22"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "(f) Waiver.--The President may waive the application of       sanctions imposed with respect to a foreign person under this       section if the President certifies to the Committee on       Foreign Affairs of the House of Representatives and the       Committee on Foreign Relations of the Senate not later than       15 days before such waiver is to take effect that the waiver       is crucial to the national security interests of the United       States.", "title": "Sanction Sea Pirates Act of 2025", "date": "2025-06-23"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "I thank Agriculture Committee members for their continued work in  developing and advancing this policy.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "James Lankford", "party": "Republican", "sentence": "We have a bill that is a bipartisan bill that has come out of the  Finance Committee that we have unanimous support for--tell me how often  that happens in this body--but that we can't seem to get to the floor.", "title": "-9999", "date": "2025-12-10"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "The Committee on Small Business has heard testimony from hundreds of  small business owners from across the country who repeatedly tell us  that excessive regulation is stifling their operations and undermining  their bottom line.", "title": "Small Business Regulatory Reduction Act of 2025", "date": "2025-12-02"}, {"senator": "James Risch", "party": "Republican", "sentence": "The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign Relations Committee.", "title": "Arms Sales Notification", "date": "2025-10-06"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "As chairman of the House Agriculture Committee, I understand the  vital importance of shaping the next generation of farmers, ranchers,  and producers.", "title": "National Future Farmers of America Week", "date": "2025-02-24"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "This bipartisan bill, which I am proud to lead with Chairman Bost and  Representative Budzinski, the ranking member of the subcommittee that I  lead on Chairman Bost's committee, will make it easier for veterans to  access the care and benefits they have earned by making significant  improvements to our overly complicated claims process.", "title": "Clear Communication for Veterans Claims Act", "date": "2025-04-07"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Passing the resolution before us will allow committees to  thoughtfully craft and debate legislation to extend the 2017 Trump tax  cuts, averting a $4 trillion to $5 trillion tax increase on the  American people, and to use our resources to generate more revenue and  to cut wasteful spending.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "This is a measured, practical bill that passed unanimously in  committee, and it deserves the support of this House on both sides of  the aisle.", "title": "Tax Court Improvement Act", "date": "2025-12-01"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "It has  been endorsed by President Trump and also by the chairman of the House  Appropriations Committee,   Tom Cole.", "title": "District of Columbia Local Funds Act, 2025", "date": "2025-03-14"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "The Dietary Guidelines Advisory  Committee reported that over two-thirds of school-age children fail to  meet the recommended levels of dairy.", "title": "Whole Milk for Healthy Kids Act of 2025", "date": "2025-12-15"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Her commitment extended to the  national level, serving on the National DAV Executive Committee from  2023 to 2024.", "title": "Recognizing Mary Ann Keckler", "date": "2025-12-09"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "On Tuesday, the Senate Foreign Relations Committee Subcommittee on  East Asia, the Pacific, and International Cybersecurity Policy held a  hearing on China's challenge to America's leadership when it comes to  artificial intelligence.", "title": "China", "date": "2025-12-04"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Speaker, I thank Chairman Smith for his leadership and for making  tax administration and improved efficiencies a priority within the Ways  and Means Committee.", "title": "Electronic Filing and Payment Fairness Act", "date": "2025-03-31"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Thompson), my colleague  on the Ways and Means Committee.", "title": "-9999", "date": "2026-01-08"}]