[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…This will allow Congress to regularly  make a more informed decision about whether or not these maximum  coverage amounts should be increased.\n\nMr. Speaker, this is commonsense legislation that allows Congress to  better do our job to support servicemembers, veterans, and their  families. This legislation passed the House last Congress, and I  encourage…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689628/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…follows the law and ensures  Appropriated and obligated funds are used for their intended purpose.\n\nI urge our colleagues on both sides of the aisle to support this  commonsense legislation.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…in  restorative justice programs that teach children how to resolve their  conflicts without violence.\n\nIf Republicans cared about our kids, then they would support  commonsense legislation to prevent school shootings.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill to keep  our babies safe from trauma, abuse, and fear.\n\nIn the words of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…with service-connected disability, which will help to ensure that  surviving family members receive the benefits that they are entitled to  in a timely fashion.\n\nThis commonsense legislation will provide the information that we  need to ensure that our veterans are getting the best possible care,  which is a goal that we all share.\n\nMr. Speaker, I will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…has said that, in addition to  the tariffs, the uncertainty is as difficult for them as the tariffs.\n\nSo I am disappointed that Senator Crapo decided to block this  commonsense legislation. Sadly, I am not surprised. But this bill would  do so much to help families and businesses in all of our States. It  would shield them from higher costs.\n\nWe have…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of this commonsense legislation to  enhance the Office of Rural Affairs at the SBA. I commend  Representatives Goodlander, Wied, and Golden for their commitment to  making this office operate more…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697282/office-of-rural-affairs-enhancement-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…are taking  the affordability crisis very seriously. We hear the concerns of the  public, and we strongly urge our Republican colleagues to come to the  table to pass commonsense legislation that brings prices down for the  American people.\n\nMr. Speaker, I stress again that the President promised to cut  Americans' power bills in half. Instead, he and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…manufacturing by fostering an innovation pipeline  that creates jobs and enhances our competitiveness on the world stage.  This bill does just that.\n\nWith this commonsense piece of legislation, everyone wins. It will  help us achieve measurable and meaningful emissions reductions,  modernize manufacturing, and improve workers' health and public health,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Mr. Speaker, this bill passed the Committee on Ways and Means with  overwhelming bipartisan support. I urge my colleagues on both sides of  the aisle to support this commonsense legislation.\n\nMr. Speaker, I think this is a commonsense bill, and I am so happy  that our colleagues thought it appropriate to bring it forward to help  older Americans make…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697233/claiming-age-clarity-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…private firms would be, for example, as you have heard, Mr.  Speaker, blockchain analytics firms or the financial intelligence units  within corresponding banks.\n\nThe commonsense legislation seeks to enhance the tools at our  disposal to investigate sanctioned individuals and entities and to hold  bad actors accountable, and that is very important.\n\nThis…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693943/ofac-licensure-for-investigators-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…statutes frequently with respect to the bail determination that is made  in all of these criminal cases at some point or another.\n\nMy colleague talked about this being commonsense legislation, but the  D.C. bill is patterned on the Federal Bail Reform Act. I note that  there is no effort to amend that here or change it in the way that has  been proposed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696977/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…Means Committee for their work on this  bill.\n\nWith his work, I rise today to support this legislation, the Chronic  Disease Flexible Coverage Act. This is bipartisan, commonsense  legislation to allow predeductible health coverage for chronic disease  patients with a high deductible health plan, otherwise known as HDHP.\n\nThis commonsense legislation, as…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…support  H.R. 3174 that supports American manufacturing, and I reserve the  balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support  this commonsense legislation, and I yield back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…partnering with me on  this legislation. I was happy to see it pass out of the Committee on  Financial Services with unanimous support. I urge my colleagues to  support this commonsense legislation.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692758/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…misguided regulations, starting with the Department  of Energy's appliance rule.\n\nI thank Chairman Guthrie, Chairman Griffith, and House leadership for  prioritizing this commonsense legislation.\n\nMr. Speaker, I urge my colleagues to support its final passage to  protect consumer choice, reduce costs, and eliminate unnecessary  regulatory burdens.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…WILLIAMS of Texas. Mr. Speaker, I have no further speakers, and I  am prepared to close.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support  this commonsense legislation, and I yield back the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, on that I demand the yeas and  nays.\n\nThe yeas and nays were ordered.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Mr. BABIN. Mr. Speaker, I have no further requests for time, and I am  prepared to close. I continue to reserve the balance of my time.\n\nMr. Speaker, H.R. 1534 is commonsense legislation that passed  unanimously last Congress. It has the support of major industry  associations, including the Portland Cement Association, the National  Asphalt Pavement…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Transparency Act.\n\nI thank the gentlewoman from Texas, Congresswoman De La Cruz, for  sponsoring this legislation.\n\nThe HUD Transparency Act of 2025 is a piece of commonsense  legislation that strengthens accountability, enhances oversight, and  ensures the American people have a clear view into how Federal housing  dollars are spent.\n\nFor years, the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…harmonize IRS deadline rules so taxpayers receive equal treatment  whether they file electronically or through the mail.\n\nMr. Speaker, I urge my colleagues to support this commonsense  legislation to help level the playing field for American taxpayers, and  I yield back the balance of my time.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689373/electronic-filing-and-payment-fairness-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…get married.\n\nThe SAVE America Act requires individuals to provide documented proof  of U.S. citizenship along with a valid photo ID when registering to  vote. This commonsense legislation strengthens election integrity  through practical measures, including voter ID requirements and  safeguards to prevent noncitizens from voting.\n\nThe SAVE America Act…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…gather, the better the  SEC  can respond, and the better off our small businesses will be.\n\nMr. Speaker, I thank Representative Gottheimer for working with me on  this commonsense legislation, and I urge my colleagues from both sides  of the aisle to support H.R. 3351.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…and  keeps our Nation secure by setting real penalties for those who seek to  enter our great Nation illegally to commit crimes. I urge my colleagues  to support this commonsense legislation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…products around the world.\n\nMr. Speaker, the same focus on protecting working families is exactly  what we are doing with the bills before us today. This rule advances  commonsense legislation to strengthen our grid, unleash American  energy, and restore coal's role in the mix.\n\nAlso, let's not underplay what it means to protect the people of  Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…associate myself with the comments of the  managers. I am pleased to know their legislative intent.\n\nMr. Speaker, in closing, I urge my colleagues to support this  commonsense legislation.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693196/one-big-beautiful-bill-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…bring necessary solutions to all small businesses, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support  this commonsense legislation, and I yield back the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, on that I demand the yeas and  nays.\n\nThe yeas and nays were ordered.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Dave Min,                                                Member of Congress.\n\nMr. COMER. Mr. Speaker, I urge my colleagues to support this  commonsense legislation to allow police officers in the District of  Columbia to pursue and apprehend criminals to keep residents and  visitors in the District safe. I yield back the balance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695642/district-of-columbia-policing-protection-act"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…for yielding.\n\nMr. Speaker, I rise today in strong support of my bill, the IRS MATH  Act. I thank my friend from Illinois (Mr. Schneider) for working with  me on this commonsense legislation.\n\nMr. Speaker, if the IRS finds a mistake on a tax return, such as when  a taxpayer accidentally adds a zero to their reported income, the  agency should clearly indicate…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}]