[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…and will, in fact, endanger police  and many others, they are now opposing this bill.\n\nWe must continue providing the resources and support that strengthen  officer and community safety, not undermine them by removing the  safeguards that keep weapons out of the hands of dangerous and violent  criminals. We need to be preventing violence.\n\nMrs. McBATH.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…tailored to facts of every  case. They also provide essential support and supervision to people  returning home from prison, helping to rebuild lives while improving  community safety.\n\nAt home in Rhode Island, our Federal probation staff is at the heart  of two successful programs to put people on path out of the criminal  justice system for good.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…and dads, but also U.S. citizens.\n\nWe also call to redirect the $75 billion OBBB enforcement funding  away from mass detention and quota-driven arrests toward humane  community safety and affordability concerns.\n\nThis includes independent investigations into the deaths in DHS  detention. As I said earlier, many people have died while in DHS  custody.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…about to  make utility bills, student loans, and grocery costs skyrocket, all to  give the richest Americans more tax breaks.\n\nI heard how the President's cancellation of community safety funding  will make our neighborhoods less safe, and I heard how his attacks on  unions at the VA and FEMA will ripple right into the private sector,  hurting working men…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…of academic achievement, career  development, and lifelong learning in our society. A strong public  education system is critical to not only our Nation's economy but  community safety, social mobility, and the health of our democracy.\n\nWe need a Secretary of Education who values and respects public  education and the millions of teachers and faculty…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…House and through the Senate and signed into law.\n\nMr. Speaker, I urge my colleagues to join us in actually standing up  for law enforcement, for the police, and for community safety. I would  invite them to join us in actually standing up for the Article I powers  of Congress. I hope they will join us in rejecting DOGE's deranged  funding cuts that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…falling apart and was a real public safety risk. We worked together  to push the railroad to make the repairs, and I got a chance to see  firsthand his dedication to his community's safety.\n\nChief Colucci is a true public servant. Indiana Township and western  Pennsylvania were lucky to have his decades of service.\n\nMr. Speaker, I congratulate Chief Steven…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Aariv Arora of Broomfield, Colorado, for earning the Rookie of the Year  Award in the 2025 Congressional App Challenge.\n\nAariv built an interactive app called WayBuddy, a community safety  app that allows students to report roadway hazards for fellow  pedestrians and bicyclists on a shared map. This accomplishment is an  example of Aariv's determination,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698764/recognizing-aariv-arora"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…protections, avoids unnecessary  bureaucracy, and promotes responsible land stewardship. I thank  Representative Carbajal for his hard work on this bill. It will support  community safety in his district and throughout the country.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMs. HOYLE of Oregon. Mr. Speaker,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691067/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…disciplinary actions.\n\nRepealing or defunding this law would not make the District       safer. It would restore outdated and harmful practices that       undermine trust, community safety, and officer morale. It       would weaken oversight structures that law enforcement       leaders themselves have said were necessary to keep ``very       bad officers''…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…internal math  correctly, that was less than $2 million out of $811 million cut in  awards that were made by the Department of Justice to local law  enforcement citizen community safety groups, and so on across the  country.\n\nNow, apparently there are certain grants that the gentleman doesn't  want ever to go out. For example, I take it the gentleman…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…ongoing affordability  crisis, programs that President Trump proposed to cut or eliminate,  despite the cost-of-living crisis he has led us into.\n\nThis package promotes community safety, increasing funding for  Violence Against Women Act grants by $7 million, supporting victims of  abuse who otherwise would have nowhere to turn.\n\nIt rejects efforts by…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Agency for the District of Columbia evaluates each       person's likelihood of appearing in court and assesses       individualized conditions of release to support community       safety. The results of D.C.'s current risk and safety based       pretrial system outperform most cash-bail jurisdictions in       the country. Ninety-two percent of people…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…than we did--but the  functionaries of DOGE slashed more than $500 million that the  Department of Justice was giving to local police departments across the  country, community safety groups, and organizations assisting victims  of rape and sexual assault.\n\nAs far as we can tell, one person in DOGE, one unelected, midnight  bureaucrat whose career was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…crash.\n\nAt age 94, he remains calm, capable, and committed.\n\nMr. Speaker, I thank Skip for his lifetime of service and the  integral role he has played in ensuring his community's safety.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690559/recognizing-junior-r-skip-baker"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…unique perspective on  bridging the gap between law enforcement operations and public policy.  This foundation has allowed him to create a more comprehensive approach  to community safety and to fostering collaboration among Federal,  State, and local agencies.\n\nCurrently, as the commanding officer of the New York Police  Department's Detective Bureau Tactical…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the budget for law enforcement, he is  cutting resources today. He has terminated $820 million worth of grants  for public safety. He has cut $169 million in funding for community  safety and violence reduction programs. He has cut $71.7 million in  grants to policing and prosecution programs, including longstanding  efforts to address violent crimes and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…developed directly with local leaders who know their  communities best and targeted at the issues that matter to our  communities the most.\n\nThis bill supports, for example, community safety vehicle fleet  modernization so that Tucson's first responders have reliable vehicles  when every second counts in their line of work. It also includes  funding for the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]