[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…executive branch. It doesn't  matter who occupies the White House. The bottom line is,  whoever is in the White House, we need clear standards that ensure  public trust is never compromised.\n\nI also remain concerned about adequate resources for the CFTC. Yes, I  acknowledge this bill provides more flexibility to deal with hiring,  but we also need to see more…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…enforcement to conduct wiretaps and accessed phone  calls of politicians and other high-value targets.\n\nVice President Vance said his communications and President Trump's  were compromised in this hack. The press reported that then-Leader  Schumer was also targeted. This espionage incident was the direct  result--the direct result--of phone carriers' failure…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Trump's 2020  election was rigged. And because Krebs said there was no evidence in  2020 that ``any voting system deleted or lost votes, changed votes, or  was in any way compromised,'' he was attacked, and that Executive order  asked DHS to target him.\n\nAt the same time, President Trump has dismantled CISA's election  security programs, including by…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…prioritize the profits       of a foreign mining company--Chilean conglomerate       Antofagasta--over the interest of this nation's citizenry and       beloved public lands. Once compromised, the Boundary Waters       cannot be restored. This region is much more than a beautiful       place. It embodies the best of our public lands: clean water,       expansive…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…uniform, I understand that I'm not just pursuing a career but       that I'm continuing a mission he began. His success proved       that the military is strengthened, not compromised, by       diverse leadership. The respect he commanded showed that       authority flows from character and capability, not color or       gender.\n\nThe transformation of…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republicans are standing by in silence as the  Federal Trade Commission, the agency entrusted with enforcing this bill  and several others under consideration this afternoon, is compromised  by the Trump administration and the President's illegal political  attempt to fire the two Democratic commissioners.\n\nThis unlawful decision undermines the legitimacy and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…writes from Albuquerque. He says:\n\n[T]his seems to be rushed without full considerations of       the ramifications. I do not want the health and solitude of       our forests compromised by opening the door to unwanted       development.\n\nDiane from Taos writes:\n\nPlease vote to stop the plan to rescind the Roadless Rule.       I lead herb identification…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…with  disabilities lose access to Medicaid support services like physical  therapy, transportation, and mental health support. Children's  abilities to learn and thrive is compromised. Schools in rural areas  where Medicaid often funds onsite nurses and telehealth programs, they  would be stripped of essential support.\n\nWhat we are witnessing is--again,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…threatens the  privacy and security of every single law-abiding American.\n\nLast Congress, I made progress with the bill's sponsors to address  some of these concerns. Indeed, I compromised on a version of this bill  and had agreed to remove my hold to let that version pass by unanimous  consent. It is unfortunate that the sponsors have chosen to abandon  those…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692908/stop-csam-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…subject to U.S. law enforcement requests pursuant  to court orders.'' Vice President Vance subsequently revealed that his  communications and those of President Trump were compromised in this  hack. This espionage incident, and the harm to U.S. national security  caused by it, were the direct result of U.S. phone carriers' failure to  follow cybersecurity…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…the cost of the Paycheck Protection Program. Moreover, many of  the lending rules ensure accountability and fair access. Cutting them  to free up funds for PPP would have compromised the integrity of the  program.\n\nMoreover, these funds needed to be disbursed quickly. Imposing a no- new-spending-without-cuts approach would have delayed or reduced aid…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…member, Senator Durbin, rightly walked out of the hearing.\n\nI commend my Democratic colleagues for standing up for the integrity  of our courts and refusing to participate in a compromised committee  process with a deeply compromised nominee.\n\nIt is obvious why the Republicans were so eager to cut off debate.  They know the arguments against Mr. Bove are telling…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Conner's medicines, the medicines that have kept him alive, cost  thousands of dollars a month. A middle-class family can't pay that.  Medicaid does.\n\nHis lung function is compromised, so he needs a $12,000 machine to  breathe. He needs help in school. He wants to go to college, but he  needs a little help because he is severely handicapped by this terrible…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…to that.\n\nThe research that is being done to help us fight against cancer and  to cure so many other diseases that are out there, those research  programs are going to be compromised. The clinical trials happening are  going to be compromised because we have decided this reconciliation  package, which is a statement of values, is going to be deciding…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…enforcement of this bill requires a  strong, independent, and bipartisan Federal Trade Commission. House  Republicans have stood by in silence as this critical agency is being  compromised by President Trump's illegal attempts to remove the two  Democratic commissioners from their posts, undermining the legitimacy  and transparency of the FTC.\n\nMr. Speaker,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692750/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, I rise today in strong support of the  effort to ban congressional stock trading because public service must  never be compromised by private financial interest. The American people  deserve to know that we are acting on their behalf, not for our own  portfolios.\n\nThat is why I have already begun placing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691215/stock-trading-ban-for-members-of-congress"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to amend title II of the Social Security Act  to provide for the reissuance of social security account numbers to  young children in cases where confidentiality has been compromised, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 5348\n\nBe it enacted by the Senate and House…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Petty Officer Danny Dietz, and Petty Officer Marcus Luttrell. Their  mission was to observe and confirm the presence of Ahmad Shah.\n\nUnfortunately, the team's position was compromised by local goat  herders. Faced with a difficult ethical decision, the SEALs let the  herders go. Within hours, they were surrounded and ambushed by a large  force of Taliban…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…utilities are  appropriately planning their investments in the electric grid.\n\nThe U.S. grid, commonly referred to as the greatest machine on Earth,  is a complex system compromised of myriad components and infrastructure  to deliver electricity that powers our economy and enables modern life  for households.\n\nTo ensure the timely delivery of electricity…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…or other electronic means of accessing a cadet       room;\n\n(2) procedures for resetting electronic locking mechanisms       in the event of a lost, stolen, or otherwise compromised       electronic access token, code, card, or other electronic       means of accessing a cadet room;\n\n(3) procedures to maintain the identity of each individual       who…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…of Social Security  numbers has become a very serious problem in our country. In 2024  alone, there were over 3,000 reported data breaches, and over half of  them included compromised Social Security numbers. For victims, the  fallout can be overwhelming.\n\nInstead of finding clear guidance at the Social Security  Administration to deal with this stressful…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…country.\n\nIt is clear that the current penalties are not enough to deter this  dangerous cycle of illegal reentry. The safety and security of our  citizens must never be compromised by those who abuse our system and  exploit our borders.\n\nH.R. 3486 protects American families, upholds the rule of law, and  keeps our Nation secure by setting real penalties…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Jane Strain, a surviving spouse and an Army veteran  herself. She said: Surviving spouses and families who cared for  children, moved many times during a military career, compromised their  own careers, and maintained their homelife while the servicemember was  deployed have earned and deserve attention when the spouse has passed.  Placing the OSA directly…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…thousands of  specialized parts: transformers, inverters, control systems, many of  which have long lead times or limited manufacturers.\n\nAny bottleneck, any shortage, any compromised component puts  reliability at risk and drives costs higher for families and  businesses.\n\nThis legislation strengthens our posture. It gives us the visibility  we need…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697893/electric-supply-chain-act"}]