[{"senator": "John Garamendi", "party": "Democrat", "sentence": "…We see the Trump trifecta in action. Trump and Musk, with the backing  of timid Republicans, have traumatized Federal employees. Republicans  have purged the military of competent, experienced leaders and have  usurped congressional, constitutional power of the purse and power of  the law by dissolving programs, such as USAID, which is authorized by…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…alike.\n\nAs SBA increases its reliance on loan agents, it is essential that  the agency have proper oversight of their involvement to minimize  fraud. This will ensure that competent and honest agents can help  screen borrowers, prepare forms, and better reach communities that need  this capital most.\n\nThat is why this bill is so essential. The 7(a) Loan…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691856/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…of wickedness, let it be that our immigration apparatus needs  bold and systemic change, and may that change be a system centered in  compassion, not cruelty; entrusted to competent officers, not  kidnapping traffickers and killer thugs, and bent toward justice, not  broken by ICE.\n\nMr. ESPAILLAT. Mr. Speaker, may I inquire as to how much time is  remaining.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…education, and outcomes. Community-based  organizations, healthcare advocates, and local leaders are working  tirelessly to ensure that Black mothers receive the culturally  competent care and support they deserve.\n\nI commend the leadership in Santa Clara County for prioritizing this  critical issue and uplifting Black maternal health as a matter of  public…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…need and deserve  to prevent, treat, and end the HIV/AIDS epidemic.\n\nAs a queer Latino immigrant, Omar has experienced firsthand the  importance of high-quality, culturally competent healthcare and HIV  prevention services. His experience has motivated him to build a world  where no one is denied quality healthcare services because of their  background,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…beyond clinics and hospitals. It is the cornerstone of  a strong nation. By engaging our communities, public health workers  address health care disparities and implement competent wellness  programs that provide essential services to diverse communities.\n\nThe opening of the UT School of Public Health San Antonio--the newest  addition to the UT Health…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689417/recognizing-national-public-health-week-and-the-ut-school-of-public-health-san-antonio"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…efficiency.  There is nothing efficient about gaining unauthorized access to private  data and then blindly firing 5,200 employees across multiple Agencies.  There is nothing competent about cutting the workforce without any  thought about how it would impact operations.\n\nThis is not efficient. This is senseless, and this is heartless.\n\nNIH is based in…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…elected in the Ninth District  by moving the lines for it over to another area.\n\nNow, I shouldn't say ``eliminate.'' Anything can happen. My belief is  that there are capable, competent, and qualified people running, but  the prognostication is that the configuration of it in terms of the  numbers is likely to elect a conservative person, probably a very…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…potentially deport United States citizens.\n\nWe asked for some simple reforms: Don't deport United States  citizens. Require the training and hiring of personnel that are  competent and capable for this job.\n\nDo you know that training has gone from 5 to 8 months to 6 to 8  weeks? The sensitivity around this issue has been broken, and the trust  of the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…easy to overwhelm  with a trivial response to it.\n\nWe have spent over $200 billion on it. We have never tested it once  against the kind of countermeasures that we know any competent opponent  would deploy. Even if we succeed at stopping ballistic missiles, there  are, unfortunately, many other ways to deliver nuclear weapons that we  can never stop.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…California made to clean up their air  from auto emissions.\n\nYou know, in the last 50 years, California has never had a waiver  revoked. That tells me they put together very competent proposals and  that the Nation supported their effort to clean up their air.\n\nBut something different is happening right now. Senate Republicans  are using the Congressional…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…to ensure that small businesses have access to  information about career and technical education programs and that  helps them, more importantly, hire both accomplished and competent CTE  graduates.\n\nI am proud to co-lead this effort as someone who prioritized  workforce development as well as career and technical education in my  prior roles. As Baltimore…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691768/supporting-cte"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…done--we would have a different  Secretary of Defense right now. It would have been unnecessary for the  Vice President to come here and break a tie. We would have a more  competent Secretary of Defense. That is the mindset that got us where  we are today, and that is the reason I have lodged these objections.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…researchers had virtually eliminated--he has  pressed forward with firing thousands of vital workers in our health  Agencies. This is not efficient, and it is not a profile in competent  leadership. What it is, instead, is absolutely dangerous, and it is  putting sensitive information and decisions between life and death in  the hands of grossly unqualified…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I yield 1 minute to the gentlewoman from Oregon (Ms.  Hoyle).\n\nMr. RASKIN. Madam Speaker, we are invited to believe that the United  States Congress is not only more competent to make medical decisions  for America's children than their own parents, but that the United  States Congress is more competent than all 50 State legislatures to run  medical…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…model to the Scouts  of Troop 66. His commitment to the principles of scouting has created a  nurturing environment where Scouts are encouraged to grow into  responsible, competent leaders.\n\nRic's ability to connect with youth, guide them through challenges,  and celebrate their achievements is a testament to his deep compassion  and unwavering dedication.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696825/recognizing-colonel-ric-trimillos"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, America is back, and so is common sense.\n\nThis last year has reminded us of what is possible when America has a  competent and respected leader who understands the unique role that our  great Nation should fill on the world stage.\n\nI am grateful to have President Donald J. Trump back in the White…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…six strategic deterrence patrols, was a nuclear weapons safety  officer, nuclear weapons security officer, and nuclear weapons  radiological control officer. He is pretty competent.\n\nThis role is responsible for the maintenance of a safe, secure, and  reliable nuclear stockpile.\n\nConfirmation is critical to President Trump's ``peace through  strength…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…RETIRED GRADE DETERMINATIONS.\n\n(a) In General.--Section 2501(d)(2) of title 14, United       States Code, is amended--\n\n(1) in subparagraph (B) by inserting ``a'' before       ``competent authority'';\n\n(2) by redesignating subparagraphs (C) through (E) as       subparagraphs (F) through (H), respectively; and\n\n(3) by inserting after subparagraph (B) the following:…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…long-overdue changes so that we take care and clean this mess  up. The law improved the management and the oversight of our organ  transplant system and encouraged participation from competent and  transparent contractors.\n\nTo build onto those reforms, in March, the President signed a  continuing resolution that provided authority for the Department of  Health…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…we secure the Nation's Capital.  They are one of the many National Guard units that have been deployed  to do the job that the people of D.C. should be doing if they were  competent and if they were doing what they are supposed to do as the  Nation's Capital. The President is taking charge, and he is leading to  ensure that our Nation's Capital is safe…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…the forgotten.\n\nYou are the party who let 15 million illegals in this country,  wantonly and deliberately. You are the party who defended a President  who wasn't mentally competent.\n\nOne of the ladies mentioned that Donald Trump voted from a golf  course. Donald Trump could read a thank-you note, unlike President  Biden.\n\nDonald Trump had 77 million…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…orders of the Tax Court.\n\n``(3) Depositions.--Pursuant to rules and orders of the       Court, the deposition of a witness may be taken before any       designated individual competent to administer oaths under       this title. Any deposition testimony shall be reduced to       writing by the individual taking the deposition, or under       such individual's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…am simply standing and saying that I believe that today this bill  needs to be passed because Washington, D.C., and the sitting courts do  need additional judges. They need competent people who would be  prepared to move forward.\n\nIf there is one President who would nominate and get this done, it  would be Donald Trump. Donald Trump deeply believes in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…district court of the United States that meets       applicable requirements relating to venue under section 1391       of title 28, United States Code; or\n\n(II) another court of competent jurisdiction.\n\n(ii) Service of process.--In an action brought under       subparagraph (A), process may be served in any district in       which--\n\n(I) the defendant is an…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Democratic colleagues and their  unbridled spending that is bankrupting this country.\n\nThey sent President Trump here with a mandate and unified Republican  leadership to restore competent leadership, commonsense policies, and a  commitment to America First. There is nothing common sense or America  First about transgender comic books in Peru and all the other…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693716/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]