[{"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…United and other handouts to  the obscenely rich and powerful are only making it worse.\n\nIt is past time that we change course and correct what has created  this inequality. Compare it to the years of another Republican  President, Dwight David Eisenhower, when we had the largest middle  class in the country and the world in our history. Ironically,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…when he was a State legislator, has warned against it, saying:\n\nIt didn't work out so well.\n\nI would say so. About 12 percent of the people who tried to register  couldn't.\n\nCompare those 30,000 Kansans who attempted to register and were  denied to the 30 people--30 people--the 30 noncitizens who reportedly  voted in the 2016 election nationwide. That…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…in front of another      Across the aisle. . .there's a lot to discover.                                  O Senate                                By Jace Miles       Shall I compare thee to a session day?      Divided it is and together they come,      A place vibrant and unique in every way.      Jacks of all trades but mastered by one.      They call…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Just this week, Connecticut launched a window-shopping tool that  allows residents to preview their healthcare options for next year. It  allows consumers to see how costs compare to next year's costs. Very  frankly, the options are preposterous.\n\nFor example, a couple in their sixties living in Hartford, CT--our  capital--making $100,000 a year will…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…from the  beginning of 2022 until now is 71 pounds. Now, that is a lot of  fentanyl, and that could kill a lot of people, so I don't endorse that  by any means, but when you compare that with the 67,966 pounds that  have been seized along the U.S.-Mexico border for the same period of  time, wouldn't it make more sense to focus on where most of this  fentanyl…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…voting place--every signature is  checked. Every signature is checked.\n\nIn fact, in our State, the Washington State Patrol basically advises  the election officials how to compare the signatures. And while they  are comparing the signatures, there are Republicans and Democrats and  League of Women Voters and observers in every election official office…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…enrollment with their       licensed capacity, review thousands of monthly attendance       sheets, validate signatures and verifications of employment       and eligibility and compare providers' rate sheets to       invoices, among other things, McDougal said.\n\nMs. MOORE of Wisconsin. Mr. Speaker, I rise in opposition to H.R.  6945.\n\nDespite the grandiose…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…generation capacity added in our country was wind and solar  and batteries. That is 50,000 megawatts of solar, 4,000 megawatts of  wind, and 11,000 megawatts of batteries. Compare that with the fuels of  the past. Last year, only 2,500 megawatts of natural gas were added and  zero from coal.\n\nThat is the present state of affairs for electricity generation…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…with its huge water demand, with  all the traffic and pollution and everything else that it means, you  see very, very little in the way of cost decreases.\n\nIn fact, if you compare it to places that are farther and farther  away--this is about 225 miles away from a data center--you can see that  the electric prices going down happens much more the farther…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…to.\n\nNow, we just saw a deal announced with the EU by the President and  Ursula von der Leyen, the head of the European Commission, forcing 15  percent taxes on imports. Now, compare that to what we were paying in  2024 at this same time. That was about 1.5 percent. So under this great  deal that the President negotiated with the EU, Americans are going…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…across America and are  particularly important in rural areas, where public stations are often  the only source of local news.\n\nThis is a $1.1 billion cut, Mr. Speaker. Let's compare that to the  big, ugly Republican reconciliation bill, which adds $3 trillion to the  deficit and--get this--includes a provision that Republicans have been  bragging about…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…remotely close to this part of the Coastal Plain.\n\nThat is why it is estimated that oil prices would have to be at least  $75 a barrel just to break even on oil from the refuge. Compare that to  today's average cost for a barrel, which is hovering around $60.  Legitimate investors knew these pitfalls.\n\nIn 2023, the six largest banks in the United States,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…largely kept the American people safe. And  criticizing that order seems pretty easy, given its imperfections. But  the critic's task becomes harder once they are forced to compare it  with what came before, the anarchy that preceded the Second World War  and what China and Russia offer for the future of this world.\n\nThis is what President Trump risks…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…says you do the  Breathalyzer in your car before you can drive again. They say that it  is painful to have to do that every morning and going back from work.  That doesn't compare to the pain of someone who loses a mother, a  father, a son, a daughter, a cousin, an uncle, an aunt, or what have  you.\n\nIf we want to deal with drunk driving, let's seriously…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…destroy the second and third pillars.\n\nIn that second pillar, no deficits beyond year 10; every category,  every year has to be deficit-neutral or reduce the deficit.\n\nWe can compare that to the law that has just been put forward--or the  guidance that has just been put forward. We can look at year 11, the  instructions that go in every category--year…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…There have been 17 identified  cases in which Federal courts issued nationwide injunctions between  January 20, 2025, and March 27, 2025, against the Trump administration.\n\nCompare this to the 19 injunctions issued during the entire Obama  Presidency, 8 years, Mr. Speaker. Fifty-five such injunctions were  issued against the first Trump administration,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Trump remains the only  President on record--the only President on record--in American history  not to have had a single nominee confirmed by unanimous consent or  voice vote. Compare that to Presidents George H.W. Bush and Bill  Clinton, who each had 98 percent of their civilian nominees confirmed  by unanimous consent or voice vote in the first term of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…state-based marketplace or to use the federal       Marketplace. These marketplaces determine eligibility for       APTC, based in part on income, and allow individuals to       compare and choose among insurance plans offered by       participating private health care coverage issuers. CMS       estimated it paid nearly $124 billion in APTC for about 19.5…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…agencies or other applicable operators have utilized       such exceptions in accordance with relevant laws and       regulations; and\n\n(B) the extent of such utilization;\n\n(2) compare the utilization of exceptions specified in such       section 91.225(f) before and after the issuance of revised       regulations under subsection (a); and\n\n(3) submit to…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(B) compliance with Federal and State securities laws at       the time of the IPO; and\n\n(C) such other IPO-related costs as the Comptroller General       may consider;\n\n(2) compare and analyze the costs of an IPO with the costs       of obtaining alternative sources of financing and of       liquidity;\n\n(3) consider the impact of such costs on capital…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…they fought for 2 weeks on the ground in Panama before they  got their hands on Noriega. At that time, both Republican and Democrat  leaders of the Senate praised this move.\n\nCompare that to what happened here. There were only about 200 troops  involved, and they were engaged for 47 minutes. And yet, all of a  sudden, this is a horrendous problem.\n\nWhen…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…qualifications and performance       submitted by firms regarding the proposed project; and\n\n``(B) conduct discussions with at least 3 firms to consider       anticipated concepts and compare alternative methods for       furnishing services.\n\n``(3) Selection.--From the firms with which discussions       have been conducted under paragraph (2)(B), the Commandant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…swords philosophically about what  the role of ESG is. Environmental, social, and governance has been a  hot topic, Mr. Speaker. I can tell you that.\n\nWhen he is trying to compare what we are talking about today,  regarding what we are dealing with with some of the other retirement  plans and publicly traded companies and what the SEC  has been doing,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…that if they  enter the United States illegally, they will be deported. During his  first full month in office, there were only 8,326 apprehensions at our  Nation's borders. Compare that to President Biden's failed leadership  where 8,000 illegal immigrants were apprehended in one day. It is  amazing. Deploying common sense and actually enforcing the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Federal agency       responsible for environmental reviews or authorizations       shall--\n\n(1) not later than 90 days after the date of enactment of       this Act--\n\n(A) compare existing Federal agency systems for       environmental reviews and authorizations under their       authority with the data standards published under section 3       and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…matter of fact, we  just approved, not too long ago, three of them--one of them was my Ag  appropriations bill--by big bipartisan majorities here on the floor in  the Senate. Compare that to last Congress,  when Leader Schumer refused to allow us to bring any of the  appropriations bills to the floor.\n\nIn fact, nearly a month ago now, the House requested…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…state-based marketplace or to use the federal       Marketplace. These marketplaces determine eligibility for       APTC, based in part on income, and allow individuals to       compare and choose among insurance plans offered by       participating private health care coverage issuers. CMS       estimated it paid nearly $124 billion in APTC for about 19.5…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…had no answer, but the answer is obvious. It is the  State's failed policies that have--through this laboratory of democracy  experiment we have in this country where you can compare the results of  different policies side by side, State by State--driven up the price of  just about everything in California.\n\nWe have the highest gas prices in the country,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to the  system. There is only one equation, and that is inflation.\n\nLook at the difference between an inflationist and real wage growth.  Those are the two things we have to compare.\n\nThis bill basically takes 2017 and says we have seen this work.  Democrats looked at the tax policy in 2017, when they had the White  House, House, and Senate. They said:…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…the spirit of  the law and offered the fewest acres possible.\n\nIn September 2023, the BLM collected a measly and insulting $27,000  from an oil and gas lease sale in Wyoming. Compare that to the  September 2021 lease sale that netted over $1.3 million.\n\nThe people of Wyoming are elated that President Trump, on day one,  committed to fixing the sins of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}]