[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the U.S. military. But it wasn't       always this way. When Charity Adams-Early joined the military       in 1942, women were restricted to certain occupations and       comprised just 1 percent of the military. Not only that, but       people were discriminatory to Black Americans, restricting       their education, housing, and neighborhoods. Even…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…dropped by  24 percent from September 2023 to September 2024, and while that's  something to celebrate, we have a long way to go.\n\nThe 33 regional HIDTAs across the country are comprised of federal,  state, and local partners, resulting in robust interagency coordination  to respond to the most serious drug threats to the region. However,  recent proposals…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…to ensure that the       District's local judges are selected based on professional       qualifications, experience, judicial temperament, and       commitment to justice. Comprised of Commissioners appointed       by the President of the United States, the United States       District Court for the District of Columbia, the Mayor and       Council of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…support of our children. What we do today matters a great  deal for the future of our next generation.\n\nIt is my hope and my prayer that 60 years from now this body will be  comprised of many more Head Start alumni, living proof that this  program must continue.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…continue to be compatible with public use or recreation       purposes.\n\n(d) Land Description.--The parcel of land referred to in       subsection (a) is the parcel--\n\n(1) comprised of approximately 3.62 acres located at 2956       Park Avenue, on the Paducah Memorial Army Reserve Center,       Paducah, McCracken County, Kentucky, including the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…American patriots  have put their lives on the line to protect national security, defend  our allies, and fight tyranny and terror from distant shores.\n\nToday, the Army is comprised of roughly 450,000 Active-Duty  servicemen, 325,000 National Guardsmen, and 176,000 members of the  Reserve, making the U.S. Army the largest branch of the military.\n\nI want…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…history by approving the creation of a  memorial to the Adams family in Washington, D.C. In 2019, Congress  further authorized the Adams Memorial Commission, a bipartisan panel  comprised of Members of Congress and Presidential appointees, tasked  with spearheading planning, raising private funds, and educating the  public on the Adams family legacy of patriotism…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…housing that utilizes existing utilities and       infrastructure.\n\n(6) Mixed-income housing.--The term ``mixed-income       housing'' means a housing development that is comprised of       housing units that promote differing levels of affordability       in the community.\n\n(7) Pattern book.--The term ``pattern book'' means a set of       pre-reviewed,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…today, providing the  Lumbee Tribe of North Carolina the full Federal recognition they have  been unfairly denied for decades.\n\nThroughout recorded history, the Lumbee Tribe, comprised of nearly  60,000 members, has called southeastern North Carolina home. Despite  their long history and cohesive culture, the Lumbee have never had  access to the same Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Congressional Gold Medals to the members of the 1980 U.S. Olympic Men's  Ice Hockey Team, in recognition of their extraordinary achievement at  the 1980 Winter Olympics where, being comprised of amateur collegiate  players, they defeated the dominant Soviet hockey team in the historic  ``Miracle on Ice'', revitalizing American morale at the height of the  Cold…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…of Florida's 16th District, it is my  privilege to congratulate and include in the Record the following  honorees, who were selected this year by an independent committee  comprised of a cross section of current and retired fire and rescue  personnel living in the district:\n\nAssociate Service Award: Adam Nover of Manatee County       Department of Public…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Since 1910, the Liberty Corner Fire Company's enduring strength has  been built not only on the courage of its members but also on the  support of the community it serves. Comprised of more than 65  volunteers, the Liberty Corner Fire Company is responsible for  providing fire and rescue service 24 hours a day, 365 days a year to  the Liberty Corner…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694757/recognizing-liberty-corner-fire-companys-115th-anniversary"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…second sentence, by striking       ``or in the case of the Arkansas Valley Conduit, payment in       an amount equal to 35 percent of the cost of the conduit that       is comprised of revenue generated by payments pursuant to a       repayment contract and revenue that may be derived from       contracts for the use of Fryingpan-Arkansas project excess…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…swift       action to reject this misguided and harmful pLanning       decision.\n\nRDC is a statewide, non-profit trade association founded in       1975. Our membership is comprised of individuals and       companies from Alaska's fishing, tourism, forestry, mining,       and oil and gas industries and includes Alaska Native       corporations, local…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…robotics competition.\n\nGreenfield-Central's team surpassed 62 other terrific Hoosier teams  to claim top honors. Coach Jason led The Exothermics, Greenfield  Central's team, comprised of juniors Simon, Hayley, and Brayden.\n\nThese talented young Hoosiers will again showcase their talents at  VEX World competition in Dallas later this year. These students…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690023/congratulating-greenfield-central-high-school-for-winning-the-indiana-state-robotics-championship"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Congressional Gold Medals to the members of  the 1980 U.S. Olympic Men's Ice Hockey Team, in recognition of their  extraordinary achievement at the 1980 Winter Olympics where, being  comprised of amateur collegiate players, they defeated the dominant  Soviet hockey team in the historic ``Miracle on Ice'', revitalizing  American morale at the height of the Cold…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…makers in what is  believed to be the longest continuous deployment for a unit in U.S.  military history.\n\nToday, the 55th Wing is the largest wing in Air Combat Command,  comprised of 6 groups, 31 squadrons, and 3 detachments located  worldwide. It operates 48 aircraft, including multiple variants of the  RC-135 and the EC-130H and EA-37B Compass Call…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Administrator for inclusion in       the educational resources and modules established under       subsection (a).\n\n``(C) Members.--The Advisory Working Group shall be       comprised of the following       members, who shall be selected by the Administrator:\n\n``(i) Individuals with demonstrated expertise in artificial       intelligence, including--…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…positions. The Javelin missile also has a       minimum smoke motor thus decreasing the likelihood of its       detection on the battlefield.\n\n3. The Javelin Weapon System is comprised of two major       tactical components, which are a reusable Lightweight Command       Launch Unit (LwCLU) and a round contained in a disposable       launch tube assembly.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}]