[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Speaker, I rise today to recognize Elevation Beer  Company of Poncha Springs, Colorado, for winning a Bronze Medal from  the World Beer Cup for their Coconut Oil Man brew.", "title": "Recognizing Elevation Beer Company", "date": "2025-08-08"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Now, for a big company, maybe they can figure that out.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the National Highway Traffic Safety Administration Relating to ``Federal Motor Vehicle Safety Standards; Fuel System Integrity of Hydrogen Vehicles; Compressed Hydrogen Storage System Integrity; Incorporation By Reference''", "date": "2025-05-21"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "In the  wake of this most recent tragedy, one air tourism  company offered discounts to their customers for flights in our region.", "title": "Threats Nonessential Helicopters Pose to Public Safety", "date": "2025-05-06"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "And a company associated with the United Arab Emirates  said: You know, we are going to buy $2 billion of your coins.", "title": "Motion to Discharge--S.J. Res. 54", "date": "2025-06-11"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "NRCA has nearly 4,000 roofing company members representing  the entire roofing supply chain.", "title": "Recognizing National Roofing Contractors Association and National Roofing Week", "date": "2025-05-20"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "When the Chinese buy a high-tech company, they can take that  technology that is acquired back to China.", "title": "Agricultural Risk Review Act of 2025", "date": "2025-06-23"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Northeast Delta Dental was founded in 1961 as a not-for-profit dental  company administering care in Vermont, Maine, and New Hampshire.", "title": "Recognizing the Achievements of Northeast Delta Dental", "date": "2025-02-26"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "When you look at the largest freshwater basins of our Great Lakes,  when you look at the arsenal of democracy, when you see our incredible  trade unions from Saginaw up to Iron Mountain working and making and  delivering--the only polysilicon manufacturing in the Nation exists in  Michigan, in a place called Hemlock by a company called Hemlock--you  want to make sure that Michigan has its fair and equal representation.", "title": "Reflecting on America's History", "date": "2025-04-08"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Another company just closed in Fulton County.", "title": "Manufacturing Jobs Lost Due to Trump Tariffs", "date": "2026-01-14"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "By getting       the charging time down to roughly the same time as it takes       to refuel a gasoline-powered car, the Ningde, China-based       company, known as CATL, appears to have further eroded a       major obstacle to wider EV adoption.", "title": "Highlighting Advances in Chinese Electric Vehicle Technology and the Need for American Investment in Battery Technology", "date": null}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "He was a true entrepreneur, operating a  successful logging company for over 25 years while also owning and  managing a country store, bait shop, grocery store, and restaurant.", "title": "In Memory of the Honorable Curtis Parham ``cp'' Redding, Sr.", "date": "2025-05-15"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Payroll company ADP found the private sector actually  lost 32,000 jobs last month, while those Yale researchers estimate that  Trump tariffs will eliminate half a million jobs this year.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "SBA's Small Business Investment Company program is a multibillion- dollar investment program designed to bridge the gap between a small  business owner's need for capital and traditional sources of financing.", "title": "Investing in Main Street Act of 2025", "date": "2025-02-24"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "senator from Nevada, a conservationist and the  founder of the Chevy Chase Land Company, which developed the Chevy  Chase neighborhood that touches D.C.", "title": "Francis G. Newlands Memorial Removal Act", "date": "2025-07-22"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Johnny Wayne Farris is the president of Farris Motor Company, founded  by his grandfather in 1929.", "title": "Recognizing Johnny Wayne Farris", "date": "2025-12-17"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "It is about giving a startup in Pella the same shot as a  company in Palo Alto.", "title": "Encouraging Local Emerging Ventures and Economic Growth Act of 2025", "date": "2025-06-23"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "In  fact, the company was under a specific contract that required it to  notify the Senate Sergeant at Arms about subpoenas related to Senators.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "He worked initially as a mail clerk and took every  opportunity to advance his education and training, further his  knowledge, and move up within the company.", "title": "Recognizing Cornwall Cleanup Crew", "date": "2025-07-22"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "The taxpayer dollars paid the insurance  company the remainder of that.", "title": "Republicans Have Delivered in 2025", "date": "2025-12-17"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Steel merger brokered by President  Trump to ensure that a critical American company remains right at home  in Pennsylvania.", "title": "Nippon Steel and U.S. Steel Merger", "date": "2025-06-03"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Tiru Chabba was a vice president at the food service company at  Florida State.", "title": "Providing for Consideration of H.R. Improving Law Enforcement Officer Safety and Wellness Through Data Act; Providing for Consideration of H.R. Leosa Reform Act; and Providing for Consideration of H.R. Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-14"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "She continued in that capacity until Newhall Land and Farming Company,  the largest land developer in California, recognized her talents and  offered her a senior position in their company when she was still in  her twenties.", "title": "Mourning the Passing of Bob Phelan", "date": "2025-04-10"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Amid intense combat near Phuoc  Hoa, South Vietnam, his company was ordered to relieve a friendly unit  under fire.", "title": "Focusing on Results", "date": "2025-11-18"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "While the cost of the labels might only be $200,000, there is a cost  to each company.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Speaker, I include in the Record a letter from the Navajo  Transitional Energy Company in support of the CRA repealing the Miles  City RMP amendment.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": null}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "That is why Republicans have focused on a way forward on healthcare  that actually lowers costs, fights fraud, and gives power to the  patient, not profit to the insurance company, not ill-gotten gains to  the criminal.", "title": "Disrupt Explicit Forged Images and Non-Consensual Edits Act of 2025", "date": "2026-01-13"}]