[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Madam President, I rise today in support of Senator  Kaine's resolution for the simple and compelling reason that it upholds  our constitutional duty. Regardless of what people may think of the  military's execution of its mission last weekend--and our  servicemembers performed…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…traditional redistricting       considerations including compactness, contiguity, and respect       for political subdivision lines, the State of Texas must       demonstrate a compelling state interest to survive strict       scrutiny.\n\nIt is well established that so-called ``coalition       districts'' run afoul the Voting Rights Act and the       Fourteenth…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…reached that conclusion. Nearly 2  years ago, the Supreme Court ended the use of affirmative action in  college and university admissions. Justice Jackson issued a strong  compelling dissent, and she wrote:\n\n[D]eeming race irrelevant in law does not make it so in       life.\n\nShe continued:\n\nAnd having so detached itself from this country's actual…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…stand  with a number of them at the Connecticut State Pier to support the  offshore wind industry.\n\nLet me thank them and thank the unions that were there. The unions  were compelling and powerful, and they are representing their workers.  Hundreds of millions of dollars have been invested into that State pier  to support the offshore wind industry.\n\nSo…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…responsibility of this administration, an  administration that was defying a 9-0 Supreme Court order to facilitate  the return of Kilmar Abrego Garcia.\n\nThere is another compelling case we have before us. The 280 other  individuals who are in CECOT prison, the government has kept those  names secret. The press and others have had to do a lot of sleuthing…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "Mr. MFUME. Mr. Speaker, I rise today to honor a trailblazing woman  who fearlessly creates works of art that serve as a compelling force  for change.\n\nAward-winning filmmaker, screenwriter, and producer Ava DuVernay grew  up in the communities of Lynwood and Compton, in California, and spent  her summers…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…can  operate on the basis of mutually agreed facts, such as who won an  election.\n\nGregory Mize--a Georgetown University law professor and retired trial  judge--offers a compelling perspective: we can use jury trials as  models for attaining higher levels of truthfulness and reliable  outcomes in government. After all, our whole justice system is based…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "I rise in support of H.R. 6732, the CSAFE Act, which creates a new  crime to prohibit people from compelling children into physically  harming themselves or animals.\n\nCoercing kids online to hurt themselves or others is spreading harm  that all of us need to take seriously. We have…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698878/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…three findings set forth in       the statute: (1) the determination of the state is arbitrary       and capricious; (2) the state does not need state standards       to meet compelling and extraordinary conditions; or (3) the       state standards and accompanying enforcement procedures are       not consistent with 42 U.S.C. Sec. 7521(a) (EPA standards…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…can defend themselves, but that is a different question. That is a  different question than whether the United States should go to war with  Iran.\n\nIn my view, there is no compelling security reason for the United  States to go to war with Iran.\n\nThe last question that I want to ask and sort of reflect upon before  concluding is this: What about diplomacy?…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…alien lawfully admitted for       permanent residence if the alien--\n\n(A) satisfies the requirements under subparagraphs (A) and       (B) of paragraph (1);\n\n(B) demonstrates compelling circumstances for the inability       to satisfy the requirements under subparagraph (C) of such       paragraph; and\n\n(C) demonstrates that--\n\n(i) the alien has a disability;…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…most prominent outlets,  including ESPN, the San Francisco Chronicle, AOL Fanhouse, and espnW.  Her dedication to elevating women's sports through insightful reporting  and compelling storytelling has spotlighted generations of athletes,  coaches, and programs, contributing to the growth and visibility of  women's sports nationwide.\n\nMichelle's contributions…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…advertising for dozens of television  programs. Its growth has continued through major acquisitions: In 2016,  Allen Media Group acquired The Grio, a digital media leader creating  compelling content for African American audiences. In 2018, Allen Media  Group acquired the universally recognized Weather Channel, one of the  crown jewels of cable television.\n\nStill,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…it hard for prosecutors to pursue these charges.\n\nThe CSAFE Act is meant to fill in the gaps in our Federal law by  creating a new crime that prohibits individuals from compelling,  attempting to compel, or conspiring to compel children into physically  harming themselves, others, or animals.\n\nWhile the original bill considered by the Judiciary Committee…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…unsubstantiated medical [debts]: Debt collectors       must not attempt to collect medical debts.\n\nThese are all awful practices that go on.\n\nHere is Paul Sugar's story, compelling and tragic.\n\nPaul spent much of his life, starting as a child, learning       about jewelry, living in a small town near Albuquerque, NM.       At an early age, he earned…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…underlying  policy. It is based on the process. But the process is important to  getting the policy right. That is why we don't skip it. That is why, in  the absence of a compelling, overwhelming, urgent reason, we don't just  ignore it, and I can't and won't ignore it here.\n\nThe Senate should not abandon its regular order by advancing  legislation that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…a victim of covered misconduct who requests access to       records under section 552 or 552a of title 5 concerning the       victim's case shall be determined to have a compelling need,       and the records request shall be processed under expedited       processing procedures, if in the request for such records the       victim indicates that the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Coercion and Sexual Abuse       Free Environment Act'' or the ``CSAFE Act''.       SEC. 2. UNLAWFULLY COMPELLING CHILDREN.\n\n(a) In General.--Section 2422 of title 18, United States       Code, is amended by adding at the end the following:\n\n``(c)(1) Whoever, using the mail or any facility…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…reported it was a surprise to him. Since then, he has been  briefed. He is standing by the Justice Department on this indictment.\n\nLadies and gentlemen, unless there is a really compelling reason,  unless the prosecution succeeds--and I think it is unlikely, virtually  impossible, that Chair Powell will be found guilty of anything. This is  all about the testimony…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Attainability Act, is included. My bill serves to maintain State and  local leadership in setting their water quality standards under the  Clean Water Act.\n\nLet me cite a compelling example of why this legislation is  necessary. In 2020, the EPA approved in Indianapolis, in my district,  new standards for stormwater management. These updates were an…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698043/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…to engage in self- harm, animal crushing, or other abusive or degrading conduct.\n\nThis legislation closes dangerous gaps in current law and sends an  unmistakable message: Compelling a child to destroy themselves or to  harm others is child abuse. It is criminal, and it will be prosecuted.\n\nMadam Speaker, protecting children is one of Congress' most solemn…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…professional  organization we now know as Opera Roanoke.\n\nFor five decades, it has been a cornerstone of cultural life in  Roanoke and across Virginia's Blue Ridge, presenting compelling  performances and fostering a broader appreciation for opera in western  Virginia.\n\nOver the years, the company has benefited from remarkable artistic  leadership and the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…agriculture, leadership in education, and  contributions to energy production.\n\nThe USS Iowa will enhance our force readiness around the world and  serve as a powerful deterrent, compelling our adversaries to maybe  think twice before attempting to destabilize the international order.\n\nI thank the crew for their service and pray for their continued  safety.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689388/commissioning-of-uss-iowa"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…direction and  chucking the Biden budget into the grave where it belongs. Good  riddance.\n\nThe bipartisan and bicameral underpinnings of this legislative  package make a compelling case as to why the House must pass it  immediately.\n\nMr. Speaker, we are here to debate this appropriations package, not  every other issue under the Sun. I urge my colleagues…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…move ahead with a process that would put the Defense bill,  the Health and Education bill, the Housing and Transportation bill,  which we call Labor-HHS, and T-HUD--very compelling names, I know--he  wants to put together a package of many of these bills. Well, if that  is the intention, we need communication between our leaders and our  caucuses.…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…cost of solar has decreased more than 80 percent  since 2010. Truly, the market is more than capable of supporting  continued growth without subsidies.\n\nAs if that isn't compelling enough, there are yet more reasons to  phase out these subsidies.\n\nNumber eight, their efficiency has increased substantially. Today's  wind turbines and solar panels are…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…under       paragraph (1), the denial shall be final, except as provided       under subparagraph (C) of this paragraph and subject to the       discovery of any new and compelling evidence or information.\n\n``(B) Reasons for denial.--If the court denies a motion       filed under paragraph (1), the court shall state the reasons       for the denial…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…note that  that is the highest possible rating for a judicial nominee. It reflects  the ABA's assessment of his integrity, experience, and temperament.\n\nThere were several compelling letters of support submitted to the  Senate Judiciary Committee in favor of Josh's nomination, and I would  like to highlight a couple of them.\n\nA diverse group of faculty…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…environmental playbook of suing for a predetermined outcome.\n\nRadical groups have litigated for years trying to get the longfin  smelt listed under the ESA, with a 2024 lawsuit compelling the U.S.  Fish and Wildlife Service to make a listing decision being the latest  example.\n\nUnfortunately, as with many ESA-related lawsuits, the species is  rarely the true…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "John Thune", "party": "Republican", "sentence": "…eroding the  confirmation process, they finally went all the way and broke it, and  they have to know that. So it is no surprise that they aren't exactly  able to mount a compelling defense of their position or a compelling  attack on the Republicans' move to fix the Senate.\n\nOn top of that, I suspect it is even possible that some Democrats are  secretly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}]