[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…grants were terminated for no reason by the  administration. One particularly egregious example was an award on  improving the effectiveness of teaching students how to do computer  science. Really?\n\nAt a time when we need to increase our domestic AI and STEM focused  workforce, we need students to be familiar with the artificial  intelligence systems…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Love Award for Excellence in Biomedical       Engineering: Aaryasinh Vaghela and Rishik Puli, Basis       Independence School\n\nCharles ``Chuck'' Smith Award for Excellence in Computer       Science and Mathematics: Eamon O'Leary, South Lakes High       School\n\nFounders Lifetime Achievement Award: Dr. Dennis Humphrey,       PhD\n\nOmega Man of the Year: Sanford…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…we live in  anymore. If you don't have the internet at home, the other kids  essentially have their books in their knapsack. It is called their  iPad. They have their home computer. They have access.\n\nI am only here because it was books and I could compete against any  kid in Malden, MA, in a blue-collar community. That is why I am a  Senator. I had…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…is the  arbitrariness of their implementation and the arbitrariness of how and  who is affected. We have a situation where we supposedly have these  tariffs on China. Apple Computer, quite understandably, was upset. It  was going to increase the cost of iPhones. Well, no problem. Tim Cook  was at the inauguration, sitting on the throne of honor, and he…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…brought food to their neighbors. They showed up for small businesses.  Teachers and other school leaders stood up and protected their  students, organized food drives and computer drives.\n\nAttorneys across our State at private law firms took ICE to court to  enforce people's constitutional rights. And judges appointed by  Presidents of both parties,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…situations that never actually  occurred but can still cause massive reputational and financial damage  to those who were targeted.\n\nSome of the platforms hosting actual and computer-generated  nonconsensual intimate images have promised to address such abuses  online and protect their users but, nevertheless, victims report great  difficulty in getting…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690185/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…to State and local police.\n\nIn fact, the party that now controls the White House and both  Chambers of Congress is now letting DOGE, Elon Musk, and their midnight  crew of computer hackers dismantle entire agencies, fire thousands of  Federal workers without cause, and generally wreak havoc across the  government.\n\nLast month, DOGE decided unilaterally…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Today, the administration filed this document saying it will take  weeks to months because they are choosing to fund only half, and  everything has to be reprogrammed in the computer system to make that  happen at the Federal level and for most States. That is not an  acceptable strategy. That is going back to saying people are not going  to get SNAP benefits…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…able to win the competition with China. That includes  AI, quantum computing, and high-tech. Those are the places that gave us  the lead that we have in software and in the computer industry. GPS and  LASIK were spinoffs of R&D that was worked on at NASA. Instead of  building that up, the Trump administration is laying people off.\n\nMr. Speaker, 445,000…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…reassigned.\n\nThis has real-life consequences for my constituents, like a 75-year- old stroke victim who hasn't received his check for months because he  can't drive or use a computer, or an immigrant who may lose his job  because a name correction appointment is weeks away, or the retiree who  waited hours just to schedule an appointment on the phone.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698683/social-security-customer-service"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…engineer's job was:\n\nCo-leading a project developing software for critical       mineral and rare earth element extraction, while also playing       a lead technical role in computer modeling of desalination       and water treatment processes and supporting U.S. industrial       partners to use these tools to deploy and modernize their       systems.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688240/fired-by-president-trump"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…administration or from the Biden administration. They  wanted some of our most vital, most significant national security  secrets. They wanted to be able to get their hands on computer chip  technology, the kind of technology that will power the next generation  of AI.\n\nWe as a nation--again, based on bipartisan consensus--had been  unwilling to give UAE…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…the basis just for critical thinking and  problem-solving in general. If our students can't get ahead in school,  how will they get ahead in the STEM workforce as engineers, computer  scientists, chemists, nurses, doctors, and much more?\n\nMs. HOULAHAN. Mr. Speaker, importantly, how will those who may decide  to pursue STEM fields succeed where these same…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…multinational corporations, and  billionaires.\n\nNow, government is frustrating. It frustrates me often. It needs to  be improved. You know what is also frustrating sometimes? My computer  is on the blink a little bit, and I just want to take a hammer and hit  it up the side. That makes me feel good, but it doesn't actually make  the device work any better.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…event, that needs to be brought up in the Appropriations  Committee where we can vote on it democratically. That should not be up  to one of Elon Musk's midnight riders, a computer hacker who comes in  and simply decides to wipe out all of the handiwork of the United  States House of Representatives and the United States Senate signed  into law by the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…hire more IRS agents,  that is supposed to be a good thing and the sign of a strong economy.  That is the way they compute them. If we hire more bureaucrats to look  at a computer screen and do nothing in the Department of Defense, that  is also supposed to be a sign of a booming economy because we have more  jobs.\n\nIn fact, the difference between the--one…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…equipped--\n\n(A) in a manner that ensures the protection of the privacy       of cadets and officer candidates, consistent with law and       policy;\n\n(B) with a telephone and computer to allow for the       provision of telehealth appointments or other services both       virtual and in person; and\n\n(C) with an accessible and private wireless internet…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…inspiration from Jewish cooking traditions in Europe;\n\nWhereas Sylvan Goldman invented the shopping cart;\n\nWhereas Evelyn Berezin invented the first true word-      processing computer and automated airline reservation system;\n\nWhereas Ralph Baer invented the ``Brown Box'', a prototype       for the first multiplayer, multiprogram video game system;\n\nWhereas…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…and enslaves nearly 50  million people. The most vulnerable are our children and young adults.  They are being targeted and exploited through their phones, through  their computer systems, through gaming systems, and through social  media. Every 30 seconds a child is sold into slavery. Every 30 seconds  another child is sold into slavery.\n\nHuman trafficking…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…(GAISE II) report.\n\n(8) STEM.--The term ``STEM'' means the academic and       professional disciplines of science, technology, engineering,       and mathematics, including computer science.\n\n(c) Preparing Educators To Engage Students in Mathematical       and Statistical Modeling.--The Director shall make awards on       a merit-reviewed, competitive…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…clear. They support  our Federal employees, like the Republican Party, but we expect them to  show up for work, not get paid to be home and not be accessible by  phone or by computer or by email.\n\nThat is what we heard from the leader of the Democratic Party.\n\nMr. Speaker, she mentioned healthcare, and the healthcare system that  she is talking about that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…remove those images. There are no more  excuses. You, Big Tech, have to take it down.\n\nLet's talk to the bullies, to the predators, to the perverts who are  hiding behind a computer, the ones who created this fake material. If  you dare to do this again to another innocent child, most of them  girls, you are going to prison. You will be in jail for a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…districts before pursuing higher education at Texarkana  College, Texas A&M Commerce, and Texas A&M--Texarkana, where he earned  a Bachelor of Science in Business with a minor in computer science. In  1990, he married the love of his life, Lisa Singleton, with whom he has  shared many pets, memories, and accomplishments.\n\nAfter graduating, Gary began his professional…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…any intimate visual depiction of an identifiable individual       created through the use of software, machine learning,       artificial intelligence, or any other computer-generated or       technological means, including by adapting, modifying,       manipulating, or altering an authentic visual depiction,       that, when viewed as a whole…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…another target after firing a missile. The missile       has an advanced tandem warhead and can be used in either the       top attack or direct fire modes. An onboard flight computer       guides the missile to the selected target.\n\n5. The highest level of classification of defense articles,       components, and services included in this potential sale…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…geolocation application data. Designed for use in tactical       ground and rotary wing platforms, the KGV-72 connects to a       commercial L band transceiver and FBCB2 BFT computer to       secure beyond line-of-sight communication.\n\nThe Sensitivity of Technology statement contained in the       original notification applies to additional items mentioned.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of Medicare  Advantage. We want the system to work, but we can't allow $1.76  trillion over 10 years of fraud and bad acts.\n\nIf you don't believe me, get in front of your computer right now and  look up some of the articles of the potential indictments, the criminal  activities that are coming. Also, look up The Wall Street Journal  series that actually…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…don't have, people being dumped on VA even though they  had the Medicare Advantage insurance, and people being dumped in  hospice care. If you don't know about it, grab your computer and  google: The Wall Street Journal MA.\n\nThe MedPAC report--I have come to this floor year after year. I am  sometimes thinking, Mr. Speaker, that I am the only idiot here…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…technology.\n\nI have a report on my desk from the IRS. I have only read the first  three or four pages. It is an analysis of their data. It turns out the  crazy thing, the chat, the computer answering the phone at the IRS, has  a higher favorability rate than when a human answered the phone.\n\nMaybe we should stop being scared of adopting the technology because,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…already happening.\n\nMr. Speaker, you will start to see companies now ditching the  middleman and starting to sell directly. Go look up Civica RX for  anyone who is in front of a computer. It is a co-op making drugs,  selling insulin cheaper than our Federal Government-subsidized price.\n\nThe fact of the matter is legalizing, encouraging, and incentivizing…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}]