[{"senator": "Ed Case", "party": "Democrat", "sentence": "…mobilization.  Second, the continued outsourcing of vessel modification and  construction undermines the U.S. shipbuilding and repair base, leaving  us with fewer than 100 Jones Act--compliant vessels in active service  nationwide, many of which are aging or specialized. And third, it sends  U.S. dollars, jobs and technological investments directly into the  hands…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the REAL ID Gender  Requirement Reform Act, which would repeal the requirement in the REAL  ID Act that REAL ID-compliant licenses include gender. Instead, states  would decide whether to include gender on their respective REAL ID- compliant licenses. I am pleased Representative Maxwell Frost…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691711/introduction-of-the-real-id-gender-requirement-reform-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…into  the Federal Register, sent over here as a submission, magically become  a new rule because of this loophole we just built, and then the  majority of the Senate, with a compliant House, can just shove it right  out the door without following regular order, without ever going to  court, without following bicameralism, and present with the  constitutional…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…because they will still have to make products  that meet efficiency standards, but they won't have updated guidance  from the Department of Energy on how to prove that they are compliant.  As a result, these companies will likely have to waste valuable time  and resources on communications with lawyers and the Department of  Energy as everyone tries to figure…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…The bottom line is this. The Trump administration needs to follow the  law. They need to reverse their illegal stop work orders, and they need  to start approving legally compliant energy projects--full stop.\n\nFinally, I will say one last thing because something that the Senator  from Rhode Island said bears repeating. The challenge to doing  permitting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…unacceptable, and it is avoidable.\n\nMr. Speaker, my bill ensures that every new Amtrak train includes a  baby-changing table in at least one restroom per car, including ADA- compliant restrooms, because, let's be real, babies don't wait for  layovers when they need to be changed.\n\nMr. Speaker, I will paint the picture: You are holding your baby in  one…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692156/baby-changing-on-board-act"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…our Nation. That is not what  Donald Trump is doing. He is acting like a tyrant, and he will keep  undermining our democracy, our country, and the rule of law as long as  compliant Republicans allow him to.\n\nWill there be just four Republicans who will stand with us and their  constituents to protect the Constitution, the rule of law, and law and  order…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…continue, investment will remain frozen, and local  communities will shoulder the burden of Federal indecision.\n\nH.J. Res. 131 ends that uncertainty. It restores the legally  compliant 2020 Record of Decision. It restores the full acreage  Congress authorized for leasing, and it restores, importantly, the  voice of the North Slope residents in Alaska.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "James Risch", "party": "Republican", "sentence": "…II of the Constitution, the President took action  to eliminate the terrorists threatening our troops and U.S. commercial  shipping in the Red Sea.\n\nThese strikes are fully compliant with the War Powers Resolution and  fully compliant with the President's article II constitutional  authority as Commander in Chief of our Armed Forces.\n\nPrior Presidents…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…not Senators, who may have a cause of action, and they deserve  their day in court. As to my cause of action under the statute, I am  going to pursue it but in a way that is compliant with Senate rules.\n\nI just want to put everybody on notice: The statute is just one  avenue to finding out what happened. There will be others. I will go to  the phone company.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…is not only sound regulatory policy but also essential  economic policy. It will help preserve the United States' leadership in  financial innovation, support the growth of compliant digital asset  markets, and provide much-needed certainty to investors, developers,  and regulators alike.\n\nIn an increasingly competitive global financial landscape, this…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…General.--The Commandant may not expend or obligate       funds--\n\n(1) appropriated pursuant to Public Law 119-21 during any       fiscal year in which the Commandant is not compliant with       sections 5102 and 5103 (excluding section 5103(e)) of title       14, United States Code; and\n\n(2) that are provided in Public Law 119-21 until the       Commandant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…people carrying those drugs were terrorists, plain and simple.  They were trafficking drugs that financed a designated foreign  terrorist organization. These strikes were fully compliant and fully  justified under the President's article II constitutional authority-- and not only authority but duty as Commander in Chief of our Armed  Forces to defend this…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…affordable energy supply for the long term. Our bill also  helps deliver on Republicans' promise of a smaller and smarter  government. Our bill achieves $1\\1/2\\ trillion in Byrd-compliant  savings, including the first real entitlement reform in decades--reform  that will put the programs in question on a more sustainable path for  today's recipients and for…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…environmental reviews and authorizations made       available through application programming interfaces or other       reporting mechanisms from Federal agency systems that are       compliant with the data standards and data architecture       described in this Act;\n\n(iii) be supported by a decentralized, cross-network       digital infrastructure software that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…States       Code, is amended by inserting after section 24313 the       following:       ``Sec. 24314. Baby changing tables\n\n``(a) Definitions.--In this section:\n\n``(1) ADA-compliant restroom.--The term `ADA-compliant       restroom' means a restroom       that complies with the requirements set forth in section       242(a) of the Americans with Disabilities…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692155/baby-changing-on-board-act"}]