[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…waited those 24 hours to see if she  would make it, I realized that I almost became one of the Black women  who are three times more likely to die due to pregnancy-related  complications than White women.\n\nI was a State legislator at the time. This was my second child. I was  on the Joint Commission on Health Care, and I began to really look into  the maternal…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…misdiagnosed.\n\nThey don't tell her that half of the personnel in the so-called  clinic have no medical credentials at all and, therefore, are not  equipped to advise on any medical complications, such as an ectopic  pregnancy.\n\nThey don't tell her that this is not a medical clinic at all. In  fact, because it is not, this woman's privacy is not protected, and her…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Supreme Court overturned Roe v.  Wade, State abortion bans have undermined healthcare for pregnant  women, causing women to experience life-threatening health conditions  and complications, with some women tragically losing their lives  because of laws that legislators voted for.\n\nNow, House Republicans are going to make things worse by limiting  students'…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…and high-quality healthcare.\n\nThe United States continues to face a maternal health crisis, with  Black women experiencing significantly higher rates of pregnancy- related complications and maternal mortality compared to their white  counterparts. These tragic and preventable outcomes stem from systemic  inequities, implicit bias in healthcare, and social…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…lifesaving. Estimates suggest that each year, it  prevents 17.1 million unintended pregnancies and saves the lives of  34,000 women and girls who otherwise would have died from complications  of pregnancy and childbirth.\n\nThe UNFPA is a critical piece of that puzzle too. This bill ensures  continued funding for international organizations, including UNFPA.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…USAID\n\nHIV-Aids Transmission And Deaths Are Increasing Because Of Cuts To                               Pepfar Funding\n\nCases of HIV have risen and they're seeing now       complications of HIV. There's a disease called Cryptococcus       meningitis [where] . . . a parasite get[s] to the brain       because of the loss of immune systems. [The] U.S. had…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…a child with an illness.\n\nI received letters. Sophia, a single mom from Palatine, IL--17 years  of age, she gave birth to a baby boy. Her son was born with many  medical complications. He had to undergo two surgeries in his first day  of life. Can you imagine?\n\nBy the age of 4, he had undergone eight separate surgical procedures  to address ongoing medical…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…birth defects.\n\nEven coming up as a city council person, I saw that the environmental  injustices surrounding my community were causing parents to have to  deal with medical complications amongst their children at alarming  rates and needed help, and Medicaid was the program--no fault of their  own, environmental injustice.\n\nHere is the double insult of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…suffer from diabetes and amputations that result from them or to die  from untreated cancers or undiagnosed cancers or late-diagnosed cancers  and experience preventable complications from just general chronic  illnesses.\n\nWhen it comes to kidney disease and dialysis access, the results are  alarming. People in the State of Alabama have been trying to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…95 percent of Active-Duty  personnel were vaccinated. While no vaccine is perfect, only three  individuals who took the vaccine while on Active Duty died from COVID- 19 complications.\n\nOperation Warp Speed was so much of a success that Secretary Esper  included a binder labeled ``Operation Warp Speed'' in his official  portrait. It is just too bad that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…National Park Service was able to charge market rent  for the rights to go through this area, and it turns out that that was  a good thing because there were all sorts of complications. In fact,  there are still all types of ongoing repair and monitoring areas where  things weren't installed properly and where there was all sorts of  damage that wasn't…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…sharp  pains, she went to a real doctor and was diagnosed with an ectopic  pregnancy that threatened her life and resulted in an emergency  surgery. She will have lifelong complications. If she had received  actual medical care earlier, she could have received the treatment she  needed before it was too late.\n\nMr. Speaker, I urge my colleagues to defeat…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…here want to impose  on all 50 States and all women in our country.\n\nI think the death certificates for so many other women who have been  denied treatment for pregnancy complications should really read the  truth, which is ``Cause of Death: Republican abortion ban.''\n\nFor every American whose life is threatened by Republican extremist  interference,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…issue.  Unsanitary handling of breast milk and formula puts kids at risk.  Mothers who can't pump because TSA held up their equipment can suffer  painful, preventable medical complications. Every parent who has  traveled with young children knows the stress, as I mentioned, that  this creates.\n\nThis bill is also about accountability. It directs an independent…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…position that she had previously been in,  where she has an untreated medical condition that won't get better on  its own, will likely get worse, and lead to further medical  complications.\n\nWhy would we do that to the American people? That is wrong. We should  be lifting people up in this country, not tearing them down. We should  be lifting up everyday…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…most helpful to him.\n\nIf I ran for reelection, I would necessarily always have to think  about what boundaries I should have in expressing my concern, and that  created complications for my campaign. There are redlines. There are  just certain things I would disagree with and would have to take the  heat in a campaign.\n\nBut I thought, in the moment,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of Hep B United,  a national coalition to unify and enhance local coalitions and  community health centers dedicated to eliminating Hepatitis B virus  infections and its complications. Hep B United was founded in 2013 as a  partnership between the Hepatitis B Foundation and AAPCHO and has done  incredible work in elevating Hepatitis B as a national priority.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…daughter.\n\nAnd we remember: Robert Daye Daffin, Jr., a narcotics agent who  served with the George County Sheriff's Office for more than 14 years.  He died in 2021 from complications as a result of contracting COVID-19  in the line of duty and is survived by his daughter, parents, and three  siblings.\n\nWe honor their memory and stand beside their families…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…mifepristone to induce an abortion is as safe as using Tylenol.  However, new data indicates that nearly 1 in 10 women taking the  chemical abortion pill experience serious complications, such as  sepsis, infection, hemorrhage, or another serious adverse event within  45 days of taking the drug.\n\nMr. Speaker, this real-world complication rate is 22 times…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…containing infected donor material.\n\nOne of these patients was my constituent, Shandra Eisenga, of Marion,  Michigan, who tragically passed away on August 10, 2023, due to  complications from TB.\n\nI was proud to have Shandra's family here last year when this  legislation was first considered by the House. This family has been  forever hurt by the loss of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692764/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…tax treatment. Nobody is treated differently. We would have a  product over here that would allow for true catastrophic insurance,  right--not regulated, not all sorts of complications, not telling you  what you can do, not do, but a risk-based product that says: Hi, I am a  healthy 24-year-old. I would like to just know that, if I am in a bad  accident…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…the need for blood  remains constant.\n\nIn the United States, someone requires a blood transfusion every 2  seconds to treat patients facing trauma, surgeries, childbirth  complications, cancer, chronic conditions, and so much more, yet our  blood supply remains critically low.\n\nBecause of the urgent and ongoing need for blood donations, I  recently introduced…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699256/national-blood-donor-month"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…abortion regimen is falsely advertised to be safer than  Tylenol. Tragically, many women have learned otherwise. Nearly 11  percent experience serious or life-threatening complications such as  sepsis, hemorrhage, infection, and emergency surgery within 45 days of  ingesting the pills.\n\nThe SAVE Moms and Babies Act would restore commonsense safety  protections,…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…abortion regimen is falsely advertised to be safer than  Tylenol. Tragically, many women have learned otherwise. Nearly 11  percent experience serious or life-threatening complications such as  sepsis, hemorrhage, infection, and emergency surgery within 45 days of  ingesting the pills.\n\nThe SAVE Moms and Babies Act would restore commonsense safety  protections,…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699389/rounds-mr-wicker-mr-lankford-mr-mcconnell-ms-lummis"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…might get unelected. You have a dozen countries that can sell a 10- year bond cheaper than the United States today, Greece being one of  them.\n\nLet's get into some of the complications. When I say one of the  primary drivers is interest and demographics, remember, if you have $38  trillion--and remember, we play this game. The United States does this.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}]