[{"senator": "George Latimer", "party": "Democrat", "sentence": "…travel industry is an economic powerhouse in the United States,  with nearly $2.9 trillion annually in economic activity. The U.S. ranks  behind Spain and France in global competition for travel. China, India,  and Saudi Arabia are gaining on us. Our market share is 9.1 percent,  but we can generate 127 million new additional visitors over the next  decade…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…them.\n\nLast year, the Chinese Government invested over $4 billion in  biomanufacturing. We must take action now. We must not cede the lead to  China. We must win the biotech competition.\n\nIt is for that reason, Mr. Chair, I urge my colleagues on both sides  of the aisle to join me in strongly opposing this amendment, and I  yield back the balance of my…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…first place prize. They are now world champions in the Scholastic  Independent division after earning a final and near-perfect score.\n\nThe WGI Championship was the final competition in the Matrix M3  percussion ensemble's busy season, after competing in seven different  contests across the Midwest. The group is a perfect example of why  Ohio's 13th…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690946/congratulating-matrix-m3-indoor-percussion-ensemble"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…of water, we would actually be doing things to  help the American people.\n\nMr. Speaker, I rise today to honor and celebrate the winners of this  year's Congressional Art Competition.\n\nArt is a cornerstone of educational success for our students, giving  them a healthy, creative outlet to process their emotions and share  their stories with the world.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690755/congratulations-to-marely-gutierrez"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…forcing families, on average, to  pay $150 more per month on their energy bills just in 5 years, and $260  per month more each month in 10 years because there won't be the  competition, and there won't be the supply.\n\nAnd the less the supply is the higher the price for the remaining  electricity in our society. And it will also destroy 840,000 American…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the  works of Mozart, Bach, Beethoven, Dvorak, and other great composers.\n\nIn addition, the symphony organization hosts an annual jazz  institute, a young artists concerto competition for students of all  ages, an apprenticeship with New Rochelle High School musicians, and so  much more.\n\nBarry and his army of woodwinds, brass, percussion, and strings…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696750/saluting-the-work-of-barry-hoffman"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…be among the  next century's key economic and geopolitical battlegrounds,'' reaffirms  our commitment to a free and open Indo-Pacific and prioritizes winning  the economic competition over the long term in the region.  Additionally, the U.S.-China Economic and Security Review Commission's  2025 Annual Report to Congress recommended that we strengthen…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…these tariffs should be reviewed by Congress for approval  or disapproval, and doing so is in the best interest of our country.\n\nI can't tell you how challenging I think competition in a fast-moving  information age global economy is. We can't afford a trade war that  lasts for 2 or 3 years, leaving our product off the shelves.\n\nWe must reassert Congress's…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Act). The ROD explains that barred owls, a       non-native invasive species in western North America, compete       with northern and California spotted owls, and this       competition ``is a primary cause of the rapid and ongoing       decline of northern spotted owl populations'' and poses a       similar risk to California spotted owls as barred owl…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…security  interests in the Indo-Pacific and advises greater U.S. engagement to  advance our shared interests and values, particularly in the context of  growing geopolitical competition and threats by our shared adversaries  to endanger the pursuit of a free and open Indo-Pacific.\n\nTo bolster U.S. engagement with this region, we have reintroduced our  Pacific…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…economically viable.''\n\nEvery company is economically viable.\n\nTurning America's back on recognized U.S.-based manufacturing--I will  underline that--facing fierce global competition--I underline that--is  an insult.\n\nThis includes hundreds of hardworking constituents even across  northwest Ohio. If the goal is to Make America Great Again, then the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…look out to the mid- century mark, waving maybe frantically good-bye as much as we want to  cling to the great half-century of America in the 20th century, we know  that competition is ripe, that we cannot rest. When you talk to  autoworkers and auto executives, they know how ferocious that  competition is with the Chinese Communist Party.\n\nIt is a…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…today to congratulate the Memphis  Central High School Jazz Band and Band Director Ollie Liddell for  winning First Place Honors at the 30th Annual ``Essentially Ellington  Competition and Festival'' at Lincoln Center in New York City on  Sunday, May 11. The band was one of 127 that applied this year,  competing with bands from all over the world including…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691133/congratulating-memphis-central-high-school-jazz-band"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…necessary to win  into the mid-21st century.\n\nFrom my vantage point of serving on the Science, Space, and  Technology Committee and the Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party,  I certainly understand the risks. Many of us who are delving into these  topics have really glommed on to the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…University's Kelley School of  Business. He was known for his joyful smile and ability to inspire a  sense of community wherever he went.\n\nAs a volleyball team captain and a STEM competition coach, Nihaal was  always attuned to the needs of those he led. Whether mentoring a  teammate  through a difficult challenge or calmly navigating high-stakes  competitions,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691338/in-memory-of-nihaal-grandhi"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…H.R. 1182 will better protect the public from the  dangers of poorly manufactured and mislabeled compressed gas cylinders.\n\nThis legislation will also better ensure fair competition for  American manufacturers and workers.\n\nFurther, H.R. 1182 improves transparency by requiring all  applications to be subject to public review and input. It ensures that…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Relay team have  represented their school ably on their way to achieving the Division  III State Track and Field Title. The team overcame the challenges posed  by intense competition in their effort to surpass all other relay teams  in their event.\n\nIn pursuing the State Championship, Audrey Alig, Lana Kaiser,  Kiersten Keller, and Isabella Zahn defeated…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693429/special-recognition-of-coldwater-high-schools-girls-4x400-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…solution. Government is the problem. This is a  case study for that. America needs less mandates, less taxes, less  regulations, and people need more freedom, more choices, more  competition.\n\nRepublicans are willing to work with Democrats, but this is beyond  the pale, and it is audacious to call it affordable healthcare. I am  amazed. I am surprised. I encourage…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…and Wyatt Clare from Penn Manor High School  for achieving two first-place finishes in the Sea Air and Land  Challenge (SEAL) at Millersville University.\n\nSEAL is a STEM competition sponsored by the Office of Naval Research.  Millersville University is one of the many schools in the Nation that  host this program, bringing in teams of high school students…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694803/recognizing-penn-manor-high-school-students-for-their-achievement-in-the-sea-air-and-land-challenge"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…walk in the door and say: We  really want you to save the future generation. Spend less money.  Everyone is at our door either wanting money or wanting us to regulate  their competition. That is bureaucracies. That is businesses. That is  private groups, charities. Give us more money, or create a barrier to  entry so I don't have to compete with someone…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Field Team have represented  their school ably on their way to achieving the Division III State  Track and Field Title. The team overcame the challenges posed by  intense competition in their effort to surpass all other teams at the  2025 OHSAA Division III State Track and Field Championships.\n\nIn pursuing the State Championship, the Cavaliers defeated…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693344/special-recognition-of-coldwater-high-schools-girls-track-and-field-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…war. Here  is the deal: If you don't provide more baseload, your price is going to  go up. We have to grow baseload in this country. The only way to reduce  energy prices is competition and more energy.\n\nEvery Member in this Chamber and the American people have witnessed  the drastic consequence of this antidomestic energy policy championed  by the previous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…choking off the supply  through regulation, licensing barriers, and protection of entrenched  interests. When government pours taxpayer dollars into a system that  restricts competition, prices rise, efficiency collapses, and  accountability disappears.\n\nThrough it all, the one group that was systematically excluded from  decisionmaking is the patients…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Huber family, Starlight  earned global recognition when its Japanese Mizunara Reserve finished  bourbon was named the best overall bourbon at the San Francisco World  Spirits Competition.\n\nThat is right, Kentucky, Indiana's bourbon is the world's best.\n\nThis prestigious award reflects the family's dedication to hard work  and a commitment to quality that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Basketball Title. In their effort to surpass all other teams in the  Division IV State Basketball Playoffs, the Bellevue Redmen overcame the  challenges posed by intense competition.\n\nIn pursuing the State Championship, the Bellevue Lady Redmen defeated  the Kettering Archbishop Alter Knights to win their first state  basketball championship. The members…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689987/recognizing-bellevue-high-school-winning-the-division-iv-state-girls-basketball"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…purchased a catastrophic or bronze  health plan on the Federal marketplace to now contribute to and use a  health savings account.\n\nIn addition, this will improve access and competition on the Federal  marketplace, and that, we all know, is sorely needed.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693915/health-savings-accounts"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…congratulate a team of extraordinary young students  at Greenfield-Central High School back home in my district for their  winning performance at our Indiana State robotics competition.\n\nGreenfield-Central's team surpassed 62 other terrific Hoosier teams  to claim top honors. Coach Jason led The Exothermics, Greenfield  Central's team, comprised of juniors…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690023/congratulating-greenfield-central-high-school-for-winning-the-indiana-state-robotics-championship"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…first- and second-place winners of the  69th Annual Tevis Cup, a grueling 100-mile endurance trail ride from  Robie Park to Auburn, held on July 12 of this year.\n\nThis year's competition proved even more challenging than usual, with  the heat and rocky road providing unforgiving conditions for all  competitors.\n\nOf the 105 entrants, only 43 were able to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…to a memorandum or agreement described in subsection (b)       shall be applied in a manner consistent with subtitle D of       title VI of the Research and Development, Competition, and       Innovation Act (Public Law 117-167; 42 U.S.C. 19231 et seq.).       SEC. 3. COMPLIANCE WITH CUTGO.\n\nNo additional amounts are authorized to be appropriated to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…community with excellent success, competing across multiple  prestigious competitions. The Marching Dutch delivered their strongest  performance at the Band of America Regional Competition, where they  claimed first place in Class 2A and earned the Outstanding General  Effect award.\n\nThey advanced to the open class finals and placed tenth overall. They  celebrated…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}]