[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…managed by  the Buffalo Field Office unavailable for new coal leases.\n\nHad I been present, I would have voted against the measure as I had  voted against the identical Senate companion, S. 89, the day before,  rollcall vote No. 621. The Congressional Review Act is not the  appropriate tool for reversing Bureau of Land Management decisions that  are developed…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699842/vote-explanation"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…to ask for the House's support  for the Filipino Veterans Family Reunification Act, which I introduced  with my colleague Congresswoman Jen Kiggans of Virginia. It is the  companion version of the bill introduced in the U.S. Senate by Senator  Mazie Hirono of Hawaii, along with twelve other Senators.\n\nIn 1941, more than 250,000 Filipino soldiers responded…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia and Maryland.  Representative Jamie Raskin of Maryland joins me in introducing this  bill. and Senator Chris Van Hollen of Maryland is the sponsor of the  companion bill.\n\nNewlands was a U.S. senator from Nevada, a conservationist and the  founder of the Chevy Chase Land Company, which developed the Chevy  Chase neighborhood that touches…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…let alone attempt to bar.\n\nThe D.C. Admission Act. The House passed the Act, as H.R.       51, on April 22, 2021, and as of this writing, the       substantively identical companion bill (S. 51) is under       consideration by the Senate. The Act provides for the       issuance of a congressional joint resolution declaring the       admittance as a State…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today in support of my Pacific  Partnership Act, co-introduced with Congresswoman Radewagen of American  Samoa and cosponsored by 21 of our colleagues. A companion version of  our bill was introduced in the U.S. Senate by Senator Cortez Masto of  Nevada and Senator Ernst of Iowa.\n\nScattered across the three traditional Pacific subregions…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…introduced today. Some of them had Republicans on them last term.\n\nThe Home Accessibility Tax Credit Act is a great bill, and I am proud  to have Senator Angus King as my companion on this bill. It is a  refundable tax credit to help seniors and Americans with disabilities,  including our veterans, retrofit their homes to meet their  accessibility needs.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…thank Representative Figures for  yielding.\n\nMr. Speaker, as the co-chair of the bipartisan Oceans Caucus, I rise  enthusiastically today in support of S. 216, the Senate companion to my  bipartisan legislation, the Save Our Seas 2.0 Amendments Act.\n\nMarine debris does not stay in one place. A plastic bottle tossed  inland can end up hundreds of miles…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Extension Act'' to safeguard federal  funding for disaster-recovery projects. I thank U.S. Senator Alex  Padilla (D-CA) and U.S. Senator John Cornyn (R-TX) for sponsoring the  companion legislation and my colleague, Congressman Doug LaMalfa (R-CA)  for cosponsoring the bill. I also want to thank the California  Department of Transportation and the Texas…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694581/introduction-of-the-transportation-emergency-relief-extension-act"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…source of news, sports, and thoughtful  discussion.\n\nWJBC continues to cement its legacy as a cornerstone of regional  media--but more than that, WJBC has been a constant companion to its  listeners, always delivering the stories that matter most. On this  historic milestone, I congratulate WJBC on 100 years of excellence and  look forward to many more…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690795/recognizing-wjbc-radios-100th-anniversary"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…legislation to build  a new national cemetery in Hawaii. I am joined by my Hawaii colleagues,  Congresswoman Jill Tokuda, and Senator Mazie Hirono, who is introducing  the companion bill in the Senate.\n\nOur Nation has a special responsibility to our veterans. They served  with selfless service, courage and sacrifice to defend our Nation. As a  fitting…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…let alone attempt to bar.\n\nThe D.C. Admission Act. The House passed the Act, as H.R.       51, on April 22, 2021, and as of this writing, the       substantively identical companion bill (S. 51) is under       consideration by the Senate. The Act provides for the       issuance of a congressional joint resolution declaring the       admittance as a State…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…programs and  it is my priority to see these programs continue without disruption.\n\nFor more than 40 years, and Small Business Innovation Research  Program (SBIFR), and later its companion program the Small Business  Technology Transfer Program (STTR), have been contributing to U.S.  leadership in technological innovation through support for small  business…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…8 housing, in compliance with the marijuana laws of the  state (including the District of Columbia) where the property is  located. Senator Cory Booker is introducing the companion bill.\n\nIndividuals living in federally assisted housing should not be denied  admission, or fear eviction, for using a product that is legal in the  state where they reside.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…education that are going to be much more important in  terms of trying to save people's lives.\n\nMr. Speaker, as I mentioned before, the bill before us today is the  Senate companion to H.R. 27, which we voted on here in the House on  February 6 of this year. The two bills are identical, other than a  couple of minor punctuation differences. This bill…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…no  senators, D.C. is deprived of 10 appointments and, assuming all  appointments are vacant, 150 nominations to each service academy.  Senator Tim Kaine has introduced the companion bill.\n\nThis bill would provide equality for D.C. residents who choose to  serve their country by applying to a service academy. It is remarkable  that D.C. residents volunteer…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696573/introduction-of-the-service-academies-district-of-columbia-equality-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…the Office of the Comptroller of the  Currency's final rule that makes it more difficult for banks to merge  and merge in a healthy way. That is why I introduced the House  companion, H.J. Res. 92.\n\nToday, we have the opportunity to prevent future administrations from  issuing arbitrary rules on mergers and acquisitions that lack robust  cost-benefit…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…generations  of Americans to enjoy the natural landscape and animals that Jocelyn  also enjoyed.\n\nI, again, thank my colleague, Congressman Babin, for introducing the  House companion of the legislation and for his commitment to honoring  Jocelyn's memory.\n\nMr. Speaker, I support this bill, and I reserve the balance of my  time.\n\nMr. WESTERMAN. Mr. Speaker,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…defensive weapons.\n\nCongress should also fully consider, debate, amend, and pass the  sanction legislation offered by Senator Lindsey Graham, which has 84  cosponsors, and its companion bill in the House sponsored by  Congressman Brian Fitzpatrick.\n\nThe President should, as a part of a newfound backbone in the G7,  fully implement the REPO Act, which I worked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Mr. COTTON.  Res. 104, H.J. Res.  105, and H.J. Res. 106, respectively, if the Senate companion measure  has been discharged from committee, and for Senator Schiff or his  designee to make a motion to discharge S.J. Res. 83.\n\nMr. COTTON. I know of no further debate…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696075/9999"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…privilege to represent.\n\nMr. Speaker, this is going to be the third time if it passes--and I  hope it will--that we pass this bill out of the House. This bill has a  Senate companion, and, Mr. Speaker, it is a bipartisan Senate  companion. I want to mention the sponsors: Senator Rick Scott, Senator  Joni Ernst, and Senator Alex Padilla.\n\nIt deals with…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…myself such time as I may consume.\n\nMadam Speaker, today I urge my colleagues to support S. 3705, the  Semiquincentennial Congressional Time Capsule Act. This is the Senate  companion to H.R. 6243, introduced by my colleagues, Representatives  Bonnie Watson Coleman,   Robert Aderholt, Maria Salazar, and Dwight  Evans.\n\nThis nonpartisan legislation would…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Heinrich for  introducing this important legislation which passed the Senate  unanimously in April.\n\nI also thank Representative   Dan Newhouse for introducing the House  companion bill and leading the charge in this Chamber. I encourage my  colleagues to once again support S. 160.\n\nMr. COMER. Mr. Speaker, I urge my colleagues to support this  important…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…filed not later than 10 years after the date       of the violation or conspiracy.''.\n\nMr. Speaker, I rise in support of H.R. 4495, the SBA Fraud  Enforcement Extension Act, a companion piece of legislation to S. 1199,  introduced by Senator Ernst.\n\nH.R. 4495 is bipartisan legislation introduced by the gentleman from  Montana (Mr. Downing) and the gentleman…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697227/sba-fraud-enforcement-extension-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…local economy.                  Support for S.J. Res. 91 and H.J. Res. 131\n\nS.J. Res. 91, introduced by Senator Murkowski and co-      sponsored by Senator Sullivan, and its companion measure in       the House, H.J. Res. 131, introduced by Representative       Begich, are identical resolutions providing for congressional       disapproval of BLM's 2024…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…unanimous consent to  pass two noncontroversial bills as a bipartisan pair. The first is H.R.  2815. This is sponsored by Congressman Begich from Alaska. It is the  identical companion to my Cape Fox Land Entitlement Finalization Act.  And the second is H.R. 972, sponsored by Representative Dina Titus of  Nevada. It is the identical companion to Senator…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…this resolution today and send it to  the President's desk to deliver on our promise to unleash American  manufacturing and energy.\n\nI am proud to have introduced the House companion to this CRA with  the gentlewoman from North Dakota (Mrs. Fedorchak), my good friend, and  I strongly urge my colleagues to support this commonsense resolution.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691594/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…that two House       subcommittees had already held extensive hearings in May       1983. Regardless of the two year delay, proponents now had a       House bill and a Senate companion. The delay also resulted in       trying to legislate during the upcoming presidential election       year. Indeed, it was an uncertain environment for wilderness.\n\nOn Wednesday,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Government's unnecessary  involvement no longer stands in the way of progress for the children of  Paducah and McCracken County.\n\nI thank Senator Paul for introducing the Senate companion bill, S.  601, and Senator McConnell for being an original cosponsor of that  legislation. I look forward to working with them to get this bill  across the finish line and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…local economy.                  support for S.J. Res. 91 and H.J. Res. 131\n\nS.J. Res. 91, introduced by Senator Murkowski and co-      sponsored by Senator Sullivan, and its companion measure in       the House, H.J. Res. 131, introduced by Representative       Begich, are identical resolutions providing for congressional       disapproval of BLM's 2024…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…also thank the Ranking Member of the Subcommittee  on Disability Assistance and Memorial Affairs, Mr. Morgan McGarvey, and  Mr. Takano for joining me in co-leading the House companion of S. 2392.\n\nAs chairman of the Subcommittee on Disability Assistance and Memorial  Affairs, I am dedicated to serving my fellow veterans. This legislation  is necessary…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696760/veterans-compensation-cost-of-living-adjustment-act-of-2025"}]