[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize New Terrain  Brewing Company of Golden, Colorado, for winning a Gold Medal from the  World Beer Cup, designating their Suntrip brew as a world-class beer.\n\nThe World Beer Cup, otherwise known as the ``Olympics…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694718/recognizing-new-terrain-brewing-company"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…have been forced to shut down,  ending funding for the most cutting-edge technologies being developed  by our most nimble allies, small businesses. I am disappointed that a  company in Pennsylvania may have to cease scaling their patented brake  technology due to the lapse in the programs. I am disappointed that a  company in Virginia producing the next…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…addition to his civil service, Steve has dedicated much of his  time and energy to a myriad of local organizations. He is a former  volunteer for West Haven Hook and Ladder Company 1, a longtime member  of the West Haven Irish American Club, a lifetime member of West  Haven's Elks Lodge 1537, and a former member of the Knights of St.  Patrick in New…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…place, from Van Nuys High School, we have Gayane Charyan's  ``Forlorn Art Piece.'' In this piece, we see a girl sitting alone on a  swing. The shadow of herself is her only company. This is an important  piece that lets people know that loneliness and mental health affects  all of us.\n\nMr. Speaker, I also take this time to share the 988 lifeline that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692266/congratulating-californias-29th-districts-congressional-art-competition-winners"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…the highest rates, Mr. Speaker, in  the Nation, while they have some of the most unreliable service and  they perform hundreds of thousands of utility shutoffs per year.\n\nThe company made $1.4 billion last year alone. Their CEO made $12.5  million last year. Investor-owned utilities like DTE will always put  profits over the people they are supposed to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690549/dte-rate-increase"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…class. China cannot be confronted if people are not  willing to do so.\n\nWe also need to take steps so that Chinese stocks are not included in  index funds and so that every company that reports to the SEC informs  its shareholders of what risk they have due to their dependence on  China and what they are doing about it so that every private company is…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Dental and their achievement in receiving the prestigious Malcolm  Baldrige National Quality Award.\n\nNortheast Delta Dental was founded in 1961 as a not-for-profit dental  company administering care in Vermont, Maine, and New Hampshire. In New  Hampshire, Northeast Delta Dental plays a crucial role in providing  dental insurance to over half of insured…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688205/recognizing-the-achievements-of-northeast-delta-dental"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…unions from Saginaw up to Iron Mountain working and making and  delivering--the only polysilicon manufacturing in the Nation exists in  Michigan, in a place called Hemlock by a company called Hemlock--you  want to make sure that Michigan has its fair and equal representation.\n\nHowever, Mr. Speaker, it has been a point of frustration for my State  of Michigan…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…regions just as we do in Appalachia and  with the other kinds of instrumentalities that exist across our  country. We are very proud of our working-class people. We have a  company right now in my hometown of Toledo, Libbey Glass, where we have  a major strike.\n\nWhy?\n\nIt is because they are in competition with China, Mexico, and France  with no help…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…to H.R. 2987, the  CEASE Act, because it has the potential to harm our Nation's most  underserved small businesses.\n\nThis bill would cap the number of Small Business Lending Company, or  SBLC, licenses that the SBA can issue at its current level of 16  licenses. These licenses enable lenders to make loans of up to $5  million to small businesses that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692070/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…firms like AIG or Lehman Brothers that can pose a threat to our  financial stability.\n\nCongress gave FSOC various tools, including the power to designate a  large nonbank company as a systemically important financial institution  for enhanced oversight and regulation. In Trump's first term, they  severely weakened the nonbank designation process. In…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…up his sleeves and  worked wherever his community needed him: as a bus driver, ensuring  children arrived at school safe and ready to learn; as a mechanic at  Dawson Motor Company, tending to the machines that helped his neighbors  make a living; and later in the ranks of public safety--with the Dawson  Fire Department, the Dawson and Dougherty County…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…we are  seeing that in many parts of the country. We are seeing it in Rhode  Island.\n\nUnsurprisingly, job growth, as a result, has stagnated under  President Trump. Payroll company ADP found the private sector actually  lost 32,000 jobs last month, while those Yale researchers estimate that  Trump tariffs will eliminate half a million jobs this year.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…places where nonrenewal rates for homeowners insurance are  increasing. What is the nonrenewal rate, you may ask, for homeowners  insurance? That is how often the insurance company says to you, their  longtime customers: Hey, thanks for being my longtime customer, but you  are fired now. I don't want your property. I can't insure it. There is  too much…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress is required to clarify that LGBTQ+ jurors in the D.C. Superior  Court are protected from discrimination.\n\nAs the Supreme Court said in Edmonson v. Leesville Concrete Company,  ``discrimination within the courtroom raises serious questions as to  the fairness of the proceedings conducted there. . . . [B]ias mars the  integrity of the judicial system…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692690/introduction-of-the-district-of-columbia-local-juror-non-discrimination-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…non-profit organization that provides  rehabilitative, preventative, educational, and employment services to  the blind and vision impaired. Mr. Steiner's history with the company  stretches back 41 years when he joined the agency in 1984 as a case  manager. In 2008, he became President and CEO of the agency.\n\nA strong advocate for the blind and visually…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696276/congratulating-visioncorps-president-and-ceo-dennis-steiner-on-his-retirement"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…goods or       services that a consumer selected from an online or physical       store or marketplace operated prominently in the name or such       person or its affiliated company.'' While this exclusion       seems to cover transactions between consumers and merchants       using a merchant's own payment software, the proposal later       states the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "James Risch", "party": "Republican", "sentence": "…equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be Repkon USA, located in       Tampa, FL; and The Boeing Company, located in St. Charles,       MO. At this time, the U.S. Government is not aware of any       offset agreement proposed in connection with this potential       sale. Any…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…family and caring for their  children along with her husband, Pat. Together, Beth and Pat launched a  family business, Terrell Materials, a leading concrete manufacturing  company that services major airports.\n\nIn addition to her career, Beth has continued to stay involved in  numerous community service initiatives. She served as President of the  Carolina…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694169/recognizing-congressional-patriot-award-recipient-beth-terrell"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…actually get what we are  talking about. Not the bill of goods they are being sold, but when you  look at what happens with the concept of inversion. When a U.S.  multinational company can choose to co-op with a foreign entity to be  able to find a lower tax domicile, lowering their overall tax  liability, they can do that. That happens, and they end up…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and readiness of our military forces relies  on the highly skilled practices of defense contracting partners like  JLG Industries, Volvo Construction Equipment, the Manitowoc Company,  and firms like Lockheed Martin, Leonardo DRS, Kongsberg Defense  Corporation, and JWF Defense Systems. These are all examples of  companies that put our Nation's vital interests…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…business. His father, Lester  Young, had founded the Young Fire Equipment Corporation in 1944, and by  the time Dick completed his military service, he was destined to lead  the company. As President, he relocated it to 204 Cemetery Road in  Lancaster, where his Navy-honed skills and forward-thinking mindset  revolutionized the fire apparatus industry. He…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the California State Assembly in 1982.\n\nSomehow, she was able to clean up every mess I made in those years.  She continued in that capacity until Newhall Land and Farming Company,  the largest land developer in California, recognized her talents and  offered her a senior position in their company when she was still in  her twenties.\n\nWell, four decades…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the Judiciary, the Committee on Ways and Means,       and the Permanent Select Committee on Intelligence of the       House of Representatives.\n\n(2) Blockchain intelligence company.--The term ``blockchain       intelligence company'' means any business providing software,       research, or other services (such as blockchain tracing       tools, geofencing,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…in Vietnam.\n\nMr. Gilman of Airway Heights served valiantly in the American  Division during the 1969 Tet Offensive. Amid intense combat near Phuoc  Hoa, South Vietnam, his company was ordered to relieve a friendly unit  under fire. Though wounded in action, Mr. Gilman refused to fall back.  He steadfastly manned his M60 machine gun and continued providing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…occur in the month of January, including  Greenwood's, where I attended Mayor Mark Myers' 14th state of the city  address.\n\nI visited with the leadership of Cummins Engine Company,  headquartered in the district. I toured their cutting-edge engineering  facility at their Cummins Engine plant.\n\nI toured Rolls Royce and their massive aircraft engine design…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…policy decision, Mr. Speaker, because if you are the  Chinese Communist Party and see a mine is getting ready to happen in  the United States, and it is going to be done by a company that is  traded publicly, you could go buy 10.1 percent and stop the project. We  don't need that kind of policy.\n\nPlus, that policy doesn't apply to the jurisdiction of this…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…jail, just like his kindred spirits in other  censorship regimes.\n\nThis tyrant who wants to be treated as a peer in the world's great  halls of democracy should be known by the company he keeps.\n\nWhen the brutal Syrian dictator Bashar al-Assad was toppled,  thankfully, where did Bashar al-Assad run? He ran for safe haven to  Moscow--that is where he went--to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…That is why Republicans have focused on a way forward on healthcare  that actually lowers costs, fights fraud, and gives power to the  patient, not profit to the insurance company, not ill-gotten gains to  the criminal.\n\nMy Democratic colleagues are about to put up a resolution that would  do a Congressional Review Act on a recent rule put out by the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…reservation system;\n\nWhereas Ralph Baer invented the ``Brown Box'', a prototype       for the first multiplayer, multiprogram video game system;\n\nWhereas Ruth Handler founded the toy company Mattel and       invented the Barbie doll;\n\nWhereas Emile Berliner invented the gramophone record and       the microphone that became part of the first Bell telephone;\n\nWhereas…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}]