[{"senator": "George Latimer", "party": "Democrat", "sentence": "…LATIMER. Mr. Speaker, I rise to acknowledge the celebration of  the Reverend Troy DeCohen, senior pastor of the Mount Vernon Heights  Congregational Church, in this year completing his 25th year of  pastoral leadership.\n\nReverend DeCohen has a distinguished clerical career. He was called  to the ministry in 1988, was active in churches in New Jersey…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…ensure that VA provides employment contracts to  graduates of the Health Professionals Scholarship Program within 90  days of completion of their programs or within 90 days of completing  all necessary licensing and credentialing processes, whichever is  later.\n\nParticipants in the Health Professionals Scholarship Program are  dedicated to service to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695433/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, I rise today to congratulate Linda Larson on  fulfilling her lifelong dream of completing her college education.  Linda graduated with an Associate's Degree with an emphasis on  political science from Inver Hills Community College. She also  graduated as part…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Ms. LEE of Nevada. Mr. Speaker, I rise today to recognize two  extraordinary women, Dr. Lynn Kowalski and Dr. Stephanie Wishnev, for  completing one of the TransAmerica routes. It is one of the most  challenging cycling endeavors in the world, spanning from Astoria,  Oregon to Yorktown, Virginia.\n\nAs an avid cyclist…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696210/recognizing-dr-lynn-kowalski-and-dr-stephanie-wishnev-for-completing-the-transamerica-route"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…extraordinary  military servicemember now serving our public schools.\n\nMr. Kenneth Singleton has dedicated decades of service to our  community. From serving in the U.S. Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned him the Meritorious Service Award five times.\n\nFor Mr. Singleton, public…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…fairness, good will, benefit, and fun in their  activities under the banner of service above self.\n\nRecently, the club raised needed funds for their community service  projects, completing a 25-hour-plus marathon filibuster, assisting  families in need.\n\nThe club is led by President Alan Gray, President-elect Anne Murphy,  Vice President Jeffrey Landsman, Immediate…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699979/recognizing-yonkers-east-yonkers-rotary-club"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…this bill provides Congress the transparency and insight we need  to oversee the licensing and regulation of private remote sensing  systems. It modifies the timeline for completing licenses to conform  with updated regulations. It also requires information to provide  Congress with details on licensing related to regulatory changes.  Further, it extends…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…Massachusetts Nautical  School in Boston, presently Massachusetts Maritime Academy in Buzzards  Bay. He then went on to enlist in the United States Navy in December  1939. After completing training in Newport, Rhode Island, Johnson was  assigned to serve aboard the USS St. Louis as a Machinist First Class.\n\nOn the morning of December 7, 1941, the USS St. Louis…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696706/recognizing-freeman-johnson"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize General Atomics, a  world-leading technology company headquartered in the district I  represent, and their historic achievement of completing the ITER  Central Solenoid. This giant custom-designed magnet, 60 feet tall, 14  feet wide, and weighing over 1,000 tons, is the largest pulsed  superconducting electromagnet…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694165/recognizing-general-atomics"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Ecumenical Patriarch, a historic title dating to the sixth  century. The Ecumenical Patriarch received his elementary and secondary  education in Imvros and Istanbul. After completing undergraduate  studies at the historic Theological School of Halki, he pursued  graduate studies at the Pontifical Oriental Institute of the Gregorian  University in Rome…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…If passed, school districts already facing shortages of teachers,  counselors, and support staff now will have to divert critical time and  resources from instruction to completing bureaucratic paperwork, like  what qualifies as a foreign source and who qualifies as a foreign  source. Schools have got to have professional development, so every  school…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…killed while  responding to a disturbance call in the Gila River Indian Community. He  had served with the Gila River Police Department for less than 1 year  and was still completing field training. His father, Deputy Sheriff  David Leroy Briese, Jr., of the Yellowstone County Sheriff's  Department, Montana, died in the line of duty on November 3, 2006.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…deals  principally with fixed-wing aviators. I am hopeful that we will  similarly rally around legislation for rotary-wing aircraft pilots.\n\nI am genuinely hopeful that, upon completing this study, we will be  significantly closer to understanding the root causes of aviator  cancers. More importantly, we will be able to provide our Nation's  veterans with…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…1069, if passed, would force school districts already facing  shortages of teachers, counselors, and support staff to divert critical  time and resources from instruction to completing bureaucratic  paperwork. This is the very definition of an unfunded mandate. It  imposes obligations on 15,000 school systems without offering any  capacity or funding to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…unaware of their right to accommodations, including leaves of       absence, lactation accommodations, academic adjustments--      including virtual learning and extensions on completing       assignments--financial aid eligibility, and child care.       Ensuring that students are informed about their educational       institution's policies that can further…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…officer, Evan has remained committed to his  educational and professional growth, earning a Master of Science Degree  in Organizational Leadership from Regis University and completing the  Air Force's Continuous Process Improvement Green Belt Program.\n\nDuring his career, Evan has served with distinction at the Squadron,  Wing, and Major Command levels,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…five more CEOs than there have been riders. Five CEOs, zero  riders. But the new CEO came out with some exciting news. He announced  that he has a goal by the year 2045 of completing the line going from  Palmdale to Gilroy.\n\nSo let's parse that statement, a goal of by 2045 going from Gilroy to  Palmdale to Gilroy.\n\nWell, 2045 is, of course, 20 years from…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…graduation, when he enlisted in the United States Marine Corps.  He reported to Marine Combat Training at the School of Infantry in Camp  Pendleton, California in 1996. After completing training at Camp  Pendleton, Timothy attended Personnel Administration School at Camp  Johnson, North Carolina where he earned the Military Occupational  Specialty (MOS)…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…have been facing  higher input costs, tighter margins, and growing uncertainty since  2021. They need predictability, risk management tools, and a strong  farm safety net. Completing a farm bill that reflects the realities on  the ground is vitally important, and I will continue pushing for a  fiscally conservative, 5-year farm bill that reflects the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…(two terms) of the Bowie  County Republican Women, a chapter affiliated with the Texas Federation  of Republican Women (TFRW). Outside of her service, Lisa is also close  to completing a personal goal--visiting all fifty states, with only two  remaining.\n\nLisa Singleton's lifelong commitment to her community, her  profession, and her Nation truly exemplifies…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Robert S. Smith on his retirement from service to our Nation  in the United States Air Force and Air National Guard.\n\nChief Smith entered the U.S. Air Force in December 1987, completing  the Aerospace Ground Equipment Apprentice course in June 1988. During  his active component service from June 1988 to October 1999, Chief  Smith performed numerous support…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Relations with Taiwan' and related documents,       and reissue such guidance to executive branch departments and       agencies; and\n\n``(B) not later than 90 days after completing a review       required by paragraph (1)(A), submit an updated report to the       Committee on Foreign Relations of the Senate and the       Committee on Foreign Affairs…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…threats from adversarial  nations and ensure critical infrastructure systems are protected from  these threats.\n\nMr. Speaker, this Homeland Security bill is the last piece in  completing 12 fiscally responsible, bipartisan spending bills. It is a  testament to--\n\nMr. NEWHOUSE. It is a testament to the hard work of the committee and  subcommittee leadership…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…you one example: intercountry adoptions.\n\nDuring the COVID-19 pandemic, China ``temporarily'' restricted travel  into the country, which stalled hundreds of families from completing  their adoptions. Today, the families I mentioned continue to be  separated from their adoptive child in China or are learning that the  child they have been matched with…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692787/intercountry-adoptions"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…understanding and knowledge of the value of mathematical       modeling and statistical modeling in education.\n\n(b) Public Stakeholder Meeting.--In the course of       completing the study described in subsection (a), NASEM or       such other appropriate entity shall hold not fewer than one       public meeting to obtain stakeholder input on the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…place where fear has turned to freedom. She uses her  motorcycle as the vehicle for her fearless healing.\n\nShe defended her nickname by conquering the Pikes Peak summit,  completing the 18-mile trek more than 14,000 feet in the air.\n\nLast month, she undertook a solo cross-country ride, her travels  stretching over 5,000 miles. She is now one of only…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Dakota RMP through a Record of       Decision (ROD) incorporated into the document.\\13\\ The ROD       states that it represents the agency's final decision, issued       after completing procedures required by FLPMA, environmental       reviews in accordance with the National Environmental Policy       Act (NEPA), and considering public comments.\\14\\\n\nThe…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…shutdowns are  expensive, and this is something that ends up costing us money every  time we do it. And, of course, we have quite a bit of national debt.\n\nNow, when we talk about completing our appropriations bills and  setting our spending limits for the year and fulfilling that budget  document, that portion--we have our budget document. Then we move to  our…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…government finally access clean water.\n\nThis bill passed both Houses unanimously. Republicans and Democrats  from across the entire country all agreed: This is a project worth  completing, not abandoning.\n\nMr. Speaker, veto overrides are rare, and they should be. However,  the Constitution gave Congress this authority for moments exactly like  this: when the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…collect or use any personally identifiable information,       such as name, date of birth, and SSN;\n\nhelp a consumer apply for coverage or financial assistance       by completing an eligibility application on their behalf; and\n\nactively enroll a consumer in a plan offered through the       federal Marketplace.\n\nAfter a consumer has applied or is enrolled,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}]