[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…clean  air and want strong vehicle emissions regulations would have had a  voice. Something would have had to have been agreed to. There would  have had to have been some compromise. But Big Oil didn't want that  because they knew what they had here in the Senate: a fast lane to  whatever they want, whenever they wanted.\n\nThey could have gone through…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…public trust in  politics and fuels the belief that the system is rigged for wealthy  elites and insiders. Most troubling, however, is that Citizens United  threatens to compromise the incentives of those of us who serve in  public office.\n\nHouse campaigns now require previously unimaginable sums of money.  Members spend far too much time courting wealth…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…program. They agreed that what they would do was to keep  the program intact, under the assistance of Tip O'Neill, but they  raised the age. That sounds like a reasonable compromise until you  realize that for every year you raise the age, that is a 7 percent cut  in benefits. In essence, back in 1982, there was a 14 percent cut in  benefits.\n\nToday,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…the dedication, and the sacrifice involved  to keep our aging, disabled, or sick loved ones safe and well.  Caregiving can be a 24/7 job, and too often, family caregivers  compromise their own health to ensure that their loved ones are not  left in limbo.\n\nRespite care offers family caregivers a necessary break to focus on  their own mental health and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Federal Bureau of Investigation confirmed that  the Chinese Government hacked ``multiple telecommunications companies  to enable the theft of customer call records data, the compromise of  private communications of  a limited number of individuals who are primarily involved in  government or political activity, and the copying of certain  information that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…essentially, of  funding with the Department of Homeland Security. Unfortunately, out of  the regular order, they are funded for the balance of the year in many  respects.\n\nThis compromise bill serves the interest of funding our government  for the American people and giving us the opportunity to constrain and  to ensure that there are meaningful, substantive,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…A lot of my Republican friends said: You know, we don't believe it is  the guns. We think it is mental illness.\n\nWell, I don't agree, but this is how you put together a compromise.  So we passed the Bipartisan Safer Communities Act, which included a  landmark $14 billion investment, most of it in mental health, most of  it directed toward kids' school-based…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…States in biotech, in automotive technology,  in battery technology, just handing it over.\n\nSo this is a pretty sad day in the history of the Senate, that there  will be a compromise of our procedures--our rules--that have been  sacred on behalf of the oil industry in our Nation. It is not the  first. There is an ongoing systematic plot that Donald Trump…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…customs are deliberatively intended to require broad       cooperation to function well at all. The most revered Members       of this institution accepted the necessity of compromise in       order to make incremental progress on solving America's       problems and to defend her from her adversaries.\n\nThat principled mindset and the service of our predecessors…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…lead to a  wide variety of negative outcomes. That said, House Democrats do not  want to see legitimate academic activity between the United States and  China hindered.\n\nThe compromise language recognizes the spirit of the bill--the need  to protect America's intellectual property and academic freedom--and  takes steps to mitigate the risk of going too…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Mr. Speaker, the bill before us is a bipartisan  compromise that continues our work to improve the quality of life of  our servicemembers and their families. I thank the chair and ranking  member for working so diligently to bring…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…the  development of technology to prevent drunk driving is inappropriate and  reckless.\n\nWhat we have before us today is a bipartisan, conferenced bill. It is  already a compromise from what Members on both sides of the aisle  wanted. Debating and attaching an amendment to this bill risks the  entire package.\n\nMr. Chair, I look forward to the time when…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…consideration of the  fiscal year 2026 Defense appropriations bill. Since taking the majority  in the House, Republicans have unfortunately abandoned any pretense of  bipartisan compromise to promote our national security by loading every  defense bill with radical, rightwing policy riders. These riders have  turned what was once a rare area of bipartisan consensus…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…fund these tax breaks for billionaires. Maybe I  should say ``trillionaires'' now. You think about how that debt, that  additional $30 trillion in debt, how much that would compromise the  ability to have future programs for healthcare and housing and  education.\n\nFolks in my State--probably the same thing with folks in your State-- last Wednesday--the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…stripping the background check requirement while still restricting the  bill to handgun sales to current law enforcement officers only. So we  were willing to go along with that compromise. We accepted that in the  last Congress.\n\nWhen the bill came to the floor for a vote, however, Republicans  filled the bill with a menagerie of more outlandish and extreme…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…applications built on blockchain technology or other       distributed ledger technology, tokens, and tokenization;\n\n(4) reduce cybersecurity and other risks that may       compromise blockchain technology or other distributed ledger       technology, applications built on blockchain technology or       other distributed ledger technology, tokens, and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…enforcement officers to be successful.\n\nI encourage my colleagues on the other side of the aisle to work with  the White House and Senate Republicans to come up with a reasonable  compromise based on common ground and to make sure that we are funding  Homeland Security.\n\nThat funding runs out Friday at midnight, and if Democrats allow this  to happen, it won't…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…transactions between the school and a foreign  entity.\n\nThe dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten our national security, compromise our  geopolitical interests, and erode our academic freedom.\n\nAmerican schools are not for sale, and they are for education, not  espionage. We cannot allow our students,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…take these bills, which represent the vast majority of things where we  have found common ground and agreement in a process of give and take  and good faith efforts and compromise and debate, and make sure that  they pass and reach the President's desk so we do not put American  Federal workers and American soldiers and American public servants out…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…their first, which raises a question, and  that is, are Democrats actually interested in a solution here or are  they just interested in a political issue?\n\nThere is room for compromise here but only if both sides give room.  Democrats aren't doing that.\n\nI shouldn't need to remind my Democrat colleagues that the Department  of Homeland Security does critical…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700181/state-of-the-union-address"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…the Hyde amendment. Now, that may not mean a lot to a lot of people,  but 50 years ago, the U.S. Senate and the U.S. House and the President  of the United States came to a compromise agreement over the issue of  abortion. It was a long, drawn-out process. At the end of that long,  drawn-out debate, they came to a compromise agreement that Americans  would…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…actual  solution.\n\nNow, once again, it is falling on the Senate to do the real  policymaking, but I am heartened that they seem to be close to a deal  that roughly mirrors the compromise bipartisan bill that I have offered  with the gentleman from California (Mr. Liccardo) that does a temporary  extension with reforms and cost controls to provide runway,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…State-sponsored cyber       actors, including Volt Typhoon, of the People's Republic of       China.\n\n(C) A classified assessment of the extent of potential       destruction, compromise, or disruption to United States       critical infrastructure by State-sponsored cyber actors,       including Volt Typhoon, of the People's Republic of China in       the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…schools hosted Confucius classrooms, many  located on U.S. military bases. That is no coincidence. Those programs  are a deliberate attempt to undermine American values and compromise  our security.\n\nThat is why I proudly support H.R. 1069, the Promoting Responsible  Oversight To Eliminate Communist Teachings for Our Kids, or the PROTECT  Act, from Representative…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…glidepath for the orderly phase-out of the tax credits.\n\nMany of my colleagues advocated pulling the rug out from wind and  solar projects, but I worked to find a sensible compromise. Based on  that compromise, the law's December 31, 2027, placed-in-service  requirement for wind and solar facilities is only effective for  ``facilities the construction…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…legitimate tools  and access privileges to conceal malicious behavior. This makes  detection extremely difficult and allows intrusions to remain unnoticed  until long after a compromise has taken place.\n\nWhile Federal agencies have taken important steps to respond, the  overall effort has revealed significant challenges in the way our  government organizes…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…its will. That,  after all, is the best expression of the will of the people.\n\nWhat about the minority leader, Hakeem Jeffries? He has had every  opportunity to endorse a compromise measure that has a temporary  extension with reforms. There are three bills that have numerous  bipartisan coauthors, but instead of supporting any of those, he has  directed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…``(II) Information containing or relating to contract       negotiations, including labor relations and procurement       actions, the disclosure of which would imperil or compromise       the competitive position of the Corporation.''.\n\nMr. EZELL.  1373, as amended.\n\nMr. Speaker, I thank Congressmen Burchett and Cohen for their  continued work in the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692213/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…this expire,  that was their timeline. This zero-dollar issue and then not capping  it, so it is only targeted towards lower-income individuals, had to go  away. Even in compromise and bipartisan approaches to deal with this  expiration, those aspects had to go away. Those are things that were on  the chopping block.\n\nAgain, I think when folks understand,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…technology. However, for this system to work, we need a degree of open  science that facilitates collaboration and transparency. The challenge  is ensuring this openness does not compromise our research security.\n\nWhile the U.S. has significantly profited from this system, other  countries--friends and foes--also benefit from U.S. investments. The  theft of…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}]