[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…attacks on our Nation on September 11, 2001,  Sergeant Major Black deployed repeatedly to the frontlines of the  Global War on Terror. With the 2nd Battalion, 1st Marines, he completed  two combat deployments to Iraq during Operation Iraqi Freedom, and  later, with the 3rd Battalion, 7th Marines, he deployed twice more to  Afghanistan in support of Operation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Lawn, a nonprofit providing free lawn care to elderly individuals,  veterans, people with disabilities, and families in need.\n\nThrough his hard work and generosity, Steve has completed 30 visits  to care for the homes of Nancy Kinkaid and Bill Orzechowski, two  neighbors facing serious health challenges.\n\nHis service not only maintains their yards, he has…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…grants can support officials in crafting their housing  plans, updating their zoning codes, or increasing capacity to conduct  housing inspections so that new developments are completed faster and  much more efficiently.\n\nThis bill provides civil servants and policymakers with the support  they need to make affordable housing a reality for so many of our…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699987/housing-is-a-human-right"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, now on my 62-county tour and the cost of  healthcare: Well, today is a special day for me as I completed my  annual 62-county tour. Every year, I visit every one of New York's 62  counties, and today's 62nd county was Columbia County, with a visit to  the Ooms Dairy Farm in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Federal agencies to sell handguns that  they were no longer using to the active-duty officers, who previously  carried those handguns, for fair market value as long as they completed  a background check like everybody else in America.\n\nMr. Speaker, last Congress, Republicans weakened that bipartisan  bill, which I think commanded unanimous support in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Committee--bid farewell  to one of its most invaluable, talented, professional staff experts:  Mr. John Phillips MacNaughton, Jr.\n\nAt the end of January, Phil, as he is known, completed 30 years of  public service to our Nation. That service began as a plebe entering  the U.S. Naval Academy in 1996, continued as a naval aviator who flew  missions in Iraq…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…with my colleagues.                            Honoring Jill Axelrod\n\nMr. LATIMER. Mr. Speaker, I rise to honor the public service  contributions of Jill Axelrod, who has completed two terms and 8 years  as the Town of Rye's councilwoman. A resident of Rye Brook with her  husband Brett and two daughters, she is a lawyer by profession and has  been a…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697851/finding-solutions-to-bridge-strikes"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Specifically, our legislation would prompt State, county,  and municipal transportation departments to employ qualified, trained  corrosion control professionals who have completed federally registered  apprenticeship programs.\n\nThis legislation also builds on a recommendation from the National  Transportation Safety Board and directs the Department…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693007/introduction-of-the-bridge-corrosion-prevention-and-repair-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…at the University  of Cincinnati and received a master's degree from George Washington  University before enlisting in the United States Army in 1966. After  enlisting, he completed Officer Cadet School, Army Airborne School, and  Army Ranger School before deploying to Vietnam in 1969, where he would  serve as a member of the 20th Infantry Regiment and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…August 3, 2020, the President said: ``We are going to be introducing  a tremendous healthcare plan sometime prior--hopefully, prior to the  end of the month. It is just about completed now.'' Nothing.\n\nSeptember 15, 2020, the President says: ``You are going to have new  healthcare. We have other alternatives to ObamaCare that are 50 percent  less expensive,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…office has received reports that Canadians--Canadians--born in  Iran have been impacted by this new Trump ban. There have even been  reports of the ban to stop parents who have completed every step of the  adoption process from bringing their new babies to the United States.\n\nThe administration has claimed this is about vetting immigrants to  protect public…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…National Labs, requires additional  funding and support. The final appropriations bill should include at  least $25 million to ensure that the High Performance Data Facility is  completed by 2030.\n\nMy fourth amendment No. 39 emphasizes the important work being  conducted by the U.S. Army Corps of Engineers to create new oyster  habitats in the Chesapeake Bay.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…tariffs are supposed to accomplish, or when, if ever, American families  and workers will see the relief.\n\nEarlier this month, Donald Trump claimed he would have 200 deals  completed within 3 or 4 weeks. Then he said: No, that is ``physically  impossible'' to have all of the meetings needed to seal the deals. He  should have thought of that before he…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the President had abused his power and  obstructed Congress. When President Trump was impeached a second time  for inciting an insurrection, the House Judiciary Committee completed  an investigative report that documented what Members of Congress and  our entire Nation witnessed on January 6, 2021. When the articles of  impeachment were brought to the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…accomplishments, having earned advanced degrees in Military Operational  Art and Science as well as National Resource Strategy.\n\nOn September 30, 2025, Colonel Halasi-Kun completed his final flight  in the F-15C Eagle, marking both the end of his own flying career and  the conclusion of the F-15 mission at Barnes Air National Guard Base.  In a fitting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "French Hill", "party": "Republican", "sentence": "…recognize the 20th Anniversary of the USS  Razorback SS 394 being docked on the banks of the Arkansas River in  North Little Rock.\n\nDuring World War II, the Balao-class submarine completed five war  patrols in the Pacific, sinking multiple Japanese vessels, capturing  enemy prisoners, and rescuing downed American airmen, even being  present in the Tokyo Bay…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Representatives and the Committee on Rules       and Administration of the Senate jointly designate, with       preparation for the event to begin on May 9, 2025, and       takedown completed on May 16, 2025.       SEC. 2. USE OF THE CAPITOL GROUNDS FOR NATIONAL HONOR GUARD                     AND PIPE BAND EXHIBITION.\n\n(a) In General.--The National Fraternal…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…subsection (d):\n\n``(d) Agreement With Institution Concerned.--A covered       member may enter into an agreement under subsection (a) only       if the covered member has completed at least half of a course       of covered education.''.\n\n(d) Section Heading.--Such section is further amended by       striking the heading and inserting ``Absence from…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…71 amazing years together  welcoming their four children: Karen Delleen, Bonnie Lee, Mark Alan,  and Douglas Ray. They both made education a priority, ensuring each  child completed college and pursued careers in nursing, teaching, and  law.\n\nThe Kennedys made Poplar Bluff their permanent home in 1950. For two  decades Kathy raised her children while…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…PROGRAMS'', by striking       ``Assistant Secretary'' and inserting ``Under Secretary''.       SEC. 102. NTIA CONSOLIDATED REPORTING ACT.\n\n(a) Elimination of Certain Outdated or Completed Reporting       Requirements.--\n\n(1) BTOP quarterly report.--Section 6001(d) of the American       Recovery and Reinvestment Act of 2009 (47 U.S.C. 1305(d)) is       amended--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…in May 1986, through the  delayed enlistment program and began active duty on September 15, 1986,  from the Syracuse, NY Military Entrance Processing Station (MEPS). She  completed basic training at Lackland Air Force Base (AFB), followed by  medical technician training at Sheppard AFB, and on-the-job training at  Wilford Hall Medical Center. Her performance…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…October 24, 2025 to November 1, 2025, in  Indianapolis, Indiana. During the Poultry Evaluation event, Manor FFA  students evaluated live poultry, graded carcasses and eggs, and  completed a written exam. The Manor FFA team won a gold ranking, and  the students--Anna Frey, Jozie Gilger, Leanna Kneisley, and Misty  Railing--each earned silver.\n\nThe Dairy Cattle…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…training.--\n\n``(A) In general.--Not later than 1 year after the date an       individual is appointed to the position of supervisor, such       individual shall be required to have completed each program       component established under subsection (b)(2).\n\n``(B) Extensions.--The Director of the Office of Personnel       Management may establish and administer…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Afghanistan to the United States or third countries.\n\n(2) Reports.--\n\n(A) Initial report.--Not later than the date on which the       strategy required by paragraph (1) is completed, the       Secretary of State shall submit to the appropriate       congressional committees a report detailing the strategy and       a plan for its implementation.\n\n(B)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…release of benefits to our veterans.\n\nI have witnessed firsthand the challenges rural veterans in Arizona's  Sixth Congressional District face in getting their medical exams  completed in a timely manner.\n\nThis bill takes an essential first step toward eliminating these  regional healthcare disparities and ensures that all veterans receive  the quality…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695498/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life- changing mission.\n\nThe…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692514/recognizing-kevin-vaughn"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…North America has lost an estimated 1 million barrels of  fuel per day due to low refining capacity.\n\nThe last report from the National Petroleum Council on refining was  completed over 20 years ago.\n\nThe report must include information concerning the contribution of  refineries to U.S. energy security; capacity projections of U.S.  petrochemical refineries;…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…conduct a review of their parent Agency's nondisclosure agreements and  similar documents to ensure the anti-gag provision was included. In  response, so far, 36 IGs have completed reviews.\n\nThirty IGs found that their parent Agency's nondisclosure agreements  were noncompliant with the law. Twenty-six IGs said their parent Agency  updated or was in…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Representative Boebert of Colorado.\n\nThe Arkansas Valley Conduit, or AVC is a 130-mile pipeline that  serves 39 communities and 50,000 people east of Pueblo, Colorado. Once  completed, it will deliver water to an area of the State that faces  severe water quality issues.\n\nThe AVC was authorized by Congress as part of the Fryingpan-Arkansas  Project in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692643/recognizing-travis-brown"}]