[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, rural Georgians and rural Americans are  older, sicker, and less likely to have health insurance than those in  our cities. In fact, compared to urban areas, rural Georgians are  nearly five times more likely to die early from cancer.\n\nHowever, access to care is collapsing. Over 20 percent of rural  counties in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696850/national-rural-healthcare-week"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…rates.\n\nArts education benefits every student, even in preschool. A recent  study shows that students in an arts-integrated preschool show three  times the growth in vocabulary compared with a similar program without  the arts. That is something to celebrate.\n\nSecond, arts education will prepare students for the jobs of today  and tomorrow. Many people talk…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Long       Beach, Riverside, San Dimas, Upland, and Mira Loma. They       focused on kids ages 11 to 15, whose lungs are growing the       most.\n\nWhile other studies have compared kids from polluted       neighborhoods to those living with cleaner air, the USC team       tracked children from the same communities over 20 years and       correlated their…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…of these practices.\n\nIn December 2023, Rutgers University found that TikTok's algorithm  disproportionately amplified anti-Israel and, by extension, anti- Semitic content compared with other social media platforms. This  amplification observed in the context of a major geopolitical events,  such as the portrayal of the Israel-Hamas conflict, and such…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…apply to the entire  country.\n\nThis Republican bill perpetuates racism. The Department of Justice  statistics show that Black kids are twice as likely to be incarcerated  compared to White kids, despite committing crimes at the same rate.\n\nThis Republican bill is flawed. By treating children as adults, Mr.  Speaker, you deny them protections from abuse…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…their State and local taxes.\n\nIt is not fair. In fact, people have moved away from our States to  other lower tax States.\n\nWhy are taxes higher in my State and in your State compared to, say,  Florida and Texas? They are higher because in New York State and in  California, we insure our children. We have the lowest rates of  uninsured children in the United…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. police officers. This bill has its facts wrong.\n\nLast year, violent crime in D.C. reached a more than 30-year low.  This year, violent crime in D.C. is down 22 percent compared to the  same period last year. Police departments throughout the country, in  both red and blue States, are struggling to retain and recruit  officers, and they have been…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…children  comprise as many as half of those living with rare diseases. Yet, here  is the reality for those children: Treatment options for children  remain extremely limited compared to those for adults.\n\nWe know that children respond to cancer treatments differently, but  there is limited research on how these therapies impact them. We owe  our kids better…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…be a death sentence.\n\nBlack and African-American men are much more likely to develop  prostate cancer. One in six Black men will develop prostate cancer in  their lifetime compared to eight overall. In fact, Black men are 1.7  times more likely to be diagnosed with and 2.1 times more likely to die  from prostate cancer than White men. Black or White,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…valuable and incredible. Mr. Martin's own views are  saturated with deranged analogies that dilute the meaning of Nazism and  Fascism.\n\nIn one episode about the 2024 election, he compared President Joe  Biden to Adolf Hitler, which either means that Biden committed genocide  or that Hitler was just a regular old politician. In another episode  about the election,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…decade, the average deficit was about $5 billion  per year. That doesn't sound like much now, by our standards, when we  are looking at $2 trillion per year, but it was a lot compared to the  past. And folks said: Do you know what? That $5 billion per year over  that 10 years exploded to an average of $20 billion a year in 1971  through 1973. Oh, my goodness,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…put this  information on the record already, as to how things have changed.  Senator Durbin was doing some of this already in referencing how little  elections used to cost compared to how much they cost today, but let's  just talk about the full amount of money that is in politics today as  compared to let's say 1976--a few years before Senator Durbin…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Head Start, Title I, and after-school  STEM enrichment don't just hurt, they derail students' futures.\n\nTexas colleges and universities share one of the largest enrollments  compared to almost any other State. Yet, under Trump's budget, millions  of them would lose access to workstudy jobs and to affordable student  loans. That is not just an educational…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…try to come and work in the United States. That is the reality.\n\nNationwide, for example, the costs of a lot of basics just keep going  up. Orange juice is up 29 percent compared to last year. Ground beef is  up 14 percent. Coffee is 26 percent more. None of these developments  have occurred in a vacuum. They are a direct response to the  President's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…looking at the data of why women were dying. Many of these  deaths were preventable. There were differences. There were differences  in the rate at which Black women died compared to White women, and  there were differences in the reasons.\n\nIn Virginia, the data showed us that for White women they were more  likely to die due to postpartum depression…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "French Hill", "party": "Republican", "sentence": "…video       inspection of a unit provided that the remote or video       inspection--\n\n``(I) covers a substantially similar review of the relevant       aspects of the unit compared to an in-person inspection;\n\n``(II) does not misrepresent the condition of the unit; and\n\n``(III) provides the information necessary to fully and       accurately evaluate…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…for fiscal year 2026.\n\nThis appropriations bill funds many programs at the center of helping  to assert our country's energy dominance. The bill cuts $766.4 million,  when compared to last year's funding bill, by focusing our efforts on  energy innovation and water infrastructure.\n\nThis appropriations bill provides funding to numerous scientific  energy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…American history. Under the  bill, the typical family will get up to $10,900 in additional take-home  pay. Households earning less than $100,000 will get a 12 percent tax  cut compared to July 2025. Equally as important, if not more so, the  child tax credit will double to $2,200 for more than 40 million  American families.\n\nThat is taking into consideration…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…an insurance company with an Army.  You laugh, but you know you are going to quote that later.\n\nLet's actually sort of take a look. This is net receipts by category,  2024 compared to 2025. Hopefully, this will make sense. I am going to  put this chart up on our website later because I know it is really hard  to see. If you actually take a look at what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…supply for families and businesses across the Las Vegas Valley. The  preferred southern route of this pipeline passes under the Sloan Canyon  National Conservation Area. Compared to other alternatives, this  alignment minimizes impacts on neighborhoods and is estimated to save  taxpayers nearly $200 million.\n\nH.R. 972 authorizes the preferred route…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Eric Swalwell smeared ICE officers as ``masked  thugs,'' called them ``terrorizing bandit[s],'' said it was his  ``priority'' to ensure officers are ``no longer faceless,'' compared  them to the KGB, and demanded they ``stay the f-- out of California.''\n\nRepresentative Jasmine Crockett compared ICE to ``slave patrols'' and  called them thugs.\n\nRepresentative…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "French Hill", "party": "Republican", "sentence": "…associated with minting and       issuing a $2.50 coin for wide circulation;\n\n(3) the cost-effectiveness of minting and issuing a $2.50       coin for wide circulation when compared to the costs       associated with minting and issuing other coins;\n\n(4) an evaluation of potential benefits to commerce, coin       handling, and transaction efficiency that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…and\n\n(B) essential to achieving fishery management and research       objectives through producing a better understanding of--\n\n(i) the quantity of hatchery produced fish compared to wild       fish in the Great Lakes;\n\n(ii) the effectiveness of hatchery operations; and\n\n(iii) the effectiveness of fishery management actions;\n\n(4) the mass marking program…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…vehicles also disproportionately affects  disabled individuals, who often rely on ATVs or side-by-sides to gain  access to remote areas of our public lands. The State of Utah compared  the decision to limit off-highway vehicles while still allowing for  conventional vehicles as akin to designating parts of Lake Powell  exclusively for yachts while restricting…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "John Rose", "party": "Republican", "sentence": "…added to the U.S. economy. Prices fell for the first time  since May 2020. The Border Patrol reported a 94 percent drop in illegal  immigrant encounters at our southern border compared to the same month  last year under Joe Biden.\n\nIt is noteworthy, Mr. Speaker, that the only thing the President  needed to accomplish this was leadership. We heard the last…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…MedPAC report. It is like this. I  have no idea how many Members have actually bothered to read it. Yes, I  understand there are some anomalies, but they are rounding errors  compared to this. I think it had that $84 billion was spent last year  in the differential between Medicare part D and Medicare part A. That  is Medicare Fee-for-Service and Medicare…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…acres. The ROD states that the areas closed to oil and gas       leasing and new infrastructure include areas critical to       certain bird and caribou populations. Compared to the 2020       Record of Decision, the ROD reduces the area available for       oil and gas leasing and the allowable area for new       infrastructure, as the 2020 Record…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…intensity of services, and other relevant metrics between       individuals who entered into the Acute Hospital Care at Home       initiative directly from an emergency department compared       with individuals who entered into the Acute Hospital Care at       Home initiative directly from an existing inpatient stay in a       hospital.\n\n``(2) Selection bias.--In…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to the broken pieces of ObamaCare that  expanded Medicaid such that we are giving 90 percent Federal match to  the able-bodied, the people who are not the most vulnerable, compared  to the vulnerable population who only get 50 to 60 to 70 percent? Why  would we do that? Why would we give more to Medicaid recipients than  Medicare recipients, which we…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…During President Biden's State of the Union Addresses, which, by  the way, his last one was one of the most caustic, partisan speeches I  have ever seen, where he repeatedly compared himself to his  predecessor; that is, his political opponent at the time. Dozens of  times, Democrats stood and applauded.\n\nBy the way, on our side, for a lot of those times,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]