[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…where you actually need to tell the truth--as  opposed to in tweets and talk shows--the story that emerges is exactly  the opposite. In the Rhode Island and Connecticut sworn complaint, we  alleged that Revolution Wind, the project off our shores, ``will . . .  yield substantial cost savings to the States' ratepayers.''\n\n[S]avings to ratepayers--\n\nthe pleading…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…only some of  this information and has refused to answer simple questions regarding  the very limited information that has been provided to date.\n\nAnd this is not a partisan complaint. These are statutory  requirements that are being ignored and noticed by both sides of the  aisle.\n\nThe United Nations has stated that these strikes ``violate  international…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…may be wondering why I am  standing here urging a ``no'' vote on Cheryl Mason, just consider the  role of inspector general in the VA for you as veterans. When you have  a complaint about a VA facility--it has failed to give you appointments  on time for care--if you have a complaint against some VA claims  processor blowing you off, if you have a complaint…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…after the victim reaches 18 years of age, if       the victim was a minor at the time of the alleged offense.\n\n``(2) There shall be no time limit for the filing of a       complaint commencing an action under this section relating to       an alleged violation of section 2241, 2242, or 2243.''.\n\n(2) Clerical amendment.--The table of sections for chapter…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…to       respond. We concluded that the guidance gave permit       ``recipients significant rights that they did not previously       possess for obtaining dismissal of [a] complaint,'' and       thereby affected the rights and duties of recipients,       complainants, and the affected population.\n\nCourts have also considered the reverse situation--namely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…miles away in New Jersey, to carve the initials of  each person into her leg and send the group pictures and videos of her  self-inflicted wounds.\n\nAccording to the criminal complaint, the content was shared with the  leader of the 764 group, or the so-called boss, so that the  perpetrators could become full-fledged members of the group.\n\nMind you, Roblox…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…H.R. 2096       will reinstate are still working at the D.C. Metropolitan       Police Department. Six of the 15 officers (40 percent) had       another official misconduct complaint filed by the       Metropolitan Police Department after they were reinstated.       H.R. 2096's arbitration system encourages officers to engage       in civil rights violations…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…who wants more untraceable ghost guns on our  streets.\n\nMr. Speaker, it is unclear what barriers law enforcement faces in  using long-range tasers. I have never received a complaint from law  enforcement in my district, nor have I seen any reports suggesting that  this is a problem. Long-range tasers are already used by law  enforcement--and listen to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…investors.\n\nFor example, the Securities and Exchange Commission recently  suspended its enforcement action against Justin Sun, founder of the  TRON Foundation. The SEC's own complaint detailed how Sun sold  unregistered crypto asset securities, manipulated trading to  artificially inflate the prices of the tokens he issued, and secretly  paid celebrities…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…safe. Yet Mr. Divine and Ms. Lanahan didn't hesitate--not at all--to  challenge its approval. And their court filing cited two research  studies, mere weeks after he filed the complaint, that were retracted  due to a lack of scientific rigor, problematic methodology, and  undisclosed bias.\n\nEdward Artau, nominated for the Southern District of Florida--the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the ballot.\n\nThe third scheme that the Governor came up with targeted me  specifically. One of his cronies, a woman named Ann Ravel, filed a  completely made-up, frivolous complaint against me with the FEC. It  alleged that I had transferred $50,000 to the campaign account  supporting this initiative. It was completely untrue. I never did  anything of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…affordability. I do agree that the affordability of  healthcare is an issue. It is a complex issue. It is not in any of the  bills that we are dealing with today, and that is his complaint, it is  that there ought to be something in there.\n\nMr. Speaker, let me remind folks how we got here. We got here with a  bill that came out of the Speaker's office, Speaker…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Goldman did something unforgivable. That  unforgivable thing was their article essentially accusing my  whistleblowers of violating the law. It does so, in part, by citing a  complaint filed by J.P. Cooney and Molly Gaston. These were two of Jack  Smith's partisan prosecutors--prosecutors with a mission to put  President Trump in prison when he was a private…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…District.\n\nShe ensured that constituents were helped, whether they had a problem  with a government agency, they had an opinion on an issue, or they just  wanted to express a complaint or sometimes a compliment. Business  groups, schools, healthcare providers, and farmers and ranchers can all  count on Debbie to help them.\n\nToday is her last day as a full-time…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…carried into 2025.)\n\n(2) The number of alleged violations that were dismissed--\n\n(A) For lack of subject matter jurisdiction or in which,       even if the allegations in the complaint are true, no       violation of Senate rules would exist: 150.\n\n(B) Because they failed to provide sufficient facts as to       any material violation of the Senate rules…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Senate from a  legislative body into, in the words of the senior Democrat from  Minnesota, a ``full-time employment agency.''\n\nBefore I close, I also want to mention one other complaint from the  Democrat leader yesterday, and that is his claim that Republicans'  attempt to restore Senate precedent on the en bloc consideration of  nominees is somehow going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "French Hill", "party": "Republican", "sentence": "…written permission from the resident       of a dwelling unit, install such temperature sensor and       monitor the data from such temperature sensor.\n\n(d) Collection of Complaint Records.--\n\n(1) In general.--Each public housing agency or owner of a       covered federally assisted rental dwelling unit that installs       1 or more approved temperature…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…17 Excellent Police Service Awards, 7 Unit Commendation Awards,  32 Chief's Letters of Commendation, and the Good Conduct Award for 29  years of service without a sustained complaint.\n\nBeyond his duties as an officer with the Rochester Police Department,  Officer Mazurkiewicz was also an active member of the Rochester Police  Locust Club, a very distinguished…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…investigation or information       relating to any referral to outside law enforcement entities;\n\n``(bb) the official or office of the Coast Guard that       received the complaint;\n\n``(cc) a description of the results of such an       investigation or information with respect to whether the       results of the investigation were provided to the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…in writing       that the attorney general intends to bring such civil action.\n\n(II) Contents.--The notification required by subclause (I)       shall include a copy of the complaint to be filed to initiate       the civil action.\n\n(III) Exception.--If it is not feasible for the attorney       general of a State to provide the notification required by…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…in court on their days off to ensure the conviction of a suspect they  have arrested. That time, overtime, is needed to truly serve their  communities. They do it without complaint.\n\nThey do receive extra pay, of course, for their overtime, yet that  often comes with the burden of extra income taxes. It puts many of our  law enforcement officers in…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…and protections. This includes  information on modified class schedules or excused absences.\n\nThis bill also requires universities to inform pregnant women how to  file a complaint with the Department of Education if their Title IX  protections are violated. Let me be clear: No woman should ever have to  choose between finishing her education or experiencing…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699318/pregnant-students-rights-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…writing that the attorney general intends to bring such civil       action.\n\n(II) Contents.--The notification required by subclause (I)       shall include a copy of the complaint to be filed to initiate       the civil action.\n\n(III) Exception.--If it is not feasible for the attorney       general of a State to provide the notification required by…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…legal guardian's 11-      year-old son and two other minor males in 1994, Richard Lee       Russell was criminally convicted for events relating to those       alleged in the complaint. This sexual predator under Florida       Law allegedly solicited the sale of the photographs and video       of this assault in America Online, Inc., chat rooms.       Ultimately,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}]