[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…after.\n\nSo what do we have?\n\nMr. Speaker, I rise in opposition to this bill. In 2004, Congress  passed LEOSA, a law that allows both off-duty and retired officers to  carry concealed firearms irrespective of State law. It compelled all  States to allow off-duty and retired officers to carry concealed  firearms under the terms set by Congress overriding…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…disclosure. They deserve to know  what is in the files of the Department of Justice when there are  credible allegations that an investigation is incomplete and potential  evidence concealed.\n\nAnd the American people are rightly asking now: What do they have to  hide? Why are they concealing this information in the files of the  Department of Justice?\n\nWe are…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…for the victims of this deadly  attack and demanded we do something. In response, the Governor of Ohio  signed permitless carry legislation, allowing individuals to carry  concealed firearms without a permit.\n\nLast year, 25-year-old Megan Keleman, a young woman in my district,  was shot and killed in a Taco Bell drive-through. She was picking up  dinner…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692027/observing-gun-violence-awareness-month"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…themselves  in harm's way to protect our citizens, visitors, and guests.\n\nPrior to the pickup truck's attack, the terrorist planted two  improvised explosive devices, or IEDs, concealed within coolers at  separate locations along crowded Bourbon Street. These rudimentary pipe  bombs were filled with shrapnel materials, such as nails, screws, and  tacks,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…legislatively resolve.  The Howard ruling undermines the ability to prosecute common scenarios  involving the surreptitious recording of kids; for example, when  criminals plant concealed cameras in bathrooms, locker rooms, and  bedrooms to record sexually explicit images of children who are unaware  that they are even being filmed.\n\nCriminals who record themselves…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and at least 6 died in  detention centers in January of this year alone.\n\nICE is in such a hurry that many of the officers don't get adequate  training. Their identities are concealed. Most disturbingly, ICE and  Kristi Noem accept no responsibility for the actions of their officers.\n\nWe are discussing reforms now in Congress, and the basic reforms that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Alex was on a public street. He was exercising his First Amendment  rights while filming Federal agents. He was exercising his Second  Amendment rights as a law-abiding, concealed-carry gun owner. He was  doing what any decent person would do: helping a woman off the ground  after she had been shoved down by a Federal officer. For that, he was  punished…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Rivers of Blood,'' Adams wrote.                    An `uncelebrated burning' is forgotten\n\nMost of the Rhode Islanders involved in the burning of the       Gaspee successfully concealed their identities from the       British and even other colonials, helping confound the       crown's probe. In some ways, their effort to hide was too       successful: Even…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…405, I call up  the bill (H.R. 2243) to amend title 18, United States Code, to improve  the Law Enforcement Officer Safety Act and provisions relating to the  carrying of concealed weapons by law enforcement officers, and for  other purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. SCHMIDT.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…of the FPS' mission, serious  vulnerabilities exist in its oversight of contract guards. For example,  one GAO investigation found that contracted guards failed to detect  concealed weapons, including batons and pepper spray, in half of covert  security tests. While FPS uses covert testing to assess security  vulnerabilities, they lack a standardized…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…careful. When we talk about people being murdered in Minnesota because  they were lawfully carrying a gun, using their Second Amendment rights,  we are belying decades of concealed-carry classes that tell people who  are carrying guns how they should behave around law enforcement.\n\nNow, I know Democrats generally hate guns, and probably none of them…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…purposes.\n\n(b) The bill (H.R. 2243) to amend title 18, United States       Code, to improve the Law Enforcement Officer Safety Act and       provisions relating to the carrying of concealed weapons by       law enforcement officers, and for other purposes.\n\n(c) The bill (H.R. 2255) to allow Federal law enforcement       officers to purchase retired service weapons,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Wisconsin already regulates the use of tasers and stun guns at the  State level. You must be over 18 to own a stun gun or a taser, and you  must be 21 and possess a valid concealed carry permit to carry in the  public.\n\nThis is not going to be unchecked. There are absolutely going to be  legislatures that will revisit this. It is currently a felony…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}]