[{"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…fisheries, and coastal  communities.\n\nWhile Commissioner, Pat engaged stakeholders on some of the toughest  issues facing our state. He worked diligently to understand the  concerns of Maine's fishing communities and translate those concerns  and recommendations into public policy. He skillfully facilitated a  pause on federal whale regulations and continuously…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…today as the ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party, the CCP, to express serious  concerns about the proposed cuts in the Republicans' budget resolution.\n\nFirst, the resolution includes $880 billion in cuts to programs that  risk stalling the advancement of technologies…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…quality of their coverage, and they are facing higher out-of-pocket  costs.\n\nBack in October, one of my constituents from New Boston, NH, Darla,  contacted me with serious concerns about whether she and her husband  would be able to afford healthcare coverage without the enhanced  premium tax credits. This is what is so disturbing.\n\nLast month, she reported…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699085/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, I rise today to speak on the importance  of the Department of Education and my grave concerns about the  nomination of Linda McMahon to be the Secretary of Education.\n\nPresident Trump has made it clear what his directive is for Linda  McMahon. It is to dismantle the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Lutnick is a billionaire who can easily provide for her, while most  seniors rely on their monthly payments.\n\nThis weekend, more than 250 people in my district voiced their  concerns at a rally to save Social Security. I will take their words  over a billionaire's mother-in-law.\n\nMore than 10,000 of my fellow boomers become eligible every day for  Social…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689272/social-security-cuts"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…well beyond  Ukraine to Moldova, Georgia, the Baltics, and Poland, coupled with this  administration's proclamation that, in effect, NATO is on its own.\n\nI paraphrase the concerns raised by Secretary Austin and General  Milley that if we don't stop Putin's aggression now, then we will pay  later with more blood and dollars.\n\nWe must recognize at the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690213/supporting-ukraines-independence"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Requiring a person merely charged with       an offense to be detained pretrial with no opportunity for a       hearing to challenge the detention raises serious due process       concerns, as there is no opportunity for the court to       determine if this serious deprivation of liberty is       justified. This legislation would significantly change the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…mental health parity by going after insurance companies  that mislead seniors in Medicare Advantage with lists of doctors that  aren't actually available. Americans have deep concerns about the state  of their healthcare, and these reforms represent a down payment on the  effort to ensure our system benefits families over giant corporations.\n\nThis package…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…were  preparing to welcome her daughter, Cameron Carter.\n\nBecause Fatima lived with type 1 diabetes, her pregnancy was  considered high risk. After a medical appointment with concerns about  preeclampsia were raised, Fatima went to sleep, and she never woke up.\n\nThe coroner listed sudden cardiac death as the cause, but we know it  was more than that. It…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689832/recognizing-black-maternal-health-week"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…best from their elected officials.\n\nBob cared deeply about his constituents and serving them. He was  known  for personally following up with residents and addressing their  concerns. He prioritized transparency, once saying: You don't have to  ask me where I stand on issues because I am usually pretty clear about  it. I am not going to sit there and obfuscate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…have. By  expanding who can fill that role, we will give more student veterans  access to the program and help enable them to access their earned  benefits.\n\nWhile I do have concerns that section 4 of the bill requires VA to  adjudicate extension requests within 30 days without addressing the  underlying issue of  staffing, I support the intent of timely…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…people.\n\nMr. Speaker, I thank Dave for his many years of service to Rhode  Island. His impact will long endure, and I wish him a very happy  retirement.                    Concerns Over High Cost of Healthcare\n\nMr. MAGAZINER. Mr. Speaker, while Donald Trump and congressional  Republicans spend time building a billion-dollar ballroom, bailing out  Argentina,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, I was absent during the time of votes today  due to minor health concerns. Had I been present, I would have voted  YEA on Roll Call No. 306 and YEA on Roll Call No. 307.                             PERSONAL EXPLANATION", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697221/no-new-burma-funds-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…as a Nation and turn their backs on children, working parents,  veterans, and our most vulnerable.\n\nUnder direct orders from the President, the big, ugly bill ignored  the concerns of a majority of Americans to instead cater to  billionaires. For over a year, Republicans have done nothing to save  Medicaid, protect immigrant communities, provide food…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Great  Recession, led negotiations for stronger contracts and worked with a  developer to create a software program to streamline the reporting  process for prevailing wage concerns. He went on to continue serving  his union as a Chairman of the General President's Advisory Committee  and Special Assistant to the General President. Nelson also helped…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and  pass the bill (H.R. 5764) to amend the Small Business Act to require  small business development centers to assist small business concerns  with the use of artificial intelligence, and for other purposes, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…secretaries of state that  I had conversations with shared with me their difficulties that they  are experiencing in administering the most recent election. Two of  their top concerns were about integrity of voter rolls and noncitizen  voting.\n\nIn a most recent election, we just saw 13 individuals referred by the  Michigan Secretary of State to the attorney…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Tongass Amendment in B-238859, the North       Dakota RMP is not limited to changes in internal agency       operations. Instead, the North Dakota RMP is directed at, and       concerns itself primarily with, the behavior of non-agency       parties. Therefore, the North Dakota RMP does not qualify as       a rule of agency organization, procedure or practice.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…Cross, not the Star of David. Many brave  servicemembers made the ultimate sacrifice while defending freedom in  World War I and World War II, but due to clerical errors or concerns  for their safety during service, their religious identities were not  properly recorded.\n\nThis bill is a meaningful step to correct those errors and to ensure  that these…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689753/american-jewish-servicemembers-to-be-buried-under-the-star-of-david"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…advocacy for local  businesses, support for community development projects, and dedication  to preserving the town's historic charm. He was always accessible,  listening to the concerns of citizens and striving to make decisions  that benefited the entire community. Beyond his official role in  government, Casey has dedicated countless hours to various civic…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…or amended energy efficiency standards. With a cost  of at least $8 billion, questions surrounding the  technological feasibility of the standards and serious food safety  concerns cloud this rulemaking.\n\nSimply put, the DOE far exceeded the bounds of its authority with  this rule. If Congress does not act, this final regulation will harm  small businesses,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…health and well-being; and\n\n(IV) information and resources, including expedited       referrals, to assist members of the Coast Guard in dealing       with behavioral health concerns;\n\n(iii) improving resilience and mental health care among       members of the Coast Guard who respond to extraordinary calls       of duty, with the ultimate goals of preventing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Debra Jones. During her nearly  fourteen years of dedicated public service, Debra has advocated  tirelessly for the Victorville community and its citizens' most  pressing concerns. Debra is renowned in our community as a selfless and  caring servant and is a true friend to all who have the privilege of  knowing her.\n\nElected to the City Council in November…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…working with the Trump administration, he instead signed new  legislation in May that expands protections for illegal immigrants,  even after local officials raised serious concerns.\n\nMy community, meanwhile, is doing the work. El Paso County and the  Colorado Springs Police Department are partnering with ICE and the DEA.  In April, they led a nightclub…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…will be transferred into trust for the Tribe.  These parcels have suffered from various management issues, which have  led the Tribe and other surrounding landowners to raise concerns about  increased wildfire risk. Despite lacking ownership, the Tribe has  performed needed management functions on this land, a fact that  reflects positively on the Tribe's…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…affordable, convenient, disclosed, not hidden overdraft protection so  that their family can avoid a late fee on a credit card, which she just  gave an excellent overview of her concerns about.\n\nIf we want to do that, then give people the financial tools that they  have in overdraft protection without micromanagement from the Federal  Government. Don't take…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "John Thune", "party": "Republican", "sentence": "…that, before any floor  consideration, all of these nominees will have gone through the  committee process, which will have provided still another forum for  Members to air concerns.\n\nThe amendment to the rules Republicans are proposing is an idea with  a bipartisan pedigree. It would restore Senate precedent, and it would  restore sanity to a confirmation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…to call their  own. Unfortunately, this is true not just for families in my district,  but for the families across the country, as well.\n\nHouse Republicans have heard these concerns and responded with  legislation that will directly help more Americans achieve the dream of  homeownership.\n\nInstead of throwing more taxpayer dollars at ineffective government…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…years, due to a rise in energy consumption and  the early retirement of our existing fossil fuel generation, our  country could face major electric generation and reliability concerns.\n\nWe must take action now to ensure that our future demand is met, that  the lights remain on, our homes remain warm, and our economy keeps  moving for Americans all across…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…careers with  deep passion, and the prospect of losing their wings is seen as one of  the worst possible outcomes. As a result, many choose not to self- report mental health concerns, fearing they might be grounded or face  stigma within the industry.\n\nAs a physician, I understand how deeply mental and physical health  are connected. When a profession…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692308/recognizing-aviation-professionals"}]