[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…administration did with this rule. They are  chipping away at the Affordable Care Act and taking away healthcare  from Wisconsin families.\n\nWhile President Trump works out his concept of a plan, Republicans  still have no real proposal on healthcare. Even if they could repeal  the Affordable Care Act, they have nothing to protect the 24 million  Americans…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…legislation seeks to enhance the tools at our  disposal to investigate sanctioned individuals and entities and to hold  bad actors accountable, and that is very important.\n\nThis concept is similar to, as you have heard by our ranking member,  Mr. Speaker, a keep-open letter, which is when the government asks a  bank to keep a suspicious illicit account open.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693943/ofac-licensure-for-investigators-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…come forward with a plan. Senate Democrats have  come forward with a plan. Senate Republicans have come forward with a  plan. The administration still doesn't seem to have a concept of a  plan, but we have 22 days where the American people are expecting us to  act.\n\nMr. Speaker, I will begin this Special Order hour by yielding to the  chair of the Congressional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…have a lot of money,  that doesn't make you knowledgeable about the markets. Knowledge is the  key here, and the definition needs to be revised to center around this  core concept of knowledge and expertise.\n\nThe committee has heard from investors who want to invest their own  money in some of these risky and illiquid investments and don't want to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…have  absolutely nothing. President Trump famously said he has ``concepts of  a plan.'' Mr. President, and to my Republican colleagues, the American  people cannot rely on a concept that exists only in your imagination.\n\nHouse Democrats stood firm for more than 40 days to support a budget  that addressed the rising cost of healthcare. Now we stand on…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…transforming the ease with  which people are able to shop for their families.\n\nWhen Hedy Lamarr, the famous and accomplished actress, was not acting  in films, she invented the concept of frequency hopping, which opened  the door to a wide range of wireless communications technologies,  including WiFi, GPS, and Bluetooth.\n\nThere are a whole lot of gamers…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…ensures that there is robust  oversight of this process, requiring the recipients of these specific  licenses to report to OFAC monthly on their findings. This is similar  in concept to the keep-open letters that government officials provide  to financial institutions to keep open suspicious accounts so the  government can watch the transactions and follow…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693941/ofac-licensure-for-investigators-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…not to fish or swim.\n\nWe came to Washington committed to respect the great bounty       and beauty of God's creation. We believe very strongly--\n\nReagan said--       in the concept of stewardship, caring for the resources we       have so they can be shared and used productively for       generations to come. And we've put that philosophy to work,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…colossal, and the threat looms.  All this has caused the World Economic Forum to elevate ``ecosystem  collapse as a mid- to high-level global risk.'' Other studies advance  the concept of planetary insolvency. Others warn about our continued  fossil fuel pollution: If left unchecked, ``then mass mortality,  involuntary mass migration, severe economic contraction,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the witnesses to the  indescribable, the unthinkable, the incomprehensible pain and suffering  caused by nuclear weapons.\n\nNihon Hidankyo highlights the nuclear taboo, the concept that nuclear  weapons should never be used, an idea that is under threat from the  growth in nuclear arsenals around the world.\n\nAmong the organization's aims is an international…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…disgrace. I urge my colleagues to vote ``no,'' and I reserve the  balance of my time.\n\nMr. Speaker, let me try to explain this again because I don't know  why this is such a tough concept for my Republican colleagues to  understand.\n\nTwo things can be true. These Republican DOGE cuts can be incredibly  cruel, which they are, and at the same time mathematically…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…or if they lose  their health insurance. We have 4 days to prevent that from happening.\n\nLast week the Senate failed to act. The administration doesn't even  seem to have a concept of a plan, so it is up to the House. Leader  Jeffries has the discharge petition open right now to extend the  credits, and we need just four Republicans to sign on.\n\nLast…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…interested in was an investigation into Renee Good's widow.  That is not justice. That is not security for the American people.\n\nFourth, Republicans refused to agree to the simple concept that  American citizens should not be detained and deported. The people going  about their business should not be kidnapped because of the color of  their skin or because…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…they have done is try to repeal, defund,  deauthorize, and dismantle the Affordable Care Act with no alternative  ever presented.\n\nAmericans are so tired of hearing about a concept of a plan or  volumes of ideas.\n\nMr. Speaker, I will tell you the plan: Medicare for all. I will tell  you the vision. It is that every American has access to affordable…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696754/medicare-for-all"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…standard was wrong in 1983 or it is  wrong now, because it is an entirely different level of real wealth and  real income.\n\nMr. Hill's bill aims to return back to the original concept of  accredited investor, which is that investors in private offerings  should be fully aware and knowledgeable of the risks involved.\n\nAs my friend and ranking member of the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Trump himself has endorsed.\n\nThis budget resolution enables us to reach over $4.5 trillion in tax  cuts for hardworking Americans and more than $2 trillion in spending  cuts, a concept that Congress has been foreign to for way too long.\n\nWith a historic trifecta, since the Republicans were elected by 77  million people to control the House, the Senate, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…mission needs to be helping you  be healthier.\n\nWe do this in my State's Medicaid system. We call it AHCCCS in  Arizona. I actually, at one point, did the budgets for that.\n\nThe concept behind this is to align the incentives. The incentives  aren't to keep trying to find the highest reimbursement to charge  things to the healthcare system. It is the incentive…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…down  the internet? Should we have stopped the revolution of technology where  you go home now and hit a button?\n\nYou say that is absurd, David. No. It is the same sort of concept.  Should government have stepped in and stopped innovation?\n\nWe have done entire presentations here where you talk about the  morality of cures. If diabetes is 33 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…management planning is to       maximize resource values for the public through a rational,       consistently applied set of regulations and procedures which       promote the concept of multiple use management.\\9\\ An RMP       generally establishes land use designations; allowable       resource uses; resource conditions, goals, and objectives;       program…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…these rescissions will harm people in other countries are missing  the point. It is about people in our country being put first. It is  about putting Americans first. What a concept.\n\nThat is because American citizens support ending the waste, the  fraud, and the abuse in places like USAID.\n\nA ``yes'' vote today will stop wasteful spending on programs…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…strip,  but this is actually a KC strip, as well. And on this side, there is a  little bit more of a flavorless type of meat. I like this KC strip  here.\n\nSo, again, the whole concept is what? It is to eat some of these, but  more of these and a lot of these--basically, substituting more protein  for less carbohydrates.\n\nWe spend a lot of time here on the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…that we are supporting families and  encouraging that type of positive environment. Strong families will  lead to so much good in our communities. I don't want to demean the  concept of a strong family, but it is one of the core aspects of having  a strong economy.\n\nThere is a lot going on now and in the coming months. I am looking  forward to seeing the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…citizenship to be able to have an  election in that State.\n\nWe had a simple bill to guarantee that only citizens are voting in  American elections. Now we have added another simple concept: voter  identification. Under the SAVE America Act, an individual will be  required to provide that proof of citizenship in order to register and,  on election day, required…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…management planning is to       maximize resource values for the public through a rational,       consistently applied set of regulations and procedures which       promote the concept of multiple use management. An RMP       generally establishes land use designations; allowable       resource uses, resource conditions, goals, and objectives;       program…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…basic concepts to people, you see that folks actually get what we are  talking about. Not the bill of goods they are being sold, but when you  look at what happens with the concept of inversion. When a U.S.  multinational company can choose to co-op with a foreign entity to be  able to find a lower tax domicile, lowering their overall tax  liability,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…teams.\n\n(3) Development of an interoperable platform to provide       situational awareness of aerial assets during wildfire       response.\n\n(4) Establishment of a multi-agency concept of operations,       which may involve Federal, State, and local government       agencies, to enable coordination of aerial activities for       wildfire response.\n\n(c) Collaboration.--In…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…faster, and cheaper--because I will argue the army of lobbyists,  basically the rent seekers, if you remember your high school economics,  who are around us all, despise the concept of reform. They despise the  concept of modernization. That is actually some of the basic things I  want to go over tonight, and I will try to do it efficiently.\n\nFirst off,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…America, namely that rights come from our creator. Ours is a  Christian-based culture. Sharia, on the other hand, is a culture of  violence and domination, totally anathema to the concept of individual  freedom.\n\nThe United States Constitution and sharia are fundamentally at odds  with one another. The Constitution begins with: ``We the people.''  Sharia states:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…concepts.\n\nI did a little tripping up of some details last week, where we were  trying to explain some of the things we see going on in the math. I  want to walk through a concept.\n\nWe actually, right now, as a country, are remarkably blessed. The GDP  growth, the economic growth, is actually well beyond almost any of what  even my economists were predicting…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…There are armies of lobbyists walking  around this campus here, and the inefficiency of the Federal Government  is their profit model. There are bureaucracies who despise the concept  of saying maybe you should use technology.\n\nI have a report on my desk from the IRS. I have only read the first  three or four pages. It is an analysis of their data. It…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}]