[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…approved, and running a multimillion-dollar  experiment by shuttering the Department and making six different  Federal agencies do the work of one.\n\nDemocrats have worked to conduct oversight for our Nation's students,  but Republicans couldn't care less if title I schools get the funding  they need; if students have their civil rights violated; or if the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…to the President--the  only qualification he cares about.\n\nAnd in a classic authoritarian playbook, he is covering all this up  by removing independent watchdogs that conduct oversight of Executive  functions. One of the most egregious examples of this power grab is the  ongoing effort to illegally withhold funding that Congress has  authorized and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the Senate, even if it  is in a secure classified setting. But the Defense Department refuses  to do even that.\n\nMeanwhile, congressional committees have failed to conduct our  oversight responsibility and to demand it from the administration. With  each  passing day, Donald Trump continues to use the Department of Defense as  an extension of his administration's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the headquarters for the agencies located in the NCR  perform the indispensable work of keeping Congress informed of agency  activities. Congress cannot write laws or conduct oversight without the  critical information provided by agencies.\n\nI urge my colleagues to support this bill.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688344/introduction-of-the-protecting-federal-agencies-and-employees-from-political-interference-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…this entire Nation, but  I am going to continue to show up physically at bases of operation,  field offices, detention centers, and the so-called Alligator Alcatraz  to conduct oversight and work with our communities to keep our people  safe.\n\nRenee Nicole Good was the mother of three, had a daughter and a son  aged 15 and 12, and a 6-year-old with her…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…their emergency tools to mitigate the damage, which they  successfully did.\n\nWe worked with our former chairman, Mr. McHenry, and launched a  bipartisan investigation to conduct oversight and understand what went  wrong. We received reports and supervisory documents, and hearings were  also held.\n\nBased on the lessons we learned, I and my Democratic colleagues,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…had to endure this  horrific trauma across Oregon's Willamette Valley.\n\nLast week, I visited the Tacoma, Washington, ICE detention facility  to visit constituents and to conduct oversight. I wanted the  opportunity to see for myself the facility, to understand what my  constituents are being put through. I gave ICE their 7-day notice of my  arrival, as…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697458/fighting-dhs-immigration-raids"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…House-passed bipartisan amendment to restore collective  bargaining rights of DOD employees.\n\nI appreciate that the NDAA process each year gives us the opportunity  to conduct oversight, update our defense policy, and assert  congressional prerogatives. This bill does include important  provisions, including an increase in pay for servicemembers,  investments…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…colleagues, including the chairman  and ranking member of the Armed Services Committee, Senators Wicker and  Reed, for working together in good faith in a bipartisan way to conduct  oversight of these boat strikes. I support those efforts  wholeheartedly.\n\nOne of the first things we need is a classified briefing from the  DOD--Department of Defense--about…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Speaker, I rise in opposition to H.R. 1526, the No  Rogue Rulings Act of 2025.\n\nJust as House and Senate Republicans have ceded their constitutional  responsibility to conduct oversight on the Executive Branch,  Republicans want to force federal judges to give up their power of  judicial review. The duty and responsibility of federal courts is to  review…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…America, including the separation of powers, checks and balances, the  independence of the judiciary, and the power of Congress to control  spending, declare war, and conduct oversight. This resolution also  reaffirms the key individual protections enshrined in the Constitution,  including due process and equal protection under the law.\n\nThis resolution…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694144/introduction-of-a-resolution-reaffirming-the-principles-of-the-constitution-of-the-united-states"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…video out of Los Angeles. I have now looked at  it. If you are following at home, our colleague Senator Padilla was  carrying out his constitutional responsibilities to conduct oversight  and defend the people he represents. At that time, he was physically  accosted and shoved out of a press conference, pushed to the ground,  and handcuffed at a press…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692429/alex-padilla"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…a new job, more likely to have prices go up and not be able to afford  those price increases.\n\nFinally, Senate Democrats will do what Senate Republicans refuse to  do: conduct oversight on this administration. We will do it on our own.  That means pushing for investigations into the leadership failures at  the Pentagon. What Hegseth did there was horrible.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Fed's independence,  if they are worried about what chaos at the Fed means for rising  housing costs, rising borrowing costs, rising inflation, then they  ought to conduct some oversight. Otherwise, their concerns are little  more than hot air.                                   Populism\n\nMr. President, now on Donald Trump's fake populism, yesterday,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Today, we are considering seven bipartisan bills that will create  additional opportunities for entrepreneurs.\n\nMr. Speaker, my hope is that we can work together to conduct  oversight of the Trump administration's policies. I have been  particularly troubled by the pauses in Federal funding to small  businesses, inflationary tariffs, and Elon Musk's…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…these agreements will lay the foundation for  investment, innovation, and good-paying U.S. jobs that will boost our  economy.\n\nBut, no, these joint resolutions do not conduct oversight or provide  congressional disapproval. Instead, they make arms sales to some of our  closest allies in the Middle East about partisan politics.\n\nMr. President, I yield…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692354/motion-to-discharge-sj-res-54"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…taxpayers  and project sponsors.\n\nThis report, coupled with the efforts of the Trump administration and  this Congress to rein in permitting burdens, will allow us to conduct  oversight, ensure accountability, and identify areas of further reform.\n\nThe consequences of NEPA are felt across this country, from  manufacturing and construction in my district…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…not follow highway safety regulations.\n\nThey also reported that postal contractors have been involved in car  crashes that have killed 79 people in the last 3 years.\n\nTo conduct oversight of this important topic, Congress needs to be  informed.\n\nThe Mail Traffic Deaths Reporting Act requires the Postal Service to  report to Congress any traffic crashes…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…3428 is a good government bill that directs the GAO to review  the ethics, practices, funding, and Federal responsibilities of the  commissions.\n\nCongress has a duty to conduct oversight of these commissions, and I  thank Mr. Bresnahan for ensuring that we fulfill that role.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…hardship, the  American people expect Congress to do something, to ask hard questions  of the administration, to be the check and balance that we were taught  about in school, conduct oversight, lower prices, and protect our  healthcare.\n\nSo what are Republicans doing?\n\nLast week, following the invasion of Venezuela and the expiration of  the healthcare tax…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…traditional community bank, small business lending  companies, or SBLCs, are regulated by the SBA. Historically, the SBA  recognized that they had finite resources to conduct oversight of the  SBLCs, reinforcing a need for a cap on the number of SBLCs.\n\nDespite this, in 2023, the Biden administration lifted the 40-year  moratorium on licensing the SBLCs…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692069/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…to do her job.\n\nMy bill clarifies it is within the purview of the National Taxpayer  Advocate to hire attorneys that report specifically to her. These  attorneys help conduct oversight, ensure taxpayers are being treated  fairly, and inform Congress of taxpayer challenges at the IRS.\n\nThis measure ensures we keep politics out of the IRS and solely focus…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…disapprove rules submitted by Federal Agencies.\n\nThe Senate has given GAO the authority in the CRA process in the past  to protect the legislative branch's ability to conduct oversight over  administrative rules.\n\nMy predecessor West Virginia Senator Jay Rockefeller was a leader in  2008 efforts to give GAO the ability to trigger the Congressional…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}]