[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…research grants across the board,  across the country, and cutting patients off from clinical trials that  were their last best chance at beating a deadly disease. They are now  condemning some of these patients to death. They are killing their hope  for a cure. And some of these patients are kids, are children.\n\nLast month, in fact, the National Cancer Institute's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I join my colleagues in condemning what can  only be seen as sheer desertion--yes, I used the word ``desertion''--of  Ukraine  by this President, and I deeply regret, at least to date, by my  Republican colleagues…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…that thanks  the Boulder Police Department, that thanks the FBI?\n\nThe purpose of these resolutions is to unite the Congress, not divide  it. The purpose is to unite us in condemning violent attacks like  these, to make clear that we stand with the Jewish community today and  always and that we will be there for them in the weeks and months  ahead.\n\nMr.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…billionaires. They didn't  make an abstract budget decision. They decided that their wealthy and  well-connected donors deserved the very best that this country has to  offer while condemning everyday Americans to lose health insurance and  to have to wait until they are sick enough to end up in the emergency  room.\n\nI will say what we all know: We don't have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…gunman tries to  assassinate the President of the United States, it is not enough to  just condemn these acts and move on. We need to recognize something  needs to change. Condemning violence is only the first step-- necessary--but a first step. We must all work together to address  violence's root causes. We must take a serious look at the toxic forces…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…them.\n\nAnd now, according to the Trump administration, swastikas no longer  count as hate symbols within the Coast Guard. This is exactly why I  introduced my resolution condemning Nick Fuentes, Tucker Carlson, and  neo-Nazism. Neo-Nazism is no longer a fringe or theoretical threat. It  is real. It is growing. It threatens our democracy, and every elected…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…differences and  see in the humanity of the other a glimpse of our own.\n\nSo we must condemn what happened to Charlie Kirk, whether we are on  the right or on the left, because condemning that heinous crime is not  about the difference between right and left; it is the difference  between right and wrong. And what happened yesterday was wrong.  Whatever the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…poorer.  We hear the message. If Americans do not have great wealth, they do not  matter to the GOP.\n\nIf my Republican colleagues vote for this cruel monstrosity, they are  condemning families to poverty. They are condemning seniors and  veterans in this country to hunger. They are condemning children to  sickness without treatment. They are voting to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693173/one-big-beautiful-bill-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…sponsored by Representative Young Kim. This resolution has a lot of  things I think we all can agree upon, including recognizing the right  to assemble and protest peacefully and condemning violence against law  enforcement.\n\nIn the very last clause, it specifically expresses gratitude to law  enforcement including ICE for ``keeping our communities safe in the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…condemn what is happening in Gaza? You can't do it, not in a righteous  way, not in a righteous way.\n\nThe Congress of the United States of America ought to be on record  condemning what is happening to the Palestinians. For those who would  claim that they have no reason to be, that this is just something that  we should allow the Israelis and the Palestinians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…policy with acts of violence motivated by  extremism.\n\nThe entire House of Representatives--both Democrats and Republicans  will stand united to unanimously pass a resolution condemning the  politically motivated violence against Speaker Emerita Melissa Hoffman,  her husband Mark, and Senator John Hoff and his wife Yvette. We will  speak in one voice to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…as a member of the  Appropriations Committee, as well as of our Subcommittees on Defense  and Homeland Security.\n\nMadam Speaker, I join the vast majority of Americans in condemning  the actions of Immigration and Customs Enforcement. There is brutality  and death in our streets, so-called leaders trashing victims and their  grieving families, warrantless…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in strong opposition to H. Res.  516, the Condemning the violent June 2025 riots in Los Angeles,  California. It is deeply unfortunate that instead of working with  Democrats on a bipartisan resolution to condemn violence,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today to join millions of American  women in condemning Trump's attempt to gut funding for women's health  research.\n\nThe Trump administration has rescinded women's research projects at  an alarming rate. These projects include…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…food, and education and so  much more. These policies threaten the livelihoods of individuals and  our nation's economy--all so the obscenely wealthy grow more secure  while condemning the majority to a precarious existence, defenseless  against life's unpredictability and wholly susceptible to exploitation  and despair. I will fight with every ounce of…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…of life in the recent shooting, but we cannot absolve people of  the actions they are taking to disrupt ICE's operations.\n\nWe certainly shouldn't be looking at ICE agents, condemning ICE  agents who are showing up to do their jobs. Democrats have been  questioning the authority and jurisdiction of ICE's actions in  Minnesota.\n\nLet's shed some light on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…2017.\n\nIn fact, H. Res. 1409 of the 118th Congress is a Democrat-sponsored  resolution with the unambiguous title of ``Standing in solidarity with  the Venezuelan people and condemning Nicolas Maduro's attempt to steal  the Venezuelan Presidential election.''\n\nHere is another Democratic hit, H.R. 8741 of the 118th Congress,  pointing to the threat to our…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…violation.\n\nMr. CLYDE. Mr. Speaker, I thank my good friend, Mr. Norman from South  Carolina, for yielding.\n\nMr. Speaker, I rise today in support of this resolution censuring and  condemning Delegate Stacey Plaskett from the U.S. Virgin Islands for  inappropriate coordination with convicted  sex offender Jeffrey Epstein during a congressional hearing and  removing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…action they want to stop is not taking place. There is no war there  now.\n\nI think what my colleagues are is shell-shocked because after all of  these years of empty comments condemning Maduro, empty statements by  them, empty statements by Joe Biden talking about how bad of a man he  was, we finally have a President who actually went and did something…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, pursuant to House Resolution  530, I call up the resolution (H. Res. 516) condemning the violent June  2025 riots in Los Angeles, California, and ask for its immediate  consideration in the House.\n\nThe Clerk read the title of the resolution.\n\nMr. KILEY of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and agree to the  resolution (H. Res. 519) condemning the attacks on Minnesota lawmakers  in Brooklyn Park and Champlin, Minnesota, and calling for unity and the  rejection of political violence in Minnesota and across the United…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…gone, if  the partisanship has gotten so deep, so raw, and so uncontrollable that  we can't follow the custom of having the victims' Representative  introduce a resolution condemning such a horrific attack like this.\n\nOn top of that, to use this for some bogus immigration argument where  he falsely characterizes Colorado as a sanctuary State and falsely…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…communities most in need.\n\nMr. Speaker, I thank Representative Williams of Georgia for allowing  me to co-lead the No New Funds for Burma Act. I urge my colleagues to  join us in condemning the ongoing violence in Burma and supporting this  legislation.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697195/no-new-burma-funds-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…here, and I am calling on Governor  Newsom and the legislature to do the right thing and bring an end to  this failed and embarrassing project once and for all.             Condemning Classification of Israel as an Adversary\n\nMr. KILEY of California. Mr. Speaker, today on the House floor, there  was an amendment offered that suffered the most overwhelming…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…clause 2(a)1 of rule IX, I rise  to give notice of my intention to raise a question of the privileges of  the House.\n\nThe form of the resolution is as follows:\n\nCensuring and condemning Delegate Stacey Plaskett and removing her  from the House Permanent Select Committee on Intelligence for conduct  that reflects discreditably on the House of Representatives…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…country a year ago in November--77 million people. And that is why  President Trump is back in the White House, and thank God he is.\n\nSo, no, we don't need a resolution condemning the attack on the  Capitol on January 6. In fact, the only thing we should be doing is  condemning Nancy Pelosi's role in setting up the government  orchestration and orchestrated…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…is going  to kill Americans--he not only has the authority to do something about  it; he has the duty to do something about it.\n\nWe should have a resolution out here not condemning what he did and  telling him ``don't do this anymore''; we should have a resolution out  here thanking him for the hundreds--probably thousands--of lives that  he saved with…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…of people been hanged. They were basically drug out of their  houses and hanged.\n\n``Iran turns to internal crackdown in wake of 12-day war.''\n\nI will be doing a resolution condemning this regime's action. What  they are doing is they are trying to maintain power over their people  after this attack. People in Iran are getting fed up with the  Ayatollah.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}]