[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…address       mental health and substance use disorders. Given the current       opioid public health emergency, and our nation's ongoing       mental health crisis, we are confused and troubled by this       proposal. SAMHSA's work is lifesaving, helping ensure       communities have access to mental health and substance use       treatment services--along…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…country, to be there for  people who are struggling. Instead, this Republican Congress is about  enriching those who are well-off and well-connected.\n\nMr. Speaker, I am really confused after listening to the gentleman  from New York complain about same-day authority. In this bill, the  Republicans put in same-day authority to be able to jam this tax scam…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…millions of Americans.\n\nTo make matters worse, he is simply lying about it. In fact, his top  trade adviser has gone on record promising Americans that we all must  just be confused and that the tariffs are really actually tax cuts.  This administration thinks so little of the American people that they  think that somehow we won't know the difference…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…way substantially similar to the one that is at issue  here. That is what this is about. That is this effort.\n\nI don't think my colleagues on my side of the aisle will be confused  by the chairman's arguments. Just in case, I want to make sure it is  crystal clear for the record that a vote in favor of this CRA is not a  vote to modify or amend the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…employees. They are part of  more than 2,400 individuals fired all across the VA.\n\nI have heard from numerous veterans and VA workers in Michigan who  are absolutely devastated and confused by why this administration would  turn their back on them like this. My staff met with a veteran who has  worked for the VA in Michigan for nearly 30 years. Last year, they…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…including nearly $1 billion from projects  funded through the then Office of Manufacturing and Energy Supply  Chains. My office heard from numerous awardees who were left confused  and frustrated by the complete lack of communication from DOE on this  matter. Many of these grantees heard about their grant cancellation by  reading stories in the media,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…happening at the Department of Education.\n\nToday, I would like to highlight the concerns of parents who have  children living with disabilities. They are scared, concerned, and  confused.\n\nThe Individuals with Disabilities Education Act, or IDEA, is the  Federal law that ensures children with disabilities receive a free and  appropriate public education tailored…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…social and economic fabric of our city.\n\nIn recent weeks and months, my office has been inundated       with calls, emails, and walk-ins from constituents who are       afraid, confused, and desperate for guidance regarding TPS.       They are asking about legal resources, immigration attorneys,       emergency funds, and whether it is safe to continue going…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…WATERS. Madam Speaker, I rise today to further discuss with our  Members and this country the situation that we find ourselves in, the  chaotic situation that has so many people confused. It is a chaotic  situation that is causing trauma and harm to the people of this  country.\n\nI know much of what I am going to say today perhaps has been said by  others before,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…benefits when the government  reopens. When it comes to feeding 42 million Americans, our most  vulnerable neighbors and friends, suddenly the Trump administration  appears confused and, once again, in disarray.\n\nWho in the world is in charge? But it has no problem remodeling the  White House bathrooms with marble and gold, throwing a ``Great Gatsby''…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…extending the tax cuts for everyone who makes up  to $1 million. That is a massive amount of money. Every Democrat voted  for it. Every Republican voted against it.\n\nDon't be confused and don't be scared by this scare tactic. If you  are a middle-class American, if you are in the 99 percent, you will not  see your taxes go up next year. There is no question…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…American people, and I am flummoxed. Maybe  it is flummoxed.\n\nAs I mentioned, Mr. Speaker, I always wanted to use that word. I  can't spell it, but I know what it means. I am confused by many of  these statements, so I am trying to enter them into the Record and then  perhaps, at some point, get some clarification.\n\nTalking about Medicaid cuts, the largest…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, I thank Ms. Waters for the time, although I  must say that I am a little bit confused. I am not going to frame this  as a parliamentary inquiry, but I am very confused.\n\nWe have just gotten back from a 2-month paid vacation in which  Federal employees didn't…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…at  grave threat with what the Trump administration is now doing. They have  imposed cuts and a number of harmful orders on the NIH that have both  stalled its research and confused its partners.\n\nNow, 99.4 percent of the FDA-approved drugs come from the NIH-funded  research. Let me just say that again. NIH-funded research has led to  99.4 percent of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…abducting their parents. They are criminalized and strip- searched at the border, and now they are denied lifesaving gender- affirming care.\n\nSince my Republican colleagues seem confused about what love, care,  and protection looks like, let me be very clear. The Protect Children's  Innocence Act is not it. No one who causes or tolerates the suffering  of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698344/protect-childrens-innocence-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…words ``positive attitude'' in the dictionary,  Charlie Kirk's name would come up.\n\nI don't know if I could stay as calm as he did while he was talking  with some of these confused young students, to be honest with you. But  Charlie always rose above it and extended grace, even to the people he  disagreed with the most. That was clearly because of his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people in this country who were not  born here. That is over 15 percent. We are naturalizing about 850,000  people a year.\n\nNevertheless, there are Congressmen who keep getting confused and  think the only people that should be removed from this country after  Joe Biden left about 10 million people in the country illegally are  people who committed serious…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…foisted on to our Nation's manufacturers and consumers in new  regulatory and compliance costs not serious enough for Congress to  thoroughly scrutinize?\n\nDemocrats seem to be confused about what it is that the American  people voted for in November, and one of those items was lowering day- to-day costs that are hurting workers and families. Reversing these…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…We are growing as a country, but the cost  of healthcare is growing substantially faster.\n\nA factoid, I beg of you, whether you be on the left side, or the  right side, or confused somewhere in between, in 7 years, the $1  trillion we spend this year on Medicare becomes $2 trillion. We double  the spend on Medicare in the next 7 years, and in 7 years,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…the taxpayer and explain  why the refund is different than expected.\n\nHowever, current notices do not explain or contain helpful  information, leaving millions of taxpayers confused about how and when  to rectify the issue with the IRS.\n\nThe IRS MATH Act ensures that the IRS clearly spells out errors on  tax forms and helps taxpayers not only understand…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…are not being paid. Federal employees are not being paid. These  young men and women here, our pages, are not being paid. Our military  is only being partially paid.\n\nI am confused about SNAP payments. Some say the payments are being  made; some say they aren't. I don't know who is telling the truth. But  I do know this: I don't think anybody wants to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Iowa, our banks handle stocks and  bonds, securities, those handled by the SEC.\n\nThat level of clarity works, but when it comes to digital assets, the  lines become blurred, confused, and overly burdensome. That regulatory  uncertainty doesn't just cost dollars. It costs jobs, innovation, and  America's global leadership.\n\nThe CLARITY Act is exactly what…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693770/digital-asset-market-clarity-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…can stay focused on the topic in front  of us today as we discuss these proposals that are important to  American families and taxpayers.\n\nMr. Speaker, I am just a little confused. My colleague mentioned  ``whiplash,'' and I am feeling a little whiplash over here because  Democrats liked Elon Musk. Then, the minority hated Elon Musk. Now, my  Democratic…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…``Death to Israel.'' This is the  freaking missile they took a photo of in Hebrew that said ``Death to  Israel.'' I wonder what they want to do with that missile.\n\nIf you are confused about this regime, you should not be allowed to  drive because you are a danger to yourself and others. If you think  this is not our conflict, you have missed a lot. You…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…all followed suit.\n\nMr. Chair, I ask my colleagues to end this experiment on our Armed  Forces and support my amendment No. 106.\n\nMr. GOSAR. Mr. Chair, I am a little bit confused here, so I want to  ask the question: If we do good faith advertising to the American  people, because that is what our job is, tell me why we would actually  say the ``Potential…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}]