[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…another nation or an  entity, like a terrorist group--and there were terrorist groups back in  the days, like the Barbary Coast pirates. From the very beginning, we  have confronted threats not just by nation states but by others.\n\nBut the decision was that it was too big a decision for any one  person; we should only go to war after a debate--not only…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Pennsylvania. Mr. Speaker, on January 1, Republicans in  Congress allowed the Affordable Care Act credits to expire.\n\nInstead of celebrating a new year, millions of Americans confronted  healthcare premiums skyrocketing overnight. Many had to make an  impossible choice. Just look at my home State of Pennsylvania, where  85,000 people who receive their health…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700080/pennie-enrollment"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…saying to the world, they want to end anti-Semitism, as  I do, but they are saying they want to manage racism. CNN manages  racism by not allowing it to be addressed and confronted to the same  extent as they would allow anti-Semitism to be addressed.\n\nAgain, I am antithetical to, I am going to fight anti-Semitism, but I  am also going to fight racism.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…his nomination after it came  out about his close association with a neo-Nazi.\n\nThe story behind it, if the gentleman is really interested in it, is  National Public Radio confronted him with all the evidence of Hale- Cusanelli's Nazi statements, including: ``Hitler should have finished  the job.''\n\nHale-Cusanelli was also associated with statements like…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…country with a plan. It is a country with a vision. It is a  country that is just speeding past us in terms of their capacity to  deploy new technologies. That is what we are confronted with right  now--a plan from our arch rival economically that we are going to  ignore on behalf of the oil industry in our Nation.\n\nThey will reap the short-term profits…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…they make, even when they are building the Chinese economy  or the Russian economy or the Iranian economy. It is time to stand up  to the billionaire class. China cannot be confronted if people are not  willing to do so.\n\nWe also need to take steps so that Chinese stocks are not included in  index funds and so that every company that reports to the SEC…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…when, last month,  masked immigration officials--unidentified and masked immigration  officials--carrying weapons, raided a carwash in Temple City. It was  there that they confronted and arrested Javier Diaz Santana. Let me  tell you about Javier, and I really, really hope you are listening not  just with your ears but with your hearts.\n\nJavier Santana…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Every generation has to answer the question for itself: Do we still  prefer democracy over tyranny?\n\nAnd as we face the 250th anniversary of the Nation's birth, we are  confronted with that.\n\nI have handed my colleague a photo. I had hoped to have it on a  poster, but the photo was taken today, and I didn't have time to turn  it into a poster. But…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…ethnic  persecution within their own communities.\n\nIt is important that these incidents, though only a fraction of the  examples we have of the destructive force of hate are confronted and  placed on the Congressional Record.\n\nCongress must renew its commitment to root out hate-fueled violence  that violates our neighbors' safety, their dignity, and their…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690781/we-have-a-shared-humanity"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…have  supported international cooperation to target these organizations at  their source. And like everyone here, I recognize the cartels are a  scourge and they must be confronted aggressively and dismantled  thoroughly.\n\nBut that is not what is happening here. Let me begin with the most  fundamental question: What is the operation actually meant to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…servicemembers do not return home  from serving their country to find trespassers or squatters living in  their homes. We also want to ensure that servicemembers who are  confronted with this situation have the tools and resources to seek  legal relief.\n\nHowever, I want to be clear that neither the original bill nor the  amended text that we are considering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695470/servicemember-residence-protection-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…religion, with  nearly 30 million followers worldwide, including one million here in  the United States.\n\nA champion of religious freedom for all, Guru Tegh Bahadur  courageously confronted the Mughal Emperor Aurangzeb's campaign of  religious persecution, defending the right of every individual to  freely practice their faith. For this act of unwavering conviction,…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…and connect across the region.\n\nIn 2017, Mr. Cotton was appointed Executive Director of the Port  Authority of New York and New Jersey. Under his leadership, the agency  confronted some of the region's most complex infrastructure challenges  and undertook one of the most ambitious capital programs in its  history. This included a $30 billion transformation…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…extraordinary  young woman from northeastern Wisconsin who recently saved her mother's  life by performing CPR.\n\nWhile at home sick from school, 11-year-old Josie Pethan was  confronted with a nightmare scenario that no child should have to  experience. Josie had been reading on the couch next to her mother when  her mother had a sudden medical emergency.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…deputies were also shot, and countless officers placed  themselves in harm's way to protect others. Their courage and sacrifice  stand in stark contrast to the evil they confronted.\n\nToday, we grieve for two families who have lost sons, husbands, and  brothers, and we honor the public servants who answered the call to  stand between danger and their…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700214/moment-of-silence-for-deputies-michael-hislope-and-gabriel-ramirez"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…who speak truth and nations that stand firmly with her and behind her.\n\nPerhaps the strongest parallel of all comes from our own civil rights  movement, a time when America confronted its deepest flaws, yet emerged  stronger, more just, and more faithful to its founding ideals.\n\nDr. Martin Luther King, Jr., once said: ``The arc of the moral  universe is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…private sector is leading the way, including payment stablecoins to  enhance the payment rails.\n\nAs the United States grapples with modernizing our own payment  systems, we are confronted with a choice. Do we empower free-market  solutions that protect privacy and protect individual liberty, or do we  centralize control over payments in the hands of the Federal…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…The Clerk read the title of the bill.\n\nMr. WALBERG.  1005.\n\nMr. Speaker, I rise in strong support of H.R. 1005.\n\nFor much of the 20th century, the United States bravely confronted  the threat of communism worldwide.\n\nAs the Soviet Union oppressed its own people and extended its  influence abroad, countless Americans dedicated their lives to stopping…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…think some of the burden of these folks will have to be put on  private organizations because it is a problem no doubt if people are  able to get these programs without being confronted with moral choices  or moral problems.\n\nIn a great book that I am reading, ``The Tragedy of American  Compassion,'' the type of people who were involved in providing food…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…surprised. This is the kind of behavior that  Americans have come to expect from Democrats. Has anyone ever noticed  how Democrats have developed such a visceral reaction when confronted  about their abdication of responsibility?\n\nThey shut the government down, and the moment you call attention to  their own actions, all they do is obfuscate and start shrieking…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…are  distributed across several departments, and each department has  specific missions and authorities. That structure often works well  during normal operations, but when confronted with a fast-moving and  coordinated foreign threat, it can create gaps in communication and  delay collective action.\n\nH.R. 2659 provides a clear and practical solution to…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…today--to knock out this obstruction by the leader of the Democratic  Party in the U.S. Senate. If we don't, if something doesn't happen  today, then we, in my view, are confronted with the only other choice,  and that is a major rules change that acknowledges the new reality in  this country. I don't want that to be the case. I am still more  optimistic…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…take cover  in an artillery shell hole. Looking out to spot the enemy, he was shot  through the face. Unconscious for a time, he woke to feel a gaping hole  in his face. Confronted with the thought of imminent death, he prayed  to the Lord for forgiveness, and lost consciousness--seemingly for the  last time. To his surprise, he regained consciousness…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}]