[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…is deeply inconsistent with the intent of our  Framers' and the desire of the American people to be kept out of  unnecessary military conflicts.\n\nIndeed, the President has confirmed that he does not see a limit. He  saw targets at sea, and now he sees potential targets on land.\n\nNow, I know that the word ``unprecedented'' gets used so much these  days…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…multimillionaires, billionaires, and  big corporations.\n\nNow, there is another part that has gotten confused or obscured, and  that is with respect to the Medicaid cuts. As CBO confirmed in a letter  they sent to Mr. Pallone and to me, there is no question that this  piece of legislation before us calls for hundreds of billions of  dollars in Medicaid cuts,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…everybody goes up. It only makes sense. Uncompensated care gets cost  into the system that is passed on to the rest of us.\n\nEarlier this month, the Congressional Budget Office confirmed that  the House's reconciliation bill, if enacted, would cause 16 million  people to become uninsured--so that is the Congressional Budget  Office--so again, 16 million people…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Warner      Warnock      Warren      Whitehouse      Wyden                               NOT VOTING--4       Capito      Lummis      Slotkin      Welch\n\nThe nomination was confirmed.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688355/vote-on-mcmahon-nomination"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…doctors,  and ambulances are systematically targeted and destroyed.\n\nMr. Speaker, I include in the Record a link to the official report of  the names and ages of Palestinians confirmed and killed in Gaza.  https://data.techforpalestine.org/list/.\n\nMr. Speaker, look at this. I want the American people to see this.  The first 21 pages are all infants who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…they have an obligation to tell  the truth, what the cost effect of Revolution Wind will be, they talk  about cost savings of hundreds of millions of dollars. And that is  confirmed across the country by grid operators. You can go to any grid,  and you can see pretty much the same thing. They call up power units by  cost. They call up the least expensive…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…warning or rationale.\n\nIn fact, the Trump administration has kept more than three in four  presidentially appointed inspector general positions vacant and without  Senate-confirmed leadership.\n\nThese actions not only silence future IGs but leave the public less  informed about critical activities happening across agencies.\n\nDangerously, Trump's actions,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Cabinet-level Secretary and you jump to that, you don't  understand our system. And, certainly, the one time she has come in  front of our committee--one time since she was confirmed--she didn't  seem to understand basic concepts, like habeas corpus.\n\nNow, she is not the only one who is the mastermind of the President's  border and immigration policy.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…nomination.\n\nThese nominations are unqualified. They have revealed themselves to  be incapable to meet basic standards of ethical conduct, judicial  independence, and, if confirmed, they would extend the administration,  in its reach into the courts, in effect, cosigning the President's most  destructive and dangerous impulses, regardless of legality.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Hermandorfer signed amicus briefs in support of the  President's unlawful efforts to fire inspectors general and heads of  independent Agencies.\n\nHer record makes it clear that, if confirmed, she would continue to  enable, rather than check, an administration that has repeatedly  exceeded its authority.\n\nMs. Hermandorfer also refuses to acknowledge that President…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Instead of serving the American people, he is  focused on carrying out the Trump agenda.\n\nIf my colleagues think that this blatant partisanship is going to  stop if he is confirmed as an independent inspector general, they are  betting on the wrong horse. When Mr. Bell came before the Finance  Committee, he said that he ``will examine, evaluate, audit,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…eliminate the filibuster for them the next. You may hear them try  to deny it, but it is all on the record.\n\nSo let me recap. The Senate Parliamentarian, through the Chair,  confirmed that all points of order are waived during a Congressional  Review Act resolution. That is in the law. But the majority voted to  ignore that provision of the law and raise…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…crypto business. Why are the Republicans  protecting the President so he can make billions and billions more?\n\nDon't just take my word for it. Earlier this week, Chairman Hill  confirmed this much in the Rules Committee. Anyone who says the bill  stops the President's company from issuing stablecoins is not telling  the truth.\n\nYet, even if we adopted such…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…he often does, the Secretary of Defense and his office  denied the reporting when it broke last weekend. But then, on Monday,  White House Press Secretary Karoline Leavitt confirmed that, in fact,  Secretary Hegseth did authorize these strikes and that Admiral Bradley,  the operational commander, did order a second strike. The White House  has admitted…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…independent judge who has ever sat on the Federal courts. He should  never have been nominated. He should never have been reported out of  committee, and he should never, ever be confirmed by the Senate to such  an important job.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…and of soliciting a prostitute in a plea deal in 2008, and  served a 13 month sentence;\n\nWhereas in the course of that investigation, the FBI compiled reports  on dozens of confirmed minors who credibly alleged sexual abuse by  Epstein;\n\nWhereas Epstein was under further Federal investigation beginning in  November 2018, two months before Delegate Plaskett's…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…clearances.\n\n10.2. The appointment of Committee staff shall be approved       by the Chairman and Vice Chairman, acting jointly, or, at the       initiative of both or either, be confirmed by a majority vote       of the Committee. After approval or confirmation, the       Chairman shall certify Committee staff appointments to the       Financial Clerk of the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "Mr. MORENO.  241; that the nomination be confirmed; that the motion to  reconsider be considered made and laid upon the table with no  intervening action or debate; that no further motions be in order to  the nomination;…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698876/executive-calendar"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…presented the award.\n\nEarlier this year, Mr. Gilman contacted my office. Through the  persistent efforts of my staff working hand in hand with Army Personnel  Command, we confirmed that his Silver Star had been authorized decades  ago but never delivered.\n\nLast Tuesday night, more than 50 years after his acts of valor,  Brigadier General Paul Sellars,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…manipulation.\n\nNow more than 500 days later, Hamas is still holding dozens of  hostages captive, including five Americans. Of the  five Americans in Hamas's captivity, four have been confirmed to have  been murdered.\n\nAs the families have spent over a year in anguish, waiting for any  sign of their loved ones, desperate for their safe return, Hamas has  kept their…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…an idea. Now, again, this has all been proven. They  decided to infiltrate the crowd with antifa and intelligence community  members who would stir up trouble. The FBI has confirmed that there  were 274 FBI agents in plain clothes in the Capitol here that day.\n\nThen they set up Capitol Police by failing and refusing President  Trump's offer to bring…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Iran's ejection of the International Atomic Energy Agency from its  facilities marked the latest in a long chain of violations of Iran's  nuclear commitments. These actions confirmed what we have known all  along: The Iran nuclear program is not civilian, as they claim; it is  the pursuit of a bomb to destroy Israel and threaten U.S. national  security…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…year, a new $6,000 tax  exemption for taxpayers age 65 and older takes effect.\n\nLast week, I visited a tax preparation site in Pasco County, Florida,  and my constituents confirmed that this provision is helping them.\n\nEnacted as part of the Working Families Tax Cut Act, this deduction  applies through 2028 and is available whether seniors take the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…western civilization. It is essentially, at its  heart, communist banking.\n\nElizabeth Warren, Sherrod Brown, and Democrats in the Senate didn't  walk around Omarova to be confirmed as a bank regulator because they  were opposed to communist banking. They want it. That is what central  bank digital currency is.\n\nOur colleagues on the other side of this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693732/anti-cbdc-surveillance-state-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE.  646 and all the  nominations on the Secretary's desk; that the nominations be confirmed  en bloc, the motions to reconsider be considered made and laid upon the  table with no intervening action or debate; that no further motions be  in order to any of the nominations;…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699790/executive-calendar"}, {"senator": "John Thune", "party": "Republican", "sentence": "…enforcement in the  One Big Beautiful Bill and new border security resources to help stop  illegal immigration and the flow of drugs across our southern border.  Ron Parsons is confirmed and back on the job as South Dakota's U.S.  attorney.\n\nWe have repealed electric vehicle mandates that were simply not  realistic for a State like ours, where long distances…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…freely hands over that kind of  money without expecting something in return? Despite being based in  China and having deep connections to the Chinese Communist Party, as  confirmed by U.S. intelligence communities, the company continues to  refuse to acknowledge the Chinese Government's influence.\n\nHowever, in 2020, under President Trump's administration,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…that recognizes that Donald Trump won  the election and has the right to have the government that he wants and  that we have a prerogative to make sure that it is not just confirmed  but that if there are some bad apples along the way, that they get held  up for greater scrutiny.\n\nBut if this becomes a straight skins-and-shirts game, then all  discretion…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Emergency Medical  Services assumed care and transported the skier to McLaren Northern  Michigan Hospital, where he is expected to make a full recovery.  Medical staff later confirmed that the rapid response, early CPR, and  timely use of an AED were critical to saving the skier's life.\n\nMr. Speaker, let us join together in recognizing Sergeant Dennis…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699808/recognizing-michigan-state-police-sergeant-dennis-wagner"}, {"senator": "John Thune", "party": "Republican", "sentence": "…of the President's  Cabinet nominees at the fastest pace in more than two decades, and we  have kept up our focus on getting President Trump's team into place.\n\nWe have now confirmed 96 civilian nominees, far outpacing where the  Senate was at this point in the first Trump administration. And the  only reason, frankly, that we are not moving faster is…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}]