[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Albany  Young Marines and their remarkable contributions to themselves and the  Southwest Georgia community. Their dedication, leadership, and service  are invaluable, and I am confident that this organization will continue  to shape future generations of outstanding young leaders.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "“The people of Wisconsin deserve to have qualified, experienced, impartial judges working for them – and I am confident that’s just what we will get with Byron Conway. I was proud to work with Senator Johnson to stand up our bipartisan nominating commission and earn the support from both Democrats…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1681935/senate-confirms-baldwin-johnson-nominee-for-us-district-court-for-the-eastern-district-of-wisconsin"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…and the head of NSA have to sign a document to the President that says:  If you push the button, these weapons will detonate at their designed  yields.\n\nThe reason they are confident to do that is we have a lot of test  data from the nearly 1,000 tests--many of them took place in Nevada-- and the extensive data we have and the fact that we can then put…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…themselves. So whatever  happens later on this evening, the American people will hear from  Delegate Plaskett beyond this making her case. The people of the Virgin  Islands, I am confident, will continue to stand behind her.\n\nWe will never be lectured on issues related to accountability,  transparency, principle, and ethics from this group of extreme House…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…to be.\n\nYou know, one of the things that is so important for us if we have a  family and if we live in a community is to act in a way in which the  people around us can be confident that we have got their backs; that we  won't hurt them or harm them; that we notice what their struggles are  and that we will try to help.\n\nYou know, all of us here have…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…occupational exposures instead of  merely tracking them. This bill begins to tackle that.\n\nThis isn't a magic wand to fix and modernize all of VA, but it is a  start. I am confident that with modernization efforts like this  legislation, as well as my colleagues' efforts in other areas, we can  make a concerted effort to give our veterans the best care…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…dual language education. She uses  language as a bridge to connect with families, affirm cultural  identities, and empower students. She helps them feel seen, heard, and  confident in classrooms where they are often told to shrink or stay  silent. She teaches her students more than just math. She teaches them  that they matter. She gives them a voice.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…this clean water to their valley but are living in fear that they  or their children are delivering poisonous water.\n\nThere are probably not a lot of Senators here who aren't confident  that the water that is consumed by their children or their  grandchildren--the water that is consumed in their neighborhoods or  part of their State--isn't safe. That, I…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…he vouched for Toledo's cultural amenities, community spirit       and easy, relatively short ride to the Detroit Metropolitan       Wayne County Airport.\n\n``I feel very confident that there is life after New       York,'' Levine said. ``And Toledo is made special by being       the only place where you can pretty much guarantee that       you'll like…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…States hope that its military interventions abroad  would succeed. I have seen regime changes, nation-building efforts, and  elaborate reconstruction schemes launched with confident predictions of  success, only to have them collapse when encountered with the reality  on the ground.\n\nAnd the reality is this: When we rely on the U.S. military as our…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…throughout the  district.\n\nAs Kathryn leaves the office to pursue new opportunities, I want to  express my sincere gratitude for her service. While we will miss her  greatly, I am confident that she will continue to use her talents and  experience to make a positive difference in the lives of others. Her  experience in this office has prepared her well for whatever…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Hitler.\n\nAt Hale-Cusanelli's sentencing hearing, Judge Trevor McFadden, a  Trump appointee, said ``Statements and actions like yours make [Jewish  people] less safe and less confident they can participate as equal  members of our society.''\n\nTimothy Hale-Cusanelli was pardoned by President Trump. And what is  more? After his release from prison, Mr. Hale-Cusanelli…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…retirement. Knowing he had more service to give, he accepted  and obtained the rank of Lieutenant Colonel.\n\nWhen taking over the position of Chief Deputy of Operations, Shabazz  was confident in his skills in operations and was looking forward to  being responsible for both the ADC and all of their support services.  Sheriff Kincaid described him as being ``the…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…National Park Service, including twenty-five thousand dollars to  provide composters to residents. In 2015, Dorothy was named a  Sustainability Hero by Sustainable Jersey. I am confident that the 6th  Congressional District of New Jersey will thank her for her efforts to  keep Middlesex County's greater environment safe, healthy, and thriving  for years to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…there was a riot.\n\nI just can't believe that our government would stage a fake riot like  that. It was carefully preserved and recorded by Oregon Public  Broadcasting. So I am confident in saying what happened.\n\nI don't think anything like that will ever happen with the Oregon  National Guard. I think they will be extraordinarily careful to execute  their…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…through       someone's immediate authority or declaration.\n\nWhen we hear things privately or in the public arena, if       the truth of them is not discernible we may be confident that       time will show the truth. The political writers' adage is       that nothing anyone says during a campaign may be true, but       during the course of it the truth…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Department of the Interior as the next  American World Heritage site.\n\nAfter his successful tenure in this role, Dr. Clark has expressed  enthusiasm for this transition and remains confident in the ongoing  excellence of the Okefenokee Swamp Park board.\n\nMr. Speaker, I thank Dr. Clark for his commitment to improving the  Okefenokee Swamp Park and I wish him the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…wife, mother,  grandmother, and daughter. She will be spending far more time with  family while still having some time for her favorite hobby: helping  with campaigns. I am confident that Kansans will still seek her advice  and consultation, or at least they will if they know what is best for  them.\n\nMr. Speaker, I thank Debbie for 8 years of serving…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…to build on this momentum and  ensure that these protections are part of our laws, that every State  can follow these  practices, and that voters across the Nation can feel confident in the  integrity and security of their elections.\n\nCongress must commit to supporting election officials and voters by  making voting accessible and secure.\n\nWhile States…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…farmers, whether they  grow corn, sorghum, soybeans, or any other grain, receive a fair price  that reflects the quality of their crop. It allows buyers of U.S. grain  to feel confident in the safety and quality of the products they need.\n\nThe United States Grain Standards Act also supports U.S. trade, a  crucial part of the American farm economy. In 2024,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…facilitating a critical land  transfer that unlocks access to minable Federal coal while providing  the Crow Tribe with a piece of the revenue. With bicameral support, I  am confident we will get this bill across the finish line for our  Tribal communities and our State economy. More importantly, this is  another step in ensuring American energy dominance.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…SpaceX.\n\nWe are in a new space race today, unfortunately, with another  communist dictatorship, that being China. The question is: Will we win  that space race once again? I am confident we will do so for one simple  reason: Our President is confident we can accomplish this.\n\nRemember, our President literally created the Space Force. He is a  true believer.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…drive  up prices, and eliminate jobs across the country.\n\nWest Virginians don't want California's climate policy. West  Virginians don't want California's EV mandate. And I am confident that  most Americans don't want these things either. That is why the House of  Representatives passed this resolution of disapproval with a strong  bipartisan vote that included…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…and Taiwan is built on  shared values and common purpose. It advances the security, prosperity,  and freedom of our peoples. If we continue to invest in deterrence, I  am confident that partnership will endure for generations.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…servicemembers have demonstrated  tremendous courage and strength, beating back tyranny to the ends of  the earth.\n\nI was glad to sponsor Alexander's nomination, and I am confident that  his talents will distinguish him among his peers during his time at the  Academy and thereafter.\n\nI congratulate Alexander. I know that he will make this Nation proud.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692734/congratulating-alexander-andrews"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…my staff, has talked to the  Congressional Budget Office to make sure that there is no score with  this. The news is, as I just mentioned, this bill does not score.\n\nI am confident--I sincerely hope, for the people of Miami Lakes and  the folks around the country--that the third time will be the charm,  that this will become law. I am confident that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…struggled with in the past.\n\nThis bill takes a long-overdue step to ensure the quick delivery of  advanced capabilities to our warfighters when and where they need them.  I am confident that this bill, along with the number of targeted  amendments that we have been privileged to lead, will help lead in that  fight.\n\nTo begin with, expanding private financing.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…consent to be able to  actually bring it.\n\nWe have been asked: Well, what if we just did it next week? The  challenge is this body has just broken down trust. So we are not  confident there is not going to be a next week and a next week and a  next week. In the meantime, we are still not moving nominees. We are  still stuck.\n\nSo we have asked a very simple…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…ensures just that.\n\nThe right to vote is precious, and the SAVE Act restores confidence,  strengthens integrity, and protects the voice of every lawful American  citizen. I am confident my colleagues in the House will do the right  thing and vote to secure our elections.\n\nI now address my colleagues in the Senate.\n\nSave America. Bring this bill to the Senate…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…family has a loved one who is aging or  facing health challenges, that money could be used to assist with  caregiving or medical expenses. No matter the response, I feel  confident that the vast majority of Kansans would agree that they could  find a better use for those dollars than paying an additional tax to  bureaucrats who want to regulate every…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}]