[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 881, the DHS Restrictions on Confucius Institutes  and Chinese Entities of Concern Act seeks to help address the threat  posed to U.S. colleges and universities by the People's Republic of  China and Chinese Communist…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in opposition to H.R. 881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern  Act.\n\nH.R. 881 is a solution in search of a problem. In 2018, Congress  passed provisions prohibiting the Department of Defense…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Asian Pacific  American Caucus, I rise in strong opposition to H.R. 881. This bill  would block Department of Homeland Security funding from colleges and  universities with a Confucius Institute, which is known to have CCP  ties, but it expands the prohibition to any institution that has a  relationship with a Chinese entity of concern.\n\nWhat is a Chinese…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…or just those  from parents of Chinese-American students?\n\nH.R. 1069 would specifically prohibit Federal funding for any school  that operates the program sponsored by the Confucius Institutes or  Confucius classrooms. It is worth noting that although there may have  been a lot of programs in the past, right now there may be as few as  five Confucius…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…qualifies as a foreign  source. Schools have got to have professional development, so every  school principal and superintendent knows exactly who needs to be  reported and how.\n\nConfucius Institutes were mentioned. We have got 15,000 school  systems that will have to comply with this bill. Five Confucius  Institute classrooms have been found to exist in the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…It is worth noting that there is no evidence that foreign entities of  concern are contributing to public schools at any scale. We have  already noted that there are five Confucius Institutes throughout the  United States, throughout 15,000 school systems.\n\nH.R. 1049 would impose new layers of reporting, auditing, and  bureaucracy on every school district…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…continue to  find novel ways to bring this Chamber to new lows.\n\nThis week, Republicans are putting forward two bills, one that is  pretty much a redundant effort to counter Confucius Institutes and  another to change the name of the Gulf of Mexico to the Gulf of  America.\n\nThe second bill may be the dumbest bill brought to the floor during  the 6 years…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…under the guise of Chinese language and culture programming.\n\nIn fact, a recent Parents Defending Education investigation found  that 143 schools across 34 States hosted a Confucius classroom or  otherwise had ties to the Chinese Communist Party. But wait, Mr.  Speaker, there is more. Disturbingly, the same investigation found that  the CCP specifically…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…more than the  People's Republic of China. They use this all-access pass to steal our  intellectual property, abuse our student visa programs, and prop up  Communist-inspired Confucius Institutes.\n\nThis places the Chinese authorities in a real position of influence  among our young people, all the more so because our own government  doesn't try to hold…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Mr. MOOLENAAR. Mr. Speaker, I rise today in strong support of  Representative Pfluger's bipartisan bill, H.R. 881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern  Act.\n\nMr. Speaker, this legislation is about one thing, and that is  protecting American students, American research, and America's…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690829/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…of liberty, freedom, and self-determination.\n\nNow, we are seeing those same authoritarian efforts reach into our  classrooms. While some are now closed, the CCP established Confucius  Institutes on college campuses and Confucius classrooms in K-12  schools, funding programs with untold dollars. Marketed as cultural  exchanges to teach Chinese language…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…educational system.  Because if you control the minds of young people and you shape their  teachers even before that, so when they enter the classroom, even if it  isn't a Confucius classroom, those teachers have been impacted in what  they point out about some of these malign actors in the world, even if  it puts down some of their concerns, is a problem…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, due to a personal family matter,  I was unable to vote on H.R. 881--the DHS Restrictions on Confucius  Institutes and Chinese Entities of Concern Act. Had I been present, I  would have voted YEA on Roll Call No. 120.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690815/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…schools,  and any terms of that contract.\n\nThe CCP is anti-American to its core. We stand for freedom of speech,  expression, and religion. They stand for none of our values. Confucius  classrooms are propaganda, and they are often set up near our military  bases, just to give it another layer.\n\nThere are CCP and Chinese affiliations in 143 schools throughout…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…funding would be barred for elementary and secondary  schools that have a partnership with a cultural or language institute  funded by the Chinese Government, including a Confucius Institute. It  would also bar any school that directly operates a learning center  supported by the Chinese Government that receives support from an  individual or entity…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Resolution 377, I call up  the bill (H.R. 881) to establish Department of Homeland Security  funding restrictions on institutions of higher education that have a  relationship with Confucius Institutes, and for other purposes, and ask  for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. PFLUGER.  881.\n\nMr. Speaker, I rise…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…sophisticated  global influence campaign of our time. They are not just targeting our  military or U.S. companies. They are targeting our children.\n\nOne of the CCP's key tools is the Confucius classroom program. These  programs are funded, staffed, and overseen by the Chinese Government,  giving them direct influence over curriculum, teaching materials, and  the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697527/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Mr. Speaker, today I rise in strong support of  H.R. 881, the DHS Restrictions on Confucius Institutes and Chinese  Entities of Concern Act, of which I am an original cosponsor. The  stakes for our national security, constitutional freedoms, and the  future of American…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…into virtually every facet of American  society, including, unfortunately, American classrooms.\n\nFindings from the State Department have revealed that CCP-funded so- called Confucius classrooms have operated in over 500 K-12 schools  across the United States.\n\nNow, these programs are not about education. They are about  influence. The CCP does not act…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I rise today in support of the rule on the  DHS Restrictions on Confucius Institutes and Chinese Entities of  Concern Act.\n\nMr. Speaker, over the past decade, Communist China has persecuted the  Uyghur population for their religious and cultural…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…K-12 schools, as well. This is not only  an attack on education and academic integrity, it is a threat to our  national security.\n\nAcross U.S. colleges, the CCP established Confucius Institutes to  push false narratives, whitewash history, and endear American students  to the CCP while obscuring its brutal human rights abuses. However,  these propaganda…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…our  country by forging ties with American schools and universities. In an  attempt to influence our future generation, the People's Republic of  China has been establishing Confucius classrooms in our K-12 public  schools. Styled as language and cultural programs, these classes and  their teachers are funded and vetted by the Chinese Government, a fact…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}]