[{"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Speaker, I will offer my impression of a congressional  Member owl who will not stand up to the unconstitutional acts of this  administration.", "title": "Impression of A Congressional Member Owl", "date": "2026-01-20"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Speaker, I rise today to share my deep frustration and  anger for the people of northwest Indiana's First Congressional  District as they open their heating bills that have skyrocketed this  winter.", "title": "When Supply Goes Up, Prices Go Down", "date": "2026-02-04"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Speaker, I am grateful to be here to co- anchor this Congressional Black Caucus Special Order hour for the month  of June.", "title": "National Gun Violence Awareness Month", "date": "2025-06-03"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "The CFO may be removed only for cause by the Mayor, subject to the  approval of two-thirds of the Council and a 30-day congressional review  and comment period.", "title": "Introduction of the District of Columbia Chief Financial Officer Salary Home Rule Act", "date": "2025-12-23"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "On behalf of Michigan's 3rd Congressional District, I congratulate  Adelyn Kim for achieving the highest distinction in Girl Scouts, the  Gold Award.", "title": "Recognizing Adelyn Kim", "date": "2025-07-02"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "That was my plan and the plan of my fellow Florida congressional  Democrats last week.", "title": "Internment Camp in the Florida Everglades", "date": "2025-07-16"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Speaker, my district has more Social  Security recipients than 87 percent of the congressional districts  nationwide.", "title": "Expanding Social Security", "date": "2025-05-07"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "His visit to the United States--where he  has met with congressional leaders and the President of the United  States--is a reminder of our shared efforts and responsibility to  pursue peace and justice, religious tolerance and coexistence, and  environmental stewardship in all we do.", "title": "Welcoming Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "284, the Congressional  Award Program Reauthorization Act.", "title": "Congressional Award Program Reauthorization Act", "date": "2025-12-15"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Speaker, today, I rise to recognize Reese Gallagher  as the champion of the week for Ohio's 13th Congressional District.", "title": "Champion of the Week: Reese Gallagher", "date": "2025-11-20"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "The people of Ohio's 13th Congressional District sent me here to do  something about gun violence in our communities, and that is exactly  what I intend to do.", "title": "Observing Gun Violence Awareness Month", "date": "2025-06-05"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "The effect of these       Congressional repeals would put our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability and effective rehabilitation when a       crime occurs.", "title": "District of Columbia Cash Bail Reform Act of 2025", "date": "2025-11-19"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "I would like to know if the majority will commit to ensuring a  Congressional Budget Office score is available on the final bill before  it moves forward.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "On behalf of Ohio's 13th Congressional District, I congratulate and  thank Detective Jerry Gachett on a storied career at the Akron Police  Department and for over 31 years of outstanding service and devotion to  our community and our country.", "title": "Congratulating Jerry Gachett on His Retirement", "date": "2025-02-25"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Speaker, it is with great honor that I rise today  to co-anchor this Congressional Black Caucus Special Order hour, along  with my distinguished colleague from Louisiana (Mr.", "title": "National Gun Violence Awareness Month", "date": "2025-06-03"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "13) providing for congressional disapproval under       chapter 8 of title 5, United States Code, of the rule       submitted by the Office of the Comptroller of the Currency of       the Department of the Treasury relating to the review of       applications under the Bank Merger Act.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "As co-chairs of the bipartisan Congressional Service Organization  Caucus, Congressman   Jimmy Panetta and I introduced a resolution to  designate the week of September 14 through September 20 as Celebrate  Community Week, where we honor the efforts of local service  organizations across the country.", "title": "Recognizing Celebrate Community Week", "date": null}, {"senator": "French Hill", "party": "Republican", "sentence": "Swagel,                             Director, Congressional Budget Office.", "title": "Digital Asset Market Clarity Act of 2025", "date": "2025-07-17"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Speaker, after blatant obstruction and prolonged delay on the  part of congressional Democrats for over 40 days, the House has  returned to regular order.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "18, a Congressional Review Act resolution, would overturn a  midnight rule issued by the Consumer Financial Protection Bureau, CFPB,  that undercuts the ability of lower-income Americans to access  liquidity.", "title": "Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''; Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''; Providing for Consideration of H.R. No Rogue Rulings Act of Providing for Consideration of H.R. Safeguard American Voter Eligibility Act; and for Other Purposes", "date": "2025-04-08"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I am honored to present retired USMC  Colonel John Battista Airola, of Huntsville, Texas, with a  Congressional Veteran Commendation.", "title": "Recognizing Colonel John Battista Airola, Usmc, Retired, with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "First of all, President Trump received an overwhelming mandate not  just in Kentucky's First Congressional District, but all across  Kentucky.", "title": "Draining the Swamp in Order to Put America First", "date": "2025-03-03"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "I am grateful to my New York congressional colleagues for  cosponsoring this bill and am especially thankful to Congressman  Joe  Morelle for co-leading this bill with me.", "title": "Officer Anthony Mazurkiewicz Memorial Post Office Building", "date": "2025-12-09"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "An astounding example of this mission and inspiration for the  resolution is right in my congressional district.", "title": "Calling Upon Local Communities to Support Organizations That Provide Resources and Aid Gold Shield Families in Their Time of Need", "date": "2025-05-13"}, {"senator": "John Joyce", "party": "Republican", "sentence": "On behalf of everyone in the 13th Congressional District, I  congratulate the Fayette Fire Company of Juniata County on its 100th  anniversary and express my personal thanks for their distinguished  legacy of community service.", "title": "President Trump's Peace Through Strength Agenda", "date": null}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Speaker, I rise today to ask my colleagues to  join me in congratulating several remarkable Girl Scouts from  Wisconsin's 5th Congressional District for demonstrating leadership,  creativity, and a commitment to making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.", "title": "Recognizing Gold Award Girl Scout Recipients", "date": "2025-04-30"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Speaker, I rise today with profound respect and  gratitude to recognize the extraordinary service and unwavering  dedication of Sergeant Major Timothy Babcock, a proud veteran of the  United States Marine Corps and our distinguished Veteran of the Month  for August 2025 from Michigan's 9th Congressional District.", "title": "Recognizing United States Marine Sergeant Major Timothy Babcock As August 2025 Veteran of the Month", "date": "2025-07-22"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "They did this despite strong opposition from local counties in  Montana and local elected officials--in fact, the entire Montana  congressional delegation and the Governor of Montana himself, Greg  Gianforte.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": "2025-10-08"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Bill grew up right in Wisconsin's Eighth Congressional District in  Clintonville and started his career with WBAY as a sports reporter in  1983.", "title": "Recognizing Bill Jartz, the Voice of Lambeau Field", "date": "2025-03-06"}]