[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…America's seniors, ensuring Medicare coverage for these  emerging tools once they become FDA approved.\n\nI am immensely grateful that this bill was led by Republican sponsor,  Congressman Jodey Arrington, and the many organizations and patient  advocacy groups who helped us push this bill across the finish line. I  am giving a big shout-out to the American…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…me later.\n\nI am proud to serve as the co-chair of the Men's Health Caucus,  stepping into this role following the passing of my dear friend and  colleague, the Honorable Congressman Donald M. Payne, Jr. Donald was a  tireless advocate for health equity, and I am honored to continue his  legacy.\n\nThe Men's Health Caucus is a bipartisan group. We are…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…piece of legislation helps to really expedite that kind of community- driven policing and helps to make sure that people feel safe and secure  in their communities.\n\nI thank Congressman Roy for his leadership on this legislation, which  will help eliminate duplicative laws and allow us to better serve and  focus on the true threats to public safety, which…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…stick by due  process. Let's go through the rules.\n\nI thank my friend from Texas for those remarks. I am afraid all of  them dance around the central issue, which is the good Congressman  knows how due process works in America. There are facts that are  adduced first. There is an opportunity to be heard on both sides. There  is due process. There is consideration.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…from Republican State legislators from my home State of  Minnesota, addressed to President Trump and Republicans in Congress.  Please listen carefully.\n\nDear Mr. President, Congressman Emmer, Congressman Finstad,       Congresswoman Fischbach, Congressman Stauber, and Ms.       Carlton, Minnesota has been a leader in providing access to       care and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…This  bill ensures their extraordinary acts of bravery are not forgotten  and that their sacrifices are valued by a grateful Nation.\n\nI have been really glad to partner with Congressman Nehls on this  bill to introduce this legislation and get it to the floor today. I  thank him for his determined leadership on this issue and hope that we  can get all of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, I rise in support of my friend and  colleague, Congressman Garcia.\n\nOver the past 3-plus years, I have had the pleasure of working with  Chuy Garcia. I have known him to be a dedicated public servant  committed to serving his community…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696781/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Nations resolution  condemning Russian aggression and demanding the immediate withdrawal of  Putin's forces from Ukraine.\n\nTo quote my Republican colleague and dear friend, Congressman   Don  Bacon: The Trump administration royally screwed up on Ukraine.\n\nAnother anniversary is fast approaching. Indeed, on April 20 of last  year, 101 Republicans voted…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…so much, again, fights against oppression  here and across the world.\n\nIt was also another son of Detroit, my predecessor and founder of the  Congressional Black Caucus, Congressman John Conyers, who stood with  Dr. King and later became the driving force behind making Dr. King's  birthday a national holiday.\n\nI am so incredibly proud to welcome all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…steel and  knows exactly how to wipe out elements of production. Thus, the Vice  President's actions make absolutely no sense.\n\nMr. Speaker, also joining us this evening is Congressman Bill Foster,  a real leader, including in the scientific community, and he  represents, as co-chair, the Research and Development Caucus.\n\nMs. KAPTUR. Mr. Speaker, I thank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…of entry, technologies will  help get people and goods across our borders quickly and safely.\n\nThis bill is just one of many solutions we need to fix the border.\n\nI thank Congressman Luttrell and his team for working with us on this  legislation.\n\nI look forward to working together on a variety of bills that this  Congress has to offer to show the American…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "Mr. JACKSON of Illinois. Mr. Speaker, I rise today in strong defense  of the great character of a loving friend, father, husband, and  brother, Congressman Chuy Garcia.\n\nMy friends, there are moments in the Nation's history when a single  life stands up and declares without arrogance and without apology that  freedom must mean…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, I got this note this morning from  a constituent of mine who said: ``Dear Congressman Davis, I wish you  were voting to extend the tax credits for healthcare today. I am a  single mother with a daughter in college. Without these Federal tax  credits, we will…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698393/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…FIGURES.  Clarke), chairwoman of the Congressional Black Caucus.\n\nMs. CLARKE of New York. Mr. Speaker, I thank Congresswoman Janelle  Bynum from the great State of Oregon and Congressman Shomari Figures  from the great State of Alabama for co-anchoring tonight's  Congressional Black Caucus Special Order hour.\n\nI rise today with my colleagues of the Congressional…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…report  sexual assault. This is an issue which was the subject of exhaustive  hearings at the Oversight and Government Reform Committee over the last  8 years. Our dear, late Congressman Elijah Cummings conducted many of  those hearings. There were brave whistleblowers that came forth, such  as Dr. Kim Young-McLear who is now a retired commander from the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "John James", "party": "Republican", "sentence": "Mr. JAMES. Mr. Speaker, I thank Chairmen Guthrie, Congressman  Griffith, and their staff for their professionalism, especially on  moving this important measure forward.\n\nMr. Speaker, I rise to speak in support of H.J. Res. 87, my…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…experience this pain.\n\nEarlier this year, the House took a critical step to get illicit  fentanyl off our streets in passing the HALT Fentanyl Act, which was  led by my friend, Congressman Morgan Griffith.\n\nI am proud today to lead the reauthorization of the SUPPORT for  Patients and Communities Act. By passing this bill, my colleagues  continue our work to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Kristy Callahan, Todd Keagle, and Steven Seward prosecuted       the case.\n\nMr. ROSE. Mr. Chairman, I yield myself the balance of my time.\n\nMr. Chair, in closing, I thank Congressman Fulcher for cosponsoring  this amendment, and I urge my colleagues to join me in supporting  accountability by ensuring that we get answers to how this fraud was  able to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…findings and determinations made in the study       required by subsection (a).\n\nMr. Speaker, before I get to the specifics of this bill, I extend my  heartfelt gratitude to Congressman Ritchie Torres who has been an  outstanding co-lead and steadfast advocate for the Homebuyers Privacy  Protection Act.\n\nThis has been a long journey leading up to today's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Freedom of Information Act--and Sunset Act  protections.\n\nI have always advocated for more transparency at TVA, first in the  State legislature, then as a mayor, and now as a Congressman.\n\nI thank my good friend, Representative Cohen, who I don't see in here  today, for his continued support. Steve and I were in the Tennessee  General Assembly together.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the amendments made by such section, are hereby repealed       and shall have no force or effect.\n\nMr. Speaker, I rise in support of H.R. 6019, introduced by my  colleague, Congressman Austin Scott of Georgia.\n\nBefore I dive into the substance of this bill, let me highlight some  good news. The government is open and funded. SNAP benefits are being  funded.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…and Representatives, shall take effect, until an       election of Representatives shall have intervened.\n\nWhat that means, of course, is you can't change the pay for a  Congressman until after you have had an election.\n\nI think my bills are constitutional for two reasons. No. 1, we are  not changing the rate of compensation. We are just saying: You…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…BERGMAN. Mr. Chairman, I rise in opposition, although I am not  opposed to the amendment.\n\nMr. BERGMAN. Mr. Chairman, I thank my dear friend and fellow PATH  Caucus co-chair, Congressman Correa, for his work on this amendment.\n\nWashington, D.C., has built its success on good partnerships,  especially across the aisle, on issues that benefit all of our  Americans,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today with a heavy  heart to share a few words about my dear friend, Congressman Doug  LaMalfa.\n\nDoug was a husband, a father, and a fourth-generation rice farmer. He  dedicated more than 20 years to public service, both in this House and  in the California…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698715/9999"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…free State  of Florida's next Governor, Byron Donalds, for introducing this bill.\n\nMr. Speaker, I rise in support of H.R. 4922, the D.C. CRIMES Act,  which is sponsored by Congressman Donalds. This critical legislation is  a direct response to the failed pro-crime policies that have turned our  Nation's Capital into a war zone.\n\nUnder failing leftist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695562/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…gentleman for yielding.\n\nMr. Chair, I rise today in support of the PERMIT Act introduced by my  good friend and chairman of the Water Resources and Environment  Subcommittee, Congressman  Mike Collins.\n\nThis bold legislation delivers a long-overdue blow to the radical  environmental agenda that has weaponized the Clean Water Act, paving  the way for critical…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…last. I am proud to take this fight head-on  to ensure that Americans are not shouldering the cost of the last  administration's regulatory state.\n\nI would like to thank Congressman Craig Goldman of Texas for leading  this effort in the House, and I urge my colleagues in the Senate to  vote for this resolution. I look forward to the legislation heading…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…streets of the United States because of the radical  progressives and their open-border policies.\n\nI know my friend from Louisiana has a lifetime of service, not just  as a Congressman, but also in law enforcement. I wonder if my brother  from Louisiana would like to expand upon my thesis that the rule of law  is the central element of a strong and prosperous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…expertise, including its  longstanding tracking of farmland purchases, with CFIUS' operations.\n\nCFIUS could greatly benefit from the Secretary's expertise, and that  is what Congressman Lucas' legislation allows. As one of the first  Members of Congress to recognize this need at CFIUS, I applaud  Representative Lucas for his foresight and his dedication…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Speaker, I urge my colleagues to support the legislation as it  will make our grid more reliable and lower America's electricity bills.\n\nMr. GUTHRIE. Mr. Speaker, I thank Congressman Balderson for  sponsoring the GRID Power Act.\n\nMr. Speaker, this is part of the strategy we all have to do to  produce more power so we can have cheaper power. Demand is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}]