[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Speaker, I invite my colleagues to join my wife, Vivian, and me,  along with the 765,000 residents of Georgia's Second Congressional  District, in extending our heartfelt condolences to Overseer Roosevelt  Carter's family and the members of First Monumental Faith Ministries.", "title": "In Memory of Overseer Roosevelt Carter, I", "date": "2025-06-23"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "On behalf of Michigan's 3rd Congressional District, I congratulate  Adelyn Kim for achieving the highest distinction in Girl Scouts, the  Gold Award.", "title": "Recognizing Adelyn Kim", "date": "2025-07-02"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "He would serve in that role for a decade, working on  behalf of the people of Missouri's Fifth Congressional District.", "title": "Recognizing Mr. Gerard J. Grimaldi on His Retirement and Expressing Appreciation for A Lifetime of Dedicated Service to Our Community", "date": "2025-02-27"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "Thomas, who has dedicated his time to improving the lives  of workers in Missouri's Fifth Congressional District and throughout  the state.", "title": "Recognizing Reginald L. Thomas for His Distinguished Service to Laborers Local 264 and the Missouri Afl-Cio", "date": "2025-06-20"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Speaker, I recognize Caribbean American Heritage  Month, celebrating the culture, contributions, and history of Caribbean  Americans in Michigan's 12th Congressional District and across the  country.", "title": "Caribbean American Heritage Month", "date": "2025-06-26"}, {"senator": "Al Green", "party": "Democrat", "sentence": "She hails from the  14th Congressional District in the great State of New York.", "title": "Censured but Not Silenced", "date": null}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate New Terrain Brewing Company for this  award.", "title": "Recognizing New Terrain Brewing Company", "date": "2025-08-08"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "As the Representative for Rhode Island's  2nd Congressional District, I welcome Ecumenical Patriarch Bartholomew  on behalf of the vibrant Greek Orthodox constituency in my district,  including at the Church of the Annunciation in Cranston, Rhode Island.", "title": "Welcoming His All-Holiness Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Brown, representing the 11th Congressional       District of Ohio, do hereby recognize and commend the Greater       Cleveland Alumnae Chapter of Delta Sigma Theta Sorority,       Incorporated for a century of distinguished service and       meaningful impact, and extend heartfelt congratulations on       this historic milestone.", "title": "Recognizing the Greater Cleveland Alumnae Chapter of Delta Sigma Theta Sorority, Incorporated on Their Centennial Anniversary", "date": "2025-05-29"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "I will keep fighting for what the people  of Ohio's 13th Congressional District made clear when they sent me here  because this Congress does not belong to party leaders or special  interests.", "title": "2025 Final Priority Results Survey", "date": "2026-01-21"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Officer Riveros' legacy  as a hero will live on in the hearts and minds of the Baldwin Park  community and the 31st Congressional District.", "title": "In Memory of Officers Samuel Riveros and Darius Wong", "date": "2025-06-05"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "As we are in this time in need of better healthcare, I thank  them for understanding the healthcare needs of the citizens of the  Third Congressional District.", "title": "Congratulating Dr. John J. Warner", "date": "2026-01-12"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's 1st Congressional  District, I thank Tess Kuenning for her selflessness and dedication to  the patients she serves.", "title": "Recognizing Tess Kuenning", "date": null}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "My district, New Jersey's 10th Congressional District, receives $98  million in title I and special education grants.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Speaker, I rise to honor one of our dear neighbors in  the 12th Congressional District.", "title": "Surveillance Pricing in Grocery Stores", "date": "2025-06-26"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Her expertise has been crucial in  crafting legislation that directly benefits our servicemembers in  Oklahoma's Fifth Congressional District.", "title": "Recognizing Simona Elvin", "date": "2025-12-15"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "It is with great honor and respect that I present  retired USA Lieutenant Colonel William (Bill) Patterson Matthews with a  Congressional Veteran Commendation from the 17th Congressional District  of Texas.", "title": "Recognizing Lieutenant Colonel William (Bill) Patterson Matthews, Usa, Retired, with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "On behalf of the 2nd Congressional District of Nevada,  congratulations to Faith McCrea for achieving the highest distinction  in Girl Scouts, the Gold Award.", "title": "Recognizing Faith McCrea, Gold Award", "date": "2025-05-20"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Speaker, I rise today with profound respect and  gratitude to recognize the exceptional service and unwavering  dedication of Robert Anthony Longo, a proud veteran of the United  States Air Force and our esteemed Veteran of the Month for April 2025  from Michigan's 9th Congressional District.", "title": "Recognizing Robert Longo As April 2025 Veteran of the Month", "date": "2025-04-08"}, {"senator": "David Taylor", "party": "Republican", "sentence": "I look forward to seeing how she continues  to create positive change in Ohio's Second Congressional District.", "title": "Madison Wasmer Earns Eagle Scout Award", "date": "2025-06-26"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "I am honored today to recognize the student-athletes, coaches,  families, and the entire Benedictine community for their remarkable  accomplishment and for the pride that they have brought to Virginia's  Fifth Congressional District and the entire Commonwealth.", "title": "Recognizing Benedictine College Preparatory School Football Team", "date": "2025-11-19"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "The 2025 PIAA Class 3A track and field championship saw students from  across Pennsylvania's 11th Congressional District excel, but it was  Manheim Township senior Adam Kingston who took home the gold.", "title": "Congratulating Adam Kingston, Gold Medal Runner", "date": "2025-06-04"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Madam Chair, I rise today in support of my amendments 390,  737, and 745, which would deliver vital resources to the military  installations of California's 20th Congressional District, their  personnel, and surrounding communities.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District.", "title": "Recognizing the Tiffin Calvert Catholic High School on Winning the Division VII State Girls Volleyball Championship", "date": "2025-12-11"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "Speaker, I rise today to share positive news about  young people from Ohio's 4th Congressional District.", "title": "Recognizing the Lima Noon Optimist Club's Annual Youth Appreciation Luncheon", "date": "2026-02-03"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school football  team in Ohio's 5th Congressional District.", "title": "Recognizing St. Henry High School on Winning the Division VII State Football Championship", "date": "2025-12-11"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "On behalf of Texas' 14th Congressional District and this great  Nation, I want to thank Dr.", "title": "Recognizing the Retirement of Dr. Tom Johnson", "date": "2025-08-15"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "Both schools call Troup County  home, right in the heart of Georgia's Third Congressional District and  less than 1 hour away from Hartsfield-Jackson Atlanta International  Airport.", "title": "Recognizing Lagrange College Panthers and the Point University Skyhawks", "date": null}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "In every small town that I represent in the Ninth Congressional  District, those businesses are benefiting from what we did because we  made major adjustments for taxes that would have burdened our small  businesses and made it more expensive for them to compete against the  big companies.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Back in 2023, it was my distinct pleasure to have Commander Taylor  Burks of Missouri's Fourth Congressional District testify at a Small  Business Committee hearing on veteran entrepreneurship.", "title": "Successful Entrepreneurship for Reservists and Veterans Act", "date": "2025-02-24"}]