[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Dr.", "title": "Recognizing Dr. Angela ``angie'' Paccione", "date": "2026-01-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Representative Bird for her dedication to serving  her community.", "title": "Recognizing Colorado State Representative Shannon Bird", "date": "2026-01-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank President Buchanan for his hard work and  dedication to serving his country and his community.", "title": "Recognizing Morgan Jay Buchanan", "date": null}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate this school, staff, administration, and  board members for this accomplishment and thank them for their  commitment to our kids and our community.", "title": "Recognizing Canon City High School", "date": null}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Dr.", "title": "Recognizing Dr. Kiara Kuenzler", "date": "2025-06-05"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Annette Stolba for her four decades of service  to the citizens of Chaffee County.", "title": "Recognizing Annette Stolba", "date": "2025-02-25"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Corrine Servis for her service and congratulate  her on earning this award.", "title": "Recognizing Corrine Servis", "date": "2025-02-25"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "My district, Alabama's Seventh Congressional District, will honor  Juneteenth with a host of activities.", "title": "2025 Juneteenth Major League Baseball Events in Birmingham", "date": "2025-06-12"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Joe Garcia and thank him for his  commitment to the people of Colorado.", "title": "Recognizing Chancellor Joe Garcia", "date": "2025-03-31"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Don on his well-earned retirement and to  thank him for his service.", "title": "Recognizing Chief Don Lombardi", "date": "2025-08-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Nathan Whittington for his service to the  Jefferson County community.", "title": "Recognizing Nathan Whittington", "date": "2025-03-31"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Evergreen's charm can be seen in the community's  appreciation for the arts, outdoor recreation opportunities, and small  community feel, along with the work of the more than 70 nonprofit  organizations that embody the town's attitude of ``taking care of  ourselves and our neighbors.''\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to celebrate Evergreen, Colorado, on its 150-year- history and join the town in looking forward to the future.", "title": "Recognizing Evergreen Colorado", "date": "2025-06-05"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "On behalf of Illinois' Third Congressional District, it is my honor  to commend Erendira Rendon in this day for her lifelong commitment to  ensuring that immigrant communities are seen and that immigrants are  valued, uplifted, and loved just as she is.", "title": "Women's History Month", "date": "2025-03-04"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Speaker, on behalf of Illinois' Third Congressional District, it  is my honor to commend Omar Martinez Gonzalez for his work to ensure  that our neighbors, no matter their sexual orientation, gender  expression, ZIP Code, background, HIV status, or citizenship status  receive every single thing they need and deserve to live healthy,  thriving lives.", "title": "Commending Omar Martinez Gonzalez", "date": "2025-12-10"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Speaker, I stand before you, along with my colleague,  Representative Keith Self of the Texas Third Congressional District, to  honor Colonel Chuck DeBellevue, United States Air Force retired, an  American patriot whose extraordinary courage, leadership, and lifetime  of service reflect the highest ideals of our Nation and the United  States Air Force.", "title": "-9999", "date": "2026-01-14"}]