[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Now, Richard Nixon--that was in January of 1970.\n\nThis was Richard Nixon in July of the same year, July of 1970, in a  special message to the Congress:\n\nTo the Congress of the United States: As concern with the       condition of our physical environment has intensified, it has       become increasingly clear that we need to know more about the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…them such  wonderful patriots. They cede the authority to make the decision about  whether they will be put in harm's way to the men and women who serve  in the Congress of the United States and the Commander in Chief. That  is a profound responsibility that each of us has to debate the question  of whether we should commit this country to war.\n\nSo…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…lot of time on that.\n\nI would like to vote for this bill, but I can't. I just can't. It is  time for all of us to take a moment and say: Wait a minute. We are the  Congress of the United States. This bill, while it does many things,  does not assert congressional authority as it should.\n\nMr. Speaker, for years, the House Armed Services Committee has worked…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the President of the United States goes  into another country, Venezuela, bombs this country, and consults with  corporate America but does not consult with the Congress of the United  States of America? Where do you stand?\n\nWell, here is where the Senate has taken a position. Here is where  the Senate stands. Let's first read what the Senate has in…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…participate.  However, I have a very, very special group of people that I want to  approach now with voting.\n\nThere will be Articles of Impeachment brought to the Congress of the  United States of America for reasons that will be stated in the  Articles of Impeachment. I am not saying to anybody that exactly what I  have said today will be the Articles…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…How can you condemn what is happening in Ukraine and not  condemn what is happening in Gaza? You can't do it, not in a righteous  way, not in a righteous way.\n\nThe Congress of the United States of America ought to be on record  condemning what is happening to the Palestinians. For those who would  claim that they have no reason to be, that this is just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that some State attorney  somewhere heard from another lawyer they were nervous about it. Mr.  Speaker, come on. That is not how we should be legislating in the  Congress of the United States.\n\nCongressman   Mike Thompson and 18 of our colleagues submitted an  amendment to ensure that less-than-lethal weapons are not considered  firearms only when they…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Articles of Impeachment against you again.\n\nMr. President, no one person should have the authority to take 300- plus million people to war on his own volition. The Congress of the  United States must be engaged in this process.\n\nMr. President, it is pretty simple. Either you will respect the  Constitution of the United States of America, or you will expect…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692934/respecting-the-us-constitution"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…make sure that we  know what we are doing. We need to make sure that what the  administration or any administration is asking for comports with the  policies of the Congress of the United States.\n\nIf we defeat the previous question, we will offer an amendment to the  rule that allows the House to simply consider my amendment concerning  the FBI headquarters.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…of making the Fed Chair a  party hack is just so very wrong. I will just say this, again: In  school you probably learned of fiscal policy, and that is what the  Congress of the United States does. We create the budget of the United  States. Fiscal policy is here, and monetary policy is at the Fed,  establishing the rates in terms of relating to inflation.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…clean up  here, and I would invite my distinguished colleague from South Carolina  to join me in this.\n\nWe voted back on March 15, 2022, to erect a plaque in the Congress of  the United States to honor the police officers who fought tooth and  nail, with valor, courage, and heroism, to defend us against mobs of  thousands of marauding rioters and insurrectionists,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…and my Republican colleagues, who have the majority in the House  and the Senate, won't control him, then the only thing left is  impeachment.\n\nThat means that the Congress of the United States of America, in this  House, this will become the court of last resort. We plan to use the  court of last resort to bring justice to the country for what an unfit…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…looked over toward my Democratic colleagues, and the President said to  them, as he was talking, words tantamount to them being lunatics. He  said it. Members of the Congress of the United States of America are at  a joint session of Congress, and the President calls the Democrats  lunatics.\n\nI wasn't here. I don't know what I would have done had I been…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…say there cannot be military action  against terrorists or cartels or drug traffickers. It just says that  the United States should not be at war without a vote of Congress, the  United States should not be at war against groups on a secret list  prepared by one individual who is unwilling to share it with Congress  and with the American public.\n\nMy colleague…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congress before taking this country to war. I do it  because no one person should have the power to take over 300 million  people to war without consulting with the Congress of the United States  of America.\n\nI do this because, if I do not, this authoritarian President that we  currently have will continue to assume power. He has already instigated  an…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…opportunity to  say these programs are important to us. Article I of the Constitution  clearly gives us legislative authority: All legislative authority will  vest in the Congress of the United States.\n\nWe authorize these programs. I don't think the answer is to say we  believe in these programs, therefore we are not going to vote to  reauthorize them because…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Instead, it continues to be the moving excuse of why to oppose the  bill.\n\nMr. Speaker, I include in the Record three letters.                                      Congress of the United States,                                        House of Representatives,                                  Washington, DC, December 10, 2025.      Hon. Pam Bondi,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Speaker, I include in the Record a letter signed by myself and 19  Financial Services Committee Republicans to Director Chopra in 2023.                                  Congress of the United States,                                   Washington DC, December 18, 2023.      Hon. Rohit Chopra,      Director, Bureau of Consumer Financial Protection,           Washington,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…include in the Record a letter from  Representative Min that clarifies that he meant to vote ``yes'' on H.R.  5143 in committee.                                      Congress of the United States,                                        House of Representatives,                                 Washington, DC, September 15, 2025.      Chairman James Comer,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695642/district-of-columbia-policing-protection-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…me that appropriating, passing appropriations bills,  keeping the Federal Government functioning, is one of the primary  necessities and responsibilities of the Congress of the United States.  This is simple and straightforward. Give us a few more weeks to process  the remaining appropriations bills, and the government continues to  function while we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…United States or Donald Trump or any other President sought to declare  war on Iran, this would be well-taken. The Constitution is clear that  only this body, the Congress of the United States, can declare war, but  the Constitution and statutes are equally clear that the President not  only may but must act to defend America and Americans at a time or…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…of 2023 and lasting into 2024, that has       coincided with and taken advantage of Houthi aggression.       SEC. 3. SENSE OF CONGRESS.\n\nIt is the sense of Congress that--\n\n(1) the United States Government should seek to stop piracy       all around the world, including off the Somali Coast and in       the Gulf of Aden; and\n\n(2) the United States should…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}]