[{"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…dedication ensures that  our seniors continue to receive the respect, support, and recognition  they deserve.\n\nMr. Speaker, on behalf of Florida's 20th, 23rd and 25th Congressional  Districts, we ask our colleagues to join us in congratulating these  outstanding individuals for their extraordinary volunteerism and in  recognizing the indispensable role…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Congressional District sees an increase they haven't seen in more than  50 years, as well as the First Congressional District in the State of  Connecticut and all 535 congressional districts where individuals have  not seen an increase, especially during these inflationary times.\n\nFor a party that used to pride itself on entrepreneurialism and  capitalism,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…letter will serve as formal notice by the Department of       Justice to the State of Texas of serious concerns regarding       the legality of four of Texas's congressional districts. As       stated below, Congressional Districts TX-09, TX-18, TX-29 and       TX-33 currently constitute unconstitutional ``coalition       districts'' and we urge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…wilderness  area in his State. I and many of my Democratic colleagues also have  bills we would like to advance to provide conservation protections for  special areas in our congressional districts. This bill demonstrates  that we can and should work in a bipartisan manner to protect and  conserve public lands.\n\nMr. Speaker, I urge my colleagues to support this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…American deserves to have access to quality, affordable healthcare and  lifesaving prescription medications.\n\nThis is our first day back after spending time in our congressional  districts and conducting face-to-face interactions with our  constituents. As is often the case, our just concluded district work  period encompassed the sacred observances…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…investments from the Inflation Reduction Act have created more  than 400,000 clean energy jobs with more than half of those jobs in red  States. In fact, 19 of the 20 Congressional districts at the top of  clean energy investments are represented by my colleagues on the  Republican side of the aisle.\n\nWhat are the top three States overall of clean energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…all, DOE eliminated  $7.6 billion in projects in 16 States, all of which are led by  Democrats.''\n\nHere is the kicker: ``But some of the projects are in Republican  congressional districts, including a $27 million grant in Colorado's  Eighth Congressional District, which Representative Gabe Evans, a  Republican, represents.''\n\nGabe Evans is the author…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…infused in  Texas politics.\n\nMr. Speaker, I have in my hand a letter from the Justice Department.  It is a letter that has as its reference Unconstitutional Race-Based  Congressional Districts, and then it cites the districts: Texas  District 9, occupied by a person of color; Texas 18 was occupied by a  person of color, who is deceased, to be filled soon;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…University, Tribal leaders along the Columbia River, and  teachers in Hillsboro. They have all highlighted how NOAA's work is  far-reaching, and this is just in one of 435 congressional districts.\n\nStudents in Oregon recently told me that the Sea Grant program, run  by NOAA, helped spark their love for marine biology and education.  Another student said Sea…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Democratic colleagues and I have seen Americans' frustrations  firsthand. During the Easter recess, I traveled from one end of my  State to the other. I visited six of seven congressional districts  represented by Republicans in Congress in New York, and I spoke with  small business owners, seniors, healthcare workers, veterans, local  electeds, Republicans,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…redistricting commission or  committee.\n\nWith this redistricting commission or committee, the Governor is  going to try--I am being told--to draw the lines for these  congressional districts so that it will be either difficult or  impossible for me to get reelected.\n\nHere is my message to those who would stoop to this level of  political shenanigans, as…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…beginning with  rural California and people who live in rural areas, which both  reflected his and my background.\n\nHe, perhaps, represented if not the, one of the largest congressional  districts by geography in California, a lot of northern and eastern  California. A lot of my colleagues when they think about California  they think of Los Angeles or the Bay…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…information  from the whistleblower who has talked about what happened to the more  than 300 million Americans who depend on Social Security. This impacts  all 435 congressional districts.\n\nMadam Speaker, you have 161,000 Social Security recipients in your  district. I know that you do not stand for having their personal  information gone through, looked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…dastards they are, they should be  recorded.\n\nLet's talk about the dastards that have perpetrated this invidious  discrimination on the people of the 18th and Ninth Congressional  Districts.\n\nThe first dastard to be dealt with is, of course, the President of  the United States, so I have a resolution that condemns President  Donald Trump for ordering…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…SCHUMER. Will my colleague yield again?\n\nMr. SCHUMER. So, just today, I visited a nursing home on Staten  Island and a nursing home on Long Island--both in Republican  congressional districts--and I spoke to people there.\n\nAt the nursing home I visited, if Medicaid were cut significantly,  the nursing home would close, according to the head of this nursing…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…support getting it to President Trump's desk.\n\nMr. Speaker, I urge all my colleagues to do the same.\n\nMr. SMITH of Missouri. Mr. Speaker, I represent one of the poorest  congressional districts in this country. I can tell you this piece of  legislation is for those working families, those small business owners,  and those farmers who are doing everything…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…frequently  going to NGOs that work to promote their liberal agenda in the most  conservative parts of the world.\n\nJust imagine $1 million going to one of the cities in our  congressional districts and the impact that it could have there. It is  a disgrace that Americans' hard-earned tax dollars are being used to  support these programs and organizations under…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…House pass this particular bill.\n\nFor far too long, our communities have been plagued by poisonings  from fentanyl and fentanyl-related substances. Every one of our  congressional districts have been affected by this crisis. Kids are  dying. They are dying, and Congress has got to make this permanent.\n\nIllicit drugs have poured across the border, made…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…very generous subsidies next year. Mr.  Speaker, 60 percent of the enrollees will still have access to a plan  at or below $50 a month.\n\nI represent one of the poorest congressional districts in the  country, and still, 99.7 percent of my constituents in my district, one  of the poorest congressional districts, will be unaffected by this  expiration.\n\nThis…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]