[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…The American people do not want to go to war over regime  change, which is apparently the real objective here.\n\nWe should pass a War Powers Resolution to make clear that Congress  does not support a military campaign that may draw us into another  endless war or destabilize the region. And we can start by releasing  the video of one deadly strike already…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…that President Trump  is calling for tax cuts for Social Security recipients, but doesn't pay  for them, further weakening the trust fund that is already under  stress.\n\nIf Congress does not act by 2033, there will be a 20 percent cut  across the board for everyone. If Trump continues down his path of not  paying for benefits, it will be over a 36 percent…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…debater--to things that  different local governments did or did not do. I don't know what  Denver, Colorado, or Burlington, Vermont, did. I know what the United  States Congress does, and we never defunded the police, and we never  tried to defund the police.\n\nOn the other hand, my good friend, I believe, participated in--and if  he didn't, I am happy…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…to  disenfranchise millions of Americans, far from the ``working tirelessly  to promote unity'' asserted by the majority in this resolution.\n\nIt is equally important that Congress does unite to reject the  government's attempt to weaponize this moment into an all-out assault  on free speech across the country all in the name of Charlie Kirk.\n\nPresident…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…of SNAP and feeding our young  people. We represent rural districts and urban districts, communities  of means and communities without. There isn't a single Member of  Congress who does not represent families who rely on SNAP's food  supports to make ends meet.\n\nWe all represent families that are getting squeezed by higher costs,  who are too scared…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…should not be  controversial. It is our job. I will keep fighting for what the people  of Ohio's 13th Congressional District made clear when they sent me here  because this Congress does not belong to party leaders or special  interests. It belongs to the people.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…long-term goal is to overturn Citizens United, certainly  through a constitutional amendment--that is a very difficult goal, but  certainly one that we should aspire to--Congress does have the power to  act immediately to curb some of its damage.\n\nWe are talking about bills like the Freedom to Vote Act, the DISCLOSE  Act, the Protecting Our Democracy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…constituents, from the States that we represent, of  people who will be priced out of the insurance market, who will be one  illness or accident away from economic devastation if Congress does not  act to extend the enhanced premium tax credits beyond December 31.\n\nClarke),  our chairwoman and the Representative from New York's Ninth District,  to tell some stories.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…hearing of law  enforcement leaders and other Republican witnesses who told us the  scourges of fentanyl that we all know. Those people all said that this  can't be all Congress does; that the HALT bill cannot be our only  response because the whole bill permanently schedules what we have  already scheduled temporarily.\n\nI believe in the 99 Members…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…passed this bill.\n\nUnder the D.C. Home Rule Act, Congress established a maximum rate of  pay of the CFO, and the D.C. Council does not have authority to  increase that rate. Congress does not cap, or otherwise establish, the  pay of any other D.C. employee. Under this bill, the CFO would be paid  at the greater of a rate equal to the current maximum rate…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…changes gun laws in this country.\n\nLaw enforcement uses tasers in all 50 States. Gun violence is already  the leading cause of death for children in our country. This Congress  does not need to be in the business of weakening the laws that we do  have, but we do need to be in the business of doing what we need to do  to end gun violence in this country.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700035/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…rise today  for the third week in a row to anchor the Congressional Black Caucus'  Special Order hour to tell stories of people who stand to lose their  health insurance if Congress does not act in 22 days.\n\nMr. Speaker, 22 days. We have 22 days to prevent at least 5 million  people from losing their health insurance.\n\nFor the past 3 weeks, the Congressional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…we can to help this woman and her  family, but it begs the question: If this is how the administration  treats someone with an attorney and the support of a Member of  Congress, what does that mean for all those who don't have anyone  fighting for them? Who is speaking up for them? If we say nothing, then  what does that say about us?\n\nThis can't be what…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…people dying every single day in our constituencies. We should use this  time to really protect our kids and not just act like we are protecting  them, while this Republican Congress does nothing about these tragedies  at all.\n\nMr. Speaker, I encourage all of my colleagues to oppose this bill.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the top priority for  Minnesotans and for me. The Nation is facing a healthcare crisis that  will raise costs and threaten access to healthcare for many Minnesotans  if Congress does not act.\n\nIf the President and congressional Republicans do not extend the  healthcare tax credits, the health insurance premiums of millions of  Americans will double…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696995/hr-5371"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…eliminate inefficient use  of CRS staff time. Requiring CRS staff to spend countless hours  formatting and paginating the print version of CONAN does not support  the work of Congress, nor does it benefit our constituents.\n\nMr. Speaker, replacing the CONAN print requirement with a digital  requirement is a no-brainer. The digital version provides Members and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…technological feasibility of the standards and serious food safety  concerns cloud this rulemaking.\n\nSimply put, the DOE far exceeded the bounds of its authority with  this rule. If Congress does not act, this final regulation will harm  small businesses, drive up costs for American families, and put already  expensive equipment out of reach for many who need it…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…mine?\n\nMr. KENNEDY. OK. I have said I will not substitute his bill for mine.\n\nMr. KENNEDY. Mr. President, may I ask for a clarification?\n\nI have offered a bill to say that Congress does not get paid like  everybody else who is not being paid during a shutdown. There has been  a little bit of a back-and-forth.\n\nAs I understand it, Senator Paul has objected…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…health insurance more  affordable beginning on January 1, 2026, but going on beyond that.\n\nSo what can we do for January 1, 2026? This is where I think we are  headed: If Congress does what it always does, Democrats are going to  put up a bill, and it is going to fail. They are going to put up a  bill, and they are going to know it is going to fail. The…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…to their reliance on confined gathering  spaces.\n\nThe statute of limitations for prosecuting fraud within these  programs is set to expire beginning early next year. If Congress does  not act, law enforcement will not have the necessary time to  investigate and prosecute these crimes.\n\nAlong with my colleague, Representative Conaway, I have introduced…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…the Federal District, which all Americans  know now is Washington, D.C., and it is the Nation's Capital.\n\nThat is in the Constitution that was ratified by several States.  Congress does have the constitutional authority to regulate activities  within the Federal District. When it is said that somehow Congress is  now eroding local control, that is simply…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…$6.5 trillion a  year. We appropriate about a third of that during the appropriations  process, but the rest of it is on autopilot. It is mandatory spending  programs that Congress does not appropriate on an annual basis. But  once we turn it on, it continues until it is changed--usually never-- and it goes up more and more each year with cost-of-living…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…exciting new opportunities artificial intelligence presents to advance  education for students with special needs. However, many of those  opportunities will not be realized if Congress does not live up to its  commitment.\n\nThe IDEA Full Funding Act ensures that we meet that commitment,  gradually increasing Federal support until we reach the promised 40  percent.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…dollars in  increases in their healthcare costs. That is something that a lot of  these folks simply cannot afford.\n\nMr. Speaker, that is the reality of what will happen if Congress does  nothing and if Congress fails to act. Since that is not acceptable to  me--and I know it is not acceptable to a lot of Members on both sides  of the aisle--I have introduced…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]