[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Representative Bonnie Watson Coleman. We both are  here because of the path that leaders like Shirley Chisholm blazed  before us.\n\nWith the highest ever membership to the Congressional Black Caucus,  62 members strong, we have never been stronger. We represent the dreams  of our ancestors, and those dreams are in danger by this  administration's hateful policies…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…from California, my  colleague from Ohio, and the previous speakers. It is an honor to be  here, not just as a Member of Congress, but to be here as a member of  the Congressional Black Caucus, especially at a time like this.\n\nI rise today not just with concern, but with alarm. In his first 100  days back in the White House, Donald Trump has unleashed a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…are putting undue burdens on the American people. I  thank my colleague Representative Jennifer McClellan for consistently  continuing to elevate the voices of the Congressional Black Caucus  members as we talk about the stories of our communities and the stories  of our people and those who we represent, highlighting the needs of  those in our Nation…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…December 31.\n\nAn estimated 5 million people will find that they can no longer  afford those premiums and will lose their coverage altogether.\n\nFor the past month, the Congressional Black Caucus has told stories  on this floor of our constituents who will be impacted by this body's  failure to act. These include restaurant owners, beauticians, barbers,  landscapers,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I thank Mr. Clyburn for yielding. I am  honored to be here tonight on behalf of  the Congressional Black Caucus to commemorate National Minority Health  Awareness Month, but I am also here for personal reasons.\n\nMr. Speaker, 10 years ago today, I was 31 weeks pregnant. I was…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Affordable Care Act.\n\nThis big, pretty some may say, most would say ugly law will hurt  Americans of every party, of every background, of every ZIP Code. For  43 days, the Congressional Black Caucus stood firm to protect America's  healthcare and lower healthcare costs for people like Mike and so many  others that will remain nameless and faceless because they…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Mr. HORSFORD. Mr. Speaker, I rise today with my colleagues in the  Congressional Black Caucus to honor my history--our history--American  history . . .\n\nI'm here to honor Black history during Black History Month.\n\nThis is a time to honor our elders, and the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Mr. OLSZEWSKI. Mr. Speaker, I thank my colleagues of the  Congressional Black Caucus for their remarks on an issue that is  pressing and timely for all of us. I really appreciate the ways in  which so many of you have lifted your voices on the scourge…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, it is with great honor that I rise  today to co-anchor this Congressional Black Caucus Special Order hour,  along with my distinguished colleague from the great State of Ohio,  Representative Shontel Brown, who hopefully will be joining us.\n\nAlong with…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…hold.\n\nThey are trying to bury us, but what they don't realize is that we  are seeds and still we rise. I stand here a proud Black woman and a  proud member of the Congressional Black Caucus, and I refuse to stand  by while this administration tries to turn back the hands of time. We  will resist. We will continue speaking truth to power, and we will…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…allow.\n\nProgress is never achieved without persistence, and justice is never  advanced without those willing to confront complacency and demand  accountability.\n\nThe Congressional Black Caucus will not be silent while families are  pushed deeper into poverty, while communities of color are targeted by  discriminatory policies, and while the promise of our…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699198/building-a-beloved-community"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "Mr. IVEY. Mr. Speaker, I thank my colleague from Virginia for hosting  this event, and I also thank the Congressional Black Caucus for the  focus on this issue tonight.\n\nI was a child in Rocky Mount, North Carolina, in the late 1960s. I  lived across the street from the Booker T. Washington High…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I am so honored and privileged to be here  tonight to speak on the Congressional Black Caucus, with our Special  Order hour tonight specific to honoring Black History Month.\n\nMr. Speaker, I am pleased to join tonight's Special Order hour  honoring Black History…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…dealing with the feelings of exhaustion and  hopelessness, we cannot grow complacent. We cannot succumb to the  forces of fear, hatred, and bigotry.\n\nThe work the Congressional Black Caucus and House Democrats are  taking up just reinforces our resistance to the division that we are  living and seeing at this very moment. Together, we are using every…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Ms. McClellan for  yielding, and I thank Representatives McClellan and Clyburn for  initiating this Congressional Black Caucus Special Order on education.\n\nLet me just say that I have been so inspired by previous speakers,  including speakers on the other side of the aisle who held their…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}]