[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…colleagues on both sides of the aisle to  support this bill. Together, we can meet the affordability crisis head  on and deliver real support for our constituents.           Congratulating Loudon County High School's Football Team\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise to congratulate Loudon County  High School's football team, led by Head Coach Matt Reidenbaugh,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…2025 Impact Award will be presented to IACC--Pars       Place.\n\nThe 2025 Education Award will be presented to Marco Rando.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  recipients of the 2025 Arts Awards and recognizing the visionaries,  leaders, and supporters who help to make our Northern Virginia  communities rich with cultural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697103/recognizing-the-recipients-of-the-2025-artsfairfax-arts-awards"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Automotive, and the Scott A. & Phyllis P.       Crabtree Family Foundation.\n\nChairman's Choice Award: Ken Quincy and Aimee Vosper.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  year's awardees. Fairfax County is regarded as one of the best places  in the country in which to live, work, and raise a family, and our  nationally recognized park…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…dedication,  talent, and teamwork that goes into earning a State championship title.\n\nOn behalf of Alabama's Seventh Congressional District, I ask my  colleagues to join me in congratulating our outstanding high school  basketball champions. I am confident that these young student athletes  have bright futures ahead of them.\n\nThis weekend, the city of Birmingham…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…problems we are hearing about at Newark could be a nationwide  problem if the majority in Congress continues to disrespect and deplete  this vital workforce.           Congratulating Students of Charter School of Wilmington\n\nMs. McBRIDE. Mr. Speaker, I rise to celebrate an extraordinary  achievement by students from the Charter School of Wilmington,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…the Jewish community in the region has a spiritual, educational,  and cultural home for decades to come.\n\nOn this historic occasion, I ask my colleagues to join me in  congratulating Rabbi Levi and Mrs. Chayala Wilhelm, the dedicated  members of the Chabad Southwest Las Vegas community, and all those  whose generosity and commitment have made this day…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695341/recognizing-the-groundbreaking-of-chabad-southwest-las-vegas"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…I am proud to represent Nancy Merkling, whose dedication  as both an artist and a mentor has made a lasting impact on our  community. I ask my colleagues to join me in congratulating Ms.  Merkling on receiving this well-deserved recognition.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…honor children,  inspire hope, and advocate for continued progress in both cancer and  blood disorder care.\n\nMr. Speaker, I would like to urge the chamber to join me in  congratulating OSF Children's Hospital of Illinois Cancer and Blood  Disorders Institute on their new name, while applauding their  leadership in pediatric cancer and blood disorder care.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694928/recognizing-childhood-cancer-awareness-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…epidemic and mental health  crisis.\n\nWhile Father Mac is no longer with us, his legacy lives on through  Haymarket Center. I join people across the Chicagoland area in  congratulating Haymarket Center for 50 years of incredible work,  helping those who had no one else to turn to, and treating everyone who  walked through its doors with kindness.", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…means to be a good neighbor  and a true public servant. I ask my colleagues to join me in honoring  Robert ``Bob'' P. Hubbard for his remarkable lifetime of service and  congratulating him on being named the 2024 Citizen of the Year.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Mr. Speaker, I am proud to represent Rhienna McClain, whose  exceptional contributions have made a lasting impact on McHenry County.  I ask my colleagues to join me in congratulating her on receiving the  ATHENA International Leadership Award, a recognition that is truly  well-deserved.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…appointment to this position was  also historic, as he became the first African American Lieutenant  Colonel and Chief Deputy.\n\nMr. Speaker, I ask my colleagues to join me in congratulating Lt.  Colonel Jabar Shabazz on his retirement. On behalf of myself and the  citizens of Fairfax County, I thank him and his family for his  honorable 31 years of selfless…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Anaheim Police Association.\n\nI call on my colleagues to join me in recognizing Mr. Patel for the  positive change he has helped create in Anaheim and Orange County, and  congratulating him on being honored by Cypress College's Americana  Awards as Citizen of the Year.\n\nOur community is grateful to Mr. Patel for his leadership and  contributions. I thank…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688533/recognizing-mr-bharat-patel-for-his-contributions-to-our-orange-county-community"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Ms. SCHOLTEN. Mr. Speaker, I rise today to ask my colleagues to join  me in congratulating Hannah Davis. Hannah is a member of Girl Scouts of  Michigan Shore to Shore, Girl Scout Juliette. She has exemplified  extraordinary leadership, innovative problem-solving,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693151/recognizing-hannah-davis"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…His visit reminds us  to be constantly kind and collaborative, one that is much needed during  this time.\n\nPlease join me in thanking His All-Holiness for his visit and  congratulating him on this well-deserved award.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…occur by chance; they  are the result of sustained hard work, personal sacrifice, and a  devoted commitment to excellence.\n\nMr. Speaker, I ask my colleagues to join me in congratulating  Madeline Brobst on this milestone of academic distinction. We commend  her for this outstanding accomplishment and look forward with  confidence to the many successes…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…induction into the Veterans Hall of Fame recognizes her impact on  the Sunshine State and our country. We are proud of her and her  service.\n\nMr. Speaker, please join me in congratulating my friend Lieutenant  Governor Jennifer Carroll on being inducted in the Florida Veterans  Hall of Fame.\n\nShe is indeed one of the best of the best.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "Mr. AMODEI of Nevada. Mr. Speaker, I rise today to ask my colleagues  to join me in congratulating Faith McCrea. Faith is a member of Girl  Scouts of the Sierra Nevada, Troop 1306, and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…I thank Lucas for his commitment to service and wish him the very  best of luck as he embarks on this exciting new phase of life at West  Point.                         Congratulating Bryony Shipe\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate Bryony Shipe of Ford City, Pennsylvania. Bryony  recently accepted…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…fair prices.\n\nToday, we celebrate Arrowhead Pointe Golf Course and its contribution  to Georgia's tourism, recreation, and community well-being.                         Congratulating Berry College\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor Berry  College, a well respected and prestigious university located in Mount  Berry, Georgia.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…entire community, I thank them and join in  celebrating this certification that will allow them to continue to  expand on their important work.                          congratulating zoe mesuch\n\nMr. RYAN. Mr. Speaker, I rise today to congratulate recent Wallkill  High School graduate Zoe Mesuch on concluding a truly remarkable high  school basketball…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…their athletic program.\n\nUnder Head Coach Tim Orlosky, these young men exhibited persistence,  sportsmanship, and humility in their title run.\n\nMr. Speaker, join me in congratulating this team of incredible young  men and everybody who supported them in their journey to achieve  history for Frederica Academy.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…team. I'm proud to support a program that promotes the  next generation of public servants.\n\nMr. Speaker, I ask my colleagues in the House of Representatives to  join me in congratulating the Maddy Institute on 25 years of service.  By educating, engaging, and empowering young people, the Maddy  Institute is helping shape the next generation of leaders in…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699141/recognizing-the-maddy-institute"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…to join his loved ones and neighbors in  wishing Mr. Robert Holland a very happy 100th birthday and thanking him  for his steadfast service to our Nation.                Congratulating Warren County Middle School FFA\n\nMr. CLINE. Mr. Speaker, for the first time in Warren County's  history, a middle school FFA chapter has earned the highest honor  possible…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…come true.\n\nMr. Speaker, I congratulate the Blackjacks on their victory. They  have made all of their families, community, and the Seventh District  proud.              Congratulating Albany Huskies on Undefeated Season\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate the Albany  Huskies on their undefeated season, closing it out with a win over…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…citation.\n\nThough he tragically passed away in November of 1942 during a  training flight in Alabama, Buzz's legacy lives on as an inspiration to  all aspiring aviators.\n\nCongratulating University of Florida Forward Thomas Haugh\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to congratulate  University of Florida forward and New Oxford, Pennsylvania,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…indispensable part of our  remarkable season.\n\nThe team should enjoy this championship. They earned it.\n\nNow, on to nationals representing Arizona. Let's go get it.                 Congratulating Jane Strain on Her Retirement\n\nMr. CISCOMANI. Mr. Speaker, I rise today to congratulate my dear  friend and Army veteran Jane Strain on a well-deserved retirement as a…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…spectrum of educational  options, including traditional public schools, private schools, charter  schools, and home schools.\n\nMr. Speaker, I ask that my colleagues join me in congratulating and  thanking Parents Challenge for its steadfast commitment to empowering  parents with school choice.\n\nOver the past 25 years, Parents Challenge has enriched the lives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694905/recognizing-parents-challenge"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…House floor to recognize their achievement and ensure that they know  just how proud they have made our country.\n\nMr. Speaker, I ask my colleagues to join me once again in  congratulating the USA Men's Deaf Basketball team for their outstanding  gold medal victory at the Deaflympics, and I look forward to their  future success.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698133/congratulating-usa-mens-deaf-basketball-team"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…both truth and compassion, empowering individuals,  strengthening families, and preserving freedom for future generations.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  outstanding woman for her public service and leadership.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}]