[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…The RAIL Act is supported by rail workers, local governments, and a  bipartisan group of lawmakers, Democrats and Republicans in and out of  Ohio. Yet, for two consecutive Congresses, House Republican leadership  has refused to even give the bill a hearing. That is not gridlock. That  is a decision and a terrible one at that. It is a decision to put…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…entitled to through their  service-connected disability. If signed into law, this bill could save  veterans tens of thousands of dollars on shipping costs of vehicles.\n\nTwo Congresses ago, we passed the Veterans Auto and Education  Improvement Act, a bill authored by Ranking Member   Mike Levin and  Representative Lizzie Fletcher, which expanded the adaptive…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689674/deliver-for-veterans-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Committee on Education and Workforce, and my Education  Policy Director on the committee have served as Stennis Congressional  Staff Fellows in the 115th, 117th, and 119th Congresses respectfully.\n\nThe Winter 2024 edition of Public Service Review comes at a pivotal  moment as we are in the early months of a new Congress and a new  administration. In this…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…that  invests in American-made jobs, that invests in our infrastructure and  our people just as we did in passing the largest bills in generations  over the last several Congresses: the bipartisan infrastructure bill,  the CHIPS and Science Act, and the Inflation Reduction Act, which not  only invested millions of dollars in communities all across the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…Pettersen, and Luna for their unwavering advocacy for traveling  mothers.\n\nI also thank my former colleague, Katie Porter of Orange County, who  introduced this bill in prior Congresses. It is a commonsense bill, and  it is rightfully a bipartisan effort.\n\nCompounding the chaos with the anxiety that mothers face are TSA  screeners who have inadequate or…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…legislation alongside Senators Cantwell  and Murray. I recognize the dedication and work of my predecessor,  Representative Derek Kilmer, who championed this bill in past  Congresses prior to his retirement last year.\n\nChairwoman Charles' leadership has been essential to one of the most  ambitious restoration projects in our country's history: the removal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…them before the Financial Services Committee, as did many of  my committee colleagues.\n\nI sponsored three of the bills in this package that I have worked on  for multiple Congresses. These bills increase transparency in  multiclass stock structures, protect against activist investors in  closed-end funds, and encourage startups to test the waters when…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697829/increasing-investor-opportunities-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…substantial number of cosponsors, 25 in all, including 13  Democrats on the Committee.\n\nWe have seen bipartisan support for this bill, not only in this  Congress but in prior Congresses. This is the Congress in which we  actually have to get it adopted. The bipartisan legislation will open  more investments and unlock capital for small businesses, as I have…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…more  in debt.\n\nNewsweek reported this week that the current Congress is one of the  least effective ever, passing only 27 bills since January 3, far fewer  than in previous Congresses at the same point. Unfortunately, the  biggest, ugliest bill we passed, and the rescissions package will  contribute to incalculable pain, suffering, and death all around…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…white male counterparts, and these disparities compound  throughout their careers. The House passed this bill as part of the  Paycheck Fairness Act in the 116th and 117th Congresses.\n\nThere is much work to do to end the pay gap. This bill represents a  crucial step towards that goal. I urge my colleagues to support this  bill.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688912/introduction-of-the-salary-history-question-prohibition-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…for me to watch. I am  not here because we haven't been trying to get a bipartisan consensus  on this and calling and doing all the work. I have watched this now for  three Congresses. Number 2, I am here not because I am trying to stop  the HALT Act. I am here because I heard two Republicans in our  committee say the only reason we can't consider bipartisan…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…hearings, open, public hearings with members of the administration  coming to testify before us and the American people so that they can  hear for themselves?\n\nIn prior Congresses, when I was the chair, even when Mr. McCaul was  the chair, and there was a Democrat in the office, they were bringing  in the Secretary of State on a consistent basis, subpoenaing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "Mr. Speaker, in this Congress, as in previous Congresses, I  introduced the Senior Security Act to protect vulnerable seniors from  fraudsters who seek to take financial advantage of them. We are  bringing it again this Congress…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…particularly in the context of growing geopolitical competition and  threats by our shared adversaries to endanger the pursuit of a free and  open Indo-Pacific.\n\nOver the last three Congresses, we have introduced versions of the  BLUE Pacific Act, which would advance a comprehensive, long-term U.S.  strategy in the Pacific Islands region. Much of the previous versions…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Act (H.R. 5107), and The D.C. Cash Bail Reform       Act (H.R. 5214). These bills will make the District of       Columbia (D.C. or the District) less safe and just.       Congresses must cease these repeated attempts--against the       will of D.C. residents and locally elected leadership--to       override D.C. laws that were enacted by and for the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…humor, and is  a friend to everyone in the office. From late hours in the D.C. office  to road trips throughout central Washington, Matt has been my megaphone  across three Congresses, and we have enjoyed every minute of it.\n\nAs Matt departs from the House for, I am sorry to say, the upper  Chamber, I am confident that he will succeed in his new role and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700048/recognizing-matt-reed"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and the International Committee of the Red Cross.\n\n7. International aspects of nuclear energy, including       nuclear transfer policy.\n\n8. International conferences and congresses.\n\n9. International law as it relates to foreign policy.\n\n10. International Monetary Fund and other international       organizations established primarily for international…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…address the unique issues faced by our  senior investors.\n\nMr. Speaker, H.R. 1469 has received strong bipartisan support in the  past, passing by suspension in the last three Congresses. It remains a  commonsense solution to ensure that senior investors receive adequate  protection against fraud and exploitation.\n\nAgain, I thank Mr. Gottheimer for his work…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…an honor to stand with him today.  I also extend my gratitude and thanks to my colleague, Mr. Pappas, for  co-leading this bipartisan legislation with me for the last two  Congresses.\n\nMr. Speaker, today, I rise in strong support of H.R. 695, the Medal  of Honor Act.\n\nThe Medal of Honor is our Nation's highest and most prestigious  military decoration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…that is just an amazing thing.\n\nToday, I rise in support of H.R. 1325, the Commercial Remote Sensing  Act. I have introduced this bipartisan legislation in the past two  Congresses, and on both occasions, the measures passed the House by  voice vote. I reintroduced the bill this Congress along with my  colleague and friend, the ranking member of the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Federal Government.\n\nLegislation to rectify this for the Lumbee Tribe has been introduced  in Congress more than 30 times with broad bipartisan support. In the  past two Congresses, in fact, the House passed this legislation under  suspension, most recently on December 17, 2024.\n\nOutside of Congress, the Lumbee Fairness Act has the support of 236  Tribes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the House Agriculture Committee  for all the work that they have put in on both sides of the aisle. It  was significant hours for multiple years, basically the last three  Congresses, in thinking through what is the future of digital assets,  how are they best regulated, what is the role of United States  Government in oversight, what is the future of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Representatives Houlahan and Baird for their work on this  logical legislation that supports our students and our economy. This  bill passed the House in the 117th and 118th Congresses, and I urge my  colleagues to pass it again today.\n\nMr. BABIN. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, as teachers prepare…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…just  that.\n\nMr. Speaker, I thank my colleagues, Congressman Correa, Congressman  Schweikert, and Congressman Stanton, for their leadership on this issue  over the last two Congresses.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…today to  prioritize the passage of S. 1383, the Safeguard American Voter  Eligibility Act, or the SAVE America Act, which builds upon the SAVE  Act introduced in previous Congresses that requires States to obtain  proof of citizenship for Federal elections, ensuring only U.S. citizens  are voting in those elections. In addition, the SAVE America Act…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Space, and Technology  Committee, Mr. Lucas, for introducing this bill and his leadership on  this important topic. This bill passed the House by a voice vote in the  last two Congresses, and I look forward to working with the Senate to  see it finally cross the finish line.\n\nMr. Speaker, I urge all of my colleagues to support this bill, and I  reserve the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…bipartisan support from the leadership of  the House Financial Services Committee. This bill has passed  unanimously out of the House Financial Services Committee for two  Congresses now, and it is past time for it to become law.\n\nFrom Hawaii and Washington to New York and Florida to my home State  of Oklahoma, our Nation's agricultural land must be protected.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692797/agricultural-risk-review-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…monitor trends and  threats and recommend policy changes aimed at protecting our seniors  from financial exploitation.\n\nThis bill has enjoyed broad bipartisan support in prior Congresses.  It helps ensure that our older investors are not left vulnerable in an  increasingly complex marketplace.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…operate efficiently and  effectively.\n\nThe Community Reclamation Partnerships Act passed the House in the  115th Congress and has moved through committee for the last three  Congresses. It is time we passed this commonsense, bipartisan piece of  legislation that will help reclaim abandoned mine lands and clean up  our local estuaries.\n\nMr. Speaker, I urge…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Canoe Area is a wonderful place, but the  Boundary Waters Canoe Area has been protected, is currently protected,  and will be protected even after this CRA is passed.\n\nThe Congresses that came long before us made sure this was the case,  long before the Obama administration ever did a lease withdrawal in the  area. They established the Boundary Waters…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]