[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…College in Atlanta after returning home from war, and then he went on  to earn a divinity degree from Colgate in 1952. He settled down in  Seattle, where he came to lead the congregation of one of Seattle's  oldest and largest African American churches for forty-three years as  pastor of Mount Zion Baptist Church. He was not only a spiritual guide,  but…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…1283, and       we urge you to oppose it as well.            Sincerely,\n\nJewish Women International; Catholics for Family Peace       Education and Research Initiative; Congregation of Our Lady       of Charity of the Good Shepherd, U.S. Provinces; Hope Rise       Thrive; Interfaith Coalition Against Domestic and Sexual       Violence; Legal Momentum:…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Government of the United States of America.\n\nMr. Speaker, let us adhere to the spirit of President George  Washington, who said in his famous letter in 1790 to the Hebrew  Congregation of Newport, Rhode Island, that ``the Government of the  United States . . . gives to bigotry no sanction, to persecution no  assistance.''\n\nIf these words are to mean something…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congressional District of Texas, I       am proud to salute Apostle Dr. Dana Carson for his 40 years       of dedicated service to enriching the lives of his family,       congregation, our Nation, and the globe. Best wishes on this       momentous occasion.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…extraordinary leadership, vision, and longstanding commitment to  community transformation. Together, they have grown The Oceanside  Sanctuary into a thriving, historic congregation that serves as a hub  for inclusive, justice-centered ministry in North County San Diego.\n\nTheir work extends far beyond the church walls through ecumenical and  interfaith…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699856/recognizing-reverend-jason-coker-and-reverend-jenell-coker-as-my-december-2025-co-constituents-of-the-month"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Virginia for their extraordinary  commitment to serving families in need.\n\nDuring the height of pandemic, the church created the Food Giveaway  Program to help members from the congregation put food on their tables.  As the harmful impacts of the pandemic spread throughout the Prince  William County, the church expanded its mission--opening its doors to  the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696800/recognizing-the-neabsco-baptist-church-for-serving-families-in-need"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…1992, launched Gethsemane Worship Center  International in Albany from a small building on Baldwin Street leased  by then-Mayor Paul Keenan. With only nine members, that congregation  grew into a thriving interdenominational ministry impacting lives  locally and globally. He also served as Pastor of New Zion Hill Baptist  Church and later organized Divine…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Prize during his visit.\n\nPatriarch Bartholomew's spiritual guidance has inspired Orthodox  Christians across the globe. In my own district, he has been a shepherd  to the congregation of St. Demetrios Greek Orthodox Church in Union,  New Jersey. Under his leadership, the St. Demetrios community has  flourished as an example of faith in action--welcoming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695736/recognizing-the-visit-of-ecumenical-patriarch-bartholomew"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Churches in New York, Connecticut,  North Carolina, and Alabama. In 1992 he became the senior pastor at the  Wesley Temple Church in Akron, which is Akron's oldest Black  congregation.\n\nReverend Dr. Walker has been a faithful servant of God, the African  Methodist Episcopal Zion Church, and the Beth-El AME Zion Church where  he currently serves as pastor.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688261/recognizing-reverend-dr-curtis-theodore-walker-sr"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize The Remedy Church  and its congregation as Ohio's 13th Congressional District's Champion  of the Week.\n\nThis past weekend marked a significant milestone as The Remedy Church  celebrated 5 years of faithful service…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…embracing change and relocating to a  new home on West McNichols in 1950. By May 27, 1951, Trinity Church  broke ground on their new fellowship hall, proudly serving a growing  congregation of 210 strong.\n\nWhile expanding their congregation and educational programs, Trinity  Church opened its doors to Faith Bethany United Methodist Church,  offering them a…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…alumnus, Jimmy Oregel, for a life of  dedication to the city of Anaheim and to Anaheim High School.\n\nAt St. Boniface, where we both attend, he helped found the Orange  County Congregation Community.\n\nWe are both diehard Anaheim High School football fans, and at  Anaheim, he served as a sports team manager. Upon graduation, Jimmy  joined the football booster…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, it is my honor and pleasure to extend  heartfelt congratulations to the congregation of First African Baptist  Church in Columbus, Georgia, as they celebrate a remarkable 185 years  of faith and community. This great occasion will be marked by a  celebration…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…If you have any questions,       please reach out.            Sincerely,\n\nJewish Women International; Catholics for Family Peace       Education and Research Initiative; Congregation of Our Lady       of Charity of the Good Shepherd, U.S. Provinces; Hope Rise       Thrive; Interfaith Coalition Against Domestic and Sexual       Violence; Legal Momentum:…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…membership and outreach. Expanding facilities,  establishing new ministries, and adopting the name Bethel Temple  Assembly of God reflected its evolving mission and growing  congregation.\n\nIn the decades that followed, Reverends Ron Johnson and Glenn  Reynolds deepened the church's community engagement through programs  such as the Great Turkey Giveaway,…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…fellowship, and community for generations. Its  restoration represents not only the preservation of an important  historic landmark but also the enduring strength of the congregation  and the broader Mount Olive community. I commend the Mount Olive  Township and the Mount Olive Township Historical Society for their  dedication to this project. Their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691357/mount-olive-baptist-church-dedication"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…the abduction of Pastor Jin and the Zion Church leaders and to demand  their immediate release. This resolution is designed to pressure  Chinese leadership to release the congregation members and to let them  practice their Christian faith freely. It sends a message that faith is  not a crime, and a government that fears its citizens' faith is nothing…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696588/expressing-condemnation-of-the-chinese-communist-partys-persecution-of-religious-minority-groups"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…small group of faithful families, the church  persevered through frontier hardships, local feuds, floods, and  economic trials. Over the years, it has grown into a vibrant  congregation rooted in service, tradition, and faith.\n\nThe sanctuary itself, built of native limestone in the Victorian  Gothic style, is a testament to the perseverance of its early…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…our Nation's Capital. His All-Holiness is a champion  of religious liberty, engaging in dialogues with leaders of Judaism,  Christianity, and Islam. Moreover, he leads a congregation of 300  million church members worldwide and is the longest-serving Patriarch  in the two-millennia history of the Church. We are blessed to have him  here in Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695798/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…back--it's a powerful  reminder of the faithfulness of God and the strength of a community  rooted in Him.\n\nI thank Pastor Gibson, the leadership team, and every member of this  congregation for their dedication, their prayers, and their service.  May God continue to bless them as they move forward into the next  chapter of this remarkable journey.\n\nCongratulations,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691555/special-recognition-of-150-years-of-first-baptist-church-of-biloxi"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…month because  they believed one of the pastors was a field director for ICE. The mob  cursed, threatened, and terrorized not just the pastor but the young  children in the congregation, screaming in the faces of crying children  that their parents were Nazis who were going to burn in Hell. They  blocked the stairs to the childcare area so that the parents…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Heshy Wolf and his wife Chani have now chosen  to make Fairbanks their permanent home.\n\nJay, generous as ever, purchased a small church with his own money.  The previous congregation at the church had outgrown the place. They  refurbished it, transforming it into the Fairbanks Jewish Center. The  original congregation stayed on rent-free until they found…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…our Nation's Capital. His All-Holiness is a champion  of religious liberty, engaging in dialogues with leaders of Judaism,  Christianity, and Islam. Moreover, he leads a congregation of 300  million church members worldwide and is the longest-serving Patriarch  in the two-millennia history of the Church. We are blessed to have him  here in Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695624/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…Orthodox Archdiocese of America for a century. The Church continues to  be a strong and dedicated partner in the Tulsa community.\n\nThis impressive anniversary highlights the congregation's devotion to  the greater Tulsa community, as well as their unwavering faith in God  and commitment to His will. One hundred years of service is an  extraordinary accomplishment.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690557/holy-trinity-greek-orthodox-church-centennial-celebration"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…the  United States House of Representatives to serve as the guest chaplain  this week and offer a prayer this morning.\n\nDr. Gossett and his wife, Katie, lead the largest congregation of  believers in east Texas. They also proudly shepherd a flock of four  wonderful children at home.\n\nPastor Michael, as he is known, and Katie are passionate about their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690047/welcoming-guest-chaplain-dr-michael-gossett"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…issues, making plans for the future, or making complex       decisions; and\n\n(B) who may include the family members, friends, unpaid       supporters, members of the religious congregation, and       appropriate personnel at a community center, of or serving       the qualified individual.       SEC. 3. PROHIBITION OF DISCRIMINATORY POLICY.\n\nThe board of directors…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…families on the Mississippi  Gulf Coast.\n\nUnder the steadfast leadership of Bishop Jason Johnson and his wife,  First Lady Kim Johnson, Abundant Life has grown into a vibrant  congregation committed to spreading the Gospel of Christ and uplifting  those in need.\n\nFrom youth outreach to disaster relief and from mentoring programs to  feeding the hungry, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}]