[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to Thomas's hard work, determination, and perseverance  at Mandalay Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Thomas Dempster on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691011/recognizing-thomas-dempster"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I congratulate the 451 graduates of  John Champe High School's class of 2025.\n\nThis class has a lot to be proud of. In their time as Knights, the  girls' soccer team made history by winning…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…testament to Kloey's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Kloey Kehl on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691929/recognizing-kloey-kehl"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…in Spotsylvania.\n\nIn Congress, I am working to strengthen public education so students  like Kaitlyn have access to programs that allow them to pursue their  passions.\n\nI congratulate Kaitlyn on this well-earned accomplishment and wish  her luck as she heads off to college in the fall.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692977/recognizing-kaitlyn-anthes"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Gael's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Gael Alvarez Acosta on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690273/recognizing-gael-alvarez-acosta"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…their belief that they can solve big problems in their communities.\n\nWhile I am a proud graduate of Cab Calloway, I couldn't help but come  to the well of the House to congratulate the Charter School of  Wilmington. They have made Delaware proud and inspired us all.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…incredible basketball game last night and brought them to  victory over the Rockets out of Texas and are going to advance onto the  next round of the basketball playoffs. So I congratulate the Dubs.\n\nSadly, that is where the good news ends. What we are going to talk  about for the rest of this evening is some bad news, bad for the  American people.\n\nThe Republican…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, I rise today to recognize and congratulate  the Boston Passport Agency on its 100th anniversary. For a century, the  dedicated public servants at the Boston Passport Agency have connected  the people of the Commonwealth…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to recognize and congratulate  John Michael Spaun, Jr., or J.J. Spaun, on his U.S. Open victory.\n\nJ.J. is a proud product of California's 31st Congressional District,  a graduate of San Dimas High School,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692888/congratulating-jj-spaun"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise today to congratulate the  Fredericksburg Nationals on winning their first-ever Carolina League  Championship.\n\nUnder manager Jake Lowery's leadership, the team made a thrilling  late-season…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690055/congratulations-to-the-fredericksburg-nationals"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…testament to Eamon's hard work, determination, and perseverance at  Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Eamon VanDyke on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691744/recognizing-eamon-vandyke"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr Speaker, I rise today to congratulate Terry Nelson on  his retirement as Co-Chair of the Finishing Trades Institute of the  Upper Midwest (FTIUM), following over four decades of leadership and  advocacy in the…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…was honored to join students, families, and community leaders to  celebrate and recognize the work that has been done to educate the next  generation on Tamil history.\n\nI congratulate the Valluvan Tamil Academy, and I thank them for all  that they do for our community in Virginia. I am looking forward to  working together for many years to come.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692089/recognizing-valluvan-tamil-academys-15th-annual-day-celebration"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to Ibrahim's hard work, determination, and perseverance  at Oberon Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Ibrahim Yousuf on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691464/recognizing-ibrahim-yousuf"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…director  role in the newly created U.S. Wildland Fire Service.\n\nMr. Speaker, I thank Chief Fennessy for his commitment to keeping  Orange County safe. He will be missed. I congratulate him on his  retirement.               recognizing anaheim police chief rick armendariz\n\nMr. CORREA. Mr. Speaker, I rise today to recognize Anaheim Police  Chief Rick Armendariz,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate Cooper Lehman  and Braylen Garcia of Hempfield High School on winning the 2025 PIAA  Class 3A boys' Tennis Doubles championship on May 24.\n\nSenior Cooper Lehman and freshman…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692412/congratulating-cooper-lehman-and-braylen-garcia-tennis-doubles-champions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Subcommittee Chairmen, Molly has  departed the U.S. House of Representatives to accept another  opportunity to continue to serve as a health expert. I wish her the  best, congratulate her on her new role, and thank Molly Brimmer Lolli  for her service to the House Committee on Energy and Commerce and the  United States Congress. I also congratulate her…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate Sophia Rivera  of Ephrata High School on winning gold medals in both girls' shot put  and girls' discus at the 2025 PIAA Class 3A Track and Field  Championship, held on…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691701/congratulating-sophia-rivera-girls-shot-put-and-discus-state-champion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I wish to congratulate JB  Harris, JT Chevallier, and the entire team at ECO-CLEAN Solutions for  reaching a record-breaking milestone late last year: 1 million square  feet of Lake Tahoe shoreline…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to congratulate Lori  Frazier Bearden, a resident of Savannah, Georgia, who will serve as the  Deputy Assistant Secretary for the Employment and Training  Administration, ETA, at the United…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690088/recognizing-deputy-assistant-secretary-lori-frazier-bearden"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today to congratulate Salpointe  Catholic High School's girls' flag football team for winning the 4A  State championship in its first season.\n\nOn November 22, the Lancers took home the State…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697431/congratulating-salpointe-catholic-high-schools-girls-flag-football-team"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…of Georgia immensely proud, and we are  excited to have the Conference USA Football Championship trophy in Cobb  County for the first time.\n\nMr. Speaker, I rise today to congratulate the university leadership,  players, staff, and head coach Jerry Mack on an incredible season and a  hard-fought win. We wish them the best of luck in their upcoming bowl…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697964/congratulating-kennesaw-state-university-football"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise to congratulate a great  seasonal tradition in our home state of Georgia: the Savannah Christmas  Market at Plant Riverside District.\n\nThis year, it was ranked as one of the top holiday…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise today to recognize and congratulate  Laramie, Wyoming's very own Frank Crum for his performance and  touchdown in the Denver Broncos playoff win versus the Buffalo Bills  this past weekend.\n\nAs an offensive…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699338/congratulating-frank-crum"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…emphasis upon discipleship and depth of a believer's walk  with the Lord, and their heart for international missions has shined  like a light throughout the community.\n\nI congratulate and celebrate this anniversary and thank Springs  Community Church for their 40 years of shining God's light in the Fifth  Congressional District.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…this promise.\n\nI also recognize the parents and Scout leaders who supported each  Girl Scout on their path to this milestone. Their support made all the  difference.\n\nI congratulate the Girl Scouts, especially Carolyn. Her investment in  our community is appreciated, and Ohio can't wait to see what is in  store for her next.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690079/congratulating-girl-scouts-of-western-ohio-on-gold-award"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…impacted thousands of students. His dedication to academic  excellence, innovative partnerships, and community service have  advanced the institution's legacy and I want to congratulate Jim on his  remarkable career, thank him for his decades of service to Loras  College, and wish him all the best in this well-deserved retirement.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…her fiance raise beef cattle in Centre County.\n\nMr. Speaker, Bailey should be proud of her accomplishments, and it is  a great example for FFA members in our community. I congratulate Bailey  on receiving the American degree.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699980/recognizing-bailey-little"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to recognize and congratulate  Kyle Welk of Peach Bottom, Pennsylvania, on being named the 2025 Merle  Howard Award winner at the 58th World Dairy Expo in Wisconsin.\n\nHaving grown up on a dairy farm,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696415/congratulating-kyle-welk-on-being-named-the-2025-merle-howard-award-winner"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…our  community, working each day to ensure public safety with compassion and  understanding.\n\nMr. Speaker, I commend the Centre County CIT team for their  dedication and congratulate all 500 graduates for their service to our  community.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693519/recognizing-centre-county-crisis-intervention-team"}]