[{"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…rise tonight to first say thank you to  our co-anchors; only freshmen in this House but certainly seasoned in  the life that they have led. I thank Congressman Figures and  Congresswoman Bynum, and to our Madam Chair of the Congressional Black  Caucus, Congresswoman Yvette Clarke.\n\nMr. Speaker, tonight you will hear many stories of Black history,  which…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…those wars, and  Congress has not yet authorized those wars, nor will it. They will have  to come to Congress for that power.\n\nI am honored to take the baton from former Congresswoman Barbara Lee  in  carrying this legislation forward. I thank the lead across the aisle,  Representative Roy, for getting this past the finish line.\n\nThis bill also includes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Congressional Black Caucus, proudly representing New  York's Ninth Congressional District, which is located in central and  southwest Brooklyn.\n\nI thank my colleague once again, Congresswoman Jennifer McClellan,  for anchoring this Congressional Black Caucus Special Order hour.\n\nI rise tonight, Mr. Speaker, with my colleagues of the Congressional  Black Caucus…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Now, with great pride, I rise today to do something we have waited 50  long days to do--exactly 49 days too long--and that is to introduce our  colleague from Arizona, Congresswoman Adelita Grijalva.\n\nSince September 23, the people of Arizona have been waiting for this  day, and the excuses for the delay have changed seemingly daily. First  they said…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696709/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…(Ms. Brown) to share some words before we  allow members of the Congressional Black Caucus to also speak to the  American people.\n\nMs. KAMLAGER-DOVE. Mr. Speaker, I thank Congresswoman Brown from Ohio  for her remarks.\n\nAs you can see, Congresswoman Brown was breaking it down, she was  keeping it real, and she was bringing the receipts. That is what the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…campaign, where he was known for knocking on  even the most difficult doors.\n\nAndrew later moved to Washington, D.C., where he began his  congressional career in the office of Congresswoman Doris Matsui.  There, he worked his way from Staff Assistant to Legislative  Correspondent to Legislative Assistant.\n\nIn 2019, I was fortunate to have Andrew join my Washington,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the world have  shifted their gaze, but families in Gaza still live under constant  threat: of violence, of the elements, of starvation.\n\nEarlier this year, my colleagues, Congresswoman Pettersen and Senator  Gallego, and I led over 100 Members of Congress in urging the State  Department to immediately surge humanitarian aid and ready-to-feed  infant formula…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Ms. RIVAS. Mr. Speaker, I thank the Congressional Hispanic Caucus,  the Congressional Progressive Caucus, and Congresswoman Ramirez for  organizing today's important conversation on the Trump administration's  cruel and inhumane treatment of immigrant communities.\n\nThis is an important discussion…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697460/fighting-dhs-immigration-raids"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…appropriated.\n\nStansbury), the ranking member of the House Oversight Committee's  Subcommittee on Delivering on Government Efficiency.\n\nMr. MIN. Mr. Speaker, I thank the Congresswoman for her comments. It  has indeed been a messy day. I think that prices are getting too high  at this moment in time. Elon Musk is, I believe, really inflating the  price…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Mr. Speaker, I now yield to the gentlewoman from New York (Ms.  Clarke), chair of the Congressional Black Caucus.\n\nMs. CLARKE of New York. Mr. Speaker, good evening. I am Congresswoman  Yvette D. Clarke, chair of the Congressional Black Caucus for the 119th  session of Congress, and proud Representative of New York's Ninth  Congressional District, located…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I rise today to mark a solemn anniversary.\n\nFifteen years ago today, Congresswoman Gabrielle Giffords was doing  her job, holding a ``Congress on Your Corner'' event at a grocery store  in Tucson, standing outside in the January sunshine, listening to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…staff, Rikki approached every task with the same commitment--to make  life better for the people we serve.\n\nRikki's decade of congressional service began as an intern for  Congresswoman Debbie Dingell, where she was soon hired full time as  constituent relations and press assistant. After two years with  Congresswoman Dingell, Rikki joined now Leader Jeffries…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…the way for future generations to  succeed. I am proud to be the third Vietnamese American ever elected to  Congress, following Congressman Joseph Cao of Louisiana and  Congresswoman Stephanie Murphy of Florida.\n\nI am reminded every day of our strength, our determination, and our  unyielding commitment to preserving our history and to ensuring that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Congressional District with distinction for more  than 4 years.\n\nMarc began his service to the Seventh Congressional District working  for my dear friend and predecessor, former Congresswoman and now  Governor Abigail Spanberger.\n\nHe has continued to deliver results for central and Northern Virginia  on my team with the same professionalism and care. From day…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699632/recognizing-marc-rabourdin"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in strong support of  Congresswoman Radewagen's South Pacific Tuna Treaty Act. I am an  original cosponsor of this bill because we urgently need this update to  U.S. law that will strengthen our national…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Speaker, I thank Congresswoman Houchin for leading  this debate, and I rise in full support of the House budget resolution  as introduced by Chairman Arrington.\n\nWhat our viewers, both in the balcony…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…circle--people working for her--were  personally profiting from this fraud. Omar held at least one event at  one of the restaurants named in the massive fraud scheme. One of  Congresswoman Omar's staffers has already been convicted for his role  in the fraud. It runs very deep. All of this has taken place inside of  Omar's congressional district, and she…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…price. Veterans are sent to emergency rooms while  skilled doctors are waiting to serve patients.\n\nThat is why I introduced this bipartisan legislation with my  colleague, Congresswoman Nikki Budzinski, because we saw a program that  required action. Bureaucratic red tape is the enemy.\n\nThe reports by the inspector general are a testament to what veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…at MD Anderson and Texas  Children's Hospital, but, unfortunately, it was too late. She had to be  put on a ventilator 3 weeks after our summit, and she passed away.\n\nAs Congresswoman Dingell mentioned, we sent videos to her to remind  her of how important she is. In her final moments on this Earth, I  reached out to her and told her that her story would…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, sincere appreciation to the  Congresswoman. I thank her very much. That is a great way to honor  Doug.\n\nMr. MOORE of Utah. Mr. Speaker, to close, I again thank the  gentlewoman from California (Ms. Rivas) for yielding…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698670/protecting-healthcare-for-millions-of-americans"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…donations, I  recently introduced H.R. 5791, the Boosting Lifesaving Operations,  Opening Donation Centers Act, or the BLOOD Centers Act, alongside my  Democratic colleague, Congresswoman Schrier.\n\nThis commonsense, bipartisan legislation would streamline the  bureaucratic burdens of opening a new blood center while still ensuring  oversight and safety in…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699256/national-blood-donor-month"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. WESTERMAN.  276.\n\nMr. Speaker, I rise in support of H.R. 276, sponsored by  Congresswoman Greene of Georgia.\n\nThroughout the history of the United States, the executive branch has  renamed our public lands and waters. This legislation codifies a  portion of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…recognizing him.\n\nMadam Speaker, I rise today in resolute support of H.R. 250, the  Benjamin Franklin statue placement act. Alongside my friend and  colleague from Pennsylvania, Congresswoman Houlahan, I am proud to  advance this effort to enshrine one of America's most extraordinary  minds and consequential patriots in the heart of our Nation's Capitol.\n\nMadam…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…to accomplish great things.\n\nMost importantly, Nicole is a friend to us all, not least of all my  kids, who will always remember her scavenger hunts during their Junior  Congresswoman visits in Washington, D.C. We are grateful for her  service with our team and wish her success as she returns to the Great  State of Iowa, and all the victories Iowa State…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…contaminants.\n\nMr. CRANK.  2389, the bill now under  consideration.\n\nMr. Speaker, I rise in support of H.R. 2389, the Quinault Indian  Nation Land Transfer Act, sponsored by Congresswoman Randall.\n\nH.R. 2389 would place approximately 72 acres of U.S. Forest Service  land, known as Allotment 1157, into trust for the Quinault Indian  Nation.\n\nThe Quinault…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697703/quinault-indian-nation-land-transfer-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise in support of the Department of Energy  and National Science Foundation Interagency Research Act, and I thank  Congresswoman Haley Stevens for working with me on this bipartisan  bill.\n\nThe Department of Energy and the National Science Foundation are  vehicles for some of our nation's cutting-edge…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688988/doe-and-nsf-interagency-research-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…been doing to restore the American Dream.\n\nRecently, Kaley departed the House Committee on Energy and Commerce  to take on a new role as the Communications Director for Congresswoman  Kat Cammack (FL-03). While she will no longer be working for a member  of the Kentucky delegation, I know she will succeed in her new role. I  wish her the best, congratulate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…thrive under that kind of bureaucratic  chokehold. Americans are demanding affordability, and this is a good  step in that direction.\n\nThis bill, championed by my colleague Congresswoman Beth Van Duyne,  finally puts a stop to it. H.R. 2965 requires the Small Business  Administration to report on the regulatory costs imposed by other  Federal agencies on…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…strongly urge my colleagues to vote ``yes''  on this important joint resolution, which will restore off-highway  vehicle access to treasured public lands. I again thank Congresswoman  Maloy for her excellent work and leadership on this effort.\n\nMr. Speaker, I will point out that the idea that passing this  Congressional Review Act would restrict all…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…year in lost revenue from oil and gas alone, including  revenue for school trust lands that is meant for North Dakota  classrooms.\n\nI am pleased to join Senator Cramer and Congresswoman Julie Fedorchak  in introducing this CRA resolution, and I urge my colleagues to support  it and help overturn this overreaching and restrictive plan. By passing  this…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}]