[{"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…portfolios.\n\nIncidents like these break our trust with the American people, with  our constituents. That is why I am so proud to cosponsor Congressman  Magaziner's TRUST in Congress Act. This bill would require Members of  Congress and their immediate family members to divest from individual  stock holdings or place them into a qualified blind trust during…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691213/stock-trading-ban-for-members-of-congress"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "Mr. COSTA. Mr. Speaker, with only 10 voting days left in this year's  calendar, Congress must act if we are to avert a full-blown healthcare  crisis. I rise today to bring attention to the affordability and  healthcare crisis that is pending upon us.\n\nI think this…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…her a lot of credit for getting the ball rolling along with  the next gentleman who I am going to introduce, who has been a  fantastic partner and co-lead on the TRUST in Congress Act. I know that  we are going to get this done, in large part due to his leadership.\n\nMr. MAGAZINER. Mr. Speaker, I thank the gentleman for being a great  partner on this and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Congressional Black Caucus serves. Families, Mr. Speaker, who sit  at the kitchen table late at night wondering which bill they can pay  and which bill must wait.\n\nIf Congress fails to act, 35,000 people in my district will see their  healthcare costs rise. Let me just give you an example. For a 60-year- old couple, earning $85,600, annual premiums will…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Michigan programs lost millions, forcing  layoffs and cuts. Worse, the current budget would slash dedicated CVI  funding even further, jeopardizing these lifesaving efforts.\n\nCongress must act to restore funding and protect proven prevention  strategies.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695493/community-violence-intervention-funding"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…would fix this by requiring an  investigation to continue even if the judge resigns or retires to avoid  accountability. This cannot and should not be a partisan issue.  Congress must act to ensure that credible allegations follow judges  beyond the robe, and that retirement or resignation is not mistaken for  resolution.\n\nI encourage all of my colleagues…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692556/accountability-for-judiciary-investigations"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…funding fix for the World Trade Center  Health Program.\n\nThese heroes who saw us through one of the darkest days in our  Nation's history have spent two decades begging Congress to act. No one  in the 9/11 community should ever have to worry about accessing the  healthcare that they require.\n\nI was outraged to see this funding excluded from the yearlong…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689387/accessing-healthcare-for-first-responders-and-survivors"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…in Gaza and Ukraine, Trump has amassed naval forces off the  coast of Venezuela and could provoke another unauthorized war.\n\nThis administration is out of control and Congress must act.  Republicans can't keep their heads in the sand. They have already  failed to protect core Article I spending authorities, the power to  make appropriations and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…qualified blind trusts, prevent conflicts of interest,  and restore accountability where it is so desperately needed.\n\nMr. Speaker, I am proud to cosponsor the TRUST in Congress Act, and I  thank Representatives Magaziner and Roy for their leadership on this  critical bipartisan legislation. It is a long overdue, commonsense step  toward restoring integrity…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691223/stock-trading-ban-for-members-of-congress"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…United,       Inc. (``HAU''), Venezuelan Association of Massachusetts      (`` VAM''), UndocuBlack Network (``UBN'')--and four       individual TPS holders. Today, LCR urges Congress to act to       preserve humane immigration protections like TPS. Without       those protections, the consequences will be severe, forcing       families into crisis, undermining…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…reflect our values, not  force us to abandon them. We can secure our borders without terrorizing  our neighbors, and I will not support funding that enables cruelty.\n\nCongress must act now to impeach Kristi Noem and rein in ICE.\n\nMr. Speaker, unfortunately, under the Republican rule, we don't have  regular order anymore. We should be debating appropriations…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…people  across this country. They let deadlines pass, premiums rise, and  coverage disappear. That is not leadership. That is failure.\n\nMr. Speaker, the choice is clear. Congress can either act to restore  affordable healthcare or we can continue to let premiums sore, coverage  vanish, and families face financial ruin.\n\nI know one thing is for certain, Mr.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Citizens United has sold out  our democracy and all Americans across the country. It is past time to  end the era when billionaires buy access, buy silence, and buy power.\n\nCongress must act to close the coordination loopholes, rein in the  super-PACs, and restore the simple idea that in America, people, not  money, govern.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699235/restoring-election-integrity"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…going to  need healthcare. They don't know if they are going to be able to pay  for it. We will continue to raise these stories because too many people  are depending on Congress to act. Their lives literally depend on it.\n\nHopefully before December 31, we will find the political will to  extend these tax credits. If we don't, we better come up with a…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…November, the American people soundly rejected the Biden-Harris  administration's disastrous policies. Now, as President Trump moves  swiftly to get our country back on track, Congress must act to roll  back these costly misguided regulations, starting with the Department  of Energy's appliance rule.\n\nI thank Chairman Guthrie, Chairman Griffith, and House leadership…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "French Hill", "party": "Republican", "sentence": "…sanctions and other forms of economic statecraft to communicate firmly  and consistently to large non-European buyers of Russian oil and gas  that the time to act is now.\n\nCongress should act by immediately passing Congressman Zach Nunn's  bipartisan PEACE Act. This proposal would finally kneecap Russia's  energy revenues, which still total some $200 billion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…into the hands of bad  actors.\n\nHowever, when our laws were established, they did not take into  account the ever-changing technology, and so it is imperative that we  as a Congress act with urgency to update our laws and ensure that  China, Russia, Iran, and others do not have access to sensitive  technology remotely. That is why this bill is imperative,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…thousands, then they  will keep coming into our country, burdening the American taxpayer, and  exacerbating the crime in our cities.\n\nThis is why it is so important that this Congress act now with a  budget reconciliation, to give President Trump the tools he needs to  keep both the wallet and the soul of America safe.\n\nBurglars are in the house, and they…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I rise today to call for  Congress to act with urgency to address the alarming news that we have  just heard from Las Vegas of the discovery of yet another illegal,  dangerous biolab run by Chinese nationals.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of legislation  that addressed safety gaps following unimaginable tragedies. Every  aviation accident typically has multiple contributing factors. Too  often, I have seen Congress act prematurely and in a way that fails to  address multilayered causes of accidents in a comprehensive and  consensus-driven manner, in some instances to the detriment of…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…benefit the United States of America. Yet, that is precisely what  has happened.\n\nMr. Speaker, this is now the fourth Congress in a row that I have  introduced the TRUST in Congress Act, now with Mr. Magaziner, and I  think it is long overdue.\n\nIn the 119th Congress, we have 12 Republican cosponsors and 60  Democratic cosponsors. I say to my Republican…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Record of Decision is a rule under the Congressional  Review Act. That opinion, printed in the Congressional Record in  September, triggered the CRA window that allows Congress to act today.\n\nCongress must act because Alaskans have spoken clearly, and they have  spoken loudly.\n\nThe North Slope Inupiat leadership, including the Arctic Slope  Regional…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…may not prohibit a recipient from using the       grant for legal representation for post-conviction relief.       SEC. 5. SENSE OF CONGRESS.\n\nIt is the sense of Congress that--\n\n(1) this Act is a first step to address the changing       tactics of human traffickers, who are using forced       criminality as a form of force, fraud, and coercion in their…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and for future rescission packages.\n\nThis is low-hanging fruit in the eyes of America, but it breaks the  cycle of spending without accountability. It is proof that Congress can  and will act responsibly when it wants to.\n\nWhen the American people put President Trump in office, they demanded  lasting changes to a bloated Federal Government. We must not…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Naval Petroleum Reserves Production Act of 1976, the  approximately 23-million-acre NPR-A was designated by Congress due to  its vast energy resources. In 1980, Congress amended the act and  directed the Secretary of the Interior to conduct ``an expeditious  program of competitive leasing of oil and gas in the National Petroleum  Reserve in Alaska.''…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…End Insider Trading by Members of Congress\n\nMr. KILEY of California. Mr. Speaker, today, I am announcing that I  will be coauthoring H.R. 5106, the Restore Trust in Congress Act, which  is designed to end insider trading by Members of Congress.  Specifically, this bill prohibits all Members of Congress, along with  spouses, dependent children, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Members of Congress  should be able to trade stocks while in office, period. American  taxpayers deserve better.\n\nThat is why I am proud to have helped introduce the TRUST in Congress  Act. This bipartisan bill would prohibit Members of Congress, in  addition to their spouses and children, to trade stocks while in  office.\n\nThis isn't rocket science. This…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691218/stock-trading-ban-for-members-of-congress"}, {"senator": "French Hill", "party": "Republican", "sentence": "…fact, Mr.  Speaker, both President Biden in his Executive Order 14067, and  President Trump in his Executive Order 14178, identified those market  regulatory gaps, asking Congress to act to fill those gaps.\n\nIn 2022, we certainly witnessed consumer harm when the Financial  Services Committee heard unprecedented testimony from an expert called  in to clean…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…innovation, and workforce expansion.\n\nThis natural gas tax threatens to increase costs to       consumers and businesses and undermines economic       competitiveness. We urge Congress to act swiftly in passing       this resolution of disapproval.            Sincerely,                                                Neil L. Bradley,\n\nExecutive Vice President,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]