[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…our friends on the other  side of the aisle are just rubberstamping what this President wants.\n\nWell, it is time for us to stand up. This vote is about reasserting  Congress's constitutional role, article I, section 8, of the  Constitution gives Congress--not the President--the power to impose  tariffs and regulate commerce with foreign nations. We must…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…farmers, for the people of Iowa, and for our country. I  want to thank him for working with me on the introduction of the Trade  Review Act of 2025 that ensures that Congress plays its constitutional  role in making sure that, as our Founding Fathers intended, we set the  duties and regulate foreign commerce.\n\nThis important reassertion of Congress's constitutional…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…don't want Donald Trump sending our  troops into harm's way without so much as a debate in Congress.\n\nToday, the Senate has a chance to move forward on asserting  Congress's constitutional authority on matters of war and peace. We can  tell Donald Trump: Enough with foreign adventures. It is time to focus  on lowering costs here at home. That is what…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…brainstorms ideas for  amicus briefs where Congress' perspective would be especially important  and useful to the courts such as when the Trump administration tramples  upon Congress' constitutional powers by ignoring the will of Congress  as expressed by legislation that directs that a certain thing be done.\n\nWhen Congress passes legislation and that legislation…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress's authority under the Twenty-Third Amendment; and       provides for expedited consideration of the repeal of that       Amendment.\n\nThe Admissions Clause grants Congress constitutional       authority to admit the Commonwealth into the Union. The       starting point for a constitutional analysis of the Act is       the Constitution's Admissions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…products abroad.\n\nThis trade war is making life more expensive, creating uncertainty  and putting good jobs at risk, all while the world continues to move  around us. Congress has constitutional authority over tariffs. We must  use it here and now. Let's lower costs for American families, protect  jobs in San Antonio and across America, and end this reckless…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699976/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress's authority under the Twenty-Third       Amendment; and provides for expedited consideration of the       repeal of that Amendment.\n\nThe Admissions Clause grants Congress constitutional       authority to admit the Commonwealth into the Union. The       starting point for a constitutional analysis of the Act is       the Constitution's Admissions…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…this measure to  rein in President Trump's unlawful boat strikes.\n\nThese strikes and Trump's naval blockade represent appalling  violations of international law and Congress' constitutional authority  to authorize the use of military force.\n\nDrug trafficking is a serious offense. Communities across the United  States have seen the devastating impact of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…H.R. 884, which would repeal a law  duly enacted by the District of Columbia because D.C. should be free to  govern its own local matters.\n\nRepublicans claim that Congress has a constitutional duty to  legislate on local D.C. matters, but this is historically and legally  incorrect. Republicans legislate on local D.C. matters only when they  think they…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…unravelling. Rather than target the real bad actors, the President is  picking fights with our friends. Instead of standing up for their  constituents and defending Congress' constitutional authority over  trade, most Republicans in this Chamber are surrendering it to the  President choosing blind allegiance to him over the people that they  are supposed…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Article II Powers of the Commander in Chief. I think that's right.''\n\nThat is the leader of Congress saying that Article I, Section 8 of  the Constitution, which gives Congress the constitutional authority to  declare war, is a violation of Article II Powers of the President.\n\nThat tells you all you need to know.   Mike Johnson is more loyal to  the President…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Venezuela. We could be stumbling into another open- ended conflict without purpose or plan.\n\nIf the administration intends to escalate toward conflict with  Venezuela, Congress has a constitutional duty to declare and authorize  such action. We cannot sleepwalk into another war through incremental  escalation while being kept in the dark.\n\nTo my Republican…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…say that we worked hard to produce the  bill to affirm U.S. leadership on the world stage, recognizing the  reorganization of the State Department and reasserting Congress'  constitutional power of the purse.\n\nThis bill funds what should be the core missions of the State  Department: diplomacy, development, and humanitarian assistance. It  supports…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress's authority under the Twenty-Third Amendment; and       provides for expedited consideration of the repeal of that       Amendment.\n\nThe Admissions Clause grants Congress constitutional       authority to admit the Commonwealth into the Union. The       starting point for a constitutional analysis of the Act is       the Constitution's Admissions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…consequences. It repeals judges' abilities to dodge mandatory minimums  for youth crimes. Crucially, it blocks the D.C. Council from gutting  sentencing laws, reclaiming Congress' constitutional oversight over  this Federal District, as it should be.\n\nAs President Trump declared in his March 2025 executive order, if  D.C. won't act, we must, restoring order,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695562/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…disapproving the action of the District of Columbia Council in  approving the D.C. Income and Franchise Tax Conformity and Revision  Temporary Amendment Act of 2025.\n\nCongress has the constitutional right to review legislation passed by  the D.C. Council under the D.C. Home Rule Act. It also has the  authority to block such legislation. In this case, it should…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…colleagues to join me in  supporting this legislation.\n\nMr. COMER. Mr. Speaker, I have no further speakers, and I reserve the  balance of my time.\n\nMr. Speaker, Congress has a constitutional duty to ensure the  District of Columbia is safe and secure. I urge my colleagues to  support this critical police reform bill that has the strong support of  the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696934/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…That  might not have happened if we weren't understaffed by about 800  officers in Washington, D.C.\n\nWhen we undermine law enforcement, we embolden the criminals.  Congress has a constitutional duty to ensure the MPD can effectively  combat crime and keep Washingtonians safe. This legislation restores  fairness and support for the men and women who risk…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692303/protecting-our-nations-capital-emergency-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…War Powers  Resolution before the Senate regarding recent U.S. actions related to  Venezuela. This is a serious and consequential matter that goes to the  heart of Congress' constitutional responsibility to authorize sustained  military engagements, define the limits of executive authority, and  protect the long-term interests of both the United States…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…creating a tool ripe for abuse. Even  though the Constitution is clear, this bill restrains the Fed from even  considering a central bank digital currency, reinforces Congress'  constitutional authority over currency, and ensures that any digital  dollar reflects our founding principles.\n\nMr. Speaker, I commend Whip Emmer for his leadership, and I urge…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693733/anti-cbdc-surveillance-state-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…COMER.  Malliotakis).\n\nMr. COMER. Mr. Speaker, may I inquire how much time remains.\n\nMr. Speaker, I remind my colleague on the other side of the aisle,  the U.S. Congress has a constitutional role to oversee Washington,  D.C., law and intervene as necessary.\n\nD.C.'s noncitizen voting law is a dangerous policy. Only American  citizens should be permitted…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692313/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…assault on the  value of American citizenship, and it undermines the voices of lawful  voters.\n\nWorse, it is part of a broader effort by the left to chip away at  Congress' constitutional authority over our Nation's Capital. The  Constitution is clear: Congress has the power to legislate in all cases  whatsoever concerning Washington, D.C. Under the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…until midnight or after.\n\nYet, the events of that day didn't change the serious concerns raised  about the ways six States conducted their elections. Members of  Congress still had a constitutional duty to defend our Nation's  election laws.\n\nI was proud to object to the results in six States and vote not to  certify the results of the two States that came…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698515/standing-for-election-integrity"}]