[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "It is my honor to congratulate Thomas Dempster on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "title": "Recognizing Thomas Dempster", "date": "2025-05-13"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Speaker, I congratulate the 451 graduates of  John Champe High School's class of 2025.", "title": "Congratulating John Champe High School Class of 2025", "date": "2025-06-10"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "It is my honor to congratulate Kloey Kehl on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "title": "Recognizing Kloey Kehl", "date": "2025-06-04"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "I congratulate Kaitlyn on this well-earned accomplishment and wish  her luck as she heads off to college in the fall.", "title": "Recognizing Kaitlyn Anthes", "date": "2025-06-25"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "It is my honor to congratulate Gael Alvarez Acosta on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "title": "Recognizing Gael Alvarez Acosta", "date": "2025-04-28"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "While I am a proud graduate of Cab Calloway, I couldn't help but come  to the well of the House to congratulate the Charter School of  Wilmington.", "title": "United States Postal Service is Not Just A Convenience", "date": "2025-05-06"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "So I congratulate the Dubs.", "title": "Republican Tax Cuts", "date": "2025-05-05"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "President, I rise today to recognize and congratulate  the Boston Passport Agency on its 100th anniversary.", "title": "Recognizing the Boston Passport Agency", "date": null}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Speaker, I rise today to recognize and congratulate  John Michael Spaun, Jr., or J.J.", "title": "Congratulating J.J. Spaun", "date": "2025-06-25"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Speaker, I rise today to congratulate the  Fredericksburg Nationals on winning their first-ever Carolina League  Championship.", "title": "Congratulations to the Fredericksburg Nationals", "date": "2025-04-10"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "It is my honor to congratulate Eamon VanDyke on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "title": "Recognizing Eamon Vandyke", "date": "2025-06-03"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Mr Speaker, I rise today to congratulate Terry Nelson on  his retirement as Co-Chair of the Finishing Trades Institute of the  Upper Midwest (FTIUM), following over four decades of leadership and  advocacy in the labor industry.", "title": "Congratulating Terry Nelson on His Retirement From Ftium", "date": "2025-08-15"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "I congratulate the Valluvan Tamil Academy, and I thank them for all  that they do for our community in Virginia.", "title": "Recognizing Valluvan Tamil Academy's 15th Annual Day Celebration", "date": "2025-06-05"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "It is my honor to congratulate Ibrahim Yousuf on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "title": "Recognizing Ibrahim Yousuf", "date": "2025-05-20"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "I congratulate him on his  retirement.", "title": "Recognizing Ocfa Chief Brian Fennessy", "date": "2025-12-10"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Speaker, I am pleased to recognize and congratulate  Chief Richard Mendez on his retirement as Chief of the Lancaster City  Bureau of Police Chief, and I thank him for his 25 years of dedicated  service to the Lancaster community.", "title": "Congratulating Lancaster City Police Chief Richard Mendez on His Retirement", "date": "2025-11-18"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "I wish her the  best, congratulate her on her new role, and thank Molly Brimmer Lolli  for her service to the House Committee on Energy and Commerce and the  United States Congress.", "title": "Recognizing Molly Brimmer Lolli", "date": "2025-12-17"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Speaker, I rise today to congratulate Kumara  Jayasuriya on his remarkable tenure as the president of Southwest  Minnesota State University.", "title": "Congratulations to President Kumara Jayasuriya on His Retirement", "date": "2025-05-06"}, {"senator": "Julia Letlow", "party": "Republican", "sentence": "Speaker, I rise to congratulate the Louisiana State  University baseball team for taking home their eighth national title.", "title": "Congratulating Lsu Baseball", "date": "2025-06-25"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I rise today to congratulate Lori  Frazier Bearden, a resident of Savannah, Georgia, who will serve as the  Deputy Assistant Secretary for the Employment and Training  Administration, ETA, at the United States Department of Labor.", "title": "Recognizing Deputy Assistant Secretary Lori Frazier Bearden", "date": "2025-04-10"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Speaker, I rise this evening to congratulate  President Trump on a successful first 100 days in office.", "title": "The First 100 Days", "date": "2025-04-30"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "Speaker, I rise today to congratulate the university leadership,  players, staff, and head coach Jerry Mack on an incredible season and a  hard-fought win.", "title": "Congratulating Kennesaw State University Football", "date": "2025-12-11"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I rise to congratulate a great  seasonal tradition in our home state of Georgia: the Savannah Christmas  Market at Plant Riverside District.", "title": "Recognizing the Savannah Christmas Market", "date": "2026-01-07"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Speaker, I rise today to recognize and congratulate  Laramie, Wyoming's very own Frank Crum for his performance and  touchdown in the Denver Broncos playoff win versus the Buffalo Bills  this past weekend.", "title": "Congratulating Frank Crum", "date": "2026-01-22"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Speaker, I rise today to congratulate my friend and  fellow Iowan, Dan Houston, on his retirement from Principal Financial  Group after 41 years of service.", "title": "Congratulating Dan Houston", "date": null}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "I congratulate Reba.", "title": "Recognizing Reba Y. Mazak", "date": "2026-02-09"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Speaker, I rise today to congratulate  University of Florida forward and New Oxford, Pennsylvania, native  Thomas Haugh who helped lead the Florida Gators to a Final Four  victory, clinching their spot in the national championship game.", "title": "Supporting Reversal of California Ev Mandate", "date": "2025-04-07"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "I congratulate Dan on his confirmation.", "title": "Recognizing Dan Driscoll", "date": "2025-02-26"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "It is my honor to congratulate Lee Vent on his recognition as a  Legacy Leader and for his decades of service.", "title": "Recognizing Lee Vent", "date": "2025-07-21"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "I congratulate Chief Ferguson and thank every EMS professional for  their courage, care, and commitment to saving lives.", "title": "Recognizing National Ems Week", "date": "2025-05-21"}]