[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…are using.\n\nThis didn't have to go like this. I remind everybody who is  responsible for supersizing the ICE budget and bringing us to this  place, it was Republicans in Congress who did this, even though we  warned them that this is what would happen.\n\nICE needs to be dismantled. Secretary Noem needs to be fired, and  Stephen Miller has to go. He is the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699663/horrific-ice-abuses"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…our next government funding deadline, it is important that we  look back on how we got to this point and what we can do about it.  Let's look back. On September 30, 1996, Congress did something that no  Congress had done in 30 years: It passed all 12 appropriations bills  before the start of the next fiscal year. One year later, Congress  built on that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…American history, Congress and 40 States have allowed  noncitizens to vote in local, State, and territorial elections,  including the home State of the sponsor of this bill.\n\nCongress did not prohibit noncitizens from voting in Federal  elections until 1996, and today, about 20 municipalities allow  noncitizens to vote in local elections.\n\nI also want to…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…for the  time.\n\nMr. Speaker, to respond to the notion of hypocrisy, that we should  rely on the Secretary of State's notification when required, we were  not notified--the Congress did not receive notification--or asked for  authorization before Americans were sent to fight and to bleed in  Venezuela.\n\nSeven Americans were wounded in that military operation.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699367/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…He refused. However, Virginia, the birthplace of American  democracy, did.\n\nFour years later, President Trump pardoned the individuals who sought  to harm Members of Congress and who did hurt Capitol Police who swear  to keep us safe.\n\nNow, as people exercise their constitutional right to protest,  President Trump has deployed the National Guard and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692516/government-of-the-people-not-of-the-king"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…started the Wear Orange movement in 2015, I have  introduced the Wear Orange Resolution every year to honor Hadiya.\n\nI ran for office because I couldn't stand by and watch as Congress  did nothing as children like Hadiya were ripped away from families.  While gun violence became the leading cause of death for all children  and teenagers in 2020, it has been…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…you because I was there on the floor of  Congress when it happened in 1977. I know there was no debate on this.\n\nAnd so that is what we are talking about right now. The Congress did  not give Jimmy Carter King-like powers--I can guarantee you that--on a  voice vote. But Trump, he thinks he can exercise these emergency powers  and tax any import for…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…standing. We will continue to  improve it every single year. When I consider now the uninsured  enrollment in America is down to 6 percent, it is thanks to the ACA.\n\nIf Congress did not do what we are about to do in the next hour, a  family of four making $130,000 would see their marketplace premium go  from $921 to $1,992. That would be an 18.4 percent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…ability to turn it around. When the Congress passed the IEEPA law  decades ago, it recognized the potential that an Executive can overuse  the emergency power, and that is why Congress did something rare in  IEEPA. They gave the power even to a single Senator, even to a single  Senator in the minority party to say: Wait a minute, Mr. President, you  have declared…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…called Medicaid in  your State. That is how we get to 24 percent of American families on  this particular program.\n\nThe Joint Economic Committee, which is a committee of Congress, did a  study, issued a report, talking about how many people would lose their  healthcare insurance on a State-by-State basis if this $880 billion cut  to Medicaid went through.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…relating to the  anniversary, representations of notable legislative and institutional  milestones, and a message from this Congress to our future colleagues  in the 244th Congress. I did say last year that I hope to be there at  the opening. I am not sure that is possible, but I will do everything I  can.\n\nThis year's celebration of America's anniversary…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Resolution of 1974. What was the problem?\n\nThe problem in 1974 was this: A President began war without telling  Congress. In 1974, we were in the midst of the Vietnam war. Congress  did know that, and Congress had passed some legislation at least  appropriating funds for it and somewhat authorizing it during the  Johnson administration. Congress knew about…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Policies Act, or PURPA, already does that. The law requires States to  have an integrated resource plan that considers reliability. That is  all we need to do, and Congress already did it 33 years ago.\n\nOf course, the only difference between that law and the language in  this bill is the bogus definition about what counts as ``reliable  generation…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…remember voting on the working families tax cut bill. We have looked it  up, and we can't find it. This body has not voted on the working  families tax cut bill this Congress. We did vote on the One Big  Beautiful Bill Act, and I asked myself, why do they keep changing the  name of their legislation?\n\nMr. Speaker, they don't want to say the name of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…time for action is now. Apparently, Putin needs more unified  pressure to convince him that, in fact, jaw-jaw is better than war-war.\n\nLet's not look back with regret that Congress did not act in the face  of Putin's corrupt, catastrophic, and contemptuous regime that laughs  in the face of his European neighbors and our American President.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…on its own merits. But to add insult to injury, Congress passed a  budget just 5 months ago which set a spending cap of almost $6 trillion  for the year. So 5 months ago, Congress did actually pass a budget-- halfway through the year we were already in--to spend $6 trillion this  year. Turns out, though, we have spent $6.6 trillion. So we couldn't  even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…his signature accomplishments, the USMCA.\n\nI am disappointed because Congress gave the President authority to  impose tariffs in the event of a national security crisis. Congress did  not grant this power to pursue petty grudges against trusted neighbors.\n\nHonestly, how can anyone be angry with Canadians? They are the nicest  people in the world. Yet…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…alongside Chairman Bost on this to  ensure survivors have a seat at the table.  I urge my colleagues to support and pass this commonsense legislation  again in the 119th Congress as it did without objection last Congress.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}]