[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…Arkansas, and Bob was born in  Louisiana.\n\nCongratulations to Derrick Rose, who is also actively involved in  community affairs with youth.\n\nI also take the opportunity to congratulate Mr. Jerry Reinsdorf and  the Chicago Bulls and all of these superstars for what they have meant  to America.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699336/congratulating-derrick-rose"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…readiness of the West Covina Fire  Department and made the firefighters and the community a top priority.  That community is safer because of his work.\n\nMr. Speaker, we congratulate Mr. Fountain on an incredible career and  a well-deserved retirement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694967/congratulating-mike-fountain-on-his-retirement"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "Mr. VARGAS. Mr. Speaker, we have giants in San Diego. I rise today to  congratulate one of them, Mr. Tom Fetter, who is being honored as Mr.  San Diego by the San Diego Rotary.\n\nA lifelong San Diegan, Tom was born in 1934 and grew up in Point  Loma. In 1957, he…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695799/recognizing-tom-fetter"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…public safety upgrades, and brought  vibrant programming to the community.\n\nMr. Zaldivar is a respected and revered leader. Our community is  better because of him.\n\nI congratulate Mr. Zaldivar on his well-deserved retirement.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692474/congratulating-enrique-zaldivar-on-his-retirement"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "I congratulate Mr. Knott on his first bill coming to the floor of the  House.\n\nThe administration and ICE say that they are targeting the most  hardened criminals, the worst of the worst,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…President Trump and his family use the White House to haul in  billions of dollars to line their own pockets, people will not be able  to access healthcare.\n\nI congratulate Mr. Buchanan and Mr. Evans on bringing forth this  bill. I certainly agree with them that people do better at home in many  instances and ought to have this as an option.\n\nI look…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…location. I will thank and congratulate Adam Levine, the director  of the museum, and the inspired board of the Toledo Museum of Art. We  give Mr. Levine a salute and congratulate him.\n\nMr. Speaker, I include in the Record a New York Times article titled  ``After 167 Years in New York, a Priceless Coin Collection Heads to  Toledo.''                  [From…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…most junior Member from the great State-- the free State of Florida, I rise today--as well as the proud  granddaughter of a World War II Army veteran--and I rise today to  congratulate Mr. Duane Brewton of Cantonment, FL, on the extraordinary  occasion of his 109th birthday celebrated on February 5, 2026.\n\nMr. Brewton is Florida's oldest living World War…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…investigations.\n\nMr. Brown's leadership and public service have contributed greatly to  safety in our communities and will leave a lasting impact on the United  States of America.\n\nI congratulate Mr. Brown on his well-deserved retirement. I know the  FBI and the American people are forever indebted to him for his work to  keep us safe.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699636/congratulating-paul-brown-on-his-retirement"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate and recognize  Mr. Ethan Albright of Hempfield High School for his achievement of  third place in the `Material Science' category at the 2025 Regeneron  International Science and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693515/recognizing-mr-ethan-albright-for-his-achievement-in-local-and-international-science-fair"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…happiness and fulfillment as he enjoys his retirement, exploring the  Great Smoky Mountains. His contributions to the state will never be  forgotten.\n\nI would like to congratulate Mr. Frank Caskey on his well-deserved  retirement and thank him for his public service.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690777/recognizing-the-retirement-of-frank-caskey"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to honor and congratulate Mr.  Dennis Steiner on his retirement as President and CEO of VisionCorps.\n\nVisionCorps is a non-profit organization that provides  rehabilitative, preventative, educational,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696276/congratulating-visioncorps-president-and-ceo-dennis-steiner-on-his-retirement"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize and  congratulate Mr. Eric Musser, President and Chief Operating Officer of  Corning Incorporated, on the occasion of his well-earned retirement.  For nearly four decades, Mr. Musser has exemplified…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693658/recognizing-eric-musser-on-his-retirement-from-corning-incorporated"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Association, and the Georgia Department of  Natural Resources. His commitment to education and fondness for  learning has made a lasting difference in Savannah.\n\nMr. Speaker, I congratulate Mr. Eswine on a well-earned retirement.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…of  the Board of Directors.\n\nMr. Farabaugh was nominated for this award by Marty Murphy, Executive  Vice President of the Automobile Dealers Association of Indiana. I  congratulate Mr. Farabaugh on this outstanding honor of being named the  2025 TIME Dealer of the Year. I commend him for all his contributions  to the community and wish him and his family's…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Mr. Speaker, please join me in recognizing Steven Folks for his  retirement and thanking him for his dedication and service to our  country and to the City of Anniston. I congratulate Mr. Folks.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688463/recognizing-the-retirement-of-steven-d-folks-sr-as-city-manager-of-anniston-alabama"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to congratulate Mr. Oliver  Royal of Plano, Texas, on achieving the rank of Eagle Scout and his  continued dedication to public service.\n\nOliver is currently a senior at Plano West Senior…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor and congratulate Mr.  Stephen D. Austin, Assistant Chief of Army Reserve, on his retirement  from the U.S. Army Reserve as a Department of the Army Civilian, Senior  Executive Service Tier…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to honor and congratulate Mr.  Leon Ressler on his retirement after 37 years with Penn State Extension  in Lancaster County.\n\nAcross nearly four decades, Leon Ressler has served Penn State  Extension,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692202/congratulating-leon-ressler-on-his-retirement"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Cook's passion and service with a career in technical education  have left an indelible mark on the lives of his students. There is no  question about it.\n\nMr. Speaker, I congratulate Mr. Cook on this well-deserved  recognition.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…pursuits.\n\nIn addition to his outstanding work with PCCA, Mr. Bassani has  previously served on the United States Pharmacopeia Compounding Expert  Committee.\n\nMr. Speaker, I congratulate Mr. Bassani on this exciting achievement,  and I wish him the best in his new role.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to honor and congratulate Mr.  Bill Kepner on his retirement as CEO of United Disabilities Services.\n\nBill Kepner has a storied history with United Disabilities Services,  a nonprofit that helps disabled…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690790/congratulating-bill-kepner-on-his-retirement"}]