[{"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…Trump will exploit, bend, and break any law. The courts have  even said it. That is why this body should leave no ambiguity, no  wiggle room, and no daylight about our congressional intent and  congressional authority. Congress has the sole constitutional right to  declare war, not President Trump or any other President.\n\nYet, we have already seen this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Nevada Land Transfer and Authorization Act  to include the city of North Las Vegas and the Apex Area Industrial  Owners Association as permittees would allow the original congressional  intent of expediting the permitting process to be fulfilled.\n\nH.R. 618 is an extremely simple fix to a complex problem that plagues  Apex and causes major slowdowns at the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691122/apex-area-technical-corrections-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…SNAP benefits       instead of reduced benefits for the month of November.\n\n8. USDA contemplated various factors including the       statutory mandate evidencing clear Congressional intent that       Section 32 funds transferred to FNS be used for Child       Nutrition Programs (see 7 U.S.C. 612c-6(b)(1)), which are a       group of programs that are distinct…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Parliamentarian as oversubmission and undersubmission.\n\nI will read from our presentation.\n\nThere are two ways in which the Executive branch could try       to defeat congressional intent with respect to the scope of       the Congressional Review Act. The first would pose an       undersubmission problem. In this scenario, an Agency might       purposely…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…that we have incorporated some helpful technical  assistance provided by the new administration to ensure the legislation  better executes the letter of the law and congressional intent.\n\nI thank Chairman Mast and Ranking Member Meeks for supporting this  legislation and working together to see that this bill made it to the  floor today. I also thank…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…emissions.\n\nIn addition to the duplicative nature of the fee, API also       contends that the Biden Administration failed to implement it       consistent with congressional intent for several key reasons:\n\nThe Inflation Reduction Act allowed for an exemption from       the fee if (1) the final EPA rule addressing methane       emissions is in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…firearm when there is  no tax.\n\nLast month, on Veterans Day, I led 30 of my House Republican  colleagues in sending a letter to Attorney General Pam Bondi to  reaffirm congressional intent behind the zeroing out of the NFA tax  provision in the One Big Beautiful Bill Act, as well as to urge that  the DOJ adopt this position in all litigation concerning…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Nation while       respecting the needs of Alaska Natives.\n\nDespite that, the 2022 plan ``imposed sweeping restrictions that  curtail responsible development, undermine congressional intent, and  disregard the well-being of the people who depend on these lands for  both subsistence and livelihoods.''\n\nThe letter then goes on to explain how the impacts of…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Policy Act process and issued a Final Coastal Plain Oil  and Gas Leasing Program Environmental Impact Statement, Final EIS, in  September 2019 that closely followed congressional intent. In 2020, the  Bureau of Land Management, BLM, under the first Trump administration,  issued its ``Coastal Plain Oil and Gas Leasing Program Record of  Decision,'' based…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Department of the Treasury works to implement the One Big  Beautiful Bill, I urge agency officials to do so in accordance with the  statute as written and consistent with congressional intent.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…economic  opportunities for local Alaskans and Alaska Natives living within ANWR.\n\nCongress must move to repeal the Biden administration-era ROD that  runs counter to congressional intent and unfairly reduces economic  opportunities in the region.\n\nI thank Representative Begich for his work on H.J. Res. 131 so we can  restore common sense to the management…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…while regulating different source categories, were  promulgated under the same legal authority.\n\nThis application of section 112 of the Clean Air Act runs contrary to  congressional intent. Section 112 of the Clean Air Act was enacted to  protect public health and the environment. It was not enacted to  promulgate costly, unnecessary regulations that do…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692022/hj-res-61"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…disapproval resolution notes that the 2022 IAP put in  place by the Biden administration imposes ``sweeping restrictions that  curtail responsible development, undermine congressional intent, and  disregard the well-being of the people who depend on these lands for  both subsistence and livelihoods'' and ``disregards the economic needs  of North Slope communities,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…needs to be undone by Congress so it is clear to the  bureaucracy that this sort of resource management plan is out of  bounds.\n\nBy passing this resolution, we reassert congressional intent and  remind the bureaucracy: Our boundaries are not optional.\n\nMr. President, this rule will need to be replaced once we repeal it.  Thank goodness Congress had the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Slope Regional Corporation, we have heard that the Biden  administration's 2022 plan imposed ``sweeping restrictions that curtail  responsible development, undermine congressional intent, and disregard  the well-being of the people who depend on these lands for both  subsistence and livelihoods.''\n\nThese communities are located in an area nearly the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…more than a decade. Moreover,  Congress specifically references current Treasury guidance to set that  term's meaning in law. This is a case where both the law and  congressional intent are clear.\n\nThe Department of the Treasury is expected to issue rules and  regulations implementing the agreed upon phase-out of the wind and  solar credits by August…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694587/department-of-the-treasury-nominations"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…utility of vital digital assets in the  next generation of global finance.\n\nFurthermore, Mr. Speaker, I intend to submit additional remarks for  the Record to clarify congressional intent on the effect the bill may  have on the ability to list certain derivative products.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693845/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]