[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…believe we must ban congressional stock trading and why  I am proud to cosponsor this act here in Congress.\n\nThe American people deserve to know that their Members of Congress  are working for them, not for stock portfolios; that their decisions,  their policies, and their priorities are in the public interest and not  the interest of private profit.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691225/stock-trading-ban-for-members-of-congress"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…has been used in the past and has existed in some form since the  1960s. However, given that this administration, with the enabling of a  feckless Republican-led Congress, has been working overtime to hollow  out VA, we must rethink whether or not it is appropriate to continue  its use.\n\nAside from the moral failing of cutting one veterans' benefit…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689677/clear-communication-for-veterans-claims-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Stevens and  Congressman Subramanyam for organizing this on such an important topic.\n\nAs Congress' sole Ph.D. physicist, I spent 25 years of my life,  before coming to Congress, working at the Department of Energy Office  of Science supported laboratory. We were smashing protons and  antiprotons together to make particles that have not been around since…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…healthcare or groceries or electricity.\n\nAnd the sad truth is that we could have worked this out. We could  have done this in the bill passed earlier this year. Congress could be  working right now, even, on working down the cost of insurance premiums  for 24 million Americans. But instead, people are refusing to come to  the table to discuss this…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…Congresses, I  introduced the Senior Security Act to protect vulnerable seniors from  fraudsters who seek to take financial advantage of them. We are  bringing it again this Congress and working very closely with Mrs.  Wagner. I am grateful for her leadership, as well as the chairman's  leadership, and as well as the ranking member who has been very  supportive.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…renewed campaign for DC       autonomy, visit freedcproject.org. For follow up questions or       additional information to inform your votes, contact Free       DC's Congress Working Group Co-chairs, Michelle Chappell and       Jacqueline Johnson.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…upon by the Speaker are not a  win for us. They do not address the challenges that we have worked so  hard to overcome. The Speaker turned his back on moms and dads in  Congress and working families across the country.\n\nCongress is stuck doing things the way that we did hundreds of years  ago, and it is time that we move it into the 21st century.\n\nFor all…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…adversaries. In fact, after DOGE infiltrated the National Labor  Relations Board, suspicious attempts were made to access the data from  an IP address in Russia.\n\nCongress should be working to fulfill our obligations to the American  people and safeguard their data. Instead, my colleagues across the  aisle have seemingly left the door open for DOGE and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690782/protecting-sensitive-data-for-millions-of-americans"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…few of those words because it shows us what  leadership actually looks like, what it sounds like, what it feels like  to have Presidential leadership that we in Congress should aspire to  working with, as opposed to bending the knee to an extreme agenda  reflected in this one big, ugly bill.\n\nPresident Truman said to this Congress in a statement recommending…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…dangerous to expand access to       these devices before creating strong guardrails to ensure       they are not deployed against children.\n\nSandy Hook Promise applauds Congress for working on       bipartisan legislation to reduce the use of lethal force, and       we are eager to       work with you if this bill advances out of Committee. We       encourage…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…purchased professional  artwork to hang in the office.\n\nIn addition to being a talented artist, Kaitlyn recently graduated  from Courtland High School in Spotsylvania.\n\nIn Congress, I am working to strengthen public education so students  like Kaitlyn have access to programs that allow them to pursue their  passions.\n\nI congratulate Kaitlyn on this well-earned…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692977/recognizing-kaitlyn-anthes"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…have to spend all their time fearing the kind of violence that we saw  in Uvalde, Texas, that led to the deaths of so many little children.\n\nThese are things that Congress could be working on right now. This  loophole that will allow more people who should not have a gun because  of their criminal history or their mental health condition will allow…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…legislation to the floor. It is why the administration  and President Trump are speaking out about changes to our housing  situation right here in the United States.\n\nCongress is now working in a bipartisan way to resolve this issue and  bring back housing affordability. In 2025, as a part of the Working  Families Tax Cuts Act, we passed what has been…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Louisianans enrolled in the  National Flood Insurance Program or the NFIP.\n\nI called on Senate Democrats to join me and Republican colleagues in  keeping the government open and Congress working. Unfortunately, the  Senate minority leader shut the government down nearly a month ago to  appease a radical base. That is nearly a month that many people in  Louisiana…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the backbone of our economy  and a sign that the American dream is alive and working.\n\nSmall business is a big deal, and the Trump administration and  Republicans in Congress are working hard to deliver for American small  business owners. One of our top priorities this year is making the 2017  Tax Cuts and Jobs Act permanent.\n\nTCJA did a lot for small…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…in my district where Apple--making the iPhone-- decided to move jobs out of China to Kentucky. Now, as a result of the  President's leadership and this Republican Congress and the working  families tax cut bill, all the Gorilla Glass, as they call it, will be  made for the iPhone and Apple watches at the Corning plant in  Harrodsburg, Kentucky. That…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…and supply chains weakened. Foreign  governments gained leverage over materials our economy and national  defense rely on every single day. That is the damage this Congress is  now working to reverse.\n\nEnergy security has been a core national security concern before.  After the oil crises of the 1970s, Americans learned the hard way what  happens when…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…allowed the Congresswoman to gain additional insights, perspectives,  and ideas to drive her oversight and legislative agenda.\n\nIn July 2014, Mac landed his next role in Congress working for the  Select Committee on Benghazi. He was initially hired to serve as the  Select Committee's Senior Counsel and then moved into the important  role of Security Manager.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…provided by licensed audiologists without  the redtape.\n\nDuring Audiology Awareness Month, Americans should be aware that they  can access hearing aids over the counter, and Congress is working hard  to improve access to those audiology services.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696431/national-audiology-awareness-month"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…This year, we advanced a responsible budget, along with President  Trump, to reflect our well-established goal to return to pre-COVID  spending.\n\nLet's look at more. This Congress, working with the President, has  held spending flat for the last 2 years, and now it is flat through  January. If we honor our commitments, it will be flat through next  September.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…have probably noticed that  things feel a little bit better this year, a little bit smoother, and  much more affordable.\n\nMr. Speaker, that is not luck. That is because Congress is working to  pass President Trump's One Big Beautiful Bill Act, and it is already  making a difference in our summer travel plans.\n\nMr. Speaker, hardworking American families…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}]