[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…am proud to  have called him my friend.\n\nMr. Speaker, I invite my colleagues to join my wife, Vivian, and me,  along with the 765,000 residents of Georgia's Second Congressional  District, in extending our heartfelt condolences to Overseer Roosevelt  Carter's family and the members of First Monumental Faith Ministries.  We celebrate his leadership,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…resources. These resources are being shared throughout West  Michigan, which will have a positive impact on our community for years  to come.\n\nOn behalf of Michigan's 3rd Congressional District, I congratulate  Adelyn Kim for achieving the highest distinction in Girl Scouts, the  Gold Award. I thank Adelyn for her leadership and for making such a  positive,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Drive, and establishment of the Harry S. Truman National  historic site. He would serve in that role for a decade, working on  behalf of the people of Missouri's Fifth Congressional District.\n\nFollowing Representative Wheat's unsuccessful bid for the United  States Senate in 1994, Gerard continued working for the newly elected  U.S. Representative Karen…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…leader, a tireless advocate, and a committed public servant, Mr.  Reginald L. Thomas, who has dedicated his time to improving the lives  of workers in Missouri's Fifth Congressional District and throughout  the state. As Mr. Thomas steps down from his roles as Vice President of  the Missouri AFL-CIO and Business Manager of Laborers Local 264, a  position…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I recognize Caribbean American Heritage  Month, celebrating the culture, contributions, and history of Caribbean  Americans in Michigan's 12th Congressional District and across the  country.\n\nCaribbean American Heritage Month, first recognized in 2005, was  established after years of global efforts to uplift our Caribbean- American…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…on the right side of  righteousness. She is a Member of this Congress who stands for those  who are among the least, the last, and the lost. She hails from the  14th Congressional District in the great State of New York.\n\nOcasio-Cortez).                  The Kirk Resolution and Political Violence\n\nMr. GREEN of Texas. I bid the gentlewoman a good day,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Company provides excellent service and beers, contributing to  Colorado's leadership in producing outstanding craft brews.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate New Terrain Brewing Company for this  award.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694718/recognizing-new-terrain-brewing-company"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…His All-Holiness  Ecumenical Patriarch Bartholomew to the United States to accept the  distinguished Templeton Prize. As the Representative for Rhode Island's  2nd Congressional District, I welcome Ecumenical Patriarch Bartholomew  on behalf of the vibrant Greek Orthodox constituency in my district,  including at the Church of the Annunciation in Cranston,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695494/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…and continued       excellence of this dynamic organization;\n\nNow, therefore be it resolved, that I, Congresswoman       Shontel M. Brown, representing the 11th Congressional       District of Ohio, do hereby recognize and commend the Greater       Cleveland Alumnae Chapter of Delta Sigma Theta Sorority,       Incorporated for a century of distinguished…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…sent me here to do.\n\nMr. Speaker, listening to your constituents should not be  controversial. It is our job. I will keep fighting for what the people  of Ohio's 13th Congressional District made clear when they sent me here  because this Congress does not belong to party leaders or special  interests. It belongs to the people.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…character, and the oath he kept until the end. Officer Riveros' legacy  as a hero will live on in the hearts and minds of the Baldwin Park  community and the 31st Congressional District.\n\nThis devastating event also claimed the life of Darius Wong, a  resident of Hacienda Heights and a beloved son, brother, husband, and  father.\n\nBoth of these men…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…and this country  healthier. As we are in this time in need of better healthcare, I thank  them for understanding the healthcare needs of the citizens of the  Third Congressional District.\n\nIt is, Mr. Speaker, the only IV maternity care hospital in central  Ohio. It includes 16 labor and delivery rooms and 51 NICU rooms. It is  in partnership with Nationwide…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698915/congratulating-dr-john-j-warner"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…servant, and I want to  acknowledge the profound positive impact she has had on community  health in her community.\n\nOn behalf of my constituents in New Hampshire's 1st Congressional  District, I thank Tess Kuenning for her selflessness and dedication to  the patients she serves. Her dedication to advocating for community  health centers has improved healthcare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…in New Jersey is served under IDEA.  Without this support, almost a quarter-million students would be denied  an adequate education.\n\nMy district, New Jersey's 10th Congressional District, receives $98  million in title I and special education grants. How will our schools  support these students without these funds?\n\nAs a former education administrator,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…better. Our children  deserve better.                           Honoring Matthew Fisher\n\nMs. TLAIB. Mr. Speaker, I rise to honor one of our dear neighbors in  the 12th Congressional District. We worked over 3 years to present  Matthew Fisher, a remarkable resident of my district, with the Purple  Heart for his dedication and service to our country.\n\nMatthew…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…for legislation,  meetings, and defense events. Her expertise has been crucial in  crafting legislation that directly benefits our servicemembers in  Oklahoma's Fifth Congressional District. Her hard work in my office and  service to our Nation are applaudable.\n\nMr. Speaker, I will miss Simona, not only for what she has brought to  us legislatively but…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698207/recognizing-simona-elvin"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…with great honor and respect that I present  retired USA Lieutenant Colonel William (Bill) Patterson Matthews with a  Congressional Veteran Commendation from the 17th Congressional District  of Texas.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…they are feeling upset, and  she also passed out brochures that she designed with resources on how  to seek professional help if they need it.\n\nOn behalf of the 2nd Congressional District of Nevada,  congratulations to Faith McCrea for achieving the highest distinction  in Girl Scouts, the Gold Award. We thank Faith for her leadership and  for making…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…unwavering  dedication of Robert Anthony Longo, a proud veteran of the United  States Air Force and our esteemed Veteran of the Month for April 2025  from Michigan's 9th Congressional District. His lifelong commitment to  duty, both in uniform and beyond, exemplifies the highest ideals of  service, sacrifice, and community.\n\nRobert Longo answered the call…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…proud of Madison's accomplishments, and we are happy  to call her one of our own. I look forward to seeing how she continues  to create positive change in Ohio's Second Congressional District.\n\nMr. Speaker, I also recognize Madison's grandmother and her  Scoutmaster, Ryan Pelliter, for their role in this process. Without  them, this achievement would not…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…student-athletes, coaches,  families, and the entire Benedictine community for their remarkable  accomplishment and for the pride that they have brought to Virginia's  Fifth Congressional District and the entire Commonwealth.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696974/recognizing-benedictine-college-preparatory-school-football-team"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…3,200-meter  run at the PIAA track and field championship on May 24.\n\nThe 2025 PIAA Class 3A track and field championship saw students from  across Pennsylvania's 11th Congressional District excel, but it was  Manheim Township senior Adam Kingston who took home the gold. Kingston  maintained the lead for the entire 3,200-meter race and crossed the  finish…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691936/congratulating-adam-kingston-gold-medal-runner"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…FONG. Madam Chair, I rise today in support of my amendments 390,  737, and 745, which would deliver vital resources to the military  installations of California's 20th Congressional District, their  personnel, and surrounding communities.\n\nThese critical provisions would ensure our servicemembers and their  civilian counterparts have the resources they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695160/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District. The young women of the  Tiffin Calvert Catholic High School girls volleyball team have  represented their school ably on their way to achieving the Division  VII State…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697947/recognizing-the-tiffin-calvert-catholic-high-school-on-winning-the-division-vii-state-girls-volleyball-championship"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "Mr. JORDAN. Mr. Speaker, I rise today to share positive news about  young people from Ohio's 4th Congressional District. Today, I am  pleased to commend to the House twelve high school students who are  being honored for their outstanding leadership skills and volunteerism.\n\nOn February…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699533/recognizing-the-lima-noon-optimist-clubs-annual-youth-appreciation-luncheon"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school football  team in Ohio's 5th Congressional District. The young men of the St.  Henry High School football team have represented their school ably on  their way to achieving the Division VII State Football Title. In their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697924/recognizing-st-henry-high-school-on-winning-the-division-vii-state-football-championship"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…only transformed Lamar State College  Orange but has paved the way for future generations to pursue the  American Dream right here in Texas.\n\nOn behalf of Texas' 14th Congressional District and this great  Nation, I want to thank Dr. Johnson for his service and dedication. His  hard work and vision set an example for all leaders.\n\nI congratulate Dr. Johnson…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…6, these two incredible institutions will meet  on the gridiron for the very first time. Both schools call Troup County  home, right in the heart of Georgia's Third Congressional District and  less than 1 hour away from Hartsfield-Jackson Atlanta International  Airport.\n\nFounded in 1831, LaGrange College is the oldest private college in  Georgia, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694895/recognizing-lagrange-college-panthers-and-the-point-university-skyhawks"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…families tax cuts bill with lots  of help for people on Main Street in Abingdon, Virginia, and Marion,  Virginia.\n\nIn every small town that I represent in the Ninth Congressional  District, those businesses are benefiting from what we did because we  made major adjustments for taxes that would have burdened our small  businesses and made it more expensive…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…duty and responsibility to protect and support our Nation's veterans.\n\nBack in 2023, it was my distinct pleasure to have Commander Taylor  Burks of Missouri's Fourth Congressional District testify at a Small  Business Committee hearing on veteran entrepreneurship. He is now  serving a deployment in the Indo-PACOM, so we wish him well.\n\nWe learned not…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687888/successful-entrepreneurship-for-reservists-and-veterans-act"}]