[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Representative Bonnie Watson Coleman. We both are  here because of the path that leaders like Shirley Chisholm blazed  before us.\n\nWith the highest ever membership to the Congressional Black Caucus,  62 members strong, we have never been stronger. We represent the dreams  of our ancestors, and those dreams are in danger by this  administration's hateful policies…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…from California, my  colleague from Ohio, and the previous speakers. It is an honor to be  here, not just as a Member of Congress, but to be here as a member of  the Congressional Black Caucus, especially at a time like this.\n\nI rise today not just with concern, but with alarm. In his first 100  days back in the White House, Donald Trump has unleashed a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I am so honored and privileged to be here  tonight to speak on the Congressional Black Caucus, with our Special  Order hour tonight specific to honoring Black History Month.\n\nMr. Speaker, I am pleased to join tonight's Special Order hour  honoring Black History…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…CBC have an opportunity to  speak directly to the American people on voting rights, specifically  fighting voter suppression, an issue of great importance to the  Congressional Black Caucus, Congress, the constituents we represent,  and all Americans.\n\nMr. Speaker, the U.S. Constitution created a government by, of, and  for We the People. As a child,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, it is with great honor that I rise today  for the third week in a row to anchor the Congressional Black Caucus'  Special Order hour to tell stories of people who stand to lose their  health insurance if Congress does not act in 22 days.\n\nMr. Speaker, 22 days. We have 22 days…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I am grateful to be here to co- anchor this Congressional Black Caucus Special Order hour for the month  of June. I thank my esteemed colleague and dear friend, Congresswoman  Jennifer McClellan, a Democrat from Virginia's Fourth District,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Mr. HORSFORD. Mr. Speaker, I thank my colleague from the Commonwealth  of Virginia for yielding and to the chair of the Congressional Black  Caucus, Congresswoman Clarke, and all of our colleagues for the work  that we do every single day to live out the legacy of Dr. Martin Luther  King, Jr.\n\nMr. Speaker, I…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699199/building-a-beloved-community"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Mr. OLSZEWSKI. Mr. Speaker, I thank my colleagues of the  Congressional Black Caucus for their remarks on an issue that is  pressing and timely for all of us. I really appreciate the ways in  which so many of you have lifted your voices on the scourge…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, it is with great honor that I rise  today to co-anchor this Congressional Black Caucus Special Order hour,  along with my distinguished colleague from the great State of Ohio,  Representative Shontel Brown, who hopefully will be joining us.\n\nAlong with…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…hold.\n\nThey are trying to bury us, but what they don't realize is that we  are seeds and still we rise. I stand here a proud Black woman and a  proud member of the Congressional Black Caucus, and I refuse to stand  by while this administration tries to turn back the hands of time. We  will resist. We will continue speaking truth to power, and we will…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Congress  took demands that we protect the American people. Yet, every day that  we delay, lives are lost.\n\nI urge my Republican colleagues to join House Democrats, the  Congressional Black Caucus, and the House Gun Violence Prevention Task  Force in advancing meaningful, commonsense reforms that will save  lives, reduce violence, and protect all Americans.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691750/national-gun-violence-awareness-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…to me and for putting this together. I appreciate the fact  that she took the leadership and initiative to bring this forward. I  also thank my colleagues in the Congressional Black Caucus, as well,  for taking a stand on this issue and the House Democratic Caucus  overall.\n\nThis is the issue that we fought about with respect to the government  shutdown.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…are putting undue burdens on the American people. I  thank my colleague Representative Jennifer McClellan for consistently  continuing to elevate the voices of the Congressional Black Caucus  members as we talk about the stories of our communities and the stories  of our people and those who we represent, highlighting the needs of  those in our Nation…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…dealing with the feelings of exhaustion and  hopelessness, we cannot grow complacent. We cannot succumb to the  forces of fear, hatred, and bigotry.\n\nThe work the Congressional Black Caucus and House Democrats are  taking up just reinforces our resistance to the division that we are  living and seeing at this very moment. Together, we are using every…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I want to thank my colleagues in  the Congressional Black Caucus (CBC) for organizing this Special Order.\n\nAs we get ready for Thanksgiving, families across our Nation are  coming together. It's a time to celebrate and express…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}]