[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…First Family; the use of government power and  position for corruption and self-enrichment.\n\nAnother powerful sign of a democracy in decline is the usurpation of  Congress's power of the purse, the illegal withholding of funding, the  impoundment of funding, the illegal rescission of funding, the illegal  termination of grants, and, I would say beyond…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and Human  Services would be unable to issue new grants, jeopardizing access to  early education for countless children across this country.\n\nInstead of reclaiming Congress' power of the purse, we would concede  even more discretion to Russ Vought and the White House to abuse the  budget process for their own partisan gain, which they would certainly…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…fails to address the crisis of affordability. It  fails to keep our promise to veterans. It provides a million-dollar  jackpot to eight Senators. It fails to protect Congress' power of the  purse. I encourage my colleagues to vote ``no.''\n\nMr. Speaker, I have the honor of yielding 1 minute to the gentleman  from New York (Mr. Jeffries), our distinguished…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the perseverance of my colleagues, Ranking Members DeLauro,  Hoyer, and Frankel, the legislation before us protects funding for  Democratic priorities, reasserts Congress's power of the purse, and  rejects Republicans' poison pill riders.\n\nThe fiscal year 2026 National Security, Department of State, and  Related Programs Appropriations bill upholds U.S.…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…grave blow to the rule of law and defies  congressional authority.\n\nJustice Sotomayor's dissent warns that the Court is enabling the  executive branch to undermine Congress' power of the purse, and she is  absolutely right.\n\nPerhaps the Republicans in the House and in the Senate and the White  House do not understand that nothing brings more money to the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693631/layoffs-at-the-department-of-education"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…issue that protects all of us from  an overbearing Executive. In fact, it is the defender of our freedom;  third, stiff-arming the courts; and, fourth, seizing Congress's power  of the purse.\n\nAnd then just this week, it was reported that Trump will limit  intelligence sharing with Congress, another brazen attempt to  centralize powers in the executive…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…just passed, which fund  95 percent of the remaining Federal budget. From the start of this  process, I made clear we needed to tear up Trump's budget and reassert  Congress' power of the purse to make the voices of our constituents  heard.\n\nThese are not the bills I would write on my own. There is much more I  would want to do to rein in Trump, and there…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, I rise today to remind my colleagues that  Congress and only Congress has the power of the purse. Yet, Donald  Trump and Elon Musk have unlawfully impounded billions of dollars of  congressionally approved funds. They have illegally slashed funding for…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691297/stand-up-for-the-rule-of-law"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Articles in H. Res. 353 are as follows:\n\n1. Obstruction of justice and abuse of executive powers. Trump denied  due process and defied Federal court orders.\n\n2. Seizing Congress' power of the purse. He froze funds and  dismantled agencies without congressional approval.\n\n3. Abuse of trade powers and international aggression. His reckless  tariffs hurt American…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…led by my friend, Chairman  Cole, and the subcommittee chairs,   David Joyce and Mario Diaz-Balart.\n\nThese two bills are a continuation of our efforts to reassert  Congress' power of the purse, reject $163 billion in cuts proposed by  the Trump administration, constrain the White House's abuse of the  budget process, and protect Democratic priorities at…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and from  communities in every part of the country.\n\nAs the courts have repeatedly concluded, this administration's  disregard for our Nation's spending laws and Congress' power of the  purse has harmed every corner of our country. Children in elementary  schools have been denied resources they need to succeed. Farmers in  rural communities have been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…capacity through the use of data  science, artificial intelligence, and other emerging technologies.\n\nThroughout his career, Gene has been a steadfast defender of  Congress' power of the purse. His work has been especially important to  the Budget Committee, including oversight of Impoundment Control Act  reviews. He also directed the first-ever audit…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…where the money is going to go. Well, that power of  the checkbook--that power of the purse, as it is called--lands on this  side of the White House and the Congress. We have the power of the  purse. Why is that? Because we represent our constituents from across  the country--I, from Washington State; you, from Oregon. People from  Illinois and Alabama…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…of  force and use warrants.\n\nMr. HOYER. Mr. Speaker, throughout this year's appropriations  process, we have seen Donald Trump and Russell Vought trample on this  Congress' power of the purse. Some will admit that. Some will say it  silently.\n\nIf there were ever a time for this Congress to exercise that power,  it is now. Let us pass five bills on which…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…It is time to end Trump's illegal tariffs on Canada, his tariffs on  United States' biggest trading partner, Mexico, and the so-called  liberation day tariffs. Congress has the power of the purse, not the  President. It is time that we take our power back from an executive who  is out of control.\n\nTrump's tariffs have been a massive tax on the American…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699973/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…seize foreign resources and direct  spending from pillaged accounts without congressional authorization,  then people no longer have a voice in their government, and Congress'  power of the purse becomes moot.\n\nIf the executive believes war is justified, then let Congress declare  it. If the executive believes foreign assets may be seized, spent, and  appropriated,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…written on. It was an effort by the  Congress back then to limit President Nixon's involvement in the  Vietnam war.\n\nThe way you do that constitutionally is that Congress has the power  of the purse. If we don't like what a President is doing in terms of  military engagement, we can stop the funding for that engagement.\n\nJust think of the chaos that would…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}]