[{"senator": "Al Green", "party": "Democrat", "sentence": "…are still in the countdown to  impeachment. This is one of the remedies that we have. It is probably  the only one that we have currently that we can impose upon the  Congress for a vote; it is impeachment.\n\nThe other remedy is one that belongs to this country and has been  here since, probably, before the arrival of the pilgrims at Plymouth  Rock; the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…balances.\n\nTrump is imprisoning these people under the Alien Enemies Act. He is  using a war power. We are not at war. Everyone here should know that.  After all, Congress--we--have to vote to declare war.\n\nI remember every war vote we have taken in my time here in Congress,  and I can tell you there has never been a vote on this so-called war  Trump…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I thank Ranking Member DeLauro for yielding.\n\nMr. Speaker, Congress should vote today for affordable health  insurance for Americans and reduce its rising costs. Instead, in the  dead of night, eight Senate Republicans slipped into this bill a payola…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696730/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…imminent. A vote takes place with this grand jury  that I called to your attention, which would be the Members of  Congress. We need but only a majority of the Members of Congress to  vote in favor of impeachment, and a President can be removed from  office. An authoritarian President can be removed from office.\n\nIf you don't like authoritarianism and you…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C.'s local legislature votes, residents can vote  them out of office or pass a ballot measure. That is called democracy.\n\nIf D.C. residents do not like how the Members of Congress vote on  local D.C. matters, residents cannot vote them out of office. That is  the antithesis of democracy.\n\nMr. Speaker, I include in the Record letters opposing this bill…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Substituting the will of District voters and the duly elected       D.C. Council for that of federal politicians is, simply put,       un-democratic. Even if members of Congress might vote       differently on similar local issues for their own       jurisdictions, the residents of D.C. deserve to have our       local laws respected without interference…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…using Rules  Committee Resolutions, consummated by majority votes of the whole  House, to declare that `a day is not a day' in order to AVOID THE U.S.  LAW that requires Congress to vote.'' These are Republican Members of  Congress,  Tom Massie,   Don Bacon, all saying what we know to be true,  which is that the House is abdicating its duty.\n\nI would encourage…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…but it is a fundamental betrayal of the people, incompetence  and indifference to the suffering of our neighbors, the shame and the  sham of it all.\n\nAny Member of Congress who would vote to deny a child a meal or  medication, it is child abuse and neglect. I ought to file a 51A on  Republicans for that. Every person in this Chamber and every person…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696696/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…should do a good job kicking the tires, as Congress, before  we go into a war and not get lied into a war. Instead, what I fear,  since there has been no willingness of Congress to vote on any war  since 2002, is what Members of this body have decided is, Wow, we got  it wrong. We were lied into a war. We voted in a way that we regretted  so let's not…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…saying.\n\nGerald Ford got it right, the President. He got it right. He said-- and I am paraphrasing; these are not his exact words--impeachment is  whatever a given Congress, whenever they vote--218, a majority vote of  a given Congress--whenever a given Congress will vote in the majority  for Articles of Impeachment on a given date, that will be an impeached…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…using Rules Committee Resolutions,  consummated by majority vote of the whole House, to declare that `a day  is not a day' in order to avoid the U.S. law that requires Congress to  vote.''\n\nBy the way, those aren't my words. That is a tweet from a Republican  House Member who just simply told the truth.\n\nLet me be clear: A vote for this rule is a vote…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689861/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…guarantee you. No one has ever regretted--no one has ever regretted--a  vote that just says: Mr. President, before you send our sons and  daughters to war, come to Congress. That is a vote that no one has ever  regretted, and no one will ever regret.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698691/venezuela"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…H.R.       2312, Tipped Employee Protection Act; and H.R. 2262,       Flexibility for Workers Education Act be brought to the       floor, we strongly urge all Members of Congress to vote No.\n\nWith any questions, please reach out to Charlotte Dodge,       National Employment Law Project; Sam Sanders, Economic Policy       Institute or Michelle Feit, National…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…spending $2 million on sex  changes in Guatemala, thousands on an LGBT opera in Colombia, and  thousands on a trans comic book in Peru. This is the low-hanging fruit.  If Congress can't vote to cut this egregious, crazy, leftwing lunacy,  will Congress ever have the courage to tackle entitlements?\n\nYet there does remain a significant constitutional question…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688899/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…important these  numbers are.\n\nDo you see the blue portion of that chart, Mr. Speaker? That is  discretionary. That is all you and I get to vote on. As Members of  Congress, we only vote on the discretionary portion, and this was a  2025 chart. Today, it is  probably only 25 percent, not 26 percent, of the total spending. Every  dime of that is borrowed.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…dime of it is borrowed. Please, anyone who cares, get  this in your head: Every dime--other than some of the things in the  reconciliation budget, every dime a Member of Congress will vote on,  many for their entire careers, is borrowed money.\n\nMr. Speaker, you see this 26 percent that is in blue, that is defense  and nondefense discretionary.\n\nThis year…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…denigrates the 77 million Americans who voted for President Trump.\n\nTo my friends watching at home who support bitcoin and  cryptocurrency: Make no mistake. Members of Congress who vote against  the rule today are voting against the most important legislation for  the cryptocurrency industry in history.\n\nI beseech my colleagues who appreciate, support,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…would continue to help thousands of other children.  I wanted her to know that her impact would outlive all of us.\n\nMr. Speaker, today, in her honor, the United States Congress will  vote on the Mikaela Naylon Give Kids a Chance Act.\n\nMr. Speaker, 16 years ago, I founded the Childhood Cancer Caucus  because I saw that children with cancer did not have…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Nation's  borrowing, is only a couple of days of borrowing. How do I help people  understand the perspective of the scale and the fact that everything  that we as Members of Congress vote on is borrowed?\n\nIf you told me today that I have to balance the budget, I can do it.  Every part of government has to be shut down--no Park Service, no  Congress, no EPA,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…us tomorrow when the reins of power change  hands. That is precisely why our loyalty must be to the Constitution  and not to any party.\n\nIf our country wants war, then Congress must vote on it. We are the  voice of the people. There is a reason so many of our offices bear a  Prisoner of War/Missing in Action Flag. It is a solemn reminder of the  human…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are 18 States that have a higher  credit rating than the United States Government right now? Eighteen  States have a higher credit rating, yet every dime a Member of Congress  will vote on, every dime of discretionary, nondefense discretionary, as  we call it, is borrowed money. Every dime of defense is borrowed money.\n\nAbout $400 billion, I believe,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…prescribes law and policy.\n\nThis decision is in line with previous GAO decisions on similar land  management plans and RMPs, several of which this body has passed in the  119th Congress.\n\nA vote today for H.J. Res. 130 has many positive implications.\n\nFirst, it would overturn this harmful plan and revert to the 2015  RMP, thereby protecting access to 481,000…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]