[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Abdullahi's hard work, determination, and  perseverance at Jefferson Jr./Sr. High School and is clearly just the  beginning of a bright and promising future.\n\nIt is my honor to congratulate Abdullahi Ali on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690274/recognizing-abdullahi-ali"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…testament to Jackson's hard work, determination, and perseverance  at Drake Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Jackson Rogers on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689986/recognizing-jackson-rogers"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…compassion, the kind that strengthens communities,  especially when families are stretched thin.\n\nToday and every day, Delaware is better because of Frank Coverdale.\n\nI congratulate Fresh on his years of service, and of course, Go  Birds.                     Celebrating Delaware Reading Assist\n\nMs. McBRIDE. Mr. Speaker, I rise today to celebrate Delaware…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to Indio's hard work, determination, and perseverance at  Mandalay Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Indio Porter on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691510/recognizing-indio-porter"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the author of H.R. 4446 and who serves on our Health  Subcommittee and our Disability Assistance and Memorial Affairs  Subcommittee.\n\nMr. TAKANO. Madam Speaker, I want to congratulate my good friend from  the State of Oregon on what will become the passage of her first bill.\n\nMadam Speaker, I have no further speakers. In closing, I ask my  colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Noah's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Noah Trask on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691078/recognizing-noah-trask"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Authority Board. In addition, a special recognition will be given to  Park Authority volunteers, who play an integral role in the agency's  success.\n\nIt is my honor to congratulate all the recipients of the Elly Doyle  Park Service Awards and to include in the Record the names of the  following individuals:\n\nElly Doyle Special Recognition: Cynthia…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…incredible basketball game last night and brought them to  victory over the Rockets out of Texas and are going to advance onto the  next round of the basketball playoffs. So I congratulate the Dubs.\n\nSadly, that is where the good news ends. What we are going to talk  about for the rest of this evening is some bad news, bad for the  American people.\n\nThe Republican…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to congratulate Lieutenant  Colonel Chaplain Reverend Dr. A'Shellarien Addison on her recent  promotion at the Delaware Army National Guard.\n\nEarlier this month, I was honored to attend…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to Devonte's hard work, determination, and perseverance  at Oberon Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Devonte Bonggas-Ellenburg on achieving  the Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691185/recognizing-devonte-bonggas-ellenburg"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise to congratulate Edie Brooks on being  named Teacher of the Year by the Virginia Business Educators  Association.\n\nEdie is a business and IT career education teacher at Post Oak Middle…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to Jayden's hard work, determination, and perseverance  at Arvada West High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Jayden DeGroot on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689669/recognizing-jayden-degroot"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, I rise today to congratulate Ann Bailey on  her retirement as President of DARTS. Ann began her Journey with DARTS  years before becoming President. When her father was diagnosed with  Alzheimer's Disease,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…testament to Parker's hard work, determination, and perseverance  at Three Creeks K-8 and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Parker Wells on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691947/recognizing-parker-wells"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to Christelle's hard work, determination, and  perseverance at Arvada High School and is clearly just the beginning of  a bright and promising future.\n\nIt is my honor to congratulate Christelle Kumeso on achieving the  Arvada Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689494/recognizing-christelle-kumeso"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I would like to take this  opportunity to congratulate and recognize the Rotary Club of Lincoln on  their centennial anniversary.\n\nThe Rotary Club of Lincoln began meeting one hundred years ago in  1925 and, since then, have…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize the Rochester  Area  Chamber of Commerce and congratulate the organization on celebrating  160 years of support for local businesses and economic growth.\n\nSince 1866, the Rochester Area Chamber of Commerce has been a strong  advocate…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700187/recognizing-the-rochester-area-chamber-of-commerce-on-160-years"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "Mr. LOUDERMILK. Mr. Speaker, I rise today to recognize an incredible  individual who is a true pillar of the community, Mrs. Pam Younker, and  congratulate her on her retirement from Children's Healthcare of  Atlanta.\n\nThe daughter of a United States Marine, Pam is a longtime advocate  for our military, as well as our local…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691682/recognizing-pam-younker-on-her-retirement"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate my constituent,  Tyrone Miller, upon his acceptance to the United States Military  Academy at West Point.\n\nAs a future cadet, he will be joining the ranks of the world's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692755/congratulating-tyrone-miller"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…including the Outstanding Alumnus Award from the  College of Agricultural and Environmental Sciences and recognition as  the 2025 Milken Educator of the Year.\n\nMr. Speaker, I congratulate Rachel on her well-deserved recognition  as Georgia Teacher of the Year.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692403/recognizing-rachel-kinsaul"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today to congratulate the Catalina  Foothills High School boys' swim team for winning the D2 State  championship.\n\nThe Falcons finished with a total score of 386, with senior Connor  Daggett…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699071/catalina-foothills-high-school-boys-swim-team-wins-d2-state-championship"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Year,'' Stephanie will serve as  an ambassador to schools, an ambassador to higher education, and an  ambassador to various communities across the State.\n\nI would like to congratulate Stephanie, again, and thank her for her  service to our State. Iowans can be very proud that teachers like  Stephanie call our State their home.\n\nI visit about 10 to 12…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697231/2026-iowa-teacher-of-the-year"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…68  bipartisan votes in the Senate. I appreciate those Senators. They  demonstrated an awareness of the needs of a modern financial sector  here in the United States. I congratulate Chairman Hill and Chairman  Steil and thank them for their work on the stablecoin legislation.\n\nThe GENIUS Act represents an important step for this Congress in  establishing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693845/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I rise today to congratulate the United  States military on their successful bombing of the three nuclear  facilities in Iran over the weekend.\n\nImagine flying 37 hours in a B-2 bomber to defang a nuclear…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692889/congratulating-the-united-states-military"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate several military academy appointments.\n\nLucas Gaston of Brookville, Pennsylvania, has recently accepted a  fully qualified appointment to the United States Military Academy…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…is disgusting--not by the far left. They  have been intimidated by people in our own party.\n\nFor what?\n\nIt is for seeking justice for these victims.\n\nSo my hat is off. I congratulate them for standing strong.\n\nI have always wondered: Where were the Republican men during this  battle?\n\nWe have taken 5 months. These three women and I have had to drag our…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor and congratulate Mr.  Stephen D. Austin, Assistant Chief of Army Reserve, on his retirement  from the U.S. Army Reserve as a Department of the Army Civilian, Senior  Executive Service Tier…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…14th Congressional District and this great  Nation, I want to thank Dr. Johnson for his service and dedication. His  hard work and vision set an example for all leaders.\n\nI congratulate Dr. Johnson on his well-earned retirement. May it  bring him the rest and reward he so richly deserves.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…possible when local  organizations and volunteers work together to lift others.\n\nI thank Senior Citizens, Inc., Meals on Wheels, and Chef Bailey for  their initiative and congratulate them on the anniversary of this most  important service.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692062/meals-on-wheels-65th-anniversary"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…fortunate teens. His compassion and dedication will have a positive  impact on our community for years to come.\n\nOn behalf of the 17th Congressional District of Florida, I  congratulate Wyatt Dickinson for achieving the highest distinction in  Scouting, the rank of Eagle Scout. We thank Wyatt for his leadership  and making such a positive, lasting change…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}]