[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…must release K-12 funding and allow the Department  of Education to continue their work. Our students deserve better than  this waste and red tape.                       Congratulating Madison Whitbeck\n\nMr. SUBRAMANYAM. Mr. Speaker, congratulations to former Ms. Loudoun  County, now Ms. Virginia, Madison Whitbeck.\n\nMadison is a proud graduate of Riverside…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Harold Leff, who is recognized for his 33  years of dedicated and tireless service to The Fairfax County Athletic  Council.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  recipients of the 2025 Stephen A. McLaughlin Fairfax County Champions  of Character Awards and commend them for their exemplary sportsmanshipp  character, and values,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Automotive, and the Scott A. & Phyllis P.       Crabtree Family Foundation.\n\nChairman's Choice Award: Ken Quincy and Aimee Vosper.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  year's awardees. Fairfax County is regarded as one of the best places  in the country in which to live, work, and raise a family, and our  nationally recognized park…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…dedication,  talent, and teamwork that goes into earning a State championship title.\n\nOn behalf of Alabama's Seventh Congressional District, I ask my  colleagues to join me in congratulating our outstanding high school  basketball champions. I am confident that these young student athletes  have bright futures ahead of them.\n\nThis weekend, the city of Birmingham…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…continued success. I thank them for continuing to pour into  Smyrna, Kent County, and the greater central Delaware region one family  heirloom at a time.                        Congratulating Robbie Stephens\n\nMs. McBRIDE. Mr. Speaker, I rise today to congratulate Robbie  Stephens on becoming the new fire chief of the Lewes Fire Department.\n\nChief Stephens brings…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…the Jewish community in the region has a spiritual, educational,  and cultural home for decades to come.\n\nOn this historic occasion, I ask my colleagues to join me in  congratulating Rabbi Levi and Mrs. Chayala Wilhelm, the dedicated  members of the Chabad Southwest Las Vegas community, and all those  whose generosity and commitment have made this day…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695341/recognizing-the-groundbreaking-of-chabad-southwest-las-vegas"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…I am proud to represent Nancy Merkling, whose dedication  as both an artist and a mentor has made a lasting impact on our  community. I ask my colleagues to join me in congratulating Ms.  Merkling on receiving this well-deserved recognition.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…honor children,  inspire hope, and advocate for continued progress in both cancer and  blood disorder care.\n\nMr. Speaker, I would like to urge the chamber to join me in  congratulating OSF Children's Hospital of Illinois Cancer and Blood  Disorders Institute on their new name, while applauding their  leadership in pediatric cancer and blood disorder care.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694928/recognizing-childhood-cancer-awareness-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…epidemic and mental health  crisis.\n\nWhile Father Mac is no longer with us, his legacy lives on through  Haymarket Center. I join people across the Chicagoland area in  congratulating Haymarket Center for 50 years of incredible work,  helping those who had no one else to turn to, and treating everyone who  walked through its doors with kindness.", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Mr. Speaker, I am proud to represent Rhienna McClain, whose  exceptional contributions have made a lasting impact on McHenry County.  I ask my colleagues to join me in congratulating her on receiving the  ATHENA International Leadership Award, a recognition that is truly  well-deserved.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…means to be a good neighbor  and a true public servant. I ask my colleagues to join me in honoring  Robert ``Bob'' P. Hubbard for his remarkable lifetime of service and  congratulating him on being named the 2024 Citizen of the Year.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…2025 Impact Award will be presented to IACC--Pars       Place.\n\nThe 2025 Education Award will be presented to Marco Rando.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  recipients of the 2025 Arts Awards and recognizing the visionaries,  leaders, and supporters who help to make our Northern Virginia  communities rich with cultural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697103/recognizing-the-recipients-of-the-2025-artsfairfax-arts-awards"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…by  the California Department of Education.\n\nGriset Academy helps prepare students to fulfill their potential both  in class, as well as in future careers.\n\nJoin me in congratulating the dedicated staff and educators at Lorin  Griset Academy for a great job in preparing Orange County's next  generation of leaders.               Honoring Santa Ana Police…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Ms. SCHOLTEN. Mr. Speaker, I rise today to ask my colleagues to join  me in congratulating Paige Kitts. Paige is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4504. She has exemplified extraordinary  leadership, innovative problem-solving, and a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…His visit reminds us  to be constantly kind and collaborative, one that is much needed during  this time.\n\nPlease join me in thanking His All-Holiness for his visit and  congratulating him on this well-deserved award.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…occur by chance; they  are the result of sustained hard work, personal sacrifice, and a  devoted commitment to excellence.\n\nMr. Speaker, I ask my colleagues to join me in congratulating  Madeline Brobst on this milestone of academic distinction. We commend  her for this outstanding accomplishment and look forward with  confidence to the many successes…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…induction into the Veterans Hall of Fame recognizes her impact on  the Sunshine State and our country. We are proud of her and her  service.\n\nMr. Speaker, please join me in congratulating my friend Lieutenant  Governor Jennifer Carroll on being inducted in the Florida Veterans  Hall of Fame.\n\nShe is indeed one of the best of the best.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…grateful to him for making it a better place. May he enjoy his well- deserved retirement and the next chapter of his life. Mr. Speaker, I  congratulate Joe.                    Congratulating Officer Sara VanLeeuwe\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate Officer Sara  VanLeeuwe on a successful 30-year career at the Marshall Police Force.  From the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693572/congratulating-joe-jensen"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…I thank Lucas for his commitment to service and wish him the very  best of luck as he embarks on this exciting new phase of life at West  Point.                         Congratulating Bryony Shipe\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate Bryony Shipe of Ford City, Pennsylvania. Bryony  recently accepted…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…their athletic program.\n\nUnder Head Coach Tim Orlosky, these young men exhibited persistence,  sportsmanship, and humility in their title run.\n\nMr. Speaker, join me in congratulating this team of incredible young  men and everybody who supported them in their journey to achieve  history for Frederica Academy.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…both truth and compassion, empowering individuals,  strengthening families, and preserving freedom for future generations.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  outstanding woman for her public service and leadership.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…fair prices.\n\nToday, we celebrate Arrowhead Pointe Golf Course and its contribution  to Georgia's tourism, recreation, and community well-being.                         Congratulating Berry College\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor Berry  College, a well respected and prestigious university located in Mount  Berry, Georgia.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Cattlewomen, Ms. Woody also remains active in  her church and throughout the community.\n\nMr. Speaker, we ask our colleagues in the House of Representatives to  join us in congratulating Ms. April Woody on being named Kern County's  2025 Cattlewoman of the Year. Her dedication to agriculture, education,  and service to the community embodies the values…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…his athletic and  academic journey at Carson-Newman University.\n\nThe Glenvar Highlanders have made their school and community proud. I  ask my colleagues to join me in congratulating these outstanding young  athletes.\n\nHonoring the Life of Justice Lawrence Larkins Koontz, Jr.\n\nMr. CLINE. Mr. Speaker, I rise today to honor the extraordinary life  and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…come true.\n\nMr. Speaker, I congratulate the Blackjacks on their victory. They  have made all of their families, community, and the Seventh District  proud.              Congratulating Albany Huskies on Undefeated Season\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate the Albany  Huskies on their undefeated season, closing it out with a win over…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689038/congratulating-dawson-boyd-blackjacks"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…best  celebrations of our shared culture and history. It is something that  all Americans should attempt to do as we celebrate our 250th  anniversary.\n\nI close by again congratulating the Spokane Tribe of Indians on their  leadership, tradition, and community pride.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…in her career, just as she has excelled in the FFA.\n\nMr. Speaker, I congratulate Kadyn on her hard work and dedication to  the FFA and the community.                    Congratulating Dorothy Vandendriessche\n\nMrs. FISCHBACH. Mr. Speaker, I rise to recognize Dorothy  Vandendriessche of Marshall, Minnesota, on receiving the Minnesota  Woman of the Year…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691460/congratulating-kadyn-kulzer"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…families  the opportunities that they deserve and that they are entitled to. It  will put our country on much stronger footing for generations to come.                       congratulating tahoe yacht club\n\nMr. KILEY of California. Mr. Speaker, I rise today to congratulate  the Tahoe Yacht Club as they celebrate their 100-year anniversary.\n\nIn 1925, many…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…to find new cures  and therapies for ALS.\n\nWe will never forget Alex and Jaci, and we will continue to fight to  find a cure for this tragic disease.                     congratulating dr. wendy wintersteen\n\nMr. FEENSTRA. Mr. Speaker, I rise today to congratulate my friend,  Dr. Wendy Wintersteen, on announcing her retirement as president of  Iowa State…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…had come to fruition. The Penguins forever etched  themselves into history as champions.\n\nI ask my colleagues in the United States House of Representatives to  join me in congratulating the Youngstown State women's bowling team's  players, coaches, staff, families, and friends as we celebrate this  historic victory and national championship. Go Penguins.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690138/congratulating-the-youngstown-state-womens-bowling-team-on-winning-the-2025-ncaa-bowling-championship"}]