[{"senator": "John Carter", "party": "Republican", "sentence": "Navy, Retired, with a Congressional Veteran Commendation.", "title": "Saluting the Service of Commander Jon Lux", "date": "2025-03-31"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I rise today to honor Danny Charles Masur,  of Rockdale, Texas, by presenting him with a Congressional Veteran  Commendation.", "title": "Recognizing Danny Charles Masur with A Congressional Veteran Commendation", "date": "2025-10-21"}, {"senator": "John Carter", "party": "Republican", "sentence": "Army, Retired, with a  Congressional Veteran Commendation.", "title": "Saluting the Service of Colonel Terry Wilson", "date": "2025-04-01"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I am honored to present Nola Jane Saldana  of Waco, Texas, with a Congressional Veteran Commendation.", "title": "Recognizing Nola Jane Saldana with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I rise today to recognize and honor Delman  Leon Orme of Crockett, Texas, as a distinguished recipient of the  Congressional Veteran Commendation.", "title": "Recognizing Delman Leon Orme with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "John Carter", "party": "Republican", "sentence": "Air Force, Retired, with a Congressional Veteran  Commendation.", "title": "Saluting the Service of Lieutenant Colonel Jeff Davison", "date": "2025-03-31"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I am honored to present retired USA  Lieutenant Colonel William (Bill) Patterson Matthews, of Mexia, Texas,  with a Congressional Veteran Commendation in recognition of his  outstanding service to both his country and his community.", "title": "Recognizing Lieutenant Colonel William (Bill) Patterson Matthews, Usa, Retired, with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "John Carter", "party": "Republican", "sentence": "Marine  Corps (Ret.), with a Congressional Veteran Commendation.", "title": "Saluting the Service of Lieutenant Colonel Spencer Hutson Smith", "date": "2025-03-31"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I am honored to present Richard Reagan  Horn, of Huntsville, Texas, with a Congressional Veteran Commendation.", "title": "Recognizing Richard Reagan Horn with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "John Carter", "party": "Republican", "sentence": "Speaker, it is my privilege to present a  Congressional Veteran Commendation to Lieutenant Colonel Barbara  MacMillan, U.S.", "title": "-9999", "date": "2025-03-31"}, {"senator": "John Carter", "party": "Republican", "sentence": "Army,  Retired, with a Congressional Veteran Commendation.", "title": "Saluting the Service of Major General Patrick Hamilton", "date": "2025-03-31"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I am honored to present retired USAF  Technical Sergeant Martha Socorro Ybarra of Waco, Texas, with a  Congressional Veteran Commendation.", "title": "Recognizing Technical Sergeant Martha Socorro Ybarra, Usaf, Retired, with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, I am honored to present Danny Wallace  Smith of Crawford, Texas, with a Congressional Veteran Commendation for  his exceptional armed forces service and unwavering commitment to our  country, state, and local communities.", "title": "Recognizing Danny Wallace Smith with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "John Carter", "party": "Republican", "sentence": "I am proud to present her with  the Congressional Veteran Commendation.", "title": "Saluting the Service of Command Sergeant Major Angela Wilson", "date": "2025-03-31"}, {"senator": "John Carter", "party": "Republican", "sentence": "Bygum, Jr., USMC and USAF, Retired, with a Congressional  Veteran Commendation.", "title": "Saluting the Service of Master Sergeant Duane C. Bygum, Jr.", "date": "2025-03-31"}]