[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…served as Newark City Council president and went on to succeed his  father in this body.\n\nDonald M. Payne, Sr., was the first African American elected to New  Jersey's congressional delegation, and his son carried that legacy  while blazing his own path.\n\nA leader on the House Committee on Transportation and Infrastructure,  Mr. Payne secured critical investments…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698322/wishing-a-happy-heavenly-birthday-to-the-honorable-donald-payne-jr"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Tracey Mann. I thank both Congressman Estes and Congressman Mann for  their leadership on this matter as well as the leadership and  cooperation of the entire Kansas congressional delegation.\n\nThe last couple of months have been heartbreaking and trying. It has  been a hard time for our country and the U.S. aviation system. There  have been numerous accidents,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…include  in the Record their testimonies:\n\nTo the Honorable Congresswoman Pressley, Senator Markey,       and other participating members of the Massachusetts       Congressional Delegation,\n\nThank you for receiving this testimony in support of       Temporary Protected Status (TPS) for Haitians. I am a primary       care physician at the MGB Chelsea…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the COP. That  was it. Just me. Nobody else went. And not only did nobody else go-- this is not important to anybody really outside the Senate--but for my  codel, my congressional delegation trip of one, the State Department,  under President Trump, refused to facilitate my trip.\n\nI think this is the first time where the Senate, the legislative  body,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…now  who identify in whole or in part as Native Hawaiian. Roughly half  continue to reside in their homeland of Hawaii, and I am deeply humbled  to join my Hawaii Congressional delegation colleagues in our kuleana  (responsibility) to represent them and their `ohana (family) everywhere  in Congress.\n\nThe Native Hawaiians, also known as Kanaka Maoli,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Border Water  Quality Restoration and Protection Act, and helped secure essential  funding for our district. In part because of her tireless advocacy, our  San Diego Congressional delegation has been able to secure millions of  dollars in funding to address cross-border pollution. For instance,  last year Ally worked with staff for the San Diego delegation…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693025/recognizing-ally-castaneda"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, I rise today as dean of the  Virginia congressional delegation to introduce and welcome to Congress  the newest Representative from the Commonwealth of Virginia, James  Walkinshaw.\n\nJames was born in Northern Virginia, the very…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the tragic shooting at Annunciation  Catholic Church in Minneapolis, Minnesota.\n\nSAINT PAUL, Minn.--Congresswoman Betty McCollum (MN-04),       Dean of the Minnesota Congressional Delegation, issued the       following statement on Wednesday after a gunman opened fire       on a mass service during the first week of classes at       Annunciation Catholic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694811/mourning-the-tragic-shooting-at-annunciation-catholic-church-in-minneapolis-minnesota"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "Ms. LOFGREN. Mr. Speaker, I rise as chair of the California  Democratic congressional delegation in opposition to this rule. It  makes in order three resolutions that claim to be pursuant to the  Congressional Review Act, but are completely illegitimate.\n\nThat…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690389/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…requested that the Committee on Homeland Security, that  some of us here serve on, would conduct an official oversight visit to  CECOT.\n\nI was of the opinion that a congressional delegation needed to  urgently go to CECOT in El Salvador and check on the health and well- being of all the political prisoners who we have sent to that heinous  place.\n\nMy…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…which explicitly calls for us to do more to  address the scourge of anti-Semitism.\n\nMr. Speaker, that resolution is broadly supported by the members of  Colorado's congressional delegation. Colorado has eight Federal  lawmakers here in Washington. Six of the eight joined that resolution.  I thank Republican Representatives Jeff Crank and Jeff Hurd for…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…streets to cause destruction and physical  confrontation.\n\nMr. Speaker, they should be arrested and prosecuted, something that  the Governor, the mayor, and L.A.'s congressional delegation have  called for from the start.\n\nLet's remember, though, how we got here. What we have seen on our  streets  is chilling. There are masked men in unmarked cars. They…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…historical  marker for the community if it were renamed the Mary Elizabeth  ``Bettie'' Cole Post Office Building.\n\nH.R. 1461 was cosponsored by the entire Pennsylvania congressional  delegation, Democrats and Republicans alike. I thank my colleagues for  their support, and I ask this Chamber's ``yea'' vote on H.R. 1461.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…to clean water just  as every citizen of the great State that I serve and that Ms. Boebert  serves, that Mr. Hurd serves, and my other colleagues in the Colorado  congressional delegation deserve.\n\nI think what is perhaps missing from this debate, and it is important  for us to level with the American people, is: Why are we here? Why,  despite all the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…transformational funding.                Baby Jay Sets Washington State's Pecking Order\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to celebrate a special  tradition of the congressional delegation of Washington State.\n\nJust 1 year ago, I was sworn in to the 119th Congress and welcomed as  one of the two new members of the Washington congressional delegation.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…thousands of good jobs, and giving students hands-on  opportunities to learn and grow.\n\nI thank once again Representative Moore, Senator Lee, and the entire  Utah congressional delegation for their work on this important effort.  I urge my colleagues to join me in supporting this bill, and I yield  back the balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…environmental extremists.\n\nThe Biden administration provided a limited opportunity for public  comment or engagement on this RMP amendment. Wyoming's Governor, a  unified congressional delegation, locally elected officials, Tribes,  and local communities all expressed strong opposition to this plan  amendment. The previous administration ignored them all.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…reserves in the United States.\n\nThey did this despite strong opposition from local counties in  Montana and local elected officials--in fact, the entire Montana  congressional delegation and the Governor of Montana himself, Greg  Gianforte. In fact, Governor Gianforte specifically requested that the  BLM Director withdraw that proposed amendment during…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…prevent by opening up the NPR-A in the first place.\n\nThe issuance of Biden's new highly restrictive IAP was widely  condemned as egregious by Alaskans. Our entire Alaska congressional  delegation slammed the decision as contrary to good science, in  contravention of congressional directives in Federal law, and foolish,  as the Biden administration implored…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…providing for balanced management, the last administration ignored what  I think was a good plan that was already in place. They ignored Federal  law. They ignored the congressional delegation. They ignored the people  who live on the North Slope. I think they also ignored or overlooked  our history of responsible production, our energy security, and they…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, 32 years ago today, I joined President  Clinton, Governor of Iowa Terry Branstad, and members of the Iowa  congressional delegation to tour catastrophic flood damage in my home  State. The great flood of 1993 ravaged nine States in America's  heartland.\n\nThis reminds me of a poster we in the Midwest…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…that  creating this pipeline is one of the most crucial steps we can take to  counter China's influence in the Indo-Pacific.\n\nEarlier this year, I led a bipartisan congressional delegation to  Taiwan, Japan, and South Korea. Taiwan has already signed a letter of  intent with the State of Alaska to purchase Alaskan LNG, and both Japan  and South Korea…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…made it so that the commodity  price is below the actual cost to extract it. The ripple effects are  still being felt throughout my district.\n\nThis is why Montana's congressional delegation is stepping up. I  stand shoulder to shoulder with Congressman Zinke and Senators Daines  and Sheehy. We introduced the Stop Russian Market Manipulation Act.  This…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…contribute to  research and innovation for decades to come.\n\nMr. Speaker, I thank Dr. Ashby for his willingness to work with  myself and members of the Washington Congressional Delegation. We built  a strong relationship over the years and worked diligently to ensure  PNNL had the resources needed to not only be successful but excel in  their mission.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696092/congratulating-dr-steven-ashby-on-his-retirement"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, tonight, the Virginia  congressional delegation is gathered on the House floor to pay our  respects to Virginia Beach Police Department Officers Cameron Girvin  and Christopher Reese, who were killed in the line…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687949/moment-of-silence-in-honor-of-cameron-girvin-and-christopher-reese"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…those bolo ties, wow--I have no doubt  she will bring to the Halls of Congress the same energy that has  defined her years of public service.\n\nAs dean of the Arizona congressional delegation, I wish to  congratulate Congresswoman Grijalva and welcome her to the United  States House of Representatives.\n\nI now yield to the gentleman from Mr. Arizona (Mr.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696710/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…simply looking out for each other to  overcome yet another natural disaster.\n\nStill, the work is far from finished. I, along with fellow members of  the Mississippi congressional delegation, strongly support Governor  Reeves' request for a major disaster declaration, and we encourage  President Trump to approve it swiftly.\n\nI ask my colleagues and the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…congressionally mandated oil and gas leasing program in the Coastal  Plain of the Arctic National Wildlife Refuge, ANWR. I urge my  colleagues to support the Alaska congressional delegation's joint  resolution of disapproval, H.J. Res. 131 and S.J. Res. 91, to reject  unlawful regulatory overreach.\n\nThe implementation of the Biden administration's 2024…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}]