[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…broadcasting to strip  communities of trusted information. If this Republican rescission  package goes through, it will only divide us further: fewer voices,  fewer facts, fewer connections.\n\nAmericans are pleading not to be left in the dark. I urge my  colleagues to listen to them and to vote against this reckless cut to  public broadcasting.", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to  build resiliency and lower energy bills.\n\nNearly $400 million was going to be invested through the Department  of Energy's Grid Innovation Program to provide onshore connections for  offshore wind power, improve the electric grid, and install energy  storage through a project called Power Up New England.\n\nBut the President's Day One executive order…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…health and environmental initiatives across Illinois.  I am proud to recognize the Chicago Indo-US Lions Club and thank them  for their dedication to service and for fostering connections that help  Illinois communities thrive.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698522/recognizing-the-chicago-indo-us-lions-club-for-its-outstanding-service-to-communities-across-illinois"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…habitat, world-class recreation, and a strong,       sustainable local economy. Generations of Midwesterners and       Americans from across the country have formed deep       connections to nature through hunting, fishing, camping,       canoeing, and hiking in the Boundary Waters.\n\nAllowing copper mining to proceed by overturning the       mineral withdrawal…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…because both nations have worked vigorously to try to  circumvent our restrictions.\n\nRight now, our laws do not explicitly cover the remote access of  technologies via network connections, including the internet or cloud  computing services.\n\nH.R. 2683 would close this gap by giving the Bureau of Industry and  Security statutory authority to control the remote…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Philippines have made our  state an ideal bridge between our two militaries. This special  relationship has not only strengthened defense readiness but also  developed personal connections that enrich both our communities.\n\nI would also like to acknowledge the role of our partners in Guam,  who have joined this trilateral cooperation in recent years. Their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…small businesses, artists, and community members  share food and traditions from around the world. His guidance has  uplifted local entrepreneurs while fostering stronger connections  across the region.\n\nJason's heritage and perspective deeply inform his approach to both  art and education. With more than a decade of experience in the arts  and nonprofit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…essential health services. As  president and CEO of Bi-State PCA, Tess has been instrumental in  leveraging her clinical background, experience in public health, and  many connections to stakeholders, nonprofits, and Congressional Offices  like my own to uplift community health centers in our state. Under her  leadership, Bi-State has grown from a staff…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…1975, poured more than  half of her life into the store. GrassRoots wasn't just a business. It  was part of the rhythm of Newark, a reminder that local businesses  create connections and build community.\n\nAs GrassRoots closes this chapter and Marilyn begins a well-earned  retirement, Delaware wishes her all the best and thanks her for her  years of community…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…on the wall of their new, temporary homes in  hopes that one day they will be able to return to their villages.\n\nWe acknowledge their trauma and the painful loss of their connections  to their family members, land, the beautiful olive groves, and the 400  Palestinian villages that they all grew up in. We, of course, see that  the Israeli Government continues…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…phone, chat and text--each contact representing courage,  resilience and hope. Its highly trained advocates provide compassionate  support, personalized safety planning, and connections to local  resources, responding to thousands of contacts each day as the demand  for services continues to grow. Thirty years later, The Hotline  continues to experience…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…communication skills and strategic insight but also her  kindness, dedication, and unwavering passion for public service. Her  excellent work has helped shape our message, build connections, grow  the New Dem brand, and advance the values we hold dear. As a  communicator, Emma is second to none.\n\nAs Chair of the New Democrat Coalition, and before that Vice…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…provide a  roadmap for bringing a new generation of Americans together in service  to our Nation. Americans want to serve. We just need to provide the  opportunities and the connections for them to do so.\n\nI urge my colleagues to join us in reaffirming our national culture  of service by working with Senator Young and me to take up and pass the  Unity through…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…firmest props of  the duties of men and citizens. The mere politician, equally with the  pious man, ought to respect and to cherish them. A volume could not  trace all their connections with private and public felicity. Let it  simply be asked where is the security for property, for reputation, for  life, if the sense of religious obligation desert the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…foods, denying access to fresh, healthy  fruits and vegetables, and then not letting people with chronic  diseases get healthcare. I love this doctor for pointing out those  connections.\n\nNow I am going to go to Brian Connell, who is the vice president of  the Leukemia & Lymphoma Society:\n\nThe fiscal year 2025 budget resolution would create not       just…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "French Hill", "party": "Republican", "sentence": "…funds provided under this subtitle for infrastructure       improvements, including the installation or repair of water       and sewer lines, sidewalks, roads, and utility connections       if--\n\n``(i) such participating jurisdiction does not receive       assistance under title I of the Housing and Community       Development Act of 1974; and\n\n``(ii)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…sacrifices.\n\nChobani, an American food company that has its main manufacturing  facility in Twin Falls, Idaho, is honoring our military servicemembers  through facilitating connections between Blue Star Families, Mountain  Home Airforce Base, and Chobani military employees.\n\nThe collaborative efforts among these groups have strengthened  military families,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…gentlewoman from Illinois' Second Congressional  District (Ms. Kelly).\n\nFor years, large parts of my district and rural areas across America  have lacked access to fast broadband connections.\n\nReliable internet access is more than just being able to stream your  favorite TV shows and movies. It is the critical connecting link for  all of us. Whether it is helping…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…County.\n\nGeorge and Joanna came to the United States from Greece in the 1970s  in search of an opportunity and a better life for their family. They  arrived in America with no connections, no government handouts, no  safety net to rely on, and worked their way forward step by step. With  them, they brought a deep respect for the values of faith, family, and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…or more crossed into our country illegally, 300 migrants per day rolled  into Colorado because cities like Denver welcomed them with our  taxpayer dollars. Migrants with connections to dangerous gangs, like  Tren de Aragua, didn't just stay in Denver, but they moved to nearby  communities, and they took over apartment complexes that were owned by  individuals.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…firmest props of  the duties of men and citizens. The mere politician, equally with the  pious man, ought to respect and to cherish them. A volume could not  trace all their connections with private and public felicity. Let it  simply be asked where is the security for property, for reputation, for  life, if the sense of religious obligation desert the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Community First Health Centers has  placed patients at the heart of its mission. For over five decades, it  has not only provided vital medical services but also built strong  connections to community support systems and resources.\n\nServing over 10,000 Michigan residents, the organization provides  quality medical, behavioral, and educational health services.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694747/recognizing-community-first-health-centers-on-50-years-of-service-to-the-ninth-congressional-district"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…meaningful networking  opportunities.\n\nMr. Speaker, I am thankful for the work of the chamber members and  their leaders and for the many contributions to fostering the  connections that make the Rochester community a great place to live,  work, and do business.\n\nI congratulate the entire Rochester Area Chamber of Commerce family  on celebrating this…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700187/recognizing-the-rochester-area-chamber-of-commerce-on-160-years"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…by employees in other areas.\n\nThese same principles and strategies can certainly be translated into  the homeland security space, where wider knowledge and institutional  connections mean stronger security. By giving DHS staff the opportunity  to gain knowledge and skills from throughout the department, we give  the intelligence community a leg up in…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…distant Federal Government  make local rules.\n\nPeople from across the world come to experience the unique  opportunities these trails offer. The rule threatens to sever these  connections, leaving communities to bear the brunt of its consequences.  This is in a beautiful part of a gorgeous State, but it is not easy to  get to. Keep in mind, this is a recreation…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…modeling, including data-driven and  computational thinking, problem, project, and performance-based  learning and assessment, interdisciplinary exploration, and career  connections, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                   H.R. 730\n\nBe it enacted…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…transatlantic flight to one of our gates. The flight from  Indianapolis to Dublin on Aer Lingus marked the start of daily nonstop  service to this European gateway and onward connections throughout  Europe.\n\nImportantly, it represents an important economic development tool.  Indianapolis has long been recognized as one of our country's best  midsize airports.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692118/welcoming-nonstop-flight-from-indianapolis-to-dublin"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…complement Northrup Grumman's work, creating a  synergy that ensures the continued success of space missions.\n\nUtah State University boasts one of the longest histories of  connections to space technologies with the establishment of Electro- Dynamics Laboratories in 1959. It would later join forces with the  University of Utah's Upper Air Research Laboratory…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…education in Neshaminy. He soon will be working at Darianna  Bridal and Tuxedo in Warrington as manager of the tuxedo department,  focusing on business development and community connections.  Congratulations again to Principal Kern.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the community he  cared so deeply about. He was the kind of supporter and cheerleader  everyone would be lucky to have.\n\nChris, a talented storyteller and comedian, made connections wherever  he went, creating valuable memories for his friends and loved ones.\n\nMr. Speaker, please join me in prayers for his family and all  privileged enough to know him…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691812/mourning-the-loss-of-chris-lane-gay"}]