[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…down the house, burn  down an Agency, burn down a framework of laws that have been carefully  built and reflect not only an intellectual commitment but also a  deliberately constructed way to balance the needs of environment and  energy and other interests that serve the public.\n\nThis administration is destroying that balance. It is easy to destroy  things.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…system is frozen in place. It definitely isn't  going to work if Federal Agencies ignore statutory timelines, stall  approvals, issue illegal stop work orders on partially constructed,  fully permitted projects, pause leases, and cancel projects that were  already under construction.\n\nSo what this administration is doing doesn't just undermine one of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…partner countries, such as Japan and South Korea-- nations with world-class maritime industries and deep national security  alignment with the United States. It allows ships constructed in those  allied countries to qualify for the U.S. domestic (coastwise) trade  under a limited Jones Act exemption, thereby expanding access to  modern, secure and cost-effective…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…issued a last-minute order to force the plant  to stay open.\n\nWe won't even talk about how the Trump administration has pulled  permits of fully permitted and almost fully constructed offshore wind  projects. We will put that aside. However, to keep the Campbell plant  open, the administration cited a so-called grid reliability emergency,  but they produced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…or a better job. It doesn't give  you quality of opportunity. It doesn't tackle any of the environmental  issues.\n\nIt is simply a gross display by the President, who has constructed  his entire administration on the basis of a theory to govern, which is  ``families lose, and billionaires win.''\n\nFamilies lose their healthcare so there can be massive…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…situated on land previously owned by David Burnes, whose  other landholdings now house the National Mall, the White House and  other notable D.C. landmarks.\n\nThe House was constructed in 1825 by Tench Ringgold using enslaved  individuals. Shortly after being built, the House's boarders included  Chief Justice of the Supreme Court John Marshall and occasionally…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692257/recognizing-the-dacor-bacon-house"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…stained glass panel depicting the D.C. seal among the panels depicting  the seals of all the states and territories that existed when the  Thomas Jefferson Building was constructed. The seals of Hawaii and  Alaska are  the only state seals not included in the display because they were not  states or territories when the building was constructed. The…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…accounts,  kids' college savings from investment accounts, and retirement savings  from 401k's.\n\nIt is not too late to change course and declare Liberation Day as a  poorly constructed April Fools' joke.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…All Program,  the Trump administration paused work on Revolution Wind, a nearly  complete offshore wind project off the coast of Rhode Island. This  project is 80 percent constructed, with over $5 billion invested and 45  turbines already installed in the Atlantic Ocean. It supports more than  1,000 local union jobs and is poised to deliver enough low-cost…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…generation we possibly can make, why do they stand idly by  while the Trump administration wages war on a clean energy power  source? Many of them are already permitted and constructed.\n\nIn April, the administration issued a stop-work order for the Empire  Wind offshore wind project surrounding New York. Even though the order  was lifted in May, that delay…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…proceeded to try to cut off almost any source of  clean energy. Just a few weeks ago, he announced that he was going to  stop the offshore wind projects that were over 90 percent constructed  in Rhode Island. He has done the same throughout the eastern seaboard.\n\nI think it was the gentleman from Kentucky (Mr. Guthrie) who said  that it takes a long time to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…substance of addressing the inflation cost  crisis that Republicans have unleashed on Coloradans and on Americans  writ large, but, no, we are here to debate this very carefully  constructed press release that ultimately will accomplish nothing if it  is ever signed into law.\n\nMadam Speaker, I am voting ``no,'' and I urge my colleagues to do the  same.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…mound       designated as a place of refuge in the event of a tsunami,       with sufficient height to elevate evacuees above the tsunami       inundation depth, designed and constructed to resist tsunami       load effects.       SEC. 215. ADDITIONAL PRIBILOF ISLAND TRANSITION COMPLETION                     ACTIONS.\n\nSection 11221 of the Don Young Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…1925, with 42 students enrolled in the  inaugural class. Four courses were available: printing, electricity,  bricklaying and cabinetmaking. All students lived in the newly  constructed dormitory equipped with modern conveniences such as steam  heat and plumbing that featured hot and cold running water. Students  helped government workmen lay bricks to…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…farmers. Keeping with the village's small town charm, the original  village hall built in 1898 is still used today. In 1900, The  Cincinnati, Hamilton & Dayton Railway depot was constructed, allowing  the village to continue its agricultural commerce. In 1958, Tontogany  became the home of the newly formed Otsego Local School District which  was formed when…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…each       individual begins in the home and parents are, first and       foremost, the primary teachers and protectors of their       children in a free society. Properly constructed social,       religious, and governmental institutions are designed to       support and strengthen the family unit, not restrict it,       regulate, or replace it. No association…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "French Hill", "party": "Republican", "sentence": "…residents;\n\n(v) a range of affordability for homeownership;\n\n(vi) accountability measures;\n\n(vii) the long-term cost to residents and businesses if       more housing is not constructed;\n\n(viii) barriers to individuals seeking to access affordable       housing in growing communities and communities with economic       opportunity;\n\n(ix) with respect to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…referred to as ``The  Florida Alps.''\n\nMr. Howey was an entrepreneur who dreamed of creating a citrus empire  with the town serving as its commercial and shipping hub. He  constructed Florida's first citrus juice plant in 1921 and introduced  the ``Lifeguard'' brand of canned citrus juice, revolutionizing the  industry. The historic Floridian Hotel, built…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…purpose of aquifer recharge;\n\n``(II) identify the existing right-of-way, easement,       permit, other authorization, or recognized authorized use for       ditches and canals constructed on public land before or on       October 21, 1976, under the authority of sections 2339 and       2340 of the Revised Statutes (43 U.S.C. 661) intended to be       used;…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691131/conveyance-for-aquifer-recharge-purposes"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…government buildings, including the Department of Justice and       the Department of the Interior.                                    Marble\n\nThe buildings were originally constructed with marble       facades and stonework. The project has salvaged the original       exterior marble to be reinstalled and will use new domestic       marble where the original…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…HISTORICAL ASSOCIATION SOUTHERN ARKANSAS UNIVERSITY                             MAGNOLIA, ARKANSAS\n\nTwenty-Five years ago in 1984, a dedicated group of       conservationists constructed an exceptional coalition, known       as the Arkansas Conservation Coalition (ACC). They were       successful in their quest to set aside 91,000 extraordinary       acres…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this year, U.S. Navy veteran ``Mac'' MacNeil and Cathie  Adams were joined by their neighbors and community leaders as they  broke ground on what will soon be their newly constructed home, the  first home rebuilt by a nonprofit charitable organization in Grizzly  Flats after the Caldor fire. This new home will provide Mac and Cathie  with a safe, comfortable,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Senior  Patrol Leader and a member of the Order of the Arrow scouting honor  society. On October 21, 2024, he earned the rank of Eagle Scout. For  his Eagle Project, Oliver constructed two raised bed planter boxes for  the Plano Chinese Alliance Church as a show of appreciation for the  Church's generosity in allowing Troop 219 to host meetings using their…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…creation and fundraising  of the World War II Memorial to honor and remember our Nation's  Greatest Generation.\n\nFred would become a major factor in getting that memorial  constructed. It would cost a lot of money to raise and build such a  monument. As a result of that movie, Fred turned to his friend Tom  Hanks for his help in public service to help…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…first Vice President and second President,  with Abigail supporting him throughout as his most valued and trusted  adviser. They were the first family to occupy the newly constructed  White House, which this monument will be immediately adjacent to.\n\nTheir son, John Quincy Adams, was America's sixth President, and so  dedicated to this country that following…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697630/adams-memorial-great-american-heroes-act"}]