[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…batteries on the global market, including those inside       made-in-China Teslas.\n\nCATL and BYD's claimed technological advancements are       unlikely to benefit American consumers, at least in the near       term, given sky-high tariffs levied by the U.S. against       Chinese goods--and in particular EVs manufactured in China.\n\nIt is a reminder of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…tobacco industry was insisting  that the Tobacco Institute do studies about the cost to smokers by  passing secondhand smoke ordinances that figured out the full cost to  consumers for people who didn't smoke.\n\nAs a former restaurant owner, who didn't allow people to smoke, it  just reminds me of the same thing. I believe in research because I have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…clear to anyone who was actually connected to the  real world that grocery prices were going up and that we had to take  steps to carve out exemptions for the sake of American consumers, our  working families, and the middle class.\n\nIt was amazing to see how the President, in October, was actually  giving speeches where he said prices have come way down…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…within the last decade, satellite capabilities have  become more sophisticated and are now being woven into the fabric of  our mobile networks. With these advancements, mobile consumers now have  even greater connectivity and the comfort of knowing they can reach  first responders and loved ones in a time of need, no matter where they  may be.\n\nThe satellite…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693468/precision-agriculture-satellite-connectivity-act"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…Both  administrations have recognized that for the United States to remain  the financial capital of the world, Congress needs to pass clear  regulatory rules that protect consumers and foster innovation here at  home.\n\nI started working on this legislation 3 years ago with Cynthia  Lummis. This is not a bill written quickly for any reason but to  regulate…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…economic proposal when he suspended certain tariffs on bananas,  coffee, beef, and clothing. You just can't keep up with him. Why  backtrack? Because he knows that the voters and consumers in America  are fed up with rising costs and place it by a factor of 2 to 1 at his  feet. My source again? FOX News. The President sees the writing on the  wall, and he is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…propose a major threat to that economy.\n\nInflation and high costs are a threat to stability and prosperity of  American  businesses of all size, to our farmers, and to our consumers. We live  now in an interconnected world--a global economy--and advances in  technology and transportation have brought that world closer and closer  together. We have a…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…businesses who simply cannot  afford another rate hike. That is why I helped found the Congressional  Lowering Utility Bills Caucus, to push real, practical solutions that  put consumers first.\n\nUpstate New York knows extreme weather--long winters, hot summers-- but weather alone doesn't explain why utility bills have become  unmanageable. Families in my…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…American  manufacturing on our home soil.\n\nThe Trump administration's reckless tariffs and disastrous trade wars  are straining the pocketbooks of our workers, farmers, and consumers.  Prices keep rising for everything--food, housing, utility bills,  lumber, and cars. This is true across the entirety of our northwest  Ohio region, in both urban and rural…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…advance this legislation while our President actively dismantles the  Consumer Financial Protection Bureau, one of the only agencies set up  to protect military and veteran consumers. This is ironic.\n\nSince its inception in 2008, the CFPB has returned more than $21  billion--that is billion with a b--back to consumers, which includes  hundreds of millions…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…order to  pay for about a trillion dollars' worth of tax cuts for the wealthiest  1 percent of Americans.\n\nThere will be table scraps in the Republican bill for middle-class  consumers and families, but the bulk of the tax cuts are going to the  very, very wealthy--millionaires and billionaires; frankly, people who  have done tremendously well in this country…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to speak in support of H.R. 2481, the Romance  Scam Prevention Act.\n\nAs more consumers report using online dating services, it is  important that they are made aware of potential harms. This bill  ensures that when an online dating service bans a user for fraud,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…store their  dollars in crypto. Rather than considering the three bills before us  this week, Congress should consider legislation that puts guardrails in  place to protect consumers, prevent fraud, and establish an effective  regulatory framework for crypto. Instead, these H.R. 3633, S. 1582, and  H.R. 1919 fall short of creating an effective regulatory…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…fuel industry is being  singled out.  Poor Big Oil with its record profits and its record exports and its  executive bonuses and its collusion with OPEC to gouge American  consumers, they are just such a victim in the telling of my friends  across this aisle.\n\nI hate to intrude on that narrative with a little bit of truth, but  the fact is, the offshore…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…be able to use this, too. We also heard in committee that  this could help make the CPSC more efficient by the use of this  technology, and it is critical that we protect consumers.\n\nThe bill also requires the Department of Commerce and other agencies  to study blockchain technology in the context of consumer products and  safety. Right now, blockchain…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693413/consumer-safety-technology-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…and Natural Gas Systems: Procedures for       Facilitating Compliance, Including Netting and Exemptions       rulemaking. Disapproving this rulemaking would help give       consumers access to affordable energy to heat their homes and       businesses to power manufacturing.\n\nDisapproving EPA's natural gas tax rulemaking is expected       to reduce energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…which already operate on thin margins and cannot afford the high  costs to comply with this onerous rule.\n\nSimply put, this is a punitive tax that will be passed along to  consumers and will force energy developers to shut in production. That  means higher prices to heat your homes. That means higher prices to  cook your food. That means higher cost…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…coolers and walk-in freezers.\n\nThese products are staples--they are necessary--in businesses and  restaurants across the country, and they play an essential role in  providing consumers with safe and fresh food as well as drinks.\n\nUnfortunately, Mr. Speaker, the Biden-Harris administration's final  rule jeopardizes those very same small and independent retailers'…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…dispatchable resources needed to power next- generation industries, we will cede American leadership on the world  stage to Communist regimes such as China and raise costs on consumers  along the way.\n\nMr. Speaker, I urge my colleagues to support the legislation as it  will make our grid more reliable and lower America's electricity bills.\n\nMr. GUTHRIE.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…heaters.\n\nThe rule we seek to overturn with this legislation effectively bans  certain natural gas water heaters from the market, placing unnecessary  financial burdens on consumers, especially seniors and low-income  households.\n\nH.J. Res. 35 provides for congressional disapproval of the rule  submitted by the Environmental Protection Agency relating…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…health insurance issuers in advance on       their behalf, known as the advance premium tax credit (APTC),       which lowers their monthly premium payments.\n\nMillions of consumers have purchased health insurance plans       through the marketplaces established under PPACA. The Centers       for Medicare & Medicaid Services (CMS), within the Department…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Mr. HUIZENGA. Mr. Speaker, the Bureau's overdraft rule would  implement government price controls over a product that has proven  necessary for consumers to make day-to-day purchases.\n\nToday, Congress has an opportunity to invalidate this Biden-era rule  that, if implemented, would severely impact community banks and local…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…Speaker, I thank the good chairman of the  Subcommittee on Commerce, Manufacturing, and Trade for yielding time.\n\nMr. Speaker, I rise today in support of H.R. 859, Informing Consumers  About Smart Devices Act. This bill would require manufacturers of  internet-connected so-called smart appliances to disclose to consumers  prior to purchase when their product…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…across the Nation.\n\nA retractable awning can serve as a valuable source of shade and a  gathering spot for families and friends. However, they can pose a  significant risk to consumers.\n\nThis legislation directs the Consumer Product Safety Commission to  establish safety standards for fixed and freestanding awnings typically  installed in homes.\n\nMy Energy…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…outcome.\n\nThis rulemaking doesn't help people in these positions as it pretends  to. It jeopardizes their survival.\n\nWhen governments act as though they know better than the consumers  and the markets, everyday people pay the price. Let's not make that  mistake today. I urge my colleagues to support this legislation.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689840/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…CFPB to use when  interpreting their authorities.\n\nThis is not responsible, risk-based regulation. It is a shortcut to  control, applied without the justification that both consumers and  innovators deserve.\n\nSome may try to frame this argument as a gift to Big Tech. That is a  distraction. This is not about defending large companies. This is about  defending…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…standards, even while working outside of the State, operator costs  increase, fleet upgrades would be impacted, and interstate commerce  would be disrupted. And American consumers would bear the brunt of  increased costs. Hard-working families are already dealing with the  high cost of everyday goods and services, and they cannot afford this  regulation.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…redundant.\n\nMr. Speaker, the purpose of the Biden-era rule wasn't just for  redundancy. It was to put shackles on offshore energy production and to  put higher costs on American consumers, who are already struggling with  inflation that has resulted from the policies of the previous  administration.\n\nGood governance doesn't have redundancy and duplicative…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…least 31 regulations covering a vast array of different  appliances and other products out of the DOE and the EPA? Is $60  billion foisted on to our Nation's manufacturers and consumers in new  regulatory and compliance costs not serious enough for Congress to  thoroughly scrutinize?\n\nDemocrats seem to be confused about what it is that the American  people…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…intermediaries and  transact directly with each other.\n\nHaving this choice will fundamentally transform the digital economy  and unlock new opportunities for innovators, investors, and consumers  around the globe.\n\nMr. Speaker, I thank Chairman Hill and Chairman Thompson for their  leadership and for working with us to include our two bills in the  CLARITY Act.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}]