[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "Mr. GOTTHEIMER. Mr. Chair, I rise in support of the en bloc package  which includes three amendments I offered to the FY 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  bill.\n\nMy first amendment requires a resident advocate in every veterans  home across the country. This advocate will be a…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…premiums will rise by  over $17,000. This is a 255 percent increase.\n\nMs. DeLAURO.  Wasserman Schultz), who is the distinguished ranking  member of the Military Construction and Veterans Affairs Subcommittee.\n\nMs. WASSERMAN SCHULTZ. Mr. Speaker, I thank the gentlewoman for  yielding.\n\nMr. Speaker, I rise to oppose this slush fund for Senators bill that…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Mr. AUSTIN SCOTT of Georgia.\n\nMr. Speaker, this week, the House has the ability to advance four  pieces of legislation under this rule.\n\nH.R. 3944 is the Military Construction, Veterans Affairs, and Related  Agencies Appropriations Act of 2026, which provides significant  investments and support for our veterans, servicemembers, and their  families, as…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Chair, I rise today to express my continued and  resolute opposition to the fiscal year 2026 Military Construction,  Veterans Affairs, and Related Agencies Appropriations Act in its  current form.\n\nI represent a district that is home to Robins Air Force Base, Fort  Benning, and Marine Corps Logistics…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Florida (Ms. Wasserman Schultz), my very good friend and author of H.R.  2701. She serves as ranking member on the House Appropriations  Subcommittee on Military Construction, Veterans Affairs, and Related  Agencies.\n\nMs. WASSERMAN SCHULTZ. Madam Speaker, I thank the ranking member for  his indulgence in yielding time to speak in support of my bill, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Supplemental Nutrition  Program for Women, Infants, and Children, WIC, as part of the  conference on three fiscal year 2026 funding bills: Agriculture,  Military Construction and Veterans Affairs, and legislative branch.\n\nBesides cutting WIC to unacceptable levels, House Republicans are  coming to the table with funding bills that are filled with extreme…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Chairman, I thank the ranking member for yielding me  time.\n\nMr. Chair, I rise today in opposition to H.R. 3944, the fiscal year  2026 Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act. Unfortunately, I must ask my colleagues to oppose  this fundamentally flawed legislation as well. This is not a position…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I thank the ranking member for yielding. I  thank all of the Military Construction and Veterans Affairs  Subcommittee staff on both sides of the aisle for their work, and in  particular Farouk Ophaso and Tyler Coe.\n\nI am opposed to this bill, which will transfer…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…COLE. Mr. Speaker, I have a motion at the desk.\n\nMr. Speaker, I rise today in support of the Continuing  Appropriations, Agriculture, Legislative Branch, Military Construction  and Veterans Affairs, and Extensions Act, 2026.\n\nHistory reminds us, Mr. Speaker, that shutdowns never change the  outcome. The only cost is paid by the American people.\n\nOver the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…legislation brings the total number of full-year fiscal  year 2026 appropriations that will be signed into law to six. The first  three bills--the Agriculture, Military Construction and Veterans  Affairs, and Legislative Branch--were enacted in November. Now we have  to continue to complete the job and make progress on the remainder of  the appropriations bills.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…SENATE DATA.\n\nSection 213 of title II of division C of the Continuing       Appropriations, Agriculture, Legislative Branch, Military       Construction and Veterans Affairs, and Extensions Act, 2026,       and the amendments made by such section, are hereby repealed       and shall have no force or effect.\n\nMr. Speaker, I rise in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…for the consideration of the motion to concur  in the Senate amendment to H.R. 5371, the Continuing Appropriations,  Agriculture, Legislative Branch, Military Construction and Veterans  Affairs, and Extensions Act, 2026, and I am happy to say that it will  end the government shutdown.\n\nThe rule provides 1 hour of debate on the motion equally divided…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Supporting Veterans\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, the House will vote on our  2026 appropriations bill for the military construction and veterans  affairs programs.\n\nOur Active-Duty servicemembers and our veterans have given so much to  our Nation to ensure that we remain safe and free. It is now our duty  to support…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "Mr. MURPHY. Mr. Chair, today I rise in grateful support of H.R. 3944,  the Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act for fiscal year 2026.\n\nAs a proud Representative of over 76,000 veterans, as well as Camp  Lejeune and Military Corps…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692939/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…President is urging.                 Continue Building World's Strongest Military\n\nMr. MEUSER. Mr. Speaker, I rise today as we are voting on the fiscal  2026 Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act, an essential bill that demonstrates our unwavering  commitment to our veterans, military families, and national security.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Prioritizing veterans and troops says everything about our  values, and that is exactly what this first fiscal year 2026  appropriations bill does.\n\nThe Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act, 2026, is a testament to caring for those who have  selflessly worn America's uniform, their families, and the defenders…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Mr. CARTER of Texas. Mr. Chair, I yield myself the balance of my  time.\n\nMr. Chair, I acknowledge and ask my colleagues to support the fiscal  year 2026 Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act.\n\nThis legislation provides critical funding for military bases,  provides housing for our troops and their families,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…include  tabular material on the same.\n\nMr. ALFORD. Mr. Chair, I yield myself such time as I may consume.\n\nI am honored to present the fiscal year 2026 Military Construction,  Veterans Affairs, and Related Agencies Appropriations bill to the House  today. This bill supports our troops, their families, and our Nation's  veterans.\n\nThe bill includes nearly…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, I urge my colleagues to vote for cloture  on the motion to proceed on the bipartisan fiscal year 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  bill.\n\nI want to thank the majority leader for bringing this important  legislation to the Senate floor.\n\nThis bill would…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693982/hr-3944"}, {"senator": "John Carter", "party": "Republican", "sentence": "…timely reminder of the commitment  our Armed Forces personnel have made and the responsibility we have to  take care of those who serve our Nation.\n\nThe military construction and veterans affairs component of the  legislation meets that goal. The legislation includes $133.3 billion  for the Department of Veterans Affairs, including $113.8 billion in  discretionary…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Chair, I thank the gentleman from Texas for yielding  me time.\n\nMr. Chair, I rise in support of the fiscal year 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  Act. It is fitting that the appropriations bill to come to the House  floor this year is one that fulfills our highest priorities,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692941/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]