[{"senator": "Al Green", "party": "Democrat", "sentence": "…``Eliminating racial discrimination means       eliminating all of it.'' 600 U.S. 181, 206 (2023). We also       agree that Justice Kavanaugh has acknowledged temporal       constraints on race-based decisions required under Section 2       of the Voting Rights Act. Allen v. Milligan, 599 U.S. 1, 45       (2023) (Kavanaugh, J., concurring).\n\nI am also keenly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…cuts have impacted the Department's  ability to do its job.\n\nMy opposition to this bill is common sense. We need to understand the  Department of Energy's current capacity constraints before we assign  the agency more work. Committee Democrats offered amendments during the  subcommittee and full committee markups of this bill to that effect,  which were…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the American Numismatic       Society and someday establish a proper money museum where one       belonged, in the city of Wall Street. But exorbitant costs       and space constraints conspired against those plans, as did       an apparent indifference to the charms of numismatics.\n\nSo: Hello, Toledo!\n\nWartenberg Kagan said that she and several other…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…agreements. However, I cannot in  good conscience support any bill with funding for DHS while this  dangerous surge in Minnesota continues and without real oversight and  constraints on ICE and Border Patrol.\n\nI understand that some of my colleagues will be voting for this  package with the hope that we will make those changes. But,  unfortunately, in…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Congress like an  afterthought? Why are we giving Pete Hegseth more money than the  administration even asked for while we get fewer answers, fewer  guardrails, and fewer constraints on reckless action?\n\nOn top of all of this, Republicans have jammed in a measure to repeal  D.C.'s new tax law. Let me just tell my colleagues, this would blow a  $600 million…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Unfortunately, this month, we saw how this unchecked lawlessness can  have fatal consequences with the killing of Renee Nicole Good.\n\nThis is a rogue agency. Substantial constraints must be placed on it.  During negotiations, we proposed such constraints, but our Republican  colleagues refused to include almost all of them.\n\nWe sought to prevent any…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…as the first       responder to global humanitarian crises becomes a distant       memory with the dismantling of USAID.\n\nDomestically, Trump is aggressively eliminating constraints       on his power and fomenting fear. He is intimidating       independent media outlets with frivolous lawsuits. Our       universities are retreating from freedom of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…increases funding for programs like Head Start and  the child care and development block grant.\n\nMake no mistake, this was an uphill battle given the really tough  funding constraints we faced this year, but I fought hard, and we got  this done.\n\nThis bill also rejects Trump's dream of slashing public education  funding and instead provides a bit more…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…the last several years to  streamline and modernize the Social Security annual statements to  increase the public's understanding of its programs. However, SSA's  funding constraints already limit SSA's ability to educate Americans  about their Social Security benefits. Section 1143 of the Social  Security Act, 42 U.S.C. Sec. 1320b-13, SSA is required…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…$170  million, secure an additional $5.5 billion for humanitarian assistance,  and boost funding for Federal Public Defenders by $350 million.\n\nWe will establish meaningful constraints on the Trump  Administration's ability to abuse the budget process, take expansive  power over Federal funding, Federal spending away from Russ Vought, and  reclaim it for…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I voted today not to continue funding for  the Department of Homeland Security without real oversight and  constraints on ICE and Border Patrol.\n\nMinnesotans are being racially profiled on a mass scale, assaulted on  their streets, and kidnapped from their homes. Peaceful demonstrators…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699551/no-funding-for-dhs"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…In short, we can learn from history.\n\nThat is why I am a proud cosponsor of H. Res. 100, authored by our  leader today and support arms control agreements and negotiated  constraints.\n\nThis resolution is not just about a treaty. It is about sanity. It is  about reaffirming our commitment to arms control, to oversight, and to  policy based on reason and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the Pueblo  Reservoir to communities facing ongoing water supply and quality  issues. Despite decades of work, the project remains unfinished,  primarily due to financial constraints.\n\nThis bill would revise certain repayment terms to provide additional  flexibility for local stakeholders to help finance the project and  begin delivering clean, reliable…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693877/finish-the-arkansas-valley-conduit-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…preferential trade agreements given its lack  of competitiveness due to its small national markets, isolation from  the global market, and high cost of operating and land and labor  constraints. The PIF has encouraged the U.S. to extend duty-free  treatment under the GSP beyond preferences for Least Developed  Beneficiary Developing Countries.\n\nImplementing such…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…New START is by no means perfect, but removing these safeguards will  create a vacuum, and we all know nature abhors a vacuum. Without these  limitations, there are fewer constraints, fewer eyes, and fewer brakes  on how Vladimir Putin expands and modernizes Russia's nuclear forces.  In this wilderness, we would see a broader breakdown of norms on  nuclear…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…breeding seasons.\n\nOn top of that, Fort Huachuca must carry out ongoing monitoring,  predator control, and habitat management, all under ESA guidelines,  which impose onerous constraints on our ability to train and be ready  for our warriors. The same could be said about the Barry M. Goldwater  Range, also in Arizona.\n\nIt is not just Arizona. This happens…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…half of its life cycle. That is exactly  what this amendment does.\n\nThe decommissioning of the Navy's mixed fleet strategy, the LCS  vessels, is not the answer to our budget constraints. That is why I  stand in opposition to this amendment, and I ask my colleagues to vote  ``no'' on the Davidson amendment.\n\nMr. Chair, I yield back the balance of my time.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…thousands of children who have come through  its doors.\n\nToday, the club is facing unprecedented demand. More than 100  children are currently on the waiting list due to space constraints in  the existing facility.\n\nUnfortunately, lingering Federal interest in the property dating back  to the city's involvement in the Federal Lands to Parks Program decades…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…squarely in the sights of foreign adversaries and criminal groups.\n\nAs a former county executive in Tennessee, I saw firsthand how  limited budgets, aging systems, and staffing constraints can leave  local governments struggling to keep up with modern cyber threats.\n\nMany smaller jurisdictions only operate with a handful of IT staff  and, in some cases, with…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…addressing these  vulnerabilities. Within one 1 year of enactment, the Secretary of  Commerce would be required to identify high-demand critical  infrastructure with manufacturing constraints, do a cost-benefit  analysis of domestic production, and determine the feasibility of such  production.\n\nBy supporting this bill, we are taking an important step toward…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690289/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…During my time in Congress, I have heard from  elected officials across southern Ohio about the difficulties they face  navigating the Federal grant process due to budgetary constraints,  insufficient time, and lack of technical expertise. This bill would  change that by helping Appalachian regions get connected to resources  they need to join the modern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…remarked, everywhere. There is an emergency everywhere. Sounds like an  emergency everywhere is really an emergency nowhere. But despite the  constitutional restraints or constraints on executive power, Americans  have now been ordered to pay higher taxes in the form of tariffs but  without the consent of Congress.\n\nThe tariffs we discuss today are global…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…alongside  brave and committed global Allied forces from over 10 nations,  including Italian resistance brigades, faced grueling conditions,  fierce combat, and severe materiel constraints. Battles such as Monte  Cassino and Anzio stand as two of the most intense of the war, costing  countless lives.\n\nToday, fewer than half a percent of the more than 16 million…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…multiple use management. An RMP       generally establishes land use designations; allowable       resource uses, resource conditions, goals, and objectives;       program constraints and general management practices; areas       to be covered by more specific plans; and other related       information.      North Dakota Resource Management Plan\n\nBLM…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…establish and       administer a competitive leasing program for the Coastal       Plain by placing more than 1 million acres off limits and       layering on operational constraints that make leasing       commercially impracticable. This disastrous Record of       Decision stifled the energy needs of our nation in       unnecessary red tape, destroyed…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…alarmed. God willing, the House-passed,  short-term funding extension will give Congress enough time to deliver  full-year appropriations and release our military from the constraints  of the Biden fiscal year 2024 budget. But I want our colleagues to  understand what is at stake this fall.\n\nThe President has set some ambitious, important, and overdue…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…multiple use management. An RMP       generally establishes land use designations; allowable       resource uses; resource conditions, goals, and objectives;       program constraints and general management practices; areas       to be covered by more specific plans; and other related       information.\n\nBLM may amend an RMP to account for, among other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…infrastructure, develop our resources, and create  opportunities for our communities, but for far too long, Alaska Native  Corporations have faced unnecessary delays and constraints in securing  the lands they were promised under the Alaska Native Claims Settlement  Act.\n\nAfter more than 50 years, Cape Fox Corporation, representing the  village of Saxman,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698208/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…housing  costs continue to climb. While demand soars, the country remains  stalled by a 5\\1/2\\ million unit shortfall.\n\nBetween the red tape of regulatory delays and the rigid constraints  of zoning, the path to affordable living is being made more difficult  to navigate, and it is American families who are paying the price.\n\nAs one of the fastest growing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…attentively monitor emerging threats and allow  the Department to utilize their existing authorities to address  vulnerabilities.\n\nIn recent years, we have seen how supply chain constraints and  bottlenecks for key grid components, such as distribution transformers  and natural gas turbines, can stifle infrastructure development.\n\nBy establishing periodic assessments…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}]