[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…is not following that oath, though.\n\nAs a matter of fact, we have seen this administration illegally deny  due process rights despite a Supreme Court order to return my  constituent, Kilmar Abrego Garcia, back to the United States.\n\nJust a moment on that. Kilmar was deported from the United States  even though a judge had given an order saying that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…January 15, 1 month from today, and those new  premiums will take effect on January 1, in 17 days.\n\nMr. Speaker, do you know who can't wait for the Speaker's process?\n\nIt is my constituent Lester Johnson, co-owner, with his wife, of Mama  J's Restaurant. They and their daughter rely on the Affordable Care Act  paying about $700 a month for their premiums in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…people know this.  Recent polling from none other than FOX News shows that nearly two- thirds of Americans blame President Trump for higher prices--FOX News.\n\nListen to my constituent Tria, who wrote to me from Chicago. After  experiencing the sticker shock at a South Loop grocery store, she said:\n\nNo matter if it's organic or not . . . it's still going…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…unwavering commitment to this  program are truly deserving of this recognition. I am honored to  congratulate him on this well-earned moment and recognize him as this  week's Constituent of the Week.\n\nI congratulate and thank George for all that he does for our  students.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698648/recognizing-george-hinckley"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, there is new reporting that the Social  Security Administration has been told to cut its workforce in half.\n\nUnfortunately, I heard from a constituent who works there who was  just put on a 30-day leave with no promise to keep their job.\n\nThis agency helps keep 364,000 of Virginia's seniors out of poverty,  supports over…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688274/cuts-to-social-security-administration"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…to celebrate the safe return of  New Jersey native Edan Alexander. This was a moment of profound relief  and gratitude for his family, our community, and our Nation.\n\nMy constituent Edan Alexander, from Tenafly, New Jersey, is an all- American kid who graduated from Tenafly High School and swam on the  swim team. He could be anyone's son.\n\nAfter being…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693449/welcoming-home-edan-alexander"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…absolutely unaffordable!! Literally we cannot pay       this. We would have to sell our home and our vehicles in       order to just come up with the money to do that.\n\nAnother constituent from Barron County, WI, wrote to me sharing that  without the tax breaks, he would have to spend over 40 percent--get  that: 40 percent--of his income on health insurance…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…life better for the people we serve.\n\nRikki's decade of congressional service began as an intern for  Congresswoman Debbie Dingell, where she was soon hired full time as  constituent relations and press assistant. After two years with  Congresswoman Dingell, Rikki joined now Leader Jeffries inaugural  leadership team. As their press assistant, Rikki…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I am honored to recognize this week's  constituent of the week, Ernisha Hall, on her work as cofounder,  president, and CEO of the Virginia Black Chamber of Commerce.\n\nFor over half a decade, Ernisha has been leading the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694877/constituent-of-the-week-ernisha-hall"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…vague allegations by DHS, lies instead of  facts, no transparency, no accountability, and no respect for the  family left behind.\n\nThere was also Marimar Martinez, another constituent. An ICE agent  shot her five times and then arrested her. ICE leveled serious criminal  accusations to justify it. Later, quietly, those charges were dropped.  Why? It was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I rise today to share the story of  my constituent, Marwan Marouf.\n\nMarwan has lived in the United States for more than 40 years. He is a  devoted father of U.S. citizens, a respected community leader, and he  has no criminal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696969/marwan-marouf-needs-humanitarian-parole-now"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Marimar, to  Keith, to Renee, to Alex, what they did to Illinois resident Nenko  Gantchev in an ICE detention center. Also, Mr. Speaker, what they are  doing right now to my own constituent, Steven, a 14-year-old boy with  autism in a detention center plagued with measles, it is  unconscionable. It is unacceptable.\n\nMany of us are clear: The Department of Homeland…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…constituents are reaching out to us. What are they  asking us? They are asking us to stop the Republican assault on our  schools, our livelihoods, and our communities.\n\nAnother constituent who reached out to me is named Kris. He is a  student at Common Ground High School. Common Ground High School is an  innovative, educational, environmental, and community-building…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688499/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "Ms. WILLIAMS of Georgia. Mr. Speaker, I rise today to welcome my  constituent George Glezmann home from more than 2 years of wrongful  detention by the Taliban in Afghanistan.\n\nGeorge is home with his family in Atlanta in large part because of  the…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691683/welcoming-george-glezmann-home-to-georgias-5th-congressional-district"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, I rise today to recognize my constituent, Mr.  Byuzand Yeremyan, President of Armenians of Colorado, for his  exceptional dedication and steadfast commitment to our community.\n\nThis year marks the tenth anniversary…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697495/recognizing-byuzand-yeremyan"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…affordable care instead of what they currently have, which is a  broken system that insurance companies run, forcing individuals onto an  exchange so they can get like my constituent who passed away last year  from cancer, who wanted to go to M.D. Anderson and could not go because  she was on an  ObamaCare plan and couldn't go to the best cancer hospital…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…see the savings. These appliances just don't last as  long because they have got to run their washing machine three times.\n\nI will tell you, Mr. Speaker, one time I had a constituent contact  me, and she said: Morgan, look at this picture. I take a hose from my  backyard to fill up my washing machine because under the new guidelines  there is not enough…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate my constituent,  Alexander Andrews, upon his acceptance to the United States Naval  Academy.\n\nAs a future midshipman, he will be joining the ranks of the world's  most elite naval force,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692734/congratulating-alexander-andrews"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor a remarkable  constituent from my district, Mr. Tom Hebel, proprietor of Bucks  Country Gardens in Doylestown, Pennsylvania--a business that has, for  more than six decades, helped beautify homes…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…legislation to combat  mail theft and fraud.\n\nA few months ago, I raised the issue of stolen checks to the Ways and  Means Committee after my office had been slammed with constituent cases  from taxpayers who have seen their hard-earned money stolen from them  via check fraud.\n\nI, alongside my colleagues, Congresswoman Terri Sewell and  Congressman David…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and a lot of them from Kentucky saying, what am I going to do? This is  something I had depended on.\n\nI will tell you, we all worked on it. I will have to say that his  constituent, our colleague on the other side of the bill and the leader  at the time, Leader McConnell, took that as his issue. I will tell you,  if you ask any coal miner, retired…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…included  serving as the Congresswoman's Veterans affairs, national security, and  foreign policy advisor. Mac was instrumental in creating and managing  Representative Roby's constituent Veterans' Advisory Committee, which  allowed the Congresswoman to gain additional insights, perspectives,  and ideas to drive her oversight and legislative agenda.\n\nIn July…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate my constituent,  Tyrone Miller, upon his acceptance to the United States Military  Academy at West Point.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692755/congratulating-tyrone-miller"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…rate was to say that we are going to make that  rate competitive. With that, they repatriated their money back to the  U.S.\n\nWhen I talk to townhall participants, regular constituent meetings, I  highlight that when you make taxes competitive, you get companies to  reinvest back in the United States, and we then can grow our revenue.\n\nCompanies have…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…Product Safety Act.\n\nIn 2023, 36 patients across 7 States contracted tuberculosis after  receiving bone grafts containing infected donor material.\n\nOne of these patients was my constituent, Shandra Eisenga, of Marion,  Michigan, who tragically passed away on August 10, 2023, due to  complications from TB.\n\nI was proud to have Shandra's family here last year…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692764/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an  outstanding constituent from my district, Jenya Rahazhynskaya. Jenya is  the founder and owner of Beauty Mood, a hair and beauty salon located  in Warminster, Pennsylvania. With her business' mission…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor the life and  legacy of an extraordinary constituent and community member, Krista  Wynne Moore, of Oaks, Pennsylvania, who passed away peacefully on March  13, 2025, at the age of 48. Krista was a woman whose warmth,  leadership,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, I include in the Record  remarks submitted at the request of a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:\n\nIsrael At 77--How poignant to affirm the special       relationship between the U.S.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…for her leadership  and for shining a light on this dark and destructive crisis.\n\nI am sad to say that this issue struck close to home with the  heartbreaking death of my constituent, 16-year-old Elijah Heacock. He  tragically fell victim to an online extortion scheme, showing my  community the dangers of predators targeting our kids online.\n\nI sat with…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…and countless others who felt overwhelmed and  unheard until Joanne stepped in.\n\nShe didn't just do what we call casework. She actually changed lives.  Joanne treated every constituent with dignity, persistence, and care,  and she never gave up on someone who needed help.\n\nThere is truly no one quite like Joanne Horn. Our office, district,  and Commonwealth…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}]